Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: In summary, I2P is very complex and there is no easy way to pinpoint why your node is not used. If your node is reachable and has a bandwidth setting of >128 kbyte/sec shared and is reachable 24/7, it should be used after some time for participating traffic. If it is down in between, the testing of your I2P node done by other nodes will tell them: you are not reachable. This blocks your node for at least 24h on other nodes. So, the other nodes which tested you as down will not use your node for 24h for building tunnels. This is why your traffic will be lower after a restart/shutdown for a minimum of 24h.
fr: En résumé, I2P est très complexe et il n’y a aucune façon facile d’identifier exactement pourquoi votre nœud n’est pas utilisé. Si votre nœud est accessible, a un paramètre de bande passante partagée > à 128 ko/s, est accessible jour et nuit, il devrait être utilisé après quelque temps pour le trafic participant. S’il est hors service entre temps, le test de votre nœud I2P par d’autres nœuds leur indiquera que vous n’êtes pas accessible. Pour les autres nœuds, votre nœud sera bloqué pour au moins 24 h. Ainsi, les autres nœuds qui vous ont testé comme étant hors service n’utiliseront pas votre nœud pour construire des tunnels durant 24 h. C’est pourquoi votre trafic sera inférieur après un redémarrage, une fermeture pendant au moins 24 h.
ru: В общем, I2P очень сложна и нет простого способа выяснить, почему ваш узел не задействован. Если ваш узел доступен в режиме 24/7 и имеет настройку доступной полосы пропускания >128 Кбайт/с, он должен быть использован после передачи некоторого количества трафика. Если есть обрыв связи, проверка вашего I2P узла, выполненная другими узлами, скажет им: вы не доступны. Это приведет к блокировке вашего узла по крайней мере на 24 часа на других узлах. Итак, другие узлы, которые пометили вас как недоступный, не будут использовать ваш узел для постройки туннелей в течение 24 часов. Вот почему ваш трафик будет меньше после перезапуска/выключения как минимум в течение 24 часов.
tr: Özetle, I2P çok karmaşıktır ve düğümünüzün neden kullanılmadığını belirlemenin kolay bir yolu yoktur. Düğümünüz erişilebilir durumdaysa, 128 kbayt/sn üzerinde bir paylaşılan bant genişliği ayarına sahipse ve 7/24 erişilebilir durumdaysa, bir süre sonra katılımcı trafik için kullanılmalıdır. Bunların altında ya da arasındaysa, I2P düğümünüzün diğer düğümler tarafından yapılan sınaması onlara şunu söyleyecektir: Size ulaşılamıyor. Bu durum, düğümünüzün diğer düğümler tarafından kullanılmasını en az 24 saat engeller. Sizi kapalı olarak sınayan diğer düğümler, tünel oluşturmak için 24 saat boyunca düğümünüzü kullanmayacaktır. Bu nedenle, yeniden başlatma/kapatma sonrasında trafiğiniz en az 24 saat süreyle daha düşük düzeyde olacaktır.

source: Also: other I2P nodes needs to know your I2P router to test it for reachability and capacity. It takes time for other nodes to get known to your node. It will be faster if you use I2P and build more tunnels, e.g. use a torrent or www for some time.
fr: Aussi : les autres noeuds I2P doivent connaître votre routeur I2P pour tester son accessibilité et sa capacité. Cela prend du temps pour que les autres noeuds prennent connaissance de votre noeud. Cela sera plus rapide si vous utilisez I2P et construisez davantage de tunnels, par exemple utilisez un torrent ou www pendant quelque temps.
ru: Также: другим узлам I2P должен быть известен ваш маршрутизатор I2P, чтобы иметь возможность проверять его доступность и производительность. Требуется время, чтобы ваш узел стал известен. Оно станет быстрее, если вы используете I2P и строите больше туннелей, например, используете время от времени торрент или www.
tr: Ayrıca: diğer I2P düğümlerinin, erişilebilirlik ve kapasite açısından sınayabilmesi için I2P yönelticinizi bilmesi gerekir. Düğümünüzün diğer düğümler tarafından tanınması zaman alır. I2P kullanıyorsanız ve daha fazla tünel oluşturursanız daha hızlı olur. Örneğin bir süre torrent veya www kullanın.

source: Performance Improvements
fr: Améliorations de performance
ru: Улучшение Производительности
tr: Başarım iyileştirmeleri

source: For possible future performance improvements see <a href="%(future)s">Future Performance Improvements</a>.
fr: Pour de possible futures améliorations de performance voir <a href="%(future)s">Améliorations de performance futures</a>.
ru: Возможные будущие улучшения производительности см. на странице <a href="%(future)s">Будущие Улучшения Производительности</a>.
tr: <a href="%(future)s">Gelecekte yapılabilecek başarım iyileştirmelerine</a> bakabilirsiniz.
