Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: Previously, when Alice sent Bob a message, when Bob replied he had to do a lookup in the network database - sending out a few requests to get Alice's current LeaseSet. If he already has Alice's current LeaseSet, he can instead just send his reply immediately - this is (part of) why it typically takes a little longer talking to someone the first time you connect, but subsequent communication is faster. Currently - for all clients - we wrap the sender's current LeaseSet in the garlic that is delivered to the recipient, so that when they go to reply, they'll <i>always</i> have the LeaseSet locally stored - completely removing any need for a network database lookup on replies. This trades off a large portion of the sender's bandwidth for that faster reply. If we didn't do this very often, overall network bandwidth usage would decrease, since the recipient doesn't have to do the network database lookup.
fr: Précédemment, quand Alice a envoyé un message à Bob, quand Bob a répondu qu’il avait dû consulter la base de données de réseau, émettant quelques requêtes pour obtenir le jeu de baux actuel d’Alice. S’il a déjà le jeu de baux actuel d’Alice, il peut alors juste envoyer sa réponse immédiatement - c’est (en partie) pourquoi cela prend habituellement un peu plus longtemps de parler à quelqu’un la première fois que vous vous connectez, mais les communications subséquentes sont plus rapides. Actuellement, pour tous les clients, nous enveloppons le jeu de baux actuel de l’expéditeur dans l’ail qui est livré au destinataire, afin qu’ils aient <i>toujours</i> le jeu de baux stocké localement quand ils s’apprêtent à répondre, supprimant complètement le besoin de consulter la base de données de réseau lors des réponses. Ceci échange une grande partie de la bande passante de l’expéditeur contre cette réponse plus rapide. Si nous ne le faisions pas très souvent, l’utilisation globale de la bande passante du réseau diminuerait, puisque le destinataire n’a pas à consulter de base de données de réseau.
ru: Ранее, когда Alice отправила сообщение Bob'у, когда Bob отвечал, он был вынужден выполнить поиск в сетевой базе данных - отправляя несколько запросов, чтобы добраться до текущего LeaseSet Alice. Если у него уже есть текущий LeaseSet Alice, он может вместо этого сразу отправить свой ответ - из-за этого (частично) вы обычно тратите немного больше времени для обращения к кому-то в первый раз, но последующие обращения проходят быстрее. Сейчас - для всех клиентов - мы упаковываем текущий LeaseSet отправителя в garlic, который доставляется получателю, и когда он соберется ответить, у него <i>всегда</i> будет локально хранимый LeaseSet - это полностью исключает необходимость поиска по сетевой базе данных при ответах. Это сохраняет большую часть пропускной полосы отправителя для такого быстрого ответа. Если мы делаем это не очень часто, общее использование пропускной полосы сети может уменьшиться, т.к. получателю не нужно выполнять поиск по сетевой базе данных.
tr: Önceden, Alice Bob'a bir ileti gönderdiğinde, Bob yanıt verdiğinde "Ağ veri tabanında" (netDB) bir arama yapmak zorundaydı. Alice'in var olan "Kiralama kümesini" (LeaseSet) almak için birkaç istek gönderiyordu. Bunun yerine, Alice'in kullandığı "Kiralama kümesini" (LeaseSet) zaten biliyorsa yanıtını hemen gönderebilir. Bu nedenle (bunun bir parçası) ilk kez bağlantı kurduğunuzda birisiyle konuşmanız genellikle biraz daha uzun sürer. Ancak sonraki iletişim daha hızlıdır. Şu anda - tüm istemciler için - göndericinin kullandığı "Kiralama kümesinin" alıcıya teslim edildiği Garlic ile sarmalıyoruz. Böylece yanıt verecekleri zaman, "Kiralama kümesi" (LeaseSet) <i>her zaman</i> yerel olarak depolanmış olacak. Yanıtlar için herhangi bir "Ağ veri tabanı" (netDB) araması gereksinimi tamamen ortadan kalkacak ve daha hızlı yanıt için göndericinin bant genişliğinin büyük bir bölümü kullanılmış olacak. Bunu çok sık yapmasaydık, alıcının "Ağ veri tabanı" (netDB) aramasını yapması gerekmeyeceğinden genel ağ bant genişliği kullanımı azalacaktı.

source: For unpublished LeaseSets such as "shared clients", this is the only way to get the LeaseSet to Bob. Unfortunately this bundling every time adds almost 100&#37; overhead to a high-bandwidth connection, and much more to a connection with smaller messages.
fr: Pour les jeux de baux non publiés tels que les « clients partagés », c’est la seule façon d’envoyer le jeu de baux à Bob. Malheureusement, ce groupage, répété toutes les fois, ajoute presque 100 &#37; de surcharge à une connexion à large bande passante et beaucoup plus à une connexion avec de plus petits messages.
ru: Для неопубликованных LeaseSets, таких как "shared clients", есть только один способ доставить LeaseSets Бобу. К сожалению, это связывание каждый раз добавляет почти 100&#37; накладных расходов на высокоскоростное соединение и гораздо больше для соединений с меньшими сообщениями.
tr: "Paylaşılan istemciler" gibi yayınlanmamış "Kiralama kümeleri" (LeaseSets) için, kiralama kümesini Bob'a almanın tek yolu budur. Ne yazık ki bu paketleme her seferinde neredeyse 100&#37; yüksek bant genişliğine sahip bir bağlantıya ek yük ve daha küçük iletiler içeren bir bağlantıya çok daha fazla yük oluşturur.

source: Changes scheduled for release 0.6.2 will bundle the LeaseSet only when necessary, at the beginning of a connection or when the LeaseSet changes. This will substantially reduce the total overhead of I2P messaging.
fr: Les changements prévus pour la version 0.6.2 grouperont le jeu de baux seulement si requis, au début d’une connexion ou quand le jeu de baux change. Cela réduira considérablement la surcharge totale de la messagerie d’I2P.
ru: Изменения, запланированные в релизе 0.6.2, будут отправлять LeaseSet только при необходимости, в начале соединения или когда изменится LeaseSet. Это значительно уменьшит общие накладные расходы системы сообщений I2P.
tr: 0.6.2 sürümü için planlanan değişiklikler, yalnızca gerektiğinde, bir bağlantının başlangıcında veya "Kiralama kümesi" (LeaseSet) değiştiğinde, "Kiralama kümesini" (LeaseSet) paketleyecek. Böylece, I2P iletişiminin toplam ek yükü önemli ölçüde azalacak.

source: More efficient TCP rejection
fr: Refus TCP plus efficace
ru: Более эффективное отклонение TCP запросов
tr: Daha verimli TCP reddi

source: At the moment, all TCP connections do all of their peer validation after going through the full (expensive) Diffie-Hellman handshaking to negotiate a private session key. This means that if someone's clock is really wrong, or their NAT/firewall/etc is improperly configured (or they're just running an incompatible version of the router), they're going to consistently (though not constantly, thanks to the banlist) cause a futile expensive cryptographic operation on all the peers they know about. While we will want to keep some verification/validation within the encryption boundary, we'll want to update the protocol to do some of it first, so that we can reject them cleanly without wasting much CPU or other resources.
fr: À l’heure actuelle, toutes les connexions TCP font toute leur validation de pair après avoir passé la (coûteuse) poignée de mains Diffie-Hellman pour négocier une clé de session privée. Cela signifie que si l’horloge de quelqu’un est vraiment fausse, ou que leur NAT/pare-feu/etc est incorrectement configuré (ou qu’ils font juste fonctionner une version incompatible du routeur), ils vont systématiquement (quoique non constamment, grâce à la banlist) causer un chère et futile opération cryptographique sur tous les pairs qu’ils connaissent. Tandis que nous voudrons garder quelques vérifications/validations dans la frontière de chiffrement, nous voudrons mettre à jour le protocole pour faire un peu de cela d’abord, afin que nous puissions les rejeter proprement sans gaspiller beaucoup de CPU ou d’autres ressources.
ru: В настоящий момент, все соединения TCP выполняют проверку валидности узла после выполнения полного (дорогого) алгоритма Диффи-Хеллмана обмена приватными ключами сессии. Это означает, что если чьи-то часы сильно неточны, или его NAT/firewall/и т.д. неверно сконфигурирован (или используется несовместимая версия роутера), эти клиенты постоянно (не совсем постоянно, благодаря бан-листам) провоцируют бесполезные ресурсоемкие криптографические операции на всех известных им узлах. Хотя мы и хотим оставить некоторые проверки внутри границ шифрования, мы также хотим обновить протокол так, чтобы некоторые проверки выполнялись раньше и мы могли отбросить невалидные соединения, не тратя процессорное время и другие ресурсы.
tr: Şu anda, tüm TCP bağlantıları, özel bir oturum anahtarı üzerinde anlaşmak için tam (pahalı) Diffie-Hellman el sıkışmasından geçtikten sonra tüm eşlerin doğrulamasını yapıyor. Bu durum, birinin saati gerçekten yanlışsa veya NAT/güvenlik duvarı/vb. yanlış yapılandırılmışsa (veya yalnızca uyumsuz bir yöneltici sürümü çalıştırıyorsa), sürekli olarak (yasaklama listesi sayesinde sürekli olmasa da) bildikleri tüm eşler üzerinde boşuna pahalı bir şifreleme işlemi yapılmasına neden olur. Bazı doğrulama/onaylama işlemlerini şifreleme sınırı içinde tutmak isteyecek olsak da, iletişim kuralını öncelikle bazılarını yapacak şekilde güncellemek isteriz. Böylece çok fazla işlemci gücünü veya başka kaynakları boşa harcamadan bunları temiz bir şekilde reddedebiliriz.

source: Adjust the tunnel testing
fr: Ajuster le test de tunnel
ru: Регулировка проверки туннеля
tr: Tünel sınamasını ayarlama

source: Rather than going with the fairly random scheme we have now, we should use a more context aware algorithm for testing tunnels. e.g. if we already know its passing valid data correctly, there's no need to test it, while if we haven't seen any data through it recently, perhaps its worthwhile to throw some data its way. This will reduce the tunnel contention due to excess messages, as well as improve the speed at which we detect - and address - failing tunnels.
fr: Plutôt que d’aller avec l’approche assez aléatoire que nous avons maintenant, nous devrions utiliser un algorithme plus conscient du contexte pour tester les tunnels. Par exemple, si nous savons déjà qu’il laisse correctement passer des données valides, il est inutile de le tester. Alors que si nous n’avons pas vu passer de données récemment, il pourrait être utile d’y envoyer des données. Cela réduira la contention du tunnel causée par un excès de messages et améliorera aussi notre vitesse de détections des tunnels en échec ainsi que notre vitesse d’intervention.
ru: Вместо использования теперешней довольно случайной схемы, мы должны использовать более контекстный алгоритм для проверки туннелей, т.к., если мы уже знаем, что он передает данные корректно, то нет необходимости проверять его, и, если мы давно не получали из него данных, возможно, стоит воспользоваться им для отправки. Это уменьшит конкуренцию туннелей из-за избытка сообщений, а также улучшит скорость, с которой мы определяем - и фиксируем - ошибочные туннели.
tr: Şu anda kullandığımız oldukça rastgele şema ile gitmek yerine, tünelleri sınamak için daha fazla bağlam farkındalığı olan bir algoritma kullanmalıyız. Örneğin. Geçerli verilerin geçtiğini zaten biliyorsak, sınamaya gerek kalmaz. Son zamanlarda herhangi bir veri görmediysek, belki de yoluna biraz veri göndermeye değer. Böylece, çok sayıda iletiden kaynaklanan tünel çekişmesi azalacak ve hatalı tünelleri algılama ve çözme hızımız iyileşecek.

source: Persistent Tunnel / Lease Selection
fr: Tunnel persistant / Sélection de bail
ru: Постоянный Туннель / Выбор Срока Аренды
tr: Kalıcı Tünel / Kiralama Seçimi

source: Outbound tunnel selection implemented in 0.6.1.30, inbound lease selection implemented in release 0.6.2.
fr: La sélection de tunnels sortants est mise en œuvre dans 0.6.1.30, la sélection de baux entrants est mise en œuvre dans la version 0.6.2.
ru: Выбор исходящего туннеля реализован в 0.6.1.30, выбор срока аренды входящего реализован в релизе 0.6.2.
tr: 0.6.1.30 sürümünde uygulanan gidiş tüneli seçimi, 0.6.2 sürümünde uygulanan geliş kiralaması seçimi.

source: Selecting tunnels and leases at random for every message creates a large incidence of out-of-order delivery, which prevents the streaming lib from increasing its window size as much as it could. By persisting with the same selections for a given connection, the transfer rate is much faster.
fr: Sélectionner au hasard des tunnels et des baux pour chaque message crée une grande incidence de défaillance de livraison, laquelle empêche la lib streaming d' augmenter sa taille de fenêtre autant qu’elle le pourrait. En persistant avec les mêmes sélections pour une connexion donné, le taux de transfert est beaucoup plus rapide.
ru: Случайный выбор туннелей и сроков аренды для каждого сообщения создает большое количество случаев доставки не-по-очереди, что мешает потоковой библиотеке увеличивать размер ее окна до максимума. При сохранении выбора для одного соединения скорость передачи намного больше.
tr: Her ileti için rastgele tüneller ve kiralamalar seçmek, akış kitaplığının pencere boyutunu olabildiğince büyütmesini engelleyen büyük bir hizmet dışı aktarım durumuna yol açar. Belirli bir bağlantı için aynı seçimler korunduğunda aktarım hızı çok daha fazladır.

source: Compress some data structures
fr: Compresse certaines structures de données
ru: Сжатие некоторых структур данных
tr: Bazı veri yapılarını sıkıştırma

source: The I2NP messages and the data they contain is already defined in a fairly compact structure, though one attribute of the RouterInfo structure is not - "options" is a plain ASCII name = value mapping. Right now, we're filling it with those published statistics - around 3300 bytes per peer. Trivial to implement GZip compression would nearly cut that to 1/3 its size, and when you consider how often RouterInfo structures are passed across the network, that's significant savings - every time a router asks another router for a networkDb entry that the peer doesn't have, it sends back 3-10 RouterInfo of them.
fr: Les messages I2NP et les données qu’ils contiennent sont déjà définis dans une structure assez compacte, bien qu’un attribut de la structure d’infosRouteur ne l’est pas. « options » est un mappage nom = valeur ASCII en clair. Pour l’instant, nous le remplissons avec ces statistiques publiées - autour de 3300 octets par pair. Facile à mettre en œuvre, la compression GZIP le réduirait presque d’un tiers et, quand l’on tient compte du nombre de fois que des structures InfosRouteur sont échangées par le réseau, cela représente des économies significatives. Chaque fois qu’un routeur demande à un autre routeur une entrée networkDb que le pair n’a pas, il en renvoie de 3 à 10 InfosRouteur.
ru: Сообщения I2NP и их содержимое уже определены и имеют довольно компактную структуру, хотя один атрибут структуры RouterInfo не "настраиваемый" - это соответствие имя = значение в виде ASCII. Сейчас мы заполняем ее публичной статистикой - около 3300 байт на узел. Простое применение сжатия GZip позволит сократить ее размер до 1/3, и когда вы поймете, как часто структуры RouterInfo передаются по сети, вы увидите, что это будет значительным выигрышем - каждый раз, когда маршрутизатор запрашивает у другого содержимое сетевой БД, которого нет у узла, он получает 3-10 записей RouterInfo.
tr: I2NP iletileri ve içerdikleri veriler, "Yöneltici bilgileri" (RouterInfo) yapısının bir özelliği olmasa da, zaten oldukça kompakt bir yapıda tanımlanmıştır. "Seçenekler", düz bir ASCII ad = değer çiftidir. Şu anda, bunu yayınlanan istatistiklerle dolduruyoruz. Eş başına yaklaşık 3300 bayt. GZip sıkıştırmasını uygulamak önemsiz bir işlem ve boyutu neredeyse 1/3 oranında düşürür. "Yöneltici bilgileri" (RouterInfo) yapılarının ağ üzerinden ne sıklıkta geçtiğini düşündüğünüzde, bu önemli bir tasarruf sağlar. Bir yöneltici başka bir yönelticiden kendisinde bulunmayan bir "Ağ veri tabanı" (netDB) kaydı istediğinde geriye 3-10 "Yöneltici bilgileri" (RouterInfo) gelir.

source: Update the ministreaming protocol
fr: Mise à jour du protocole ministreaming
ru: Обновление протокола ministreaming
tr: Mini akış iletişim kuralında güncelleme

source: replaced by full streaming protocol
fr: remplacé par le protocole plein ministreaming
ru: заменен на полностью потоковый протокол
tr: tam akış iletişim kuralı ile değiştirildi

source: Currently mihi's ministreaming library has a fairly simple stream negotiation protocol - Alice sends Bob a SYN message, Bob replies with an ACK message, then Alice and Bob send each other some data, until one of them sends the other a CLOSE message. For long lasting connections (to an IRC server, for instance), that overhead is negligible, but for simple one-off request/response situations (an HTTP request/reply, for instance), that's more than twice as many messages as necessary. If, however, Alice piggybacked her first payload in with the SYN message, and Bob piggybacked his first reply with the ACK - and perhaps also included the CLOSE flag - transient streams such as HTTP requests could be reduced to a pair of messages, instead of the SYN+ACK+request+response+CLOSE.
fr: Actuellement, la bibliothèque de minidiffusion de mihi a un protocole de négociation de flux assez simple. Alice envoie à Bob un message SYN, Bob répond par un message ACK, ensuite Alice et Bob s’envoient des données, jusqu’à ce que l’un d’entre eux envoie à l’autre un message CLOSE. Pour les connexions longues (p. ex. à un serveur IRC), cette surcharge est négligeable, mais pour les situations simples de demande/réponse unique (p. ex. une demande/réponse HTTP), c’est plus du double de messages que nécessaire. Si, cependant, Alice avait ajouté ses premières données utiles au message SYN et Bob avait ajouté sa première réponse avec le message ACK, et peut-être aussi inclus le drapeau CLOSE, les flux transitoires tels que les requêtes HTTP pourraient être réduits à deux messages, au lieu du SYN+ACK+requête+réponse+CLOSE.
ru: Сейчас у библиотеки мини-потоков mihi есть довольно простой потоковый протокол согласования - Alice отправляет Бобу сообщение SYN, Боб отвечает сообщением ACK, затем Alice и Боб обмениваются данными до тех пор пока один из них не отправит другому сообщение CLOSE. Для длительных подключений (например, для IRC-сервера), эти издержки незначительны, но для некоторых простых ситуаций запрос-ответ (например, запрос/ответ HTTP) приходится отправлять вдвое больше сообщений, чем это необходимо. Если, тем не менее, Alice комбинирует свою отправку с сообщением SYN, и Боб комбинирует его первый ответ с ACK - и, возможно, также включит флаг CLOSE - временные потоки, такие как запросы HTTP, могут быть сокращены до пары сообщений, вместо SYN+ACK+запрос+ответ+CLOSE.
tr: Şu anda kullanılan mihi mini akış kitaplığı oldukça basit bir akış anlaşma iletişim kuralı kullanır. Alice, Bob'a bir SYN iletisi gönderir. Bob bir ACK iletisi ile yanıt verir. Ardından Alice ve Bob, biri diğerine bir KAPAT iletisi gönderene kadar birbirlerine bazı veriler gönderir. Uzun süreli bağlantılar için (örneğin bir IRC sunucusu), bu ek yük ihmal edilebilir. Ancak basit bir kerelik istek/yanıt durumları (örneğin bir HTTP isteği/yanıtı) için bu durum, gerekenden iki kat daha fazla iletiye yol açar. Bununla birlikte, Alice ilk yükünü SYN iletisiyle bindirdiyse ve Bob ilk yanıtını ACK ile döndürdüyse - ve belki KAPAT işaretini de eklediyse - HTTP istekleri gibi geçici akışlar bir çift iletiye indirgenebilir. SYN+ACK+istek+yanıt+KAPAT.

source: Implement full streaming protocol
fr: Implémenter protocole full streaming
ru: Реализация полностью потокового протокола
tr: Tam akış iletişim kuralı eklendi

source: The ministreaming protocol takes advantage of a poor design decision in the I2P client protocol (I2CP) - the exposure of "mode=GUARANTEED", allowing what would otherwise be an unreliable, best-effort, message based protocol to be used for reliable, blocking operation (under the covers, its still all unreliable and message based, with the router providing delivery guarantees by garlic wrapping an "ACK" message in with the payload, so once the data gets to the target, the ACK message is forwarded back to us [through tunnels, of course]).
fr: Le protocole « ministreaming » profite d’une mauvaise décision de conception dans le protocole client I2P (I2CP) ; l’exposition de « mode=GUARANTEED », permettant à ce qui serait autrement un protocole non fiable, au meilleur effort, basé sur des messages d’être utilisé pour une opération de blocage fiable (sous le capot, tout est encore non fiable et basé sur des messages, le routeur fournissant des garanties de livraison par l’enveloppage ail d’un message « ACK » avec les données utiles. Donc une fois que les données atteignent la cible, le message ACK nous est retourné [par des tunnels, bien sûr]).
ru: Протокол мини-потоков унаследовал преимущества плохого проектного решения клиентского протокола I2P (I2CP) - иллюстрация "mode=GUARANTEED", позволяющая то, что иначе было бы ненадежным, негарантированным, протокол на основе сообщений используется для надежной, блокирующей операции (приоткрывая покров, оно все равно остается ненадежным и основанным на сообщениях с гарантиями доставки, предоставляемыми маршрутизатором с помощью чесночной маршрутизации данных с сообщением "ACK" внутри, так что когда данные доходят до получателя, сообщение ACK отправляется обратно к нам [через туннели, естественно]).
tr: Mini akış iletişim kuralı, I2P istemci iletişim kuralındaki (I2CP) zayıf bir tasarım kararından yararlanır. "mode=GUARANTEED" ifadesinin ortaya çıkması. aksi durumda güvenilir olmayan, en çok çaba gerektiren, ileti tabanlı olan iletişim kuralının güvenilir bir şekilde engelleme işlemi için kullanılmasını sağlar (kapakların altında, hala tamamen güvenilmez ve ileti tabanlıdır. Yöneltici, bir "ACK" iletisini yük ile birleştirerek Garlic kapsamayla teslim garantisi sağlar. Böylece veriler hedefe ulaştığında, ACK iletisi bize geri iletilir [tabii ki tünellerden]).
