Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: <strong><a href="https://debian.org">Debian</a> and <a href="https://ubuntu.com">Ubuntu</a> GNU/Linux</strong>: It is possible to obtain packages for Debian and Ubuntu GNU/Linux over I2P using <a href="https://i2pgit.org/idk/apt-transport-i2p">apt-transport-i2p</a> and <a href="https://i2pgit.org/idk/apt-transport-i2phttp">apt-transport-i2phttp</a>. In the future, a bittorrent-based transport may also be developed.
fr: <strong><a href="https://debian.org">Debian</a> et <a href="https://ubuntu.com">Ubuntu</a> GNU/Linux</strong> : Il est possible d'obtenir des paquets pour Debian et Ubuntu GNU/Linux sur I2P en utilisant <a href="https://i2pgit.org/idk/apt-transport-i2p">apt-transport-i2p</a> et <a href="https://i2pgit.org/idk/apt-transport-i2phttp">apt-transport-i2phttp</a>. À l'avenir, un moyen de transportation basé sur bittorrent pourrait aussi être développé.
ru: <strong><a href="https://debian.org">Debian</a> и <a href="https://ubuntu.com">Ubuntu </a>GNU/Linux</strong>: Можно получить пакеты для Debian и Ubuntu GNU/Linux через I2P с помощью <a href="https://i2pgit.org/idk/apt-transport-i2p">apt-transport-i2p</a> и <a href="https://i2pgit.org/idk/apt-transport-i2phttp">apt-transport-i2phttp</a>. В будущем может быть также разработан транспорт на основе bittorrent.
tr: <strong><a href="https://debian.org">Debian</a> ve <a href="https://ubuntu.com">Ubuntu</a> GNU/Linux</strong>: <a href="https://i2pgit.org/idk/apt-transport-i2p">apt transport-i2p</a> ve <a href="https://i2pgit.org/idk/apt-transport-i2phttp">apt-transport-i2phttp</a> kullanılarak I2P üzerinden Debian ve Ubuntu GNU/Linux için paketler elde edilebilir. Gelecekte, bittorrent tabanlı bir taşıyıcı da geliştirilebilir.

source: Applications for Developers to create new things
fr: Applications pour développeurs qui veulent créer de nouvelles choses
ru: Приложения для разработчиков, создающих новые продукты
tr: Geliştiricilerin yeni şeyler yapabileceği uygulamalar

source: <strong><a href="%(sam)s">The SAM API Bridge</a></strong>: The SAM API is a language-independent API for writing applications that are I2P-native by communicating with the local I2P router. It can provide Streaming-like capabilities, Anonymous Datagrams, or Repliable Datagrams.
fr: <strong><a href="%(sam)s">Le pont API SAM</a></strong>: L'API SAM est une API indépendant de la langue pour écrire des applications natives à I2P en communicant avec le routeur I2P local. Il peut fournir des capacités de diffusion en continu, de datagrammes anonymes ou de datagrammes reproductibles.
ru: <strong><a href="%(sam)s">Мост SAM API</a></strong>: SAM API — это независимый от языка API, используемый для написания созданных на основе I2P приложений при помощи локального маршрутизатора I2P. Он может предоставлять возможности, подобные потоковой передаче, анонимные или надежные датаграммы.
tr: <strong><a href="%(sam)s">SAM API köprüsü</a></strong>: SAM API, yerel I2P yönelticisi ile iletişim kurarak I2P ağına özgü uygulamalar yazmak için dilden bağımsız çalışan bir API uygulamasıdır. Akış benzeri yetenekler, anonim datagramlar veya güvenilir datagramlar sağlayabilir.

source: <strong><a href="%(bob)s">The BOB API Bridge</a></strong>: This is a deprecated technology, BOB users should migrate to SAM if it is possible for them to do so.
fr: <strong><a href="%(bob)s">Le pont API BOB</a></strong> : C'est une technologie obsolète, les utilisateurs de BOB devrait migrer vers SAM si possible.
ru: <strong><a href="%(bob)s">Мост API BOB</a></strong>: Это устаревшая технология. Пользователи BOB должны перейти на SAM, если это возможно.
tr: <strong><a href="%(bob)s">BOB API köprüsü</a></strong>: Bu uygulama, kullanımdan kaldırılmış bir teknolojidir Olaibliyorsa BOB kullanıcıları SAM uygulamasına geçmelidir.

source: <strong><a href="%(i2cp)s">The I2CP API</a></strong>: Not strictly an application, this is how Java applications communicate with the I2P router to set up tunnels, generate and manage keys, and communicate with other peers on the network.
fr: <strong><a href="%(i2cp)s">L'API I2CP</a></strong> : Pas strictement une application, cela est comment les applications Java communiquent avec le routeur I2P pour mettre en place les tunnels, générer et gérer les clés et communiquer avec d'autres pairs sur le réseau.
ru: <strong><a href="%(i2cp)s">API I2CP</a></strong>: Это не совсем приложение, это скорее способ взаимодействия приложений Java с маршрутизатором I2P для создания туннелей, генерации и управления ключами и взаимодействия с другими узлами в сети.
tr: <strong><a href="%(i2cp)s">I2CP API</a></strong>: Tam olarak bir uygulama değildir, Java uygulamalarının tünelleri kurmak, anahtarları oluşturmak ve yönetmek, ağdaki diğer eşler ile iletişim kurmak amacıyla I2P yöneltici ile iletişim kurmasını sağlar.

source: I2P Project Members
fr: Membres du projet I2P
ru: Участники проекта I2P
tr: I2P projesi üyeleri

source: We are a small group of people spread around several continents, working to advance different aspects of the project and discussing the design of the network. <a href="%(volunteer)s">Get involved!</a>
fr: Nous sommes un petit groupe disséminé sur tous les continents qui travaille à l’amélioration des différents aspects du projet et qui étudie et débat sur la conception du réseau. <a href="%(volunteer)s">Impliquez-vous !</a>
ru: Мы - маленькая группа людей, распределенная по нескольким континентам, мы работаем над продвижением различных частей проекта и обсуждаем архитектуру сети. <a href="%(volunteer)s">Присоединяйтесь!</a>
tr: Bizler, birkaç kıtaya yayılmış, projenin farklı yönlerini geliştirmek için çalışan ve ağın tasarımını tartışan küçük bir grubuz. <a href="%(volunteer)s">Aramıza katılın</a>

source: Admin
fr: Administration
ru: Администрация
tr: Yönetici

source: Project Manager
fr: Chef de projet
ru: Менеджер проектов
tr: Proje yöneticisi

source: point of contact of last resort
fr: contact en dernier ressort
ru: контакт для крайних случаев
tr: Son aşamada görüşülecek kişi

source: Donations treasurer
fr: Trésorier des dons
ru: Казначей пожертвований
tr: Bağış saymanı

source: manage donations
fr: gérer les dons
ru: управлять пожертвованиями
tr: bağışların yönetimi

source: PR manager
fr: Responsable des relations publiques
ru: PR-менеджер
tr: Halkla ilişkiler yöneticisi

source: press contact, manages public relations and affairs
fr: contact presse, gère les relations publiques et les affaires
ru: контакты с прессой, публичные отношения и дела
tr: Basın ile ilişkiler, halkla ilişkiler yönetimi

source: Assistant PR manager
fr: Assistant du gestionnaire de RP
ru: Помощник PR-менеджера
tr: Halkla ilişkiler sekreteri

source: Public speaking, public relations assistance
fr: Prise de parole en public, aide aux relations publiques
ru: Публичные выступления, связи с общественностью
tr: Herkese açık konuşmalar, halkla ilişkiler desteği

source: <a href="http://%(forum)s/">Forum</a> admin
fr: Admin du <a href="http://%(forum)s/">forum</a>
ru: Администратор <a href="http://%(forum)s/">форума</a>
tr: <a href="http://%(forum)s/">Forum</a> yöneticisi

source: manage the public user forum
fr: gère le forum utilisateurs public
ru: управляет публичным форумом пользователей
tr: herkese açık kullanıcı forumu yönetimi

source: Download mirrors admin
fr: Admin des miroirs de téléchargement
ru: Администратор зеркал загрузки
tr: İndirme yansıları yöneticisi

source: manage the mirrors for the download files
fr: gère les miroirs des fichiers en téléchargement
ru: управление зеркалами для файлов загрузки
tr: indirme dosyaları yansıları yönetimi

source: Website mirrors admin
fr: Admin des miroirs de site Web
ru: Администратор зеркал сайта
tr: Site yansıları yöneticisi

source: vacant
ru: открыта вакансия
tr: açık

source: manage the mirrors for the website
fr: gère les miroirs du site Web
ru: управление зеркалами сайта
tr: site yansıları yönetimi

source: <a href="%(monotone)s">Monotone</a> guru
ru: Гуру <a href="%(monotone)s">Monotone</a>
tr: <a href="%(monotone)s">Monotone</a> gurusu

source: manage the public monotone repositories
fr: gére les référentiels monotones publics
ru: управляет публичными хранилищами monotone
tr: herkese açık monotone depoları yönetimi

source: Packager; Linux
fr: Intégrateur ; Linux
ru: Упаковщик; Linux
tr: Paketleyici; Linux

source: Linux (Debian/Ubuntu) distribution packager
fr: Intégrateur des versions de Linux (Debian/Ubuntu)
ru: упаковщик дистрибутивов под Linux (Debian/Ubuntu)
tr: Linux (Debian/Ubuntu) dağıtım paketleyici

source: Packager; Windows
fr: Intégrateur ; Windows
ru: Упаковщик; Windows
tr: Paketleyici; Windows

source: Windows installer packager
fr: Intégrateur du programme d’installation pour Windows
ru: упаковщик дистрибутивов под Windows
tr: Windows kurucusu paketleyici

source: Packager; OSX
fr: Intégrateur ; OS X
ru: Упаковщик; OSX
tr: Paketleyici; OSX

source: OSX installer packager
fr: Intégrateur du programme d’installation pour OS X
ru: Упаковщик дистрибутивов под OSX
tr: OSX kurucusu paketleyici

source: Release Manager
fr: Responsable des versions
ru: Менеджер по выпуску
tr: Yayın yöneticisi

source: Builds and signs the releases
fr: Compile et signe les versions
ru: Собирает и подписывает релизы
tr: Yayınları hazırlama ve imzalama

source: Release Manager Alternates
fr: Suppléants au gestionnaire de sortie
ru: Заместители менеджера по выпуску
tr: İkinci yayın yöneticisi

source: Backup release managers
fr: Responsables de secours des sorties
ru: Менеджеры по выпуску
tr: Yedek yayınlama yöneticileri

source: CI admin
fr: Admin CI
ru: Администратор CI
tr: Sürekli bütünleştirme yöneticisi

source: Maintain the Continuous Integration infrastructure
fr: Maintient l’infrastructure d’intégration continue
ru: Поддержка инфраструктуры непрерывной интеграции
tr: Sürekli bütünleştirme altyapısı bakımı

source: Reseed admin
fr: Administrateur en réensemencement
ru: Администратор начальных загрузок
tr: Yeniden tohumlama yöneticisi

source: Monitors, advises and recruits reseed hosts
fr: Surveille, conseille et recrute les hôtes de réensemencement
ru: Наблюдает, советует и набирает узлы для начальной загрузки
tr: Yeniden tohumlama sunucularının izlenmesi, önerilmesi ve devreye alınması

source: Security Researcher
fr: Chercheur de sécurité
ru: Специалист, изучающий безопасность
tr: Güvenlik araştırmacısı

source: threat model / crypto expert
fr: Modèle de menaces/expert en cryptographie
ru: Эксперт по моделированию угроз / шифрованию
tr: tehdit modelleme / şifreleme uzmanı

source: Manage the project gitlab
fr: Gérer le projet gitlab
ru: Управление проектом gitlab
tr: Proje GitLab yönetimi

source: Manage the project bug tracker
fr: Gérer le système de suivi des bogues
ru: Управлять системой контроля ошибок проекта
tr: Proje hata izleyici yönetimi

source: manage the public project webservers
fr: Gère les serveurs Web publics du projet
ru: управление веб-серверами публичного проекта
tr: herkese açık proje site sunucuları yönetimi

source: Translation admins
fr: Administrateurs de traduction
ru: Администраторы переводов
tr: Çeviri yöneticileri

source: User Advocate
fr: Avocat des utilisateurs
ru: Пользовательский Адвокат
tr: Kullanıcı avukatı

source: gather, prioritize, advocate for user needs
fr: Rassemble, priorise, défend les besoins exprimés
ru: сбор сведений, расстановка приоритетов, адвокатские услуги для пользователей
tr: kullanıcı gereksinimlerini toplama, önceliklendirme ve koruma

source: Product Development
fr: Développement de produits
ru: Разработка продуктов
tr: Ürün geliştirme

source: supervises projects from the early planning stages to project completion
fr: superviser des projets des premières étapes de préparation à l'achèvement du projet
ru: руководит проектами от ранних стадий планирования до завершения проекта
tr: projelerin planlamasından tamamlanmasına yönetimi

source: Website Maintainer
fr: mainteneur de site web
ru: Сопровождение вэб-сайта
tr: Site yöneticisi

source: manage the public project website content design
fr: Gère le design du site Web public du projet
ru: управление дизайном веб-сайта публичного проекта
tr: herkese açık proje site sunucuları içerik ve tasarım yönetimi

source: <a href="%(website)s">Webserver</a> admin
fr: Admin du <a href="%(website)s">serveur Web</a>
ru: Администратор <a href="%(website)s">веб-сервера</a>
tr: <a href="%(website)s">Site sunucusu</a> yöneticisi

source: <a href="%(website)s">Website</a> admin
fr: Admin du <a href="%(website)s">site Web</a>
ru: Администратор <a href="%(website)s">веб-сайта</a>
tr: <a href="%(website)s">Site sunucusu</a> yöneticisi

source: manage the public project website content
fr: Gère le contenu du site Web public du projet
ru: управление содержимым веб-сайта публичного проекта
tr: herkese açık proje site sunucuları içerik yönetimi

source: News Admin
fr: Admin actualités
ru: Администратор новостей
tr: Haberler yöneticisi

source: manage router console news feed
fr: Gérer le fil d’actualités de la console du routeur
ru: управляет лентой новостей консоли маршрутизатора
tr: yöneltici panosu haberlerinin yönetimi

source: Backup News Admin
fr: Admin des nouvelles de secours
ru: Администратор резервных копий новостей
tr: Yedek haberleri yöneticisi

source: manage the backup news feed
fr: gère l’alimentation en nouvelles de secours
ru: управление резервными копиями ленты новостей
tr: yedek haberlerinin yönetimi

source: Director of passion
fr: Directeur de passion
ru: Директор по мотивации
tr: Bağlılık yöneticisi

source: community motivator
fr: motivateur de communauté
ru: мотиватор сообщества
tr: topluluk canlandırıcı

source: Dev
fr: Développement
ru: Разработка
tr: Geliştirme

source: Core Lead
fr: Meneur principal
ru: Главный разработчик Ядра
tr: Asıl geliştirici

source: lead dev for the SDK and router
fr: Dirige le développement du SDK et du routeur
ru: ведет разработку SDK и роутера
tr: Asıl SDK ve yöneltici geliştiricisi

source: <a href="http://%(postman)s/">I2P mail</a> lead
fr: Responsable du <a href="http://%(postman)s/">courriel d’I2P</a>
ru: Главный разработчик <a href="http://%(postman)s/">почты I2P</a>
tr: <a href="http://%(postman)s/">I2P mail</a> lideri

source: organize and develop the i2p mail system
fr: organiser et développer le système de courriel d’I2P
ru: организует и разрабатывает почтовую систему i2p
tr: I2P e-posta sistemi derleme ve geliştirme

source: <a href="http://%(bote)s/">I2P-Bote</a> lead
fr: Responsable de <a href="http://%(bote)s/">I2P-Bote</a>
ru: Главный разработчик <a href="http://%(bote)s/">I2P-Bote</a>
tr: <a href="http://%(bote)s/">I2P-Bote</a> lideri

source: I2P-Bote plugin
fr: Greffon I2P-Bote
ru: Плагин I2P-Bote
tr: I2P-Bote uygulama eki

source: <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a> lead
fr: Responsable de <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a>
ru: Главный разработчик <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a>
tr: <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a> lideri

source: Maintains the integrated Bittorrent client
fr: Maintient le client Bittorrent intégré
ru: Поддерживает интегрированный клиент Bittorrent
tr: Bütünleşik Bittorrent istemcisi geliştirme

source: <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a> lead
fr: Responsable de <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a>
ru: Главный разработчик <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a>
tr: <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a> lideri

source: Syndie development
fr: Développement de Syndie
ru: разработка Syndie
tr: Syndie geliştirme

source: Susimail lead
fr: Responsable de Susimail
ru: Главный разработчик Susimail
tr: Susimail lideri

source: Susimail development
fr: Développement de Susimail
ru: разработка Susimail
tr: Susimail geliştirme

source: Android lead
fr: Responsable Android
ru: Главный разработчик под Android
tr: Android lideri

source: Android development
fr: Développement Android
ru: разработка под Android
tr: Android geliştirme

source: Console
ru: Консоль
tr: Pano

source: Router console HTML/CSS design
fr: Design HTML/CSS de la console routeur
ru: Дизайн HTML/CSS консоли маршрутизатора
tr: Yöneltici panosu HTML/CSS tasarımı

source: SAM maintainer
fr: Mainteneur SAM
ru: сопровождение SAM
tr: SAM geliştirici

source: Translators
fr: Traducteurs
ru: Переводчики
tr: Çevirmenler

source: many many people!
fr: beaucoup beaucoup de personnes !
ru: много много людей!
tr: Pek çok kişi!

source: Contributors
fr: Contributeurs
ru: Помощники
tr: Katkıda bulunanlar

source: fire2pe dev, console enhancements
fr: Fire2pe dev, améliorations console
ru: разработка fire2pe, улучшение консоли
tr: fire2pe geliştirme, pano geliştirmeleri

source: desktopgui, dijjer port
fr: Interface graphique utilisateur, portage dijjer
ru: desktopgui, портирование dijjer
tr: desktopgui, dijjer taşıma

source: Debian/Ubuntu Packager and PPA maintainer
fr: Intégrateur Debian/Ubuntu et mainteneur du PPA
ru: Дистрибуция Debian/Ubuntu и поддержка PPA
tr: Debian/Ubuntu paketleyici ve PPA sorumlusu

source: Routerconsole backend and UI work, website revamp, unit tests work
fr: Arrière-plan et travail sur l’UI de la console routeur, réorganisation du site Web, travail sur les tests d’unité
ru: Бэкэнд консоли маршрутизатора и работа на UI, исправления по веб-сайту, юнит-тестирование
tr: Routerconsoleyönetim bölümü ve kullanıcı arayüzü işlemleri, sitenin yenilenmesi, birim denemeleri

source: Help needed on many fronts!
fr: Aide nécessaire sur beaucoup de fronts !
ru: Необходима помощь на многих фронтах работы!
tr: Pek çok konuda yardım gerekiyor!

source: Past contributors
fr: Anciens contributeurs
ru: Также помогали
tr: Geçmişte katkıda bulunanlar

source: I2PTunnel development, ministreaming library
fr: développement I2PTunnel, mini bibliothèque de flux
ru: Разработка I2PTunnel, библиотеки мини-потоков
tr: I2PTunnel geliştirme, ministreaming kitaplığı

source: Project lead, Syndie lead
fr: Responsable du projet, responsable de Syndie
ru: Главный разработчик проекта, главный разработчик Syndie
tr: Proje lideri, Syndie lideri

source: Project lead, Syndie lead, I2Phex, support guru
fr: Responsable du projet, responsable de Syndie, I2Phex, gourou du support
ru: Главный разработчик проекта, главный разработчик Syndie, I2Phex, гуру поддержки
tr: Proje lideri, Syndie lideri, I2Phex, destek gurusu

source: iMule lead
fr: Responsable de iMule
ru: Главный разработчик iMule
tr: iMule lideri

source: I2Phex work
fr: Travail I2Phex
ru: Разработчик I2Phex
tr: I2Phex çalışmaları

source: Python SAM library, attack simulations
fr: Bibliothèque Python SAM, simulations d’attaques
ru: Python библиотека SAM, эмуляция атак
tr: Python SAM kitaplığı, saldırı benzetimleri

source: i2pmail development
fr: Développement d’i2pmail
ru: разработка i2pmail
tr: i2pmail geliştirme

source: Syndie help
fr: Aide pour Syndie
ru: Файл справки Syndie
tr: Syndie yardımı

source: i2p mail,susimail and susidns apps
fr: applis courriel i2p, susimail et susidns
ru: приложения почты i2p, susimail и susidns
tr: i2p mail,susimail ve susidns uygulamaları

source: I2Phex (port of Phex to I2P)
fr: I2Phex (portage de Phex vers I2P)
ru: I2Phex (портирование Phex на I2P)
tr: I2Phex (I2P üzerine Phex taşıma)

source: addressbook,i2p-bt,syndie client
fr: carnet d’adresses, i2p-bt, client Syndie
ru: адресная книга, i2p-bt, клиент syndie
tr: addressbook,i2p-bt,syndie istemcisi

source: organize and develop the i2p-bt BitTorrent port
fr: Organise et développe le portage BitTorrent i2p-bt
ru: организация и разработка порта i2p-bt BitTorrent
tr: i2p-bt BitTorrent taşıması derleme ve geliştirme

source: addressbook, i2p-bt, syndie client development
fr: Carnet d’adresses, i2p-bt, développement du client Syndie
ru: адресная книга, i2p-bt, разработка клиента syndie
tr: addressbook, i2p-bt, syndie istemci geliştirme

source: encryption and signature routines, I2PIM
fr: Routines de chiffrement et de signature, I2PIM
ru: задачи по шифрованию и подписанию, I2PIM
tr: şifreleme ve imzalama alt yazılımları, I2PIM

source: SAM jython code, work on stasher (DHT) and v2v (VoI2P)
fr: Code jython de SAM, travail sur stasher (DHT) et v2v (VoI2P)
ru: кодирование SAM jython, работа над stasher (DHT) и v2v (VoI2P)
tr: SAM jython kodu, stasher ("Dağıtılmış karma tablosu", DHT) v2v (VoI2P) çalışmaları

source: installer, systray, bogobot
fr: installateur, zone de notification, bogobot
ru: установщик, systray, bogobot
tr: Kurucu, systray, bogobot

source: jbigi development, wiki migration, doc cleanup
fr: Développement jbigi, migration du wiki, nettoyage de la doc
ru: разработка jbigi, миграция wiki, чистка doc
tr: jbigi geliştirme, wiki aktarımı, belge temizliği

source: java debugging and client development on I2PTunnel and the router console
fr: Débogage java debugging et développement de client sur I2PTunnel et la console du routeur
ru: отладка java и разработка клиента I2PTunnel и консоли маршрутизатора
tr: I2PTunnel ve yöneltici panosu java hata ayıklama ve istemci geliştirme

source: SAM perl module
fr: Module perl de SAM
ru: модуль perl для SAM
tr: SAM perl modülü

source: i2psnark work
fr: travail sur i2psnark
ru: разработка i2psnark
tr: i2psnark çalışması

source: java cleanup
fr: Nettoyage Java
ru: чистка java
tr: java temizliği

source: docs. wiki migration
fr: migration du wiki docs.
ru: документация. миграция wiki
tr: belgeler. wiki aktarımları

source: translations into French
fr: traductions en français
ru: перевод на французский
tr: Fransızca çevirisi

source: C port of jcpuid
fr: Portage en C de jcpuid
ru: Портирование jcpuid на C
tr: jcpuid C taşıma

source: C# SAM library, pants, fortuna integration
fr: Bibliothèque SAM C#, pants, fortuna integration
ru: Библиотека C# SAM, pants, интегрирование fortuna
tr: C# SAM kitaplığı, pants, fortuna bütünleştirmesi

source: i2p-bt tracker development
fr: Développement du traqueur bt-i2p
ru: разработка трекера i2p-bt
tr: i2p-bt izleyici geliştirme

source: Console and website themes
fr: Thèmes console et site Web
ru: Темы для консоли и веб-сайта
tr: Pano ve site temaları

source: &hellip; and many others
fr: &hellip; et de nombreux autres
ru: &hellip; и многие другие
tr: &hellip; ve pek çok diğer şey

source: I2PCon 2015 was the first event of its kind. It had two short-term goals. First, to provide the general public with an event where knowledge about privacy could be obtained. Second, to further the I2P project and its community with technical discussions about cryptography, anonymity and I2P-centric topics.
fr: I2PCon 2015 était le premier événement de cet type. Il avait deux objectifs à court terme. D’abord, de fournir au grand public un événement où il pourrait obtenir de la connaissance au sujet de la vie privée. Deuxièmement, à prolonger le projet I2P et sa communauté avec des discussions techniques au sujet de la cryptographie, l’anonymat et les sujets centrés sur I2P.
ru: I2PCon 2015 - первое мероприятие такого рода. У него две краткосрочные цели. Первая - предоставить обычным людям площадку, на которой могут быть получены знания о приватности. Вторая - обеспечить I2P и его сообществу технические дискуссии о криптографии, анонимности и I2P.
tr: I2PCon 2015, türünün ilk etkinliğiydi. İki kısa vadeli hedefi vardı. Birincisi, kamuoyuna kişisel gizlilik hakkında bilgi edinilebilecek bir etkinlik sunmak. İkincisi, I2P projesini ve topluluğunu şifreleme, anonimlik ve I2P odaklı konular hakkında teknik tartışmalarla ilerletmek.
