Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: Right now, our <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algorithm works by tagging each encrypted message with a unique random 32 byte nonce (a "session tag"), identifying that message as being encrypted with the associated AES session's key. This prevents peers from distinguishing messages that are part of the same session, since each message has a completely new random tag. To accomplish this, every few messages bundle a whole new set of session tags within the encrypted message itself, transparently delivering a way to identify future messages. We then have to keep track of what messages are successfully delivered so that we know what tags we may use.
fr: Dès maintenant, notre algorithme <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> fonctionne en étiquetant chaque message chiffré avec un nonce unique aléatoire de 32 octets (une "étiquette de session"), identifiant ce message comme étant chiffré avec la clé de la session AES associée. Ceci empêche des pairs de distinguer les messages faisant partie de la même session, sachant que chaque message a une nouvelle étiquette complètement aléatoire. Pour accomplir ceci, tous les quelques messages empaquette un tout nouvel ensemble d’étiquettes de session dans le message chiffré lui-même, livrant d’une manière transparente une façon d’identifier des messages futurs. Nous devons alors garder la trace de quels messages sont livrés avec succès afin que nous sachions quelles étiquettes nous pouvons utiliser.
ru: Сейчас наш алгоритм <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> помечает каждое шифрованное сообщение уникальными случайными 32 байтами ("метка сессии - session tag"), определяющими, что сообщение было зашифровано ассоциированным с сессией AES ключом. Это избавляет узлы от необходимости помечать сообщения, которые являются частью той же сессии, т.к. у каждого сообщения есть совершенно новая случайная метка. Чтобы добиться этого, каждые несколько сообщений связываются новым набором меток сессии вместе с шифрованным сообщением, прозрачно предоставляя способ идентифицировать будущие сообщения. Далее мы должны следить за тем, какие сообщения были успешно доставлены, чтобы знать, какие метки мы можем использовать.
tr: Şu anda, <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algoritmamız, her şifrelenmiş iletiyi benzersiz bir rastgele 32 bayt nonce ("oturum etiketi") ile etiketleyerek çalışır ve bu iletiyi ilişkili AES oturumunun anahtarıyla şifrelenmiş olarak tanımlar. Böylece, her iletinin tamamen yeni bir rastgele etiketi olduğundan, eşlerin aynı oturumun parçası olan iletileri ayırt etmesi engellenir. Bunu başarmak için, her birkaç ileti, şifrelenmiş iletinin içinde yepyeni bir oturum etiketi kümesi toplayarak ve gelecekteki iletileri şeffaf bir şekilde tanımlamanın bir yolunu sunar. Ardından, hangi etiketleri kullanabileceğimizi bilmemiz için hangi iletilerin başarıyla iletildiğini izlemeliyiz.

source: This works fine and is fairly robust, however it is inefficient in terms of bandwidth usage, as it requires the delivery of these tags ahead of time (and not all tags may be necessary, or some may be wasted, due to their expiration). On average though, predelivering the session tag costs 32 bytes per message (the size of a tag). As Taral suggested though, that size can be avoided by replacing the delivery of the tags with a synchronized PRNG - when a new session is established (through an ElGamal encrypted block), both sides seed a PRNG for use and generate the session tags on demand (with the recipient precalculating the next few possible values to handle out of order delivery).
fr: Ceci marche bien et c’est assez robuste, cependant c’est inefficace en termes d’utilisation de bande passante, comme cela exige la livraison de ces étiquettes en avance de temps (et toutes les étiquettes peuvent ne pas être nécessaires, ou certaines peuvent être gaspillés, en raison de leur expiration). En moyenne cependant, pré délivrer l’étiquette de session coûte 32 octets par message (la taille d’une étiquette). Comme Taral l’a suggéré, cette taille peut être évitée en remplaçant la livraison des étiquettes par un PRNG synchronisé - quand une nouvelle session est établie (via un block ElGamal chiffré), les deux côtés essaiment un PRNG pour utilisation et produisent les étiquettes de session sur demande (avec le destinataire pré calculant à l’avance les quelques peu de valeurs suivantes possibles afin de traiter la panne de livraison).
ru: Это хорошо и довольно надежно работает, тем не менее, это не эффективно с точки зрения использования пропускной способности, так как для этого требуется досрочно доставлять метки (и не все метки могут быть важны, некоторые могут быть бесполезны в связи с их просрочкой). Хотя, в среднем, досрочная доставка метки сессии занимает 32 байта на сообщение (размер метки). Хотя, как предложил Taral, этот размер можно выиграть, заменив доставку меток синхронизированным PRNG - когда устанавливается новая сессия (через зашифрованный блок ElGamal), обе стороны используют PRNG и генерируют метки сессии по запросу (и получатель предварительно рассчитывает следующие несколько значений для обработки очереди доставки).
tr: Bu yöntem iyi çalışır ve oldukça sağlamdır. Ancak bu etiketlerin zamanından önce teslim edilmesini gerektirdiğinden bant genişliği kullanımı açısından verimsizdir (ve tüm etiketler gerekli olmayabilir veya sürelerinin dolmasından dolayı bazıları boşa gidebilir). Bununla birlikte, ortalama olarak, oturum etiketinin önceden iletilmesi, ileti başına 32 bayta (bir etiketin boyutuna) mal olur. Yine de Taral tarafından önerildiği gibi, etiketlerin teslimi eşitlenmiş bir PRNG ile değiştirilerek bu boyuttan kaçınılabilir. Yeni bir oturum kurulduğunda (ElGamal şifrelenmiş bir blok aracılığıyla), her iki taraf da kullanım için bir PRNG tohumu ve istek üzerine oturum etiketlerini oluşturur (alıcı, istek teslimatını işlemek için sonraki birkaç olası değeri önceden hesaplarken).

source: Longer lasting tunnels
fr: Tunnels de longue durée
ru: Более долгосрочные туннели
tr: Daha uzun ömürlü tüneller

source: The current default tunnel duration of 10 minutes is fairly arbitrary, though it "feels okay". Once we've got tunnel healing code and more effective failure detection, we'll be able to more safely vary those durations, reducing the network and CPU load (due to expensive tunnel creation messages).
fr: La durée actuelle de tunnel est par défaut de 10 minutes, c’est assez arbitraire, quoique cela "va bien". Une fois que nous aurons le code de guérison de tunnel et un code de détection d’échec plus efficace, nous pourrons sans risque varier ces durées, réduisant les charges réseau et UC (dues aux coûteux messages de création de tunnel).
ru: Текущее время жизни туннеля по умолчанию в 10 минут довольно произвольно, хотя "вполне подходит". Когда у нас будет код для лечения туннеля и более эффективное обнаружение ошибок, мы сможем более безопасно варьировать его длительность, снижая нагрузку на сеть и CPU (из-за дорогих сообщений создания туннеля).
tr: 10 dakikalık geçerli varsayılan tünel süresi oldukça keyfidir, ancak "iyi hissettirir". Tünel iyileştirme koduna ve daha etkili arıza algılamasına sahip olduğumuzda, ağ ve işlemci yükünü azaltarak (pahalı tünel oluşturma iletileri nedeniyle) bu süreleri daha güvenli bir şekilde değiştirebileceğiz.

source: This appears to be an easy fix for high load on the big-bandwidth routers, but we should not resort to it until we've tuned the tunnel building algorithms further. However, the 10 minute tunnel lifetime is hardcoded in quite a few places, so substantial effort would be required to change the duration. Also, it would be difficult to maintain backward compatibility with such a change.
fr: Ceci semble être une réparation facile pour une haute charge sur des routeurs à grande bande passante, mais nous ne devrions pas y recourir jusqu’à ce que nous ayons ajusté le tunnel construisant des algorithmes plus loin. Cependant, la durée de vie de tunnel de 10 minutes est codée en dur dans un bon nombre d’endroits, donc un effort substantiel serait exigé pour changer la durée. Aussi, il serait difficile de maintenir la compatibilité descendante avec un tel changement.
ru: Это выглядит простым решением для высоконагруженных маршрутизаторов с большой пропускной способностью, но мы не должны на это рассчитывать до тех пор, пока не оптимизируем алгоритм построения туннеля. Тем не менее, 10 минутное время жизни туннеля жестко прописано в коде в нескольких местах, и для изменения длительности понадобятся значительные усилия. Также будет сложно обеспечить обратную совместимость такого изменения.
tr: Bu, büyük bant genişliğine sahip yönelticilerdeki yüksek yük için kolay bir düzeltme gibi görünüyor. Ancak tünel oluşturma algoritmalarını daha fazla ayarlayana kadar buna başvurmamalıyız. Bununla birlikte, 10 dakikalık tünel ömrü birkaç yerde sabit olarak kodlanmıştır. Bu nedenle süreyi değiştirmek için büyük çaba gerekir. Ayrıca, böyle bir değişiklik yapıldığında geriye dönük uyumluluğu korumak zor olacaktır.

source: Currently, since the network average tunnel build success rate is fairly high, there are no current plans to extend tunnel lifetime.
fr: Actuellement, puisque dans le réseau le taux de réussite de construction de tunnel est en moyenne assez élevé, il n’y a actuellement aucun plan visant à étendre la durée de vie de tunnel.
ru: В настоящее время, т.к. средняя частота удачного создания сетевого туннеля довольно высока, мы не планируем увеличивать время жизни туннеля.
tr: Şu anda, ağın ortalama tünel oluşturma başarı oranı oldukça yüksek olduğundan, tünel ömrünü uzatmaya yönelik bir plan bulunmuyor.

source: Adjust the timeouts
fr: Ajuster les temps d’échéance
ru: Настройка тайм-аутов
tr: Zaman aşımlarını ayarlama

source: Yet another of the fairly arbitrary but "okay feeling" things we've got are the current timeouts for various activities. Why do we have a 60 second "peer unreachable" timeout? Why do we try sending through a different tunnel that a LeaseSet advertises after 10 seconds? Why are the network database queries bounded by 60 or 20 second limits? Why are destinations configured to ask for a new set of tunnels every 10 minutes? Why do we allow 60 seconds for a peer to reply to our request that they join a tunnel? Why do we consider a tunnel that doesn't pass our test within 60 seconds "dead"?
fr: Les temporisations actuelles pour diverses activités sont une autre des choses assez arbitraires, mais qui « semblent correcte » que nous avons. Pourquoi avons-nous une temporisation « pair inaccessible » de 60 secondes ? Pourquoi essayons-nous après 10 secondes d’envoyer au travers d’un tunnel différent que celui annoncé par le jeu de baux ? Pourquoi les requêtes à la base de données de réseau sont-elles restreintes par des limites de 60 ou 20 secondes ? Pourquoi les destinations sont-elles configurées pour demander un nouveau jeu de tunnels toutes les 10 minutes ? Pourquoi permettons-nous 60 secondes à un pair pour répondre à notre demande de se joindre à un tunnel ? Pourquoi considérons-nous comme « mort » un tunnel qui ne réussi pas notre test dans les 60 secondes ?
ru: У нас есть еще одна довольно произвольная, но "вполне подходящая" вещь - это тайм-ауты на различные действия. Почему для "peer unreachable" у нас тайм-аут 60 секунд? Почему мы пытаемся отправить извещения LeaseSet через другой туннель спустя 10 секунд? Почему запрос к базе данных не может длиться дольше 60 или 20 секунд? Почему пункт назначения настроен на запрос нового набора туннелей каждые 10 минут? Почему мы даем узлу 60 секунд для ответа на запрос о присоединении к туннелю? Почему мы считаем, что туннель "умер", если он не передал наш тест за 60 секунд?
tr: Sahip olduğumuz oldukça keyfi ama "tamam saydığımız" şeylerden bir diğeri, çeşitli işlemler için var olan zaman aşımlarıdır. Neden 60 saniyelik bir "eş ulaşılamaz" zaman aşımına sahibiz? Neden bir "Kiralama kümesini" (LeaseSet) duyurulduktan 10 saniye sonra farklı bir tünelden göndermeyi deneriz? Neden "Ağ veri tabanı" (netDB) sorgularını 60 ya da 20 saniye ile sınırlandırıyoruz? Neden hedefleri her 10 dakikada bir yeni bir tünel kümesi isteyecek şekilde yapılandırıyoruz? Neden bir eşin tünele katılma isteğimize yanıt vermesi için 60 saniyeye izin veriyoruz? Neden 60 saniye içinde sınamamızı geçemeyen bir tüneli "ölü" olarak değerlendiriyoruz?

source: Each of those imponderables can be addressed with more adaptive code, as well as tunable parameters to allow for more appropriate tradeoffs between bandwidth, latency, and CPU usage.
fr: Chacun de ces impondérables peut être abordé avec du code plus adaptatif, et aussi avec des paramètres ajustables pour tenir compte de différences plus appropriées entre bande passante, latence et utilisation de CPU.
ru: Все эти костыли можно заменить более адаптивным кодом, так же как и параметры туннеля, чтобы достичь компромисса между пропускной способностью, задержками и использованием CPU.
tr: Bu öngörülemez sorunların her biri, bant genişliği, gecikme ve işlemci kullanımı arasında daha uygun bir denge bulabilmek için ayarlanabilir parametrelerin yanında daha uyarlanabilir bir kodlama ile de çözümlenebilir.

source: Full streaming protocol improvements
fr: Améliorations du protocole full streaming
ru: Улучшение полностью потокового протокола
tr: Tam akış iletişim kuralı iyileştirmeleri

source: Perhaps re-enable the interactive stream profile (the current implementation only uses the bulk stream profile).
fr: Peut-être re-permettre le profil stream interactif (la mise en œuvre actuelle utilise seulement le profil stream en vrac (bulk).
ru: Возможно возобновление использования профиля интерактивного потока (текущая реализация использует только профиль bulk потока).
tr: Belki de etkileşimli akış profilini yeniden etkinleştirme (geçerli uygulama yalnızca toplu akış profilini kullanır).

source: Client level bandwidth limiting (in either or both directions on a stream, or possibly shared across multiple streams). This would be in addition to the router's overall bandwidth limiting, of course.
fr: Limitation de bande passante au niveau du client (ou dans les deux directions sur un flux stream, ou probablement partagée à travers de multiples flux stream). Ceci serait bien sûr en supplément à la limitation de bande passante globale du routeur.
ru: Ограничение пропускной способности на стороне клиента (в любом или обоих направлениях потока, или, при возможности, распределение между несколькими потоками). Конечно, это будет дополнением к общему ограничению пропускной способности маршрутизатором.
tr: İstemci düzeyinde bant genişliği sınırlaması (bir akışta herhangi bir yönde ya da her iki yönde ya da birden çok akışta paylaşılabilir). Bu durum, yönelticinin genel bant genişliğinin sınırlamasına ek olur.

source: Access control lists (only allowing streams to or from certain other known destinations).
fr: Listes de contrôle d’accès (permettant seulement des flux vers ou depuis certaines autres destinations connues).
ru: Списки контроля доступа (разрешать потоки только к или из известных пунктов назначения).
tr: Erişim denetimi listeleri (yalnızca bilinen diğer belirli hedeflere ya da bu hedeflerden akışlara izin verilir).

source: Web controls and monitoring the health of the various streams, as well as the ability to explicitly close or throttle them.
fr: Contrôles Web et suivi de la santé des divers flux, ainsi que la capacité de les fermer ou de les ralentir explicitement.
ru: Веб-управление и наблюдение за состоянием различных потоков, наряду с возможностью явного их закрытия или уменьшения.
tr: İnternet, çeşitli akışların sağlığını denetleme ve izlemenin yanında bunları açıkça kapatabilir ya da kısabilir.

source: Additional ideas for improving the streaming library are described on the <a href="%(streaming)s#future">streaming library page</a>.
fr: Des idées supplémentaires pour améliorer la bibliothèque de streaming sont décrites sur la <a href="%(streaming)s#future">page de bibliothèque streaming</a>.
ru: Дополнительные идеи улучшения потоковой библиотеки описаны на <a href="%(streaming)s#future">странице потоковой библиотеки</a>.
tr: Akış kitaplığını geliştirmek için ek fikirler <a href="%(streaming)s#future"> akış kitaplığı sayfasında</a> açıklanmıştır.

source: Performance History
fr: Historique des performances
ru: Журнал Производительности
tr: Başarım geçmişi

source: Notable performance improvements have been made using the techniques below. There is more to do, see the <a href="%(performance)s">Performance</a> page for current issues and thoughts.
fr: Des améliorations notables de performance ont été faites en utilisant les techniques ci-dessous. Il y a plus à faire, voir la page <a href="%(performance)s">performance</a> pour les problèmes actuels et les idées.
ru: Заметные улучшения производительности были выполнены с использованием нижеперечисленных техник. Еще многое предстоит сделать, см. на странице <a href="%(performance)s">Производительность</a> текущие вопросы и размышления.
tr: Aşağıdaki yöntemler kullanılarak önemli başarım iyileştirmeleri yapılmıştır. Yapılacak daha çok şey var. Güncel sorunlar ve düşünceler için <a href="%(performance)s">Başarım</a> sayfasına bakabilirsiniz.

source: Native math
fr: Maths natives
ru: Нативные вычисления
tr: Doğal matematik

source: implemented
fr: implémenté
ru: реализовано
tr: eklenmiş

source: When I last profiled the I2P code, the vast majority of time was spent within one function: java.math.BigInteger's <a href="%(modpow)s">modPow</a>. Rather than try to tune this method, we'll call out to <a href="%(gmp)s">GNU MP</a> - an insanely fast math library (with tuned assembler for many architectures). (<i>Editor: see <a href="%(jbigi)s">NativeBigInteger for faster public key cryptography</a></i>)
fr: Quand j’ai dernièrement établi le profil du code d’I2P, la grande majorité du temps a été passée dans une fonction : java.math.BigInteger’s <a href="%(modpow)s">modPow</a>. Plutôt que d’essayer d’accorder cette méthode, nous ferons appel à <a href="%(gmp)s">GNU MP</a> – une bibliothèque mathématique follement rapide (avec assembleur accordé pour beaucoup d’architectures). (<i>éditeur : voir <a href="%(jbigi)s">NativeBigInteger pour cryptographie clé publique plus rapide</a></i>)
ru: Когда я последний раз профилировал код I2P, большая часть времени тратилась на одну функцию: java.math.BigInteger <a href="%(modpow)s">modPow</a>. Вместо того чтобы попытаться оптимизировать этот метод, мы будем вызывать <a href="%(gmp)s">GNU MP</a> - безумно быструю математическую библиотеку (с отлаженным ассемблером под множество архитектур). (<i>Редактор: смотри <a href="%(jbigi)s">NativeBigInteger для быстрого шифрования публичным ключом</a></i>)
tr: I2P kodunun profilini en son çıkardığımda, zamanın büyük çoğunluğu tek bir işlev içinde harcanıyordu: java.math.BigInteger <a href="%(modpow)s">modPow</a>. Bu yöntemi ayarlamaya çalışmak yerine, delicesine hızlı bir matematik kitaplığı olan (birçok mimari için ayarlanmış birleştirici ile) <a href="%(gmp)s">GNU MP</a> kitaplığını çağıracağız. (<i>Editör: <a href="%(jbigi)s">Daha hızlı ortak anahtar şifrelemesi için NativeBigInteger</a> inceleyebilirsiniz</i>)

source: ugha and duck are working on the C/JNI glue code, and the existing java code is already deployed with hooks for that whenever its ready. Preliminary results look fantastic - running the router with the native GMP modPow is providing over a 800&#37; speedup in encryption performance, and the load was cut in half. This was just on one user's machine, and things are nowhere near ready for packaging and deployment, yet.
fr: ugha et duck travaillent sur le code glue de C/JNI, et le code Java existant est déjà déployé avec des crochets pour cela quand ce sera prêt. Les résultats préliminaires semblent fantastiques - faire tourner le routeur avec le modPow GMP natal fournit une accélération de 800* *37; de la performance en chiffrement, et la charge a été réduite à moitié. Ceci était juste sur la machine d’un utilisateur et les choses sont très loin d’être prêtes pour le paquetage ni le déploiement, pour le moment.
ru: ugha и duck работают над связующим кодом C/JNI, и существующий код Java уже внедрен соответствующими ловушками, как только он был готов. Предварительные результаты выглядят потрясающе - запуск маршрутизатора с нативным GMP modPow дает около 800&#37; прироста производительности шифрования и снижает нагрузку наполовину. Это было проверено только на одном компьютере пользователя и оно уже готово для внедрения.
tr: ugha ve duck, C/JNI yapıştırıcı kodu üzerinde çalışıyor ve var olan Java kodu, hazır olduğunda bunun için zaten kancalarla konuşlandırılıyor. İlk sonuçlar harika görünüyor. Yönelticiyi yerel GMP modPow ile çalıştırmak 800&#37; şifreleme başarımında hızlanma sağladı ve yükü yarıya indirdi. Bu sonuç yalnızca bir kullanıcının bilgisayarında alındı ve henüz paketleme ve dağıtım için hazır bir şey yok.

source: Garlic wrapping a "reply" LeaseSet
fr: Ail enveloppant un jeux de baux "réponse"
ru: Чесночная упаковка "ответа" LeaseSet
tr: Garlic sarmalama bir "yanıt" "Kiralama kümesi" (LeaseSet)

source: implemented but needs tuning
fr: implémenté mais aurait besoin d’ajustements
ru: реализовано, но нуждается в настройке
tr: eklenmiş ancak ayarlanması gereken

source: This algorithm tweak will only be relevant for applications that want their peers to reply to them (though that includes everything that uses I2PTunnel or mihi's ministreaming lib):
fr: Cet ajustement de l’algorithme ne sera seulement pertinent que pour les applications qui veulent que leurs pairs leur répondent (quoique cela inclue tout ce qui utilise I2PTunnel ou la bibliothèque « ministreaming » de mihi) :
ru: Этот алгоритмический прием может быть применим только к тем приложениям, которые хотят получать ответ от своих узлов (хотя он включает в себя все, что использует I2PTunnel или ministreaming библиотеку mihi):
tr: Bu algoritma ince ayarı, yalnızca eşlerin kendilerine yanıt vermesini isteyen uygulamalar için geçerli olacaktır (ancak bu I2PTunnel veya mihi mini akış kitaplığını kullanan her şeyi kapsar):
