Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: The Project relies on the research provided by civil and digital rights organizations in order to make decisions that offer protections for its users. In this case the ongoing research provided by <a href="https://freedomhouse.org/">Freedom House</a> has been referenced. General guidance is to include countries with a Civil Liberties (CL) score of 16 or less or an Internet Freedom score of 39 or less (not free).
fr: Le projet se repose sur les recherches fourni par les organisations des droits civiles et digitaux pour faire des décisions qui donnent de la protection pour ces utilisateurs. Dans ce cas là, les recherches en cours fourni par la <a href="https://freedomhouse.org/">Freedom House</a> furent référencées. L'orientation général devrait inclure les pays avec un score de Liberté Civile de 16 ou moins ou un score de Liberté Internet de 39 ou moins.
ru: Проект основан на результатах исследований, предоставленных организациями по гражданским и цифровым правам, чтобы поспособствовать принятию решений, обеспечивающих защиту пользователей. В данном случае было использовано текущее исследование, предоставленное Freedom House. Главная мысль заключается в том, чтобы включать страны с рейтингом гражданских свобод (CL) 16 или менее или с рейтингом свободы Интернета 39 (несвободные).
tr: Proje, kullanıcıları için koruma sağlayan kararlar almak amacıyla sivil ve dijital haklar kuruluşları tarafından sağlanan araştırmalara dayanır. Bu durumda <a href="https://freedomhouse.org/">Freedom House</a> tarafından sunulan ve sürmekte olan araştırmaya başvurulmuştur. Genel eğilim, Sivil Özgürlükler (CL) puanı 16 veya altında ya da İnternet Özgürlüğü puanı 39 veya altında olan (özgür olmayan) ülkeleri katmak şeklindedir.

source: Hidden Mode Summary
fr: Résumé du mode caché
ru: Краткое описание скрытого режима
tr: Gizli Kip Özeti

source: When a router is placed into hidden mode, three key things change about it's behavior. It will no longer publish a routerInfo to the NetDB, it will no longer accept participating tunnels, and it will reject direct connections to routers in the same country that it is in. These defenses make the routers more difficult to enumerate reliably, and prevent them from running afoul of restrictions on routing traffic for others.
fr: Quand un routeur est mis en mode caché, trois éléments clés changent dans son comportement. Il ne publiera plus d'InfosRouteur au BDréseau, il n'acceptera plus de tunnels participants et rejettera les connexions directes au routeurs dans le même pays que le routeur. Ces défenses rendent les routeurs plus difficiles à énumérer fiablement et les empêche de rencontrer des restrictions du trafic de routage pour les autres.
ru: Когда маршрутизатор переводится в скрытый режим, в его работе меняются три ключевых момента. Он перестает публиковать информацию о маршрутизаторе в NetDB, принимать используемые туннели и начнет отклонять прямые соединения с маршрутизаторами в той же стране, в которой он находится. Эти защитные меры усложняют перечисление маршрутизаторов и не позволяют им нарушать ограничения на маршрутизацию трафика для других стран.
tr: Bir yöneltici gizli kipe getirildiğinde, davranışıyla ilgili üç önemli şey değişir. Artık "Ağ veri tabanı" (NetDB) üzerine "Yöneltici bilgilerini" (RouterInfo) yayınlamaz, katılımcı tünellerini kabul etmez ve bulunduğu ülkedeki yönelticilerle doğrudan bağlantıları reddeder. Bu savunmalar, yönelticilerin güvenilir bir şekilde belirlenmesini zorlaştırır ve trafiği başkaları için yöneltme sırasındaki kısıtlamalardan kaçınılmasını sağlar.

source: Strict Countries List as of 2020
fr: Listes des pays stricts dès 2020
ru: Список стран с ограничениями, 2020 год
tr: 2020 Kısıtlanan Ülkeler Listesi

source: If you think a country should be added to the strict countries, file an issue on the I2P gitlab.
fr: Si vous pensez qu'un pays doit être ajouté aux pays stricts, déposez un problème sur le gitlab I2P.
ru: Если вы считаете, что какая-либо страна должна быть добавлена в список государств с ограничениями, сообщите о проблеме на гитлабе I2P.
tr: Kısıtlanan ülkelere eklenmesi gerektiğini düşündüğünüz bir ülke varsa, I2P GitLab üzerinden sorun olarak bildirin.

source: The I2P Software
fr: Le logiciel I2P
ru: Программное обеспечение I2P
tr: I2P yazılımı

source: When you install the I2P software made available at geti2p.net, you are actually installing an I2P router and an accompanying bundle of basic applications. The I2P Java distribution is the first I2P software gateway and has been actively developed since 2003.
fr: Quand vous installez le logiciel I2P fournit sur geti2p.net, vous installez en fait un routeur I2P et un paquet accompagné d'applications simples. La distribution Java d'I2P est la première passerelle logiciel I2P et a été activement développé depuis 2003.
ru: Когда вы устанавливаете программное обеспечение I2P, доступное на сайте geti2p.net, вы фактически устанавливаете маршрутизатор I2P и сопутствующий пакет базовых приложений. Дистрибутив I2P Java, находящийся в разработке с 2003 года, — первый программный шлюз I2P.
tr: geti2p.net üzerinde sunulan I2P yazılımını kurduğunuzda, bir I2P yöneltici ile beraberindeki temel uygulamalar paketini kurmuş olursunuz. I2P Java dağıtımı, ilk I2P yazılımsal ağ geçididir ve 2003 yılından beri aktif olarak geliştirilmektedir.

source: The applications are made available through a webUI, which listens at 127.0.0.1:7657, and the main page of which is called the “Router Console,” where you monitor the health of your connection to the network and access applications to use on the network.
fr: L'application est rendue publique à partir d'un webUI, que écoute à 127.0.0.1:7657 et la page principale qui est appelée la "Console Routeur" où vous surveillez la santé de vos connexions au réseau et accédez les applications à utiliser sur le réseau.
ru: Приложения доступны через веб-интерфейс, расположенный по адресу 127.0.0.1:7657, и главная страница которого называется «Консоль маршрутизатора» На ней вы можете отследить состояние вашего подключения к сети и получить доступ к приложениям для использования в сети.
tr: Uygulamalar, 127.0.0.1:7657 adresini dinleyen ve ana sayfası "Yöneltici panosu" olarak adlandırılan internet arayüzünden, ağ bağlantınızın durumunu izleyebilir ve ağ üzerinde kullanabileceğiniz uygulamalara erişebilirsiniz.

source: What is included:
fr: Qu'est-ce qui est inclut :
ru: Что включено:
tr: İçinde neler var:

source: <strong>The Set Up Wizard</strong>: When you download the I2P software, a set up wizard will guide you through a few configuration steps while your router is making its first connections to the network. This happens the same way that your home router connects you to the Internet. During the set up process, you will be given the option to test your bandwidth and set your bandwidth limits in order to ensure a good connection as a network peer.
fr: <strong>Le sorcier mise en place</strong> : quand vous téléchargez le logiciel I2P, un sorcier mise en place vous guidera à travers quelques étapes de configuration pendant que votre routeur fait ses premières connexions au réseau. Cela se passe de la même manière que votre routeur maison qui se connecte à l'internet. Pendant le processus de mise en place, vous aurez l'option de tester votre bande passante et mettre en place vos limites de bande passante pour assurer une bonne connexion à un réseau pair.
ru: Мастер настройки: Когда вы загружаете I2P, мастер настройки проведет вас через несколько этапов конфигурации, пока ваш маршрутизатор будет выполнять первые подключения к сети. Это процесс, аналогичный подключению к Интернету с помощью вашего маршрутизатора. В ходе настройки вам будет предоставлена возможность протестировать пропускную способность и установить ограничения пропускной способности, чтобы обеспечить хорошее соединение с помощью одноранговой сети.
tr: <strong>Kurulum yardımcısı</strong>: I2P yazılımını indirdiğinizde, yönelticiniz ağ ile ilk bağlantılarını kurarken, bir kurulum rehberi birkaç yapılandırma adımını tamamlamanıza yardımcı olacaktır. Bu işlem, ev yönelticinizin İnternet bağlantınızı kurmasıyla aynı şekildedir. Kurulum işlemi sırasında, bir ağ eşi olarak iyi bir bağlantı sağlamak için bant genişliğinizi sınama ve bant genişliği sınırlarınızı belirleme seçenekleri sunulur.

source: <strong>The I2P Router Console</strong>: Here is where you can see your network connections and information about your router. You will be able to see how many peers you have, and other information that will help if you need to troubleshoot. You can stop and start the router as well. You will see the applications that the software includes, as well as links to some community forums and sites on the I2P network. You will receive news when there is a a new software release, and will be able to download the latest version here as well. Additionally, you can find shortcuts to other available applications. The console is customizable and includes a default light theme with a dark theme option.
fr: <strong>La console routeur I2P</strong>: voilà où vous pouvez voir vos connexions réseau et les informations de votre routeur. Vous pourrez voir combien de pairs vous avez et d'autres informations utiles si vous avez besoin de dépannage. Vous pouvez aussi arrêter et démarrer le routeur. Vous verrez les applications que le logiciel propose ainsi que des liens vers des forums communautaires et des sites sur le réseau I2P. Vous recevrez des nouveautés quand il y aura une prochaine version du logiciel et vous pourrez télécharger la dernière version au même endroit. De plus, vous pourrez trouver des raccourcis vers d'autres applications disponibles. Cette console est personnalisable et inclut un thème clair par défaut et l'option d'un thème sombre.
ru: Консоль маршрутизатора I2P: Здесь вы можете увидеть свои сетевые подключения и информацию о маршрутизаторе. Вы сможете увидеть, сколько у вас узлов и другую информацию, которая поможет вам в устранении неполадок. Вы можете остановить и запустить маршрутизатор. Вы увидите приложения, которые включает программное обеспечение, а также ссылки на некоторые форумы и сайты сообщества в сети I2P. В консоли вы будете получать новости о выходе нового программного обеспечения, и здесь же вы сможете загрузить ее последнюю версию. Кроме того, здесь вы можете найти ярлыки для других доступных приложений. Консоль настраивается и включает светлую тему по умолчанию и темную тему.
tr: <strong>I2P yöneltici panosu</strong>: Ağ bağlantılarınızı ve yönelticinizle ilgili bilgiler burada bulunur. Kaç tane eşiniz olduğunu ve bir sorunu gidermeniz gerektiğinde yardımcı olabilecek diğer bilgileri görebilirsiniz. Yönelticiyi durdurabilir ve başlatabilirsiniz. Yazılımın içerdiği uygulamalara ve I2P ağındaki bazı topluluk forumları ile sitelerine bağlantılar da bulunur. Yeni bir yazılım sürümü çıktığında bildirim alarak en son sürümü buradan indirebilirsiniz. Ayrıca, var olan diğer uygulamaların kısayollarını da bulabilirsiniz. Yöneltici panosu özelleştirilebilir ve varsayılan açık temanın yanında koyu tema seçeneği de bulunur.

source: <strong>SusiMail</strong>: SusiMail is a secure email client. It is primarily intended for use with Postman’s email servers inside of the I2P network . It is designed to avoid leaking information about email use to other networks. SusiMail is bridged so it can send and receive email from the internet as well. Occasionally you may see some services like Gmail classifying it as spam, which you can correct in your Internet email service providers settings.
fr: <strong>SusiMail</strong>: SusiMail est un client courriel sécurisé. Il est principalement conçu pour être utilisé avec les serveurs courriels Postman dans le réseau I2P. Il est conçu pour éviter les fuites d'informations d'utilisation de courriel aux autres réseaux. SusiMail est ponté pour qu'il puisse envoyer et recevoir aussi des courriels à internet. Parfois vous pourrez voir certains services comme Gmail le classifiant de pourriel ce qui vous pouvez corriger dans les paramètres internet de fournisseurs courriel.
ru: <strong>SusiMail</strong>: SusiMail — это безопасный почтовый клиент. Он в первую очередь предназначен для совмещенного использования с почтовыми серверами Postman внутри сети I2P. Он разработан таким образом, чтобы избежать утечки информации об использовании электронной почты в другие сети. SusiMail — мост, поэтому он может отправлять и получать электронные письма и из Интернета. Иногда некоторые службы, например, Gmail, классифицируют его как спам,. Вы можете исправить это в настройках вашего поставщика услуг электронной почты.
tr: <strong>SusiMail</strong>: SusiMail güvenli bir e-posta istemcisidir. Öncelikle, I2P ağı içindeki Postman e-posta sunucularıyla kullanılmak üzere tasarlanmıştır. E-postalar ile ilgili bilgilerin diğer ağlara sızmasını engellemek amacıyla geliştirilmiştir. SusiMail, İnternet üzerinden de e-posta alıp gönderebilecek şekilde köprülenmiştir. Ara sıra Gmail gibi bazı hizmetler tarafından istenmeyen e-posta (spam) olarak sınıflandırdığını görebilirsiniz. Ancak bu durum İnternet e-posta hizmeti sağlayıcınızın ayarlarından düzeltilebillr.

source: <strong><a href="%(bittorrent)s">I2PSnark</a></strong>: Snark is an I2P network only BitTorrent client. It never makes a connection to a peer over any other network.
fr: <strong><a href="%(bittorrent)s">I2PSnark</a></strong>: Snark est un client BitTorrent seulement sur le réseau I2P. Il ne se connecte jamais à un pair à la place de n'importe quel autre réseau.
ru: <strong><a href="%(bittorrent)s">I2PSnark</a></strong>: Snark — это клиент BitTorrent только для сети I2P. Он никогда не устанавливает соединение с узлом через любую другую сеть.
tr: <strong><a href="%(bittorrent)s">I2PSnark</a></strong>: Snark, yalnızca I2P ağında çalışan bir BitTorrent uygulamasıdır. Asla başka bir ağ üzerinden bir eş ile bağlantı kurmaz.

source: <strong><a href="%(addressbook)s">The Address Book</a></strong>: This is a locally-defined list of human-readable addresses ( ie: i2p-projekt.i2p) and corresponding I2P addresses.(udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p) It integrates with other applications to allow you to use those human-readable addresses in place of those I2P addresses. It is more similar to a hosts file or a contact list than a network database or a DNS service. There is no recognized global namespace, you decide what any given .i2p domain maps to in the end.
fr: <strong><a href="%(addressbook)s">Le carnet d'adresse</a></strong>: C'est une liste définie localement d'adresses lisibles ( ex: i2p-projekt.i2p) et des adresses I2P correspondantes. (udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p) Cela intègre avec d'autres applications pour vous permettre d'utiliser ces adresses lisibles à la place des adresses I2P. Il ressemble plus à un fichier hébergeur ou une liste de contact qu'à une base de donnée réseau ou un service DNS. Il y n'y a pas d'espace-nom mondialement reconnu, vous pouvez choisir où chaque domaine .i2p
ru: <strong><a href="%(addressbook)s">Адресная книга</a></strong>: Это локально определенный список читаемых пользователем адресов (например: i2p-projekt.i2p) и соответствующих I2P-адресов.(udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p) Она интегрируется с другими приложениями, что позволяет использовать читаемые пользователями адреса вместо I2P-адресов. Адресная книга больше похожа на файл hosts или список контактов, чем на сетевую базу данных или службу DNS. Не существует признанного глобального пространства имен. Вы сами решаете. к какому именно домену .i2p в конечном итоге привязывается тот или иной домен.
tr: <strong><a href="%(addressbook)s">Adres defteri</a></strong>: Burada, insan tarafından okunabilen adreslerin (yani: i2p-projekt.i2p gibi) ve karşılık gelen I2P adreslerinin (udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p gibi) yerel olarak kaydedilmiş bir listesi bulunur. Diğer uygulamalarla bütünleşik olarak çalışarak, I2P adresleri yerine insan tarafından okunabilen adreslerin kullanılabilmesini sağlar. Bir ağ veri tabanından veya DNS hizmetinden çok bir sunucu dosyasına veya kişi listesine benzer. Tanınmış bir küresel ad alanı yoktur. Belirtilen herhangi bir .i2p etki alanının ne ile eşleneceğine siz karar verirsiniz.

source: <strong><a href="%(i2ptunnel)s">I2P Hidden Services Manager</a></strong> This is a general-purpose adapter for forwarding services ( ie SSH ) into I2P and proxying client requests to and from I2P. It provides a variety of “Tunnel Types” which are able to do advance filtering of traffic before it reaches I2P.
fr: <strong><a href="%(i2ptunnel)s">Gestionnaire de Services Cachés I2P</a></strong> C'est un adaptateur polyvalent pour expédier des services (ex : SSH) vers I2P et mandater les demandes clientes vers et à partir d'I2P. Il fournit une multitude de "types de tunnels" qui peuvent filtrer de manière avancé le trafic avant qu'il atteigne I2P.
ru: <strong><a href="%(i2ptunnel)s">I2P Hidden Services Manager</a></strong> Это универсальный адаптер для пересылки сервисов (т.е. SSH) в I2P и проксирования клиентских запросов в I2P и из I2P. Он предоставляет различные «типы туннелей», которые способны осуществлять предварительную фильтрацию трафика до того, как он достигнет I2P.
tr: <strong><a href="%(i2ptunnel)s">I2P gizli hizmetler yönetimi</a></strong> Bu uygulama, çeşitli hizmetleri (SSH gibi) I2P ağına iletmek ve istemci isteklerini I2P ağından vekil sunucu olarak geçirmeyi sağlayan genel amaçlı bir bağdaştırıcıdır. Trafiğin I2P ağına ulaşmadan önce süzülmesini sağlayan çeşitli “Tünel türleri” sunar.

source: Applications Outside I2P to use with I2P
fr: Applications en-dehors d'I2P qui utilisent I2P
ru: Приложения вне I2P для использования в I2P
tr: I2P ile birlikte kullanılan I2P dışındaki uygulamalar

source: <strong><a href="%(browser)s">Mozilla Firefox</a></strong>: A web browser with advanced privacy and security features, this is the best browser to configure to browse I2P sites.
fr: <strong><a href="%(browser)s">Mozilla Firefox</a></strong> : Un navigateur web avec une intimité avancée et des fonctions de sécurité, c'est le meilleur navigateur pour configurer et naviguer des sites I2P.
ru: <strong><a href="%(browser)s">Mozilla Firefox</a></strong>: Веб-браузер с расширенными функциями конфиденциальности и безопасности. Это лучший браузер, который можно настроить для просмотра сайтов I2P.
tr: <strong><a href="%(browser)s">Mozilla Firefox</a></strong>: Gelişmiş gizlilik ve güvenlik özelliklerine sahip bir tarayıcıdır ve I2P sitelerine göz atmak için yapılandırılabilecek en iyi tarayıcıdır.

source: <strong><a href="%(browser)s">Chromium</a></strong>: A web browser developed by Google that is the Open-Source base of Google Chrome, this is sometimes used as an alternative to Firefox.
fr: <strong><a href="%(browser)s">Chromium</a></strong>: Un navigateur web développé par Google qui est la base open source de Google Chrome qui est parfois utilsé en tant qu'alternative à Firefox.
ru: <strong><a href="%(browser)s">Chromium</a></strong>: Веб-браузер, разработанный компанией Google, являющийся основой Google Chrome с открытым исходным кодом, иногда используется как альтернатива Firefox.
tr: <strong><a href="%(browser)s">Chromium</a></strong>: Google tarafından geliştirilen ve Google Chrome için açık kaynak tabanı olan bir tarayıcıdır. Bazen Firefox yerine kullanılır.

source: <strong><a href="https://biglybt.com">BiglyBT</a></strong>: A Feature-Rich bittorrent client including I2P support and the unique ability to “Bridge” regular torrents in-to I2P so people can download them anonymously.
fr: <strong><a href="https://biglybt.com">BiglyBT</a></strong> : Un client bittorent rempli de fonctionnalités incluant la prise en charge d'I2P et la possibilité unique de "Ponter" les torrents normaux vers I2P pour que les gens puissent les télécharger anonymement.
ru: <strong><a href="https://biglybt.com">BiglyBT</a></strong>: Многофункциональный битторрент-клиент, включающий в себя I2P-поддержку и уникальную возможность соединять обычные торренты в I2P, чтобы чтобы люди могли скачивать их анонимно.
tr: <strong><a href="https://biglybt.com">BiglyBT</a></strong>: I2P desteği sunan ve insanların anonim olarak indirebilmeleri için normal torrent dosyalarını I2P ağına "köprüleme" gibi benzersiz bir özelliği de içeren zengin özellikli bir bittorrent istemcisidir.

source: <strong><a href="https://openssh.com">OpenSSH</a></strong>: OpenSSH is a popular program used by systems administrators to <a href="%(ssh)s">remotely administer a server</a>, or to provide “Shell” accounts for users on the server.
fr: <strong><a href="https://openssh.com">OpenSSH</a></strong> : OpenSSH est un logiciel populaire utilisé dans des systèmes administrateurs pour <a href="%(ssh)s">administrer un serveur à distance</a> ou pour fournir des comptes "Shell" pour les utilisateurs du serveur.
ru: <strong><a href="https://openssh.com">OpenSSH: OpenSSH</a></strong> — это популярная программа, используемая системными администраторами для <a href="%(ssh)s">удаленного администрирования сервера</a> или для создания учетных записей Shell для пользователей на сервере.
tr: <strong><a href="https://openssh.com">OpenSSH</a></strong>: OpenSSH, sistem yöneticileri tarafından <a href="%(ssh)s">bir sunucuyu uzaktan yönetmek</a> ya da sunucudaki kullanıcılara “kabuk” hesapları sağlamak için beğenilerek kullanılan bir uygulamadır.

source: <strong><a href="%(git)s">Git</a>/<a href="%(gitlab)s">Gitlab</a></strong>: Git is a source-code control tool which is distributed, and often recommends a fork-first workflow. Hosting source code on I2P is an important activity, so Gitlab-specific instructions are available for all to use.
fr: <strong><a href="%(git)s">Git</a>/<a href="%(gitlab)s">Gitlab</a></strong>: Git est un outil de contrôle du code source distribué et recommande souvent un flux de travail. Héberger le code source sur I2P est une activité importante donc les instructions spécifiques à Gitlab sont disponible à l'utilisation pour tous.
ru: <strong><a href="%(git)s">Git</a>/<a href="%(gitlab)s">Gitlab</a></strong>: Git — это распределенный инструмент контроля исходного кода, который часто рекомендует сначала поработать с форком. Размещение исходного кода на I2P важно, поэтому инструкции, адаптированные для Gitlab, доступны для для всех желающих.
tr: <strong><a href="%(git)s">Git</a>/<a href="%(gitlab)s">GitLab</a></strong>: Git, dağıtılmış ve genellikle önce bir dal oluşturma şeklinde iş akışını öneren bir kaynak kodu denetleme aracıdır. I2P için kaynak kodu barındırmak önemli bir etkinliktir. Bu nedenle özel GitLab yönergeleri herkesin kullanımına açıktır.
