Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: A a larger and more long-term goal of this event was to build a commnutiy of privacy-conscious individuals. By connecting people who recognize the importance of privacy, we wanted to provide a forum where this community can grow.
fr: Un objectif plus grand et à plus à long terme de cet événement était de construire une communauté d’individus conscients de la vie privée. En connectant des gens qui reconnaissent l’importance de la vie privée, nous avons voulu fournir un forum où cette communauté peut croître.
ru: Более крупная и долгосрочная цель - построение сообщества сознающих приватность индивидуалов. Связывая людей, осознающих важность приватности, мы хотим предоставить форум для роста такого сообщества.
tr: Bu etkinliğin daha büyük ve daha uzun vadeli bir amacı, kişisel gizlilik bilincine sahip bireylerden oluşan bir topluluk oluşturmaktı. Kişisel gizliliğin öneminin farkında olan insanları bir araya getirerek, bu topluluğun büyüyebileceği bir forum sağlamak istedik.

source: The idea for this event was first spawned by our wonderful friends at <a href="https://torontocrypto.org/">Toronto Crypto</a>. The venue was provided by <a href="https://hacklab.to/">Hacklab.to</a>. The marketing was spearheaded by <a href="https://twitter.com/YrB1rd">@YrB1rd</a> and Siew. Without them this event would not have been possible.
fr: L’idée de cet événement a été d’abord engendré par nos merveilleux amis du <a href="https://torontocrypto.org/">Toronto Crypto</a>. Le lieu a été fourni par <a href="https://hacklab.to/">Hacklab.to</a>. Le marketing a été mené par <a href="https://twitter.com/YrB1rd">@YrB1rd</a> et Siew. Sans eux cet événement n’aurait pas été possible.
ru: Идея этого мероприятия была впервые озвучена нашими прекрасными друзьями на <a href="https://torontocrypto.org/">Toronto Crypto</a>. Помощь оказана <a href="https://hacklab.to/">Hacklab.to</a>. Продвижение <a href="https://twitter.com/YrB1rd">@YrB1rd</a> и Siew. Без них мероприятие бы не состоялось.
tr: Bu etkinliğin fikri ilk olarak <a href="https://torontocrypto.org/">Toronto Crypto</a> etkinliğindeki harika arkadaşlarımız tarafından ortaya atıldı. Mekan <a href="https://hacklab.to/">Hacklab.to</a> tarafından sağlandı. Pazarlamaya <a href="https://twitter.com/YrB1rd">@YrB1rd</a> ve Siew öncülük etti. Onların katkıları olmadan bu etkinlik gerçekleşemezdi.

source: Slides and Video
fr: Diaporamas et vidéo
ru: Слайды и видео
tr: Sunumlar ve görüntü

source: Slides are also available as an in-I2P torrent.
fr: Les diaporamas sont également disponibles sous forme de torrent dans I2P.
ru: Слайды также доступны через I2P torrent.
tr: Sunumlar ayrıca I2P torrent olarak da bulunabilir.

source: Note: Video links will be posted as they become available.
fr: Note : des liens de vidéos seront affichés dès qu’ils seront disponibles.
ru: Примечание: Ссылки на видео будут опубликованы как только видео станет доступным.
tr: Not: Görüntü bağlantıları kullanılabilir olduka eklenecektir.

source: Note that in-I2P torrents may also be available on the non-private internet due to bridging by Vuze clients.
fr: Prenez note que les torrents dans I2P peuvent aussi être aussi disponible sur l'internet non-privé à cause du relai par les clients Vuze.
ru: Обратите внимание, что торренты in-I2P могут быть доступны и в обычном Интернете благодаря мостовому соединению клиентов Vuze.
tr: Vuze istemcileri tarafından köprüleme yapılması nedeniyle, I2P içi torrentlerin kişisel olmayan İnternet üzerinde de bulunabileceğini unutmayın.

source: Licenses
fr: Licences
ru: Лицензии
tr: Lisanslar

source: All videos are by z3r0fox.
fr: Toutes les vidéos sont de z3r0fox.
ru: Все видео z3r0fox.
tr: z3r0fox tarafından hazırlanmış tüm görüntüler.

source: License
fr: Licence
ru: Лицензия
tr: Lisans

source: Slides by psi: Public domain.
fr: Diaporamas par psi : domaine public.
ru: Слайды psi: Общественное достояние
tr: psi sunumları: Herkese açık.

source: Slides by str4d and zzz:
fr: Diaporamas par str4d et zzz :
ru: Слайды str4d и zzz:
tr: str4d ve zzz sunumları:

source: Slides by others: Contact the author for license information.
fr: Diaporamas réalisées par d’autres : contactez l’auteur pour les informations de licence.
ru: Слайды других: Свяжитесь с авторами для уточнения информации о лицензии.
tr: Diğerlerinin sunumları: Lisans bilgileri için hazırlayan ile görüşün.

source: Speakers
fr: Orateurs
ru: Докладчики
tr: Konuşmacılar

source: Colin Mahns has a strong interest in the use of anonymity and encryption technology to help preserve human rights in the digital age.
fr: Colin Mahns a un grand intérêt dans l’utilisation de l’anonymat et de la technologie de chiffrement pour aider à préserver les droits humains à l’âge numérique.
ru: У Colin Mahns есть большой интерес к использованию анонимности и технологий шифрования, чтобы помочь сохранять права человека в цифровой век.
tr: Colin Mahns, dijital çağda insan haklarının korunmasına yardımcı olmak için anonimlik ve şifreleme teknolojisinin kullanımına büyük ilgi duymaktadır.

source: David Dagon is a postdoc researcher at Georgia Tech focused on botnets, malware, network security, and DNS. His interest in I2P is centered on preserving user privacy, autonomous filtering, and anti-abuse.
fr: David Dagon est un chercheur postdoctoral à l’université « Georgia Tech ». Il concentre ses recherches sur les réseaux de zombies, les programmes malveillants, la sécurité des réseaux et le DNS. Son intérêt pour I2P est axé sur la protection de la vie privée des utilisateurs, le filtrage autonome et la lutte contre les abus.
ru: David Dagon - исследователь postdoc в Технологическом институте Джорджии, фокусируется на ботнетах, вредоносном программном обеспечении, сетевой безопасности и DNS. Его интерес к I2P центрируется на сохранении приватности частной жизни, автономной фильтрации и anti-abuse.
tr: David Dagon, Georgia Tech'te botnetler, kötü amaçlı yazılımlar, ağ güvenliği ve DNS üzerine odaklanmış bir doktora sonrası araştırmacıdır. I2P ağına olan ilgisi, kullanıcı gizliliğini, otonom süzmeyi ve kötüye kullanımı önlemeye odaklanmıştır.

source: More info
fr: Renseignements complémentaires
ru: Больше информации
tr: Ayrıntılı bilgiler

source: J is the head of Toronto Crypto.
fr: J est le responsable de Toronto Crypto.
ru: J - глава Торонто Crypto.
tr: J, Toronto Crypto'nun başıdır.

source: Lance James is the founder of the Invisibile IRC Project, the predecessor to I2P, back in 2002. He founded his own cyber threat intelligence company in 2003. He's been focused on network security, malware research, and information security ever since. During 2011-2013, he was Director of Threat Intelligence for The Vigilant, which was acquired by Deloitte in 2013. He recently left Deloitte to do consulting through his company The James Group.
fr: Lance James est le fondateur du projet IRC Invisible, le prédécesseur d’I2P, lancé en 2002. Il a fondé sa propre entreprise d’intelligence en cyber menace en 2003. Depuis, il a été concentré sur la sécurité de réseau, la recherche concernant le logiciel malveillant et la sécurité de l’information. Durant 2011-2013, il était le directeur d’intelligence de menace pour The Vigilant, qui a été acquis par Deloitte en 2013. Il a récemment quitté Deloitte pour effectuer du conseil via son entreprise James Group.
ru: Lance James - основатель Invisibile IRC Project, предшественника I2P, back in 2002. Он основал свою собственную компанию по борьбе с киберугрозами в 2003. Он фокусируется на защите сети, исследовании вредоносных программ и защите информации до сих пор. В 2011-2013 он был директором Threat Intelligence в The Vigilant, поглощенной Deloitte в 2013. Недавно он покинул Deloitte для консультирования через свою компанию The James Group.
tr: Lance James, 2002 yılında I2P öncülü olan Invisibile IRC projesinin kurucusudur. 2003 yılında kendi siber tehdit istihbarat şirketini kurdu. O zamandan beri ağ güvenliği, kötü amaçlı yazılım araştırması ve bilgi güvenliği konularına odaklandı. 2011-2013 döneminde, 2013 yılında Deloitte tarafından satın alınan The Vigilant için Tehdit İstihbaratı Direktörü olarak görev yaptı. Yakın zamanda kendi şirketi The James Group aracılığıyla danışmanlık yapmak üzere Deloitte kuruluşundan ayrıldı.

source: Nicholas D. is a member of Hacklab Toronto.
fr: Nicholas D. est un membre du Hacklab Toronto.
ru: Николас Д. - член Торонто Hacklab.
tr: Nicholas D. Hacklab Toronto üyesidir.

source: Nicholas Johnston is a Professor of Information Security in Sheridan College's School of Applied Computing in the InfoSec Bachelor's degree program. His previous professional career was in digital forensics and investigations. He is also a contractor specializing in incident response. His research areas include secure software development and data analytics.
fr: Nicholas Johnston est un professeur de sécurité de l’information au "Sheridan College’s School of Applied Computing" dans le programme de licence d’InfoSec. Sa carrière professionnelle précédente était dans la science légale numérique et les enquêtes. Il est aussi un entrepreneur se spécialisant dans la réponse à l’incident. Ses zones de recherche incluent le développement logiciel sécurisé et l’analytique de données.
ru: Nicholas Johnston - профессор информационной безопасности в Sheridan College's School of Applied Computing в программе подготовки бакалавров по информационной безопасности. Его предыдущая профессиональная карьера была в цифровой судебной экспертизе и расследованиях. Он также подрядчик, специализирующийся на реагировании на инциденты. Его области исследования включают безопасную разработку программного обеспечения и аналитику данных.
tr: Nicholas Johnston, InfoSec Lisans programında Sheridan College Uygulamalı Bilgi İşlem Okulu'nda Bilgi Güvenliği Profesörüdür. Önceki profesyonel kariyeri adli bilişim ve soruşturmalardı. Aynı zamanda olay müdahalesinde uzmanlaşmış bir sözleşmeli çalışandır. Araştırma alanları arasında güvenli yazılım geliştirme ve veri incelemesi bulunmaktadır.

source: Psi is an I2P developer.
fr: Psi est un développeur d’I2P.
ru: Psi - разработчик I2P.
tr: Psi bir I2P geliştiricisidir.

source: Str4d is an I2P developer.
fr: Str4d est un développeur d’I2P.
ru: Str4d - разработчик I2P.
tr: Str4d bir I2P geliştiricisidir.

source: Zzz is an I2P developer.
fr: Zzz est un développeur d’I2P.
ru: Zzz - разработчик I2P.
tr: Zzz bir I2P geliştiricisidir.

source: Press
fr: Presse
ru: Пресса
tr: Basın

source: Toronto Star article on Nicholas Johnston's talk
fr: Article de Toronto Star concernant la conférence de Nicholas Johnston
ru: Статья Toronto Star, основанная на разговоре с Николасом Джонстоном
tr: Nicholos Johnson'un konuşması hakkındaki Toronto Star makalesi

source: Day 1
fr: Jour 1
ru: День 1
tr: 1. gün

source: Talk
fr: Conférence
ru: Общение
tr: Konuşma

source: Presenter
fr: Orateur
ru: Ведущий
tr: Sunucu

source: Video
fr: Vidéo
ru: Видео
tr: Görüntü

source: Slides
fr: Diaporamas
ru: Слайды
tr: Sunum

source: Day 2
fr: Jour 2
ru: День 2
tr: 2. gün

source: The first conference dedicated to I2P was held in Toronto on August 15-16, 2015. See the link below for more information and links to slides and videos.
fr: La première conférence dédiée à I2P à eu lieu à Toronto du 15 au 16 août 2015. Voir les liens ci-dessous pour plus de précisions et les liens vers les diaporamas et les vidéos.
ru: Первая конференция, посвященная только I2P, была проведена в Торонто 15-16 августа 2015. Посмотрите ссылку ниже для получения дополнительной информации и ссылки на слайды и видео.
tr: I2P üzerine ilk konferans 15-16 Ağustos 2015 tarihinde Toronto'da yapıldı. Ayrıntılı bilgi almak ve sunum ile görüntülere bakmak için aşağıdaki bağlantıya bakın.

source: Past years
fr: Années précédentes
ru: Прошлые годы
tr: Önceki yıllar

source: Future Performance Improvements
fr: Améliorations des performances dans le futur
ru: Предстоящие улучшения производительности
tr: Gelecekteki başarım iyileştirmeleri

source: August 2010
fr: Août 2010
ru: Август 2010
tr: Ağustos 2010

source: There are a few major techniques that can be done to improve the perceived performance of I2P - some of the following are CPU related, others bandwidth related, and others still are protocol related. However, all of those dimensions affect the latency, throughput, and perceived performance of the network, as they reduce contention for scarce resources. This list is of course not comprehensive, but it does cover the major ones that are seen.
fr: Il existe quelques techniques principales qui peuvent être appliquées pour améliorer les performances perçues d’I2P. Certaines des suivantes sont liées à l’UCT, d’autres à la bande passante et d’autres encore au protocole. Cependant, toutes ces dimensions affectent la latence, le débit, et les performances perçues du réseau, car elles réduisent les conflits pour des ressources rares. Cette liste n’est bien sûr pas complète, mais elle couvre les techniques principales observées.
ru: Существует несколько основных применимых техник для увеличения видимой производительности I2P - некоторые из них связаны с ЦП, другие связаны с шириной канала, третьи связаны с протоколом. Тем не менее, все они оказывают влияние на задержки, пропускную способность и видимую производительность сети, так как снижают нагрузку на ограниченные ресурсы. Этот список, конечно же, не является исчерпывающим, однако он охватывает основные доступные методы.
tr: Algılanan I2P başarımını iyileştirmek için yapılabilecek birkaç temel işlem vardır. Aşağıdakilerden bazıları işlemci ile, bazıları bant genişliği ile, bazıları da iletişim kuralları ile ilgilidir. Bununla birlikte, bu boyutların tümü, kıt kaynakların kullanımını azalttığı için ağ gecikmesini, verimini ve algılanan başarımı etkiler. Bu liste çok ayrıntılı olmasa da ele alınan ana konuları kapsıyor.

source: For past performance improvements see the <a href="%(history)s"> Performance History</a>.
fr: Pour les améliorations de performance passées voir <a href="%(history)s"> l’historique de performance</a>.
ru: Для ознакомления с уже реализованными улучшениями производительности просмотрите <a href="%(history)s"> Историю Производительности</a>.
tr: Geçmişte yapılmış başarım iyileştirmeleri için <a href="%(history)s"> Başarım geçmişine</a> bakabilirsiniz.

source: Better peer profiling and selection
fr: Meilleure sélection et profilage du pair
ru: Улучшение выбора и профилирования узлов
tr: Daha iyi eş belirleme ve seçme

source: Probably one of the most important parts of getting faster performance will be improving how routers choose the peers that they build their tunnels through - making sure they don't use peers with slow links or ones with fast links that are overloaded, etc. In addition, we've got to make sure we don't expose ourselves to a <a href="%(sybilpdf)s">Sybil</a> attack from a powerful adversary with lots of fast machines.
fr: Une des parties probablement les plus importantes pour obtenir la performance plus rapide sera d’améliorer comment les routeurs choisissent les pairs( au travers desquels ils construisent leurs tunnels - en s’assurant qu’ils n’utilisent pas de pairs avec des liens lents ou avec des liens rapides qui seraient surchargés, etc. De plus, nous devons nous assurer que nous ne nous exposons pas nous-mêmes à une attaque <a href="%(sybilpdf)s">Sybil</a> lancée depuis un adversaire puissant avec beaucoup de machines rapides.
ru: Вероятно, самым важным шагом к повышению производительности является улучшение механизма выбора узлов, через которые будет строиться туннель, нужно удостовериться, что не будут использоваться слишком медленные узлы или быстрые, но перегруженные узлы и т.д. Вдобавок к этому мы должны убедиться, что не откроемся для атак типа <a href="%(sybilpdf)s">Sybil</a> со стороны сильных противников с множеством быстрых узлов.
tr: Daha hızlı başarım elde etmenin en önemli parçalarından biri, yönelticileri tüneller oluşturduğu eşleri seçme şeklini iyileştirmek olabilir. Yavaş bağlantıları olan ya da hızlı bağlantılara aşırı yüklenmiş eşlerin kullanılmadığından emin olmak gibi. Ayrıca, kendimizi çok sayıda hızlı bilgisayara sahip güçlü bir düşmanın <a href="%(sybilpdf)s">Sybil</a> saldırısına açık hale getirmeyeceğimizden de emin olmalıyız.

source: Network database tuning
fr: Mise au point de la base de données de réseau
ru: Настройка базы данных сети
tr: Ağ veri tabanını ayarlama

source: We're going to want to be more efficient with the network database's healing and maintenance algorithms - rather than constantly explore the keyspace for new peers - causing a significant number of network messages and router load - we can slow down or even stop exploring until we detect that there's something new worth finding (e.g. decay the exploration rate based upon the last time someone gave us a reference to someone we had never heard of). We can also do some tuning on what we actually send - how many peers we bounce back (or even if we bounce back a reply), as well as how many concurrent searches we perform.
fr: Nous allons vouloir être plus efficaces en guérissant la base de données de réseau et les algorithmes de maintenance - plutôt que constamment explorer le keyspace pour de nouveaux pairs - cause d’un nombre important de messages de réseau et de charge de routeur - nous pouvons ralentir ou peut même arrêter d’explorer jusqu’à ce que nous détections qu’il y a quelque chose de nouveau méritant d’être trouvé (ex: dégrader le taux d’exploration en se basant sur la dernière fois que quelqu’un nous a donné une référence de quelqu’un dont nous n’avions jamais entendu parler). Nous pouvons aussi faire certains réglages sur ce que nous envoyons actuellement - sur combien de pairs nous rebondissons (ou même si nous rebondissons en retour une réponse), aussi bien que combien de recherches simultanées nous accomplissons.
ru: Мы хотим улучшить процесс исправления сетевой базы данных и алгоритмы обслуживания, а не постоянно отслеживать пространство ключей для новых узлов, провоцируя огромное количество сетевых сообщений и нагрузку на маршрутизатор - мы можем снизить или даже прекратить следить до тех пор, пока мы не обнаружим что-то более плохое (например, снизить частоту слежения, основываясь на последнем времени, когда кто-то дал нам ссылку на кого-то, о ком мы раньше не знали). Также мы можем оптимизировать то, что мы на самом деле отправляем - сколько узлов участвует в отправке (или даже в получении ответа), и сколько конкурентных поисков мы выполняем.
tr: Ağ veri tabanının iyileştirme ve bakım algoritmalarıyla daha verimli olmak isteyeceğiz. Sürekli olarak yeni eşler bulmak için anahtar alanını keşfetmek ve önemli sayıda ağ iletisine ve yöneltici yüküne neden olmak yerine, bulmaya değer yeni bir şey olduğunu algılayıncaya kadar keşfetmeyi yavaşlatabilir hatta durdurabiliriz (birinin bize daha önce hiç duymadığımız birinin referansını vermesine bağlı olarak keşif oranını azaltmak gibi). Ayrıca, gerçekte ne gönderdiğimizle, kaç eşten geri döndürüldüğümüzle (veya bir geri dönüş yanıtı aldığımızle) ve aynı anda kaç tane eş zamanlı arama yaptığımızla ilgili bazı ayarlamalar yapabiliriz.

source: Session Tag Tuning and Improvements
fr: Mise au point et améliorations des étiquettes de session
ru: Настройка и улучшение меток сессии
tr: Oturum etiketi ayarlama ve geliştirme

source: The way the <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algorithm works is by managing a set of random one-time-use 32 byte arrays, and expiring them if they aren't used quickly enough. If we expire them too soon, we're forced to fall back on a full (expensive) ElGamal encryption, but if we don't expire them quickly enough, we've got to reduce their quantity so that we don't run out of memory (and if the recipient somehow gets corrupted and loses some tags, even more encryption failures may occur prior to detection). With some more active detection and feedback driven algorithms, we can safely and more efficiently tune the lifetime of the tags, replacing the ElGamal encryption with a trivial AES operation.
fr: La façon dont l’algorithme <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> fonctione est en gérant un ensemble de tableaux de 32 octets à usage unique, et en les faisant expirer s’ils ne sont pas utilisés assez rapidement. Si nous les faisons expirer trop tôt, nous sommes obligés de nous replier en ayant recours à un (coûteux) plein chiffrement ElGamal, mais si nous ne les faisons pas expirer assez rapidement, nous devons réduire leur quantité pour que nous ne soyons pas à court de mémoire (et si le destinataire est d’une façon ou d’une autre corrompu et perd certaines étiquettes, encore plus d’échecs de chiffrement peuvent se produire avant la détection). Avec une certaine détection plus active et des algorithmes de retour d’information, nous pouvons sans risque et plus efficacement ajuster la durée de vie des étiquettes, remplaçant le chiffrement ElGamal avec une insignifiante opération AES.
ru: Суть алгоритма <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> состоит в управлении набором случайных одноразовых 32-байтных массивов и в удалении их, если они не были достаточно быстро использованы. Если мы удалим их слишком рано, мы перейдем к полному (дорогому) шифрованию ElGamal, но если мы не удалим их достаточно быстро, нам придется уменьшить их количество, чтобы не исчерпать свободную память (и если получатель все-таки поломается и потеряет несколько меток, то может возникнуть даже больше ошибок шифрования до обнаружения этого). С более активными алгоритмами обнаружения и оповещения мы можем безопаснее и эффективнее управлять жизненным циклом меток, заместив шифрование ElGamal простой операцией AES.
tr: <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algoritmasının çalışma şekli, rastgele tek kullanımlık 32 baytlık diziler kümesini yönetmek ve yeterince hızlı kullanılmazlarsa bunların sürelerini sona erdirmektir. Süresini çok erken doldurursak, tam (pahalı) bir ElGamal şifrelemesine geri dönmek zorunda kalırız. Ancak süreleri yeterince hızlı bir şekilde sona erdirmezsek, bitmemesi için sayılarını azaltmamız gerekir (ve alıcı bir şekilde bozulursa ve bazı etiketleri kaybederse, algılamadan önce daha da fazla şifreleme hatası oluşabilir). Algılama ve geri beslemeye dayalı daha etkin bazı algoritmalarla, ElGamal şifrelemesini önemsiz bir AES işlemiyle değiştirerek etiketlerin ömrünü güvenli ve daha verimli bir şekilde ayarlayabiliriz.

source: Additional ideas for improving Session Tag delivery are described on the <a href="%(elgamalaes)s#future">ElGamal/AES+SessionTag page</a>.
fr: Des idées supplémentaires pour améliorer la livraison d’étiquettes de session sont décrites sur la <a href="%(elgamalaes)s#future">page ElGamal/AES+SessionTag</a>.
ru: Дополнительные идеи улучшения доставки Метки Сессии описаны на <a href="%(elgamalaes)s#future">странице ElGamal/AES+SessionTag</a>.
tr: Oturum etiketi dağıtımını iyileştirmeye yönelik ek fikirler <a href="%(elgamalaes)s#future">ElGamal/AES+SessionTag sayfasında</a> açıklanmıştır.

source: Migrate sessionTag to synchronized PRNG
fr: Migrer l’étiquette de session vers un PRNG synchronisé
ru: Переход от sessionTag к синхронизированному PRNG
tr: Eşitlenmiş PRNG üzerine sessionTag aktarımı
