Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: I2P hides the server from the user and the user from the server. All I2P traffic is internal to the I2P network. Traffic inside I2P does not interact with the Internet directly. It is a layer on top of the Internet. It uses encrypted unidirectional tunnels between you and your peers. No one can see where traffic is coming from, where it is going, or what the contents are. Additionally I2P offers resistance to pattern recognition and blocking by censors. Because the network relies on peers to route traffic, location blocking is also reduced.
fr: I2P cache ses serveurs de ses utilisateurs et l'utilisateur des serveurs. Toute la circulation I2P est interne au réseau I2P. La circulation à l'intérieur d'I2P n'interagit pas directement avec l'internet. C'est une couche au dessus d'internet. Il utilise des tunnels chiffrés non directionnels entre vous et vos pairs. Personne ne peux voir d'où la circulation arrive, où elle va et où le contenu se trouve. De plus, I2P offre de la résistance sur la reconnaissance de modèle et en bloquant la censure. Parce que le réseau se repose sur des paires pour acheminer le trafic, le blocage de localisation est aussi réduit.
ru: I2P скрывает сервер от пользователя и пользователя от сервера. Весь трафик I2P является внутренним для сети I2P. Трафик внутри I2P не взаимодействует с Интернетом напрямую. I2P представляет собой слой поверх Интернета. Он использует зашифрованные однонаправленные туннели между вами и вашими коллегами. Никто не может видеть, откуда идет трафик, куда он направляется и каково его содержимое. Кроме того, I2P обеспечивает устойчивость к распознаванию образов и блокировке цензорами. Поскольку сеть использует узлы для маршрутизации трафика, вероятность блокировки местоположения также минимальна.
tr: I2P, sunucuyu kullanıcıdan, kullanıcıyı da sunucudan gizler. Tüm I2P trafiği, I2P ağının içindedir. I2P içindeki trafik, İnternet ile doğrudan etkileşime girmez. İnternet üzerinde ayrı bir katmandır. Siz ve eşleriniz arasında şifrelenmiş tek yönlü tüneller kullanılır. Hiç kimse trafiğin nereden geldiğini, nereye gittiğini ya da içeriğinin ne olduğunu göremez. Ek olarak I2P, örüntü tanıma ve sansür uygulamalarına karşı koyar. Ağ, trafiği yöneltmek için eşler kullandığından, konuma göre engelleme etkisi de azaltılır.

source: How to Connect to the I2P Network
fr: Comment se connecter au réseau I2P
ru: Как подключиться к сети I2P
tr: I2P ağıyla nasıl bağlantı kurulur

source: The Invisible Internet Project provides software to download that connects you to the network. In addition to the network privacy benefits, I2P provides an application layer that allows people to use and create familiar apps for daily use. I2P provides its own unique DNS so that you can self host or mirror content on the network. You can create and own your own platform that you can add to the I2P directory or only invite your friends. The I2P network functions the same way the Internet does. When you download the I2P software, it includes everything you need to connect, share, and create privately.
fr: Le Projet Internet Invisible fournit un logiciel pour télécharger qui vous connecte au réseau. En plus des bénéfices de la protection des données personnelles du réseau, I2P fournit une couche d'application qui permet aux gens d'utiliser et créer des applis familières pour un usage quotidien. I2P fournit son propre DNS unique pour que vous puissiez héberger ou refléter vous-mêmes du contenu sur le réseau. Vous pouvez créer et posséder votre propre plateforme que vous pouvez ajouter au répertoire I2P ou seulement inviter vos amis. Le réseau I2P fonctionne de la même manière qu'internet. Quand vous téléchargez le logiciel I2P, il inclut tout ce dont vous avez besoin pour vous connecter, partager et créer en toute intimité.
ru: Проект Invicible Internet предоставляет для загрузки программное обеспечение, которое подключает вас к сети. В дополнение к преимуществам конфиденциальности сети, I2P обеспечивает уровень приложений, который позволяет людям использовать и создавать привычные приложения для повседневного использования. I2P предоставляет свой собственный уникальный DNS, чтобы вы могли самостоятельно размещать или зеркалить контент в сети. Вы можете создать свою собственную платформу, которую можно добавить в каталог I2P или пригласить только своих друзей. Сеть I2P функционирует так же, как и Интернет. Программное обеспечение I2P включает все необходимое для подключения, обмена и частного творчества.
tr: Invisible Internet Project, sizi ağa bağlamak için indirebileceğiniz bir yazılım sağlar. Ağ gizliliği avantajlarına ek olarak, I2P, insanların bildiği ve günlük olarak kullandığı uygulamaları kullanmasını ve oluşturmasını sağlayan bir uygulama katmanı sağlar. I2P, kendi benzersiz DNS sunucusunu sağlar. Böylece ağda kendi içeriğinizi ya da yansıları barındırabilirsiniz. I2P dizinine ekleyebileceğiniz ya da yalnızca arkadaşlarınızı çağırabileceğiniz kendi platformunuzu kurabilirsiniz. I2P ağı, İnternet gibi çalışır. İndireceğiniz I2P yazılımında, kişisel gizliliğinizi koruyarak bağlantı kurmak, paylaşmak ve bir şeyler oluşturmak için gerek duyacağınız her şey bulunur.

source: An Overview of the Network
fr: Un aperçu du réseau
ru: Общий обзор сети
tr: Ağa genel bakış

source: I2P uses cryptography to achieve a variety of properties for the tunnels it builds and the communications it transports. I2P tunnels use transports, NTCP2 and SSU, to hide the nature of the traffic being transported over it. Connections are encrypted from router-to-router, and from client-to-client(end-to-end). Forward-secrecy is provided for all connections. Because I2P is cryptographically addressed, I2P addresses are self-authenticating and only belong to the user who generated them.
fr: I2P utilise la cryptographie pour atteindre une variété de fonctions pour les tunnels qu'il construit et les communications qu'ils transporte, NTCP2 et SSU pour cacher la nature du trafic transporté dessus. Les connexions sont chiffrés de routeur à routeur et de client à client (bout en bout). Forward-secrecy est fournit pour toute les connexions. Vu que I2P est adressé de manière cryptographique, les adresses sont auto-identifiées et n'appartiennent qu'à l'utilisateur qui les a générer.
ru: I2P использует шифрование для формирования различных свойств создаваемых туннелей и передаваемых по ним сообщений. Туннели I2P используют транспорты NTCP2 и SSU, чтобы скрыть характер передаваемого по ним трафика. Соединения шифруются от маршрутизатора к маршрутизатору и от клиента к клиенту (из конца в конец). Для всех соединений обеспечивается секретность в прямом направлении. Поскольку I2P имеет криптографическую адресацию, адреса I2P самоаутентифицируются и принадлежат только пользователю, который их создал.
tr: I2P, oluşturduğu tüneller ve aktardığı iletişimler için çeşitli özellikler elde etmek amacıyla şifreleme kullanır. I2P tünelleri, üzerinden geçen trafiğin doğasını gizlemek için NTCP2 ve SSU taşıyıcılarını kullanır. Bağlantılar, yönelticiden yönelticiye ve istemciden istemciye (uçtan uca) şifrelenir. Tüm bağlantılar için ileri düzeyde gizlilik sağlanır. I2P şifrelenmiş olarak adreslendiğinden, I2P adresleri kendi kendini doğrular ve yalnızca onları oluşturan kullanıcıya aittir.

source: I2P is a secure and traffic protecting Internet-like layer. The network is made up of peers ("routers") and unidirectional inbound and outbound virtual tunnels. Routers communicate with each other using protocols built on existing transport mechanisms (TCP, UDP, etc), passing messages. Client applications have their own cryptographic identifier ("Destination") which enables it to send and receive messages. These clients can connect to any router and authorize the temporary allocation ("lease") of some tunnels that will be used for sending and receiving messages through the network. I2P has its own internal network database (using a modification of the Kademlia DHT) for distributing routing and contact information securely.
fr: I2P est une couche similaire à internet sécurisé et protégeant le trafic. Le réseau est construit de plusieurs pairs ("routeurs") et des tunnels virtuels à direction unidirectionnel entrante et sortante. Les routeurs communiquent entre eux en utilisant des protocoles construit sur des mécanismes de transport existants (TCP, UDP, etc...) passant des messages. Les applications clients ont leurs propres identifiant cryptographique ("Destination") qui leur permet d'envoyer et de recevoir des messages. Ces clients peuvent se connecter à n'importe quel routeur et autoriser l'allocation temporaire ("louer") de certains tunnels qui seront utilisés pour envoyer et recevoir des messages à travers le réseau. I2P a sa propre base de donnée réseau interne (utilisant une modification du DHT Kademlia) pour distribuer des informations de routage et de contact en toute sécurité.
ru: I2P — это безопасный и защищающий трафик уровень, напоминающий Интернет. Сеть состоит из узлов («маршрутизаторов») и однонаправленных входящих и исходящих виртуальных туннелей. Маршрутизаторы взаимодействуют друг с другом с помощью протоколов, построенных на существующих транспортных механизмах (TCP, UDP и т.д.), передавая сообщения. Клиентские приложения имеют свой собственный криптографический идентификатор (Destination), который позволяет им отправлять и получать сообщения. Эти клиенты могут подключиться к любому маршрутизатору и санкционировать временное выделение («аренду») некоторых туннелей, которые будут использоваться для отправки и получения сообщений через сеть. У I2P есть своя собственная внутренняя сетевая база данных (использующая модификацию Kademlia DHT) для безопасного распределения маршрутизации и контактной информации.
tr: I2P, İnternet benzeri bir katman olan güvenli ve trafiği koruyan bir katmandır. Ağ, eşler ("yönelticiler") ile tek yönlü geliş ve gidiş sanal tünellerinden oluşur. Yönelticiler, iletileri ileterek, var olan taşıyıcı yöntemleri (TCP, UDP, vb.) üzerine kurulmuş iletişim kurallarını kullanarak birbirleriyle iletişim kurarlar. İstemci uygulamalarının, ileti gönderip almasını sağlayan kendi şifreleme tanımlayıcıları ("hedef") vardır. Bu istemciler herhangi bir yönelticiye bağlanabilir ve ağ üzerinden ileti göndermek ve almak için kullanılacak bazı tünellerin geçici olarak tahsis edilmesine ("kiralama") yetki verebilir. I2P, yöneltme ve iletişim bilgilerini güvenli bir şekilde dağıtmak için kendi iç ağ veri tabanını (değiştirilmiş bir Kademlia "Dağıtılmış karma tablosu" (DHT)) kullanır.

source: About Decentralization and I2P
fr: À propos de I2P et la décentralisation
ru: О Децентрализации и I2P
tr: Merkezi olmayan yapı ve I2P hakkında

source: The I2P network is almost completely decentralized, with exception to what are called "Reseed Servers," which is how you first join the network. This is to deal with the DHT ( Distributed Hash Table ) bootstrap problem. Basically, there's not a good and reliable way to get out of running at least one permanent bootstrap node that non-network users can find to get started. Once you're connected to the network, you only discover peers by building "exploratory" tunnels, but to make your initial connection, you need to get a peer set from somewhere. The reseed servers, which you can see listed on http://127.0.0.1:7657/configreseed in the Java I2P router, provide you with those peers. You then connect to them with the I2P router until you find one who you can reach and build exploratory tunnels through. Reseed servers can tell that you bootstrapped from them, but nothing else about your traffic on the I2P network.
fr: Le réseau I2P est presque entièrement décentralisé à l'exception de ce que l'on appelle les "serveurs réensemencés" qui vous permettent de joindre le réseau pour la première fois. C'est pour gérer le problème d'amorçage du DHT (table de hachage distribuée). Essentiellement, il n'y a pas de moyen sûr de ne pas exécuter au moins un nœud d'amorçage que ceux qui n'utilisent pas le réseau peuvent trouver pour commencer. Une fois connecté au réseau, vous ne découvrirez les pairs qu'en construisant des tunnels "explorateurs", mais pour faire votre première connexion vous devrez avoir placé un pair de quelque part. Les serveurs réensemencés, qui sont listés sur http://127.0.0.1:7657/configreseed dans le routeur I2P Java vous fournira ces pairs. Vous vous connectez à eux ensuite avec le routeur I2P jusqu'à ce que vous en trouvez un que vous pouvez atteindre et construire des tunnels explorateurs à travers. Les serveurs réensemencés peuvent vous dire que vous avez amorcés par eux mais rien d'autre sur votre trafic dans le réseau I2P.
ru: Сеть I2P почти полностью децентрализована, за исключением так называемых Reseed-серверов, с помощью которых вы впервые присоединяетесь к сети. Это делается для того, чтобы решить проблему бутстрапа DHT (Distributed Hash Table). По сути, не существует хорошего и надежного способа обойтись без запуска хотя бы одного постоянного загрузочного узла, который могут найти пользователи, не входящие в сеть, чтобы начать работу. После подключения к сети вы можете обнаружить узлы только с помощью поисковых туннелей, но чтобы установить начальное соединение, вам нужно обзавестись набором узлов. Серверы reseed, список которых вы можете увидеть на сайте http://127.0.0.1:7657/configreseed в маршрутизаторе Java I2P, предоставляют вам эти узлы. Затем вы подключаетесь к узлам с помощью маршрутизатора I2P, пока не найдете узел, к которому сможете подключиться и построить поисковые туннели. Серверы Reseed могут подтвердить, что вы загрузились с них, но не смогут предоставить никакой другой информации о вашем трафике в сети I2P.
tr: I2P ağı, ağa ilk katılma şekliniz olan "Yeniden Tohumlama Sunucuları" olarak adlandırılanlar dışında, neredeyse tümüyle merkezi olmayan yapıdadır. Böylece, "Dağıtılmış karma tablosu" (DHT) ön yükleme sorunuyla başa çıkılmış olur. Temel olarak, ağ dışı kullanıcıların başlamak için bulabileceği en az bir tane kalıcı ön yükleme düğümü işletmekten kurtulmanın iyi ve güvenilir bir yolu yoktur. Ağ ile bağlantı kurduğunuzda, yalnızca "keşif" tünelleri oluşturarak eşleri keşfedersiniz, ancak ilk bağlantınızı yapmak için bir yerden bir eş kümesi almanız gerekir. Java I2P yönelticisinde http://127.0.0.1:7657/configreseed adresinde listesini görebileceğiniz yeniden tohumlama sunucular size bu eşleri sağlar. Daha sonra, ulaşabileceğiniz ve içinden keşif tünelleri oluşturabileceğiniz birini bulana kadar I2P yöneltici ile onlara bağlanın. Yeniden tohumlama sunucuları, onlardan ön yükleme yaptığınız bilgisini verebilir, ancak bunun dışında I2P ağındaki trafiğiniz hakkında herhangi bir şey söylemez.

source: I see IP addresses of all other I2P nodes in the router console. Does that mean my IP address is visible by others?
fr: Dans la console du routeur, je vois les adresses IP de tous les autres nœuds d’I2P. Cela signifie-t-il que les autres peuvent voir mon adresse IP ?
ru: Я вижу IP-адреса всех других узлов I2P в консоли маршрутизатора. Означает ли это, что мой IP-адрес виден другим?
tr: Yöneltici panosunda tüm diğer I2P düğümlerinin IP adreslerini görebiliyorum. Bu durum benim IP adresimin de diğerleri tarafından görülebildiği anlamına mı geliyor?

source: Yes, this is how a fully distributed peer-to-peer network works. Every node participates in routing packets for others, so your IP address must be known to establish connections. While the fact that your computer runs I2P is public, nobody can see your activities in it. You can't say if a user behind this IP address is sharing files, hosting a website, doing research or just running a node to contribute bandwidth to the project.
fr: Oui, voilà comment un réseau entièrement distribué en pair-à-pair fonctionne. Chaque nœud participe en routant des paquets pour d'autres personnes, donc votre adresse IP doit être connue pour établir des connexions. Même si il est connu que votre ordinateur exécute I2P, personne ne peut voir votre activité dessus. Vous ne pouvez pas savoir que l'utilisateur derrière l'adresse IP partage des fichiers, héberge un site web, fait des recherches ou exécute simplement un nœud pour contribuer à la bande passante du projet.
ru: Да, именно так работает полностью распределенная одноранговая сеть. Каждый узел участвует в маршрутизации пакетов для других узлов, поэтому для установления соединений ваш IP-адрес должен быть известен. Хотя информация о том, что на вашем компьютере работает I2P, является общедоступной, никто не может отслеживать ваши действия в нем. Вы не сможете выяснить, обменивается ли пользователь с этим IP-адресом файлами, предоставляет хостинг для веб-сайта, занимается поиском или просто запускает узел, чтобы внести свой вклад в пропускную способность проекта.
tr: Evet, tam olarak dağıtılmış bir eşler arası ağ bu şekilde çalışır. Her düğüm, diğerleri için yöneltme paketlerine katılır. Bu nedenle bağlantı kurmak için IP adresinizin bilinmesi gerekir. Bilgisayarınızın I2P çalıştırdığı gerçeği herkese açık olsa da, I2P ağındaki etkinliklerinizi kimse göremez. Bu IP adresinin arkasındaki bir kullanıcının, dosya paylaşıp paylaşmadığı, bir site barındırdığı, araştırma yaptığı veya yalnızca projeye bant genişliği sağlamak için bir düğüm çalıştırdığı gibi şeyler söylenemez.

source: What I2P Does Not Do
fr: Qu'est ce que I2P ne fait pas
ru: Что I2P не делает
tr: I2P ne yapar

source: The I2P network does not officially "Exit" traffic. It has outproxies to the Internet run by volunteers, which are centralized services. I2P is primarily a hidden service network and outproxying is not an official function, nor is it advised. The privacy benefits you get from participating in the the I2P network come from remaining in the network and not accessing the internet. I2P recommends that you use Tor Browser or a trusted VPN when you want to browse the Internet privately.
fr: Le réseau I2P ne "quitte" pas officiellement le trafic. Il a des mandataires sortants à l'internet entretenus par des bénévoles qui sont des services décentralisés. I2P est principalement un service réseau caché et utiliser un mandataire sortant n'est ni une fonction officielle, ni recommandé. L'intimité qui vous permet de participer au réseau I2P s'applique seulement si vous restez dans le réseau et n'accédez pas à Internet. I2P vous recommande que vous utilisiez le navigateur Tor ou un RPV de confiance si vous voulez naviguez internet en toute intimité.
ru: Сеть I2P не занимается официальным «Выходом» трафика. У нее есть аутпрокси в Интернет, управляемые волонтерами и являющиеся централизованными службами. I2P — это в первую очередь сеть скрытых услуг, и аутпроксирование не является официальной функцией сервиса и не рекомендуется к использованию. Преимущества конфиденциальности, которые вы получаете от участия в сети I2P, связаны с тем, что вы остаетесь в сети и не выходите в Интернет. I2P рекомендует использовать Tor Browser или надежную VPN, когда вы хотите использовать Интернет в частном порядке.
tr: I2P ağı resmi olarak trafik için bir "Çıkış" sağlamaz. Merkezi hizmetler olarak, gönüllüler tarafından işletilen İnternet çıkış vekil sunucuları bulunur. I2P öncelikle bir gizli hizmet ağıdır. Çıkış vekil sunucuları resmi olarak desteklenen bir özellik değildir ve kullanılması önerilmez. I2P ağına katılmakla elde ettiğiniz gizlilik avantajları, ağda kalmaktan ve İnternete erişmemekten gelir. I2P. Özellikle İnternet üzerinde gezinmek istediğinizde Tor Browser ya da güvenilir bir VPN kullanmanız önerilir.

source: Comparisons
fr: Comparaisons
ru: Сравнения
tr: Karşılaştırmalar

source: There are a great many other applications and projects working on anonymous communication and I2P has been inspired by much of their efforts. This is not a comprehensive list of anonymity resources - both freehaven's <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> and GNUnet's <a href="https://www.gnunet.org/links/">related projects</a> serve that purpose well. That said, a few systems stand out for further comparison. The following have individual comparison pages:
fr: Il existe un grand nombre d’autres applications et de projets travaillant sur les communications anonymes et I2P s’en est largement inspiré. Cette liste est loin d’être exhaustive concernant le thème de l’anonymat (<a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> de Freehaven et les <a href="https://www.gnunet.org/links/">projets liés</a> à GNUnet servent à celà). Néanmoins, certains systèmes se prêtent bien à la comparaison. Les suivants disposent d’ailleurs d’une page dédiée :
ru: Существует много других хороших приложений и проектов в области анонимных коммуникаций, и I2P определенно обогащается их опытом. Это неполный список подобных ресурсов - у freehaven'а в <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> и в GNUnet <a href="https://www.gnunet.org/links/">проектах</a> эти списки полнее. Всего несколько систем имеет смысл сравнивать далее. Ниже перечислены страницы, посвященные сравнениям с этими системами:
tr: Anonim iletişim üzerinde çalışan birçok başka uygulama ve proje var ve I2P bu uygulamaların çoğuna harcanan çabalardan ilham aldı. Bu liste, kapsamlı olarak anonimlik kaynaklarını içermez. Bu amaç için freehaven <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> ve <a href="https://www.gnunet.org/links/">ilgili GNUnet projeleri</a> kullanılabilir. Bununla birlikte, daha fazla karşılaştırma için birkaç sistem öne çıkar. Aşağıdakilerin ayrı karşılaştırma sayfaları vardır:

source: The following are discussed on the <a href="%(othernetworks)s">other networks page:</a>
fr: Ceux qui suivent sont discuté sur la page <a href="%(othernetworks)s">autres réseaux</a>
ru: Обсуждается на <a href="%(othernetworks)s">странице других сетей:</a>
tr: <a href="%(othernetworks)s">Diğer ağlar sayfasında</a> aşağıdaki konular tartışılıyor:

source: Presentations on I2P
fr: Présentations sur I2P
ru: Презентации в I2P
tr: I2P sunumları

source: Following are links to presentations, videos, and tutorials about I2P. Links to research papers on I2P are available <a href="%(papers)s">here</a>.
fr: Voici des liens vers des présentations, des vidéos et des tutoriels sur I2P. Des liens vers des documents de recherche sur I2P sont proposés <a href="%(papers)s">ici</a>.
ru: Ниже приведены ссылки на презентации, видео и руководства по I2P. Ссылки на исследовательские работы по I2P доступны <a href="%(papers)s">здесь</a>.
tr: Aşağıda I2P ile ilgili sunum, görüntü ve eğitimleri bulabilirsiniz. Araştırma belgelerine <a href="%(papers)s">buraya tıklayarak</a> bakabilirsiniz.

source: To request an addition to this page, please send to %(email)s.
fr: Pour demander un ajout à cette page, veuillez l’envoyer à %(email)s.
ru: Материалы для добавления на эту страницу отправляйте на %(email)s.
tr: Bu sayfaya ek yapılmasını istiyorsanız bize %(email)s gönderin.

source: Newest links are at the bottom of each section.
fr: Les liens les plus récents se trouvent au bas de chaque section.
ru: Свежие ссылки в начале каждого раздела.
tr: En yeni bağlantılar her bölümün altında bulunur.

source: Presentations
fr: Présentations
ru: Презентации
tr: Sunumlar

source: IIP Presentation at CodeCon <a href="%(mp3)s">MP3 audio</a> <a href="%(transcript)s">transcript</a> Lance James (0x90), February 2002.
fr: Présentation IIP à Codecon <a href="%(mp3)s">audio MP3</a> <a href="%(transcript)s">transcription</a> Lance James (0x90), février 2002.
ru: Презентация IIP на конференции CodeCon <a href="%(mp3)s">MP3 audio</a> <a href="%(transcript)s">стенограмма</a> Lance James (0x90), февраль 2002.
tr: CodeCon IIP Sunumu <a href="%(mp3)s">MP3 ses kaydı</a> <a href="%(transcript)s">metin</a> Lance James (0x90), Şubat 2002.
