Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: As I've <a href="%(link)s">said</a>, having I2PTunnel (and the ministreaming lib) go this route was the best thing that could be done, but more efficient mechanisms are available. When we rip out the "mode=GUARANTEED" functionality, we're essentially leaving ourselves with an I2CP that looks like an anonymous IP layer, and as such, we'll be able to implement the streaming library to take advantage of the design experiences of the TCP layer - selective ACKs, congestion detection, nagle, etc.
fr: Comme je l’ai <a href="%(link)s">dit</a>, faire qu’I2PTunnel (et la bibliothèque ministreaming) suivent cette route était la meilleure chose à faire, mais des mécanismes plus efficaces existent. Quand nous ôtons la fonction « Mode=GUARANTEED », nous nous trouvons essentiellement avec un I2CP qui ressemble à une couche IP anonyme, et il nous sera ainsi possible de mettre en œuvre la bibliothèque de diffusion afin de profiter des expériences de conception de la couche TCP : ACK sélectifs, détection de la congestion, nagle, etc.
ru: Как я уже <a href="%(link)s">сказал</a>, наличие I2PTunnel (и библиотеки мини-потоков) было наилучшим путем из всех возможных, но уже доступны и более эффективные механизмы. Когда мы выпиливаем функциональность "mode=GUARANTEED", мы в сущности оставляем себе I2CP, который выглядит как анонимный уровень IP, и, т.о., мы сможем реализовать в потоковой библиотеке преимущества архитектурного опыта слоя TCP - селективные ACK, обнаружение коллизий, nagle и т.д.
tr: <a href="%(link)s">Dediğim</a> gibi, I2PTunnel (ve ministreaming kitaplığı) için bu yolun seçilmesi yapılabilecek en iyi şeydi. Ancak daha verimli yöntemler var. "Mode=GUARANTEED" işlevini kaldırdığımızda, aslında elimizde anonim bir IP katmanına benzeyen bir I2CP kalıyor. Bu nedenle, TCP katmanının tasarım deneyimlerinden - seçici ACK, tıkanıklık algılama, nagle vb. - yararlanmak için akış kitaplığını ekleyebileceğiz.

source: Performance
ru: Производительность
tr: Başarım

source: How does I2P work, why is it slow, and why does it not use my full bandwidth?
fr: Comment est-ce que I2P fonctionne, pourquoi est-il lent, et pourquoi n’utilise-t-il pas complètement ma bande passante ?
ru: Как работает I2P, почему она медленная, и почему она не использует мой канал полностью?
tr: I2P nasıl çalışır, neden yavaştır ve neden tüm bant genişliğimi kullanmıyor?

source: Probably one of the most frequent things people ask is "how fast is I2P?", and no one seems to like the answer - "it depends". After trying out I2P, the next thing they ask is "will it get faster?", and the answer to that is a most emphatic <b>yes</b>.
fr: Probablement qu’une de choses la plus fréquemment demandée par les gens est "à quelle vitesse est I2P ?", et aucun ne semble aimer la réponse - "cela dépend". Après avoir essayé I2P, la chose suivante qu’ils demandent est "deviendra-t-il plus rapide ?", et la réponse à cela est plus emphatique <b>oui</b>.
ru: Вероятно, один и самых часто задаваемых вопросов это "насколько быстра I2P?", и, похоже, никому не нравится ответ - "это зависит". После опробования I2P следующим вопросом становится "а быстрее будет?", и ответом на это служит самое решительное <b>да</b>.
tr: Büyük olasılıkla insanların en sık sorduğu şeylerden biri "I2P ne kadar hızlı?" olur. Hiç kimse "duruma göre değişir" yanıtını beğenmiyor gibi görünüyor. I2P uygulamasını denedikten sonra sorulan soru, "daha hızlı olacak mı?" olur ve bunun yanıtı çok kesin bir <b>evet</b>.

source: I2P is a full dynamic network. Each client is known to other nodes and tests local known nodes for reachability and capacity. Only reachable and capable nodes are saved to a local NetDB (This is generally only a portion of the network, around 500-1000). When I2P builds tunnels, it selects the best resource from this pool. For example, a small subset of 20-50 nodes are only available to build tunnels with. Because testing happens every minute, the pool of used nodes changes every minute. Each I2P node knows a different part of the net, meaning that each router has a different set of I2P nodes to be used for tunnels. Even if two routers have the same subset of known nodes, the tests for reachability and capacity will likely show different results, as the other routers could be under load just as one router tests, but be free if the second router tests.
fr: I2P est un réseau complètement dynamique. Chaque client est connu par les autres nœuds et teste l’accessibilité et la capacité des nœuds locaux connus. Seuls les nœuds accessibles et aptes sont enregistrés dans une base de données NetDB locale (généralement une portion du réseau seulement, environ 500 à 1 000). Quand I2P construit des tunnels, la meilleure ressource est sélectionnée de cette réserve. Par exemple, un petit sous-ensemble de 20 à 50 nœuds n’est disponible que pour construire des tunnels. Avec des tests toutes les minutes, la réserve de nœuds utilisés change toutes les minutes. Chaque nœud d’I2P connaît une partie différente du réseau, ce qui signifie que chaque routeur connaît un ensemble différent de nœuds d’I2P pouvant être utilisés pour les tunnels. Même si deux routeurs possédaient le même sous-ensemble de nœuds connus, les tests d’accessibilité et de capacité donneraient probablement des résultats différents, car les autres routeurs pourraient subir une charge lors du test d’un routeur, mais être libres lors du test du deuxième routeur.
ru: I2P - это полностью динамическая сеть. Каждый клиент известен другим узлам, и проверяет локальные известные узлы на доступность и производительность. Только доступные и производительные узлы добавляются в локальную NetDB (В основном это только часть сети, около 500-1000). Когда I2P строит туннели, она выбирает лучший ресурс из этого пула. Например, только маленький набор из 20-50 узлов доступен для постройки туннелей к ним. Из-за того, что проверки выполняются каждую минуту, пул используемых узлов изменяется каждую минуту. Каждым узлам I2P известны различные части сети, т.о., каждый маршрутизатор имеет свой набор узлов I2P для туннелей. Даже если два маршрутизатора имеют одинаковый набор известных узлов, проверка на доступность и производительность покажет, скорее всего, различные результаты, т.к. другие маршрутизаторы могут быть под нагрузкой во время проверок первого маршрутизатора, но свободными во время проверок второго.
tr: I2P tam dinamik bir ağdır. Her istemci diğer düğümler tarafından bilinir ve yerel olarak bildiği düğümleri erişilebilirlik ve kapasite açısından sınar. Yalnızca erişilebilir ve yetenekli düğümler yerel "Ağ veri tabanı" (NetDB) üzerine kaydedilir (bu da genellikle yaklaşık 500-1000 olan ağın yalnızca bir kısmıdır). I2P tüneller oluşturduğunda bu havuzdan en iyi kaynağı seçer. Örneğin, 20-50 düğümden oluşan küçük bir alt küme, yalnızca tüneller oluşturmak için kullanılabilir. Sınama her dakika yapıldığından, kullanılan düğüm havuzu her dakika değişir. Her I2P düğümü, ağın farklı bir bölümünü bilir. Bu durum, her yönelticinin tüneller için kullanılacak farklı bir I2P düğümü kümesinin olduğu anlamına gelir. İki yöneltici aynı bilinen düğüm alt kümesine sahip olsa bile, erişilebilirlik ve kapasite sınamaları büyük olasılıkla farklı sonuçlar gösterecektir. Diğer yönelticiler yalnızca bir yöneltici sınaması gibi yük altında olabilir. Ancak ikinci yöneltici sınarsa ücretsiz olabilir.

source: The above describes why each I2P node has different nodes to build tunnels. Because every I2P node has a different latency and bandwith, tunnels (which are built via those nodes) have different latency and bandwidth values. And because every I2P node has different tunnels built, no two I2P nodes have the same tunnel sets.
fr: Le texte ci-dessus décrit pourquoi chaque noeud I2P a des noeuds différents pour construire des tunnels. Parce que chaque noeud I2P a une latence différente et une largeur de bande passante, des tunnels (qui sont construits via ces noeuds) ont une latence différente et des valeurs différentes de bande passante. Et parce que chaque noeud I2P a différents tunnels construits, aucun de deux noeud I2P n’a les mêmes ensembles de tunnels.
ru: Описанное выше объясняет, почему каждый узел I2P имеет отличный от других набор узлов для постройки туннелей. Из-за того, что каждый узел I2P имеет свои задержки и полосу пропускания, туннели (которые строятся через эти узлы) имеют различные значения задержки и ширины канала. И из-за того, что каждый узел I2P строит свои туннели, нет ни одной пары узлов I2P с одинаковым набором туннелей.
tr: Yukarıdakiler, her I2P düğümünün neden tünel oluşturmak için farklı düğümlere sahip olduğunu açıklamaktadır. Her I2P düğümünün farklı bir gecikme süresi ve bant genişliği olduğundan, tüneller (bu düğümler aracılığıyla oluşturulan) farklı gecikme ve bant genişliği değerlerine sahiptir. Ayrıca her I2P düğümünün oluşturulmuş farklı tünelleri bulunduğundan, hiçbir iki I2P düğümünde aynı tünel kümeleri bulunmaz.

source: A server/client is known as a "destination" and each destination has at least one inbound and one outbound tunnel. The default is 3 hops per tunnel. This adds up to 12 hops (aka 12 different I2P nodes) for a full roundtrip client-server-client.
fr: Un serveur ou client est connu comme une « destination » et chaque destination a au moins un tunnel entrant et un tunnel sortant. Il y a par défaut 3 sauts par tunnel. Cela s’élève à 12 sauts (c.-à-d. 12 nœuds I2P différents) pour un aller-retour complet client-serveur-client.
ru: Сервер/клиент известны как "пункт назначения", и у каждого пункта назначения есть по крайней мере один входящий и один исходящий туннель. По умолчанию на туннель приходится 3 участка. Это добавляет до 12 участков (aka 12 различных узлов I2P) в полный путь клиент-сервер-клиент.
tr: Bir sunucu/istemci "hedef" olarak bilinir ve her hedefin en az bir geliş ve bir gidiş tüneli vardır. Varsayılan değer, her tünel için 3 atlamadır. Böylece, tam bir istemci-sunucu-istemci gidiş dönüşü için 12 taneye kadar atlama (12 farklı I2P düğümü) eklenir.

source: Each data package is sent through 6 other I2P nodes until it reaches the server:
fr: Chaque paquet de données est envoyé par 6 autres noeuds I2P jusqu’à ce qu’il atteigne le serveur :
ru: Каждый пакет данных отправляет через 6 других узлов I2P до того как он достигнет сервера:
tr: Her veri paketi, sunucuya ulaşana kadar 6 diğer I2P düğümü aracılığıyla gönderilir:

source: and on way back 6 different I2P nodes:
fr: et au retour 6 noeuds I2P différents :
ru: и на пути обратно 6 различных узлов I2P:
tr: ve dönüş yolunda 6 farklı I2P düğümü kullanılır:

source: As most traffic on I2P (www, torrent,...) needs ack packages until new data is sent, it needs to wait until a ack package returns from the server. In the end: send data, wait for ack, send more data, wait for ack,.. As the RTT (RoundTripTime) adds up from the latency of each individual I2P node and each connection on this roundtrip, it takes usually 1-3 seconds until a ack package comes back to the client. With some internals of TCP and I2P transport, a data package has a limited size and cannot be as large as we want it to be. Together these conditions set a limit of max bandwidth per tunnel of 20-50 kbyte/sec. But if ONLY ONE hop in the tunnel has only 5 kb/sec bandwidth to spend, the whole tunnel is limited to 5 kb/sec, independent of the latency and other limitations.
fr: Comme la plupart du trafic sur I2P (www, torrent, etc.) a besoin de paquets ack jusqu’à ce que de nouvelles données soient envoyées, il doit attendre jusqu’à ce qu’un paquet ack revienne du serveur. Donc : envoyer des données, attendre ack, envoyer plus de données, attendre ack, etc. Comme le RTT (temps aller-retour) s’ajoute à la latence de chaque nœud I2P individuel et à chaque connexion pendant cet aller-retour, un paquet ack revient habituellement vers le client en 1 à 3 secondes. En raison de contrainte du transport TCP et I2P, un paquet de données a une taille limitée et ne peut pas être aussi grand que nous le souhaitons. Ensemble, ces conditions définissent une limite de bande passante maximale de 20 à 50 Ko/s par tunnel. Mais si SEULEMENT UN saut dans le tunnel n’a qu’une bande passante de 5 Ko/s à pouvoir, le tunnel entier est limité à 5 Ko/s, indépendamment de la latence et autres restrictions.
ru: В большинстве случаев трафик в I2P (www, torrent, ...) нуждается в пакете ack до отправки данных, необходимо дождаться пока пакет ack вернется с сервера. В конце: отправка данных, дождаться ack, отправить еще данных, дождаться ack, ... Т.к. RTT (RoundTripTime) складывается из задержек на каждом конкретном узле I2P и каждом соединении на этом пути, то обычно время получения пакета ack обратно на клиенте составляет 1-3 секунды. С некоторыми добавками транспортов TCP и I2P пакет данных имеет ограничение на размер и он не может быть таким большим, как мы того хотим. Вместе эти условия накладывают ограничение на максимальную пропускную способность на туннель - 20-50 Кбайт/с. Но если ТОЛЬКО у ОДНОГО участка туннеля есть 5 свободных кб/с, весь туннель будет ограничен до 5 кб/с, независимо от задержек и других ограничений.
tr: I2P üzerindeki çoğu trafik (www, torrent,...) yeni veriler göndermeden önce onay paketlerine gerek duyar ve sunucudan bir onay paketi dönene kadar beklemesi gerekir. Sonunda: Veri gönder, onay bekle, daha fazla veri gönder, onay bekle, .. RTT (gidiş dönüş süresi), bu gidiş dönüşteki her bir bireysel I2P düğümünün ve her bağlantının gecikme süresine eklendiğinden, istemciye bir onay paketinin geri gelmesi genellikle 1-3 saniye sürer. Bazı iç TCP ve I2P taşıyıcılarında, bir veri paketinin boyutu sınırlıdır ve olmasını istediğimiz kadar büyük olamaz. Bu koşullar dikkate alındığında, tünel başına en fazla bant genişliği 20-50 kbyte/sn arasında olur. Ancak tüneldeki YALNIZ BİR atlamanın harcayacak yalnızca 5 kb/sn bant genişliği varsa, gecikme ve diğer sınırlamalardan bağımsız olarak tüm tünel 5 kb/sn ile sınırlanır.

source: Due to encryption used and other setups in I2P (howto built up tunnels, latency, ...) it is quite expensive in CPU time to build a tunnel. This is why a destination is only allowed to have a max of 6 IN and 6 OUT tunnels to transport data. With a max of 50 kb/sec per tunnel, a destination could use roughly 300 kb/sec traffic combined ( in reality it could be more if shorter tunnels are used with low or no anonymity available). Used tunnels are discarded every 10 minutes and new ones are built up. This change of tunnels (and sometimes clients that shutdown hard due to usage of "shut down at once" or situations where there is power loss) does sometimes break tunnels and connections, as seen on the IRC2P Network in loss of connection (ping timeout) or on when using eepget.
fr: En raison du chiffrement utilisé et d’autres configurations dans I2P (comment construire des tunnels, la latence…) la construction d’un tunnel est gourmande en temps UCT. C’est pourquoi une destination n’est autorisée à avoir qu’un maximum de 6 tunnels entrants et 6 sortants pour transporter les données. Avec un maximum de 50 ko/s par tunnel, une destination pourrait utiliser à peu près 300 ko/s de trafic combiné (en réalité peut-être plus si des tunnels plus courts sont utilisés avec un anonymat disponible faible ou nul). Les tunnels utilisés sont éliminés toutes les 10 minutes et d’autres sont construits. Ce changement de tunnels (et parfois des clients qui se ferment à froid, car ils utilisent la « fermeture immédiate » ou des situations de panne de courant) met parfois fin aux tunnels et aux connexions, comme observé sur le réseau IRC2P en perte de connexion (dépassement du temps de ping) ou lors de l’utilisation d’eepget.
ru: Из-за использования шифрования и других надстроек I2P (как то - построение туннелей, задержки...) построение туннеля является достаточно дорогим для времени CPU. Вот почему пункту назначения разрешено иметь максимум 6 входящих и 6 исходящих туннелей для передачи данных. С максимальной скоростью 50 кб/с на туннель пункт назначения может использовать приблизительно 300 кб/с комбинированного трафика (в действительности, может быть больше, если используются более короткие туннели с меньшей или отсутствующей анонимностью). Используемые туннели сбрасываются каждые 10 минут и строятся новые. Эти изменения туннелей (и иногда клиенты выполняют жесткое выключение при использовании "shut down at once" или в ситуации с выключением питания) иногда разрушают туннели и соединения, как это можно увидеть в сети IRC2P при потере соединения (ping timeout) или при использовании eepget.
tr: I2P üzerinde kullanılan şifreleme ve diğer kurulumlar (tünellerin nasıl oluşturulacağı, gecikme, ...) nedeniyle bir tünel oluşturmak işlemci zamanı açısından oldukça pahalıdır. Bu nedenle bir hedefin veri taşımak için yalnızca en fazla 6 GİRİŞ ve 6 ÇIKIŞ tüneline sahip olmasına izin verilir. Tünel başına en fazla 50 kb/sn ile bir hedef, toplamda yaklaşık 300 kb/sn trafik kullanabilir (gerçekte, düşük ya da hiç olmayan anonimlik ile daha kısa tüneller kullanılıyorsa bu daha fazla olabilir). Her 10 dakikada bir kullanılmış tüneller atılır ve yenileri oluşturulur. Tünellerdeki bu değişiklik (ve bazen "toplu kapanma" kullanımı veya güç kaybının olduğu durumlar nedeniyle ani kapanan istemciler) bazen IRC2P ağında görüldüğü gibi bağlantı kaybında (ping zaman aşımı) veya eepget kullanırken olduğu gibi tünelleri ve bağlantıları keser.

source: With a limited set of destinations and a limited set of tunnels per destination, one I2P node only uses a limited set of tunnels across other I2P nodes. For example, if an I2P node is "hop1" in the small example above, we only see 1 participating tunnel originating from the client. If we sum up the whole I2P network, only a rather limited number of participating tunnels could be built with a limited amount of bandwidth all together. If one distributes these limited numbers across the number of I2P nodes, there is only a fraction of available bandwidth/capacity available for use.
fr: Avec un ensemble limité de destinations et un ensemble limité de tunnels par destination, un noeud I2P utilise seulement un ensemble limité de tunnels à travers d’autres noeuds I2P. Par exemple, si un noeud I2P est "hop1" dans le petit exemple ci-dessus, nous voyons seulement 1 tunnel participant provenant du client. Si nous résumons le réseau I2P entier, seul un nombre plutôt limité de tunnels participants pourrait être construit avec une quantité limitée de bande passante tous ensemble. Si on distribue ces nombres limités à travers le numéro de noeuds I2P, il y a seulement une fraction de bande passante/capacité disponible disponible pour utilisation.
ru: При ограниченном наборе пунктов назначения и туннелей для пункта назначения один узел I2P использует только ограниченный набор туннелей с другими узлами I2P. Например, если узел I2P это "hop1" и маленьком примере выше, то мы видим только 1 участвующий туннель, порожденный клиентом. Если мы сложим всю сеть I2P, то сможем построить только ограниченное число участвующих туннелей с ограниченной пропускной способностью. Если кто-то предоставит это ограниченное число туннелей набору узлов I2P, то только часть пропускной способности/мощности будет доступна для использования.
tr: Sınırlı bir hedef kümesi ve hedef başına sınırlı bir tünel kümesiyle, bir I2P düğümü, diğer I2P düğümlerinde yalnızca sınırlı sayıda tünel kullanır. Örneğin, yukarıdaki küçük örnekte bir I2P düğümü "hop1" ise, istemciden kaynaklanan yalnız 1 katılımcı tünel görürüz. Tüm I2P ağını özetlersek, hep birlikte sınırlı miktarda bant genişliği ile yalnızca oldukça sınırlı sayıda katılımcı tünel oluşturulabilir. Bu sınırlı sayılar, I2P düğümlerinin sayılarına dağıtılırsa, kullanılabilir bant genişliğinin/kapasitenin yalnızca bir kısmı kullanılabilir.

source: To remain anonymous one router should not be used by the whole network for building tunnels. If one router does act as a tunnel router for ALL I2P nodes, it becomes a very real central point of failure as well as a central point to grab IPs and data from the clients. This is not good. I2P attempts to spread the load across a lot of I2P nodes because of this reason.
fr: Pour rester anonyme, un routeur ne devrait pas être utilisé par l’ensemble du réseau pour la construction de tunnels. Si un routeur agit comme routeur de tunnels pour tous les nœuds d’I2P, il devient un véritable point central de défaillance, ainsi qu’un point central pour récolter des adresses IP et des données des clients. Ce n’est pas souhaitable. I2P tente de répartir la charge sur un grand nombre de nœuds d’I2P pour cette raison.
ru: Чтобы остаться анонимным, один маршрутизатор не должен быть использован всей сетью для построения туннелей. Если один маршрутизатор выступает в качестве туннельного маршрутизатора для ВСЕХ узлов I2P, то он становится как узким местом, так и центром сбора адресов IP и данных от клиентов. Это не есть хорошо. По этой причине I2P пытается распределить нагрузку на большое число узлов I2P.
tr: Anonim kalmak için, bir yöneltici tüm ağ tarafından tünel oluşturmak için kullanılmamalıdır. Bir yöneltici TÜM I2P düğümleri için bir tünel yönelticisi işlevi görürse, çok gerçek bir merkezi başarısızlık noktası ve aynı zamanda istemcilerden IP adreslerini ve verileri almak için merkezi bir nokta haline gelir. Bu iyi olmaz. Bu nedenle I2P yükü birçok I2P düğümüne yaymaya çalışır.

source: Another point is the full mesh network. Each connection hop-hop utilizes one TCP or UDP connection on the I2P nodes. With 1000 connections, one sees 1000 TCP connections. That is quite a lot and some home and small office routers (DSL, cable,..) only allow a small number of connections (or just go mad if you use more than X connections). I2P tries to limit these connections to be under 1500 per UDP and per TCP type. This limits the amount of traffic routed across your I2P node as well.
fr: Un autre point est le réseau complètement maillé. Chaque connexion saut-à-saut utilise une connexion TCP ou UDP sur les nœuds I2P. Avec 1000 connexions, on voit 1000 connexions TCP. C’est beaucoup et certains routeurs (DSL, câble, …) domestique ou de petit bureau permettent seulement un petit nombre de connexions (ou deviennent simplement fous si vous utilisez plus de X connexions.) I2P essaie de limiter le nombre de ces connexions pour être en dessous de 1500 par UDP et par type TCP. Ce qui limite la quantité de trafic acheminé à travers votre nœud I2P aussi.
ru: Другая цель — это полносвязная сеть. Каждое соединение hop-hop использует одно соединение TCP или UDP между узлами I2P. При 1000 соединений видны 1000 соединений TCP. Это довольно много, и какой-нибудь домашний или маленький офисный маршрутизатор (DSL, проводной, ...) допускает только маленькое количество соединений (или даже сойдёт с ума при использовании более чем X соединений). I2P старается ограничить эти соединения до 1500 для UDP или TCP. Также это ограничивает объём трафика через ваш узел I2P.
tr: Diğer bir nokta ise tam ağ kapsamasıdır. Her bağlantıdaki atlama-atlama, I2P düğümlerinde bir TCP veya UDP bağlantısı kullanır. 1000 bağlantı ile bir kişi 1000 TCP bağlantısı görür. Bu oldukça fazladır ve bazı ev ve küçük ofis yönlendiricileri (DSL, kablo, ..) yalnızca az sayıda bağlantıya izin verir (veya fazla bağlantı kullanırsanız çıldırır). I2P, bu bağlantıları UDP ve TCP türü başına 1500 altında olacak şekilde sınırlamaya çalışır. Bu durum, I2P düğümünüz üzerinden yöneltilen trafik miktarını da sınırlar.
