Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: IIP Presentation at ToorCon <a href="%(mp3)s">MP3 audio</a> <a href="%(slides)s">slides</a> Lance James (0x90), September 2002.
fr: Présentation IIP à ToorCon <a href="%(mp3)s">audio MP3</a> <a href="%(slides)s">diaporama</a> Lance James (0x90), septembre 2002.
ru: Презентация IIP на конференции ToorCon <a href="%(mp3)s">MP3 audio</a> <a href="%(slides)s">слайды</a> Lance James (0x90), сентябрь 2002.
tr: ToorCon IIP Sunumu <a href="%(mp3)s">MP3 ses kaydı</a> <a href="%(slides)s">sunum</a> Lance James (0x90), Eylül 2002.

source: <a href="%(video)s">To Be or I2P</a> (Youtube Video) An introduction into anonymous communication with I2P. <a href="%(pdf)s">To Be or I2P (PDF presentation)</a>, Jens Kubieziel, 24C3 Berlin, December 28, 2007.
fr: <a href="%(video)s">To Be or I2P</a> (vidéo Youtube) Une introduction à la communication anonyme avec I2P. <a href="%(pdf)s">To Be or I2P (présentation PDF)</a>, Jens Kubieziel, 24C3 Berlin, le 28 décembre 2007.
ru: <a href="%(video)s">Быть или I2P</a> (видео на youtube) Введение в анонимную связь с I2P. <a href="%(pdf)s">Быть или I2P (презентация PDF)</a>, Jens Kubieziel, 24C3, Берлин, 28 декабря 2007.
tr: <a href="%(video)s">To Be or I2P</a> (Youtube görüntüsü) I2P ile anonim iletişime giriş. <a href="%(pdf)s">To Be or I2P (PDF sunumu)</a>, Jens Kubieziel, 24C3 Berlin, 28 Aralık 2007.

source: <a href="%(video)s">Video of I2P talk at Chemnitz Linux Tag</a>, Lars Schimmer, March 14-15, 2009
fr: <a href="%(video)s">Vidéo de la conférence I2P au « Chemnitz Linux Tag »</a>, Lars Schimmer, 14 au 15 mars 2009
ru: <a href="%(video)s">Видеозапись обсуждения I2P на Chemnitz Linux Tag</a>, Lars Schimmer, Март 14-15, 2009
tr: <a href="%(video)s">Chemnitz Linux Tag I2P konuşmasının görüntü kaydı </a>, Lars Schimmer, 14-15 Mart 2009

source: HOPE New York July 17, 2010 - Brief overview of I2P by zzz, at the end of Adrian Hong's talk "Hackers for Human Rights". <a href="%(mp3)s">MP3 audio</a> <a href="%(vid)s">Youtube Video</a> (I2P part at 44 minutes)
fr: HOPE New York 17 Juillet 2010 - bref aperçu d'I2P par zzz à la fin de la présentation de Adrian Hong "les hackers pour les droits de l'homme". <a href="%(mp3)s">audio MP3</a> <a href="%(vid)s">vidéo YouTube</a> (partie I2P à 44 minutes)
ru: HOPE New York 17 июля 2010 - Краткий обзор I2P от zzz, в конце выступления Адриана Хона «Хакеры за права человека». <a href="%(mp3)s">MP3 аудио</a> <a href="%(vid)s">Видео Youtube </a>(часть I2P на 44-й минуте).
tr: HOPE New York 17 Temmuz 2010 - Adrian Hong konuşmasının sonunda Brief zzz tarafından kısa bir I2P özeti "İnsan Hakları için Hackerlar". <a href="%(mp3)s">MP3 ses kaydı</a> <a href="%(vid)s">Youtube görüntüsü</a> (I2P bölümü 44. dakikada)

source: <a href="%(link)s">Into the I2P Darknet: Welcome to Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, January 2011
fr: <a href="%(link)s">Into the I2P Darknet: Welcome to Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, janvier 2011
ru: <a href="%(link)s">В I2P Darknet: Добро пожаловать в Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, январь 2011
tr: <a href="%(link)s">I2P Darknet nedir: Cipherspace'e hoş geldiniz</a> Adrian Crenshaw. Schmoocon Firetalk, Ocak 2011

source: <a href="%(link)s">Using techhnology to advance liberty</a> (Youtube Video) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, March 27, 2011. I2P covered from 10:00 to 20:00 in the video.
fr: <a href="%(link)s">Utiliser la technologie pour faire avancer la liberté</a> (vidéo Youtube) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, le 27 mars 2011. I2P couvert de 10:00 à 20:00 dans la vidéo.
ru: <a href="%(link)s">Использование технологий для распространения свободы</a> (Youtube Video) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, 27 марта 2011. Информация об I2P с 10:00 до 20:00.
tr: <a href="%(link)s">Özgürlüğü arttırmak için teknolojiyi kullanmak</a> (Youtube görüntüsü) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, 27 Mart 2011. I2P görüntünün 10:00 ile 20:00 dakikaları arasında anlatılıyor.

source: <a href="%(link)s">Common Darknet Weaknesses</a> (Youtube Video) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, July 11-15, 2011.
fr: <a href="%(link)s">Faiblesses communes du darknet (Common Darknet Weaknesses)</a> (vidéo Youtube) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, 11-15 juillet 2011.
ru: <a href="%(link)s">Общие уязвимости Darknet</a> (Youtube Video) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, 11-15 июля 2011.
tr: <a href="%(link)s">Ortak Darknet zayıflıkları</a> (Youtube görüntüsü) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, 11-15 Temmuz 2011.

source: <a href="%(link)s">I2P / Tor Workshop Notes</a> Adrian Crenshaw. DEF CON 19, Las Vegas, August 6, 2011.
fr: <a href="%(link)s"> I2P / Tor notes d’atelier</a> Adrian Crenshaw. DEF CON 19, Las Vegas, 6 août 2011.
ru: <a href="%(link)s">Заметки с семинаров по I2P / Tor</a> Adrian Crenshaw. DEF CON 19, Лас-Вегас, 6 августа 2011.
tr: <a href="%(link)s">I2P / Tor Atölye Notları</a> Adrian Crenshaw. DEF CON 19, Las Vegas, 6 Ağustos 2011.

source: <a href="%(live)s">Cipherspaces/Darknets: An Overview Of Attack Strategies - DEF CON Live version (Youtube Video)</a>, <a href="%(studio)s">"Studio" version (Youtube Video)</a>, <a href="%(slides)s">Slides (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, August 7, 2011.
fr: <a href="%(live)s"> Cipherspaces / Darknets : un aperçu des stratégies d’attaque – DEF CON Live version (vidéo Youtube) </a>, <a href="%(studio)s">Version "Studio" (vidéo Youtube) </a>, <a href="%(slides)s">Diaporama (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, 7 août 2011.
ru: <a href="%(live)s">Cipherspaces/Darknets: Обзор стратегий атак - DEF CON Живая версия (видео на youtube)</a>, <a href="%(studio)s">"Студийная" версия (видео на youtube)</a>, <a href="%(slides)s">Слайды (ppt)</a> Adrian Crenshaw. DEF CON 19, Лас-Вегас, 7 августа 2011.
tr: <a href="%(live)s">Cipherspaces/Darknets:Saldırı stratejilerine genel bir bakış - DEF CON Canlı sürümü (Youtube görüntüsü)</a>, <a href="%(studio)s">"Studio" sürümü (Youtube görüntüsü)</a>, <a href="%(slides)s">Sunum (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, 7 Ağustos 2011.

source: <a href="http://0x375.org/">Modern cipherspace ecosystems</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), November 4, 2011.
fr: <a href="http://0x375.org/">Modern cipherspace ecosystems</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), 4 novembre 2011.
ru: <a href="http://0x375.org/">Экосистемы современных шифрованных пространств</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), 4 ноября 2011.
tr: <a href="http://0x375.org/">Modern cipherspace ekosistemleri</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), 4 Kasım 2011.

source: <a href="%(link)s">I2P - The Anonymous Network</a> (Youtube Video) Blair Dick, University of Abertay, Dundee Ethical Hacking Society, January 25, 2012.
fr: <a href="%(link)s">I2P - The Anonymous Network</a> (vidéo Youtube) Blair Dick, Université d’Abertay, Dundee Ethical Hacking Society, 25 janvier 2012.
ru: <a href="%(link)s">I2P — анонимная сеть</a> (видео на youtube) Blair Dick, Университет Абертей, Dundee Ethical Hacking Society, январь 25, 2012.
tr: <a href="%(link)s">I2P - Anonim ağ</a> (Youtube görüntüsü) Blair Dick, University of Abertay, Dundee Ethical Hacking Society, 25 Ocak 2012.

source: <a href="%(link)s">I2PCon 2015</a> Toronto, August 15-16, 2015
fr: <a href="%(link)s">I2PCon 2015</a> Toronto, 15-16 août 2015
ru: <a href="%(link)s">I2PCon 2015</a> Торонто, 15-16 августа 2015
tr: <a href="%(link)s">I2PCon 2015</a> Toronto, 15-16 Ağustos 2015

source: <a href="%(link)s">I2P - Still alive! (pdf)</a> <a href="%(link2)s">(video)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburg, December 28, 2015
fr: <a href="%(link)s">I2P - Still alive! (pdf)</a> <a href="%(link2)s">(vidéo)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburg, 28 décembre 2015
ru: <a href="%(link)s">I2P - Всё ещё жив! (pdf)</a> <a href="%(link2)s">(видео)</a> echelon, 32C3 (You Broke the Internet Assembly), Гамбург, 28 декабря 2015
tr: <a href="%(link)s">I2P - Still alive! (pdf)</a> <a href="%(link2)s">(görüntü)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburg, 28 Aralık 2015

source: Replacing Weary Crypto: Upgrading the I2P network with stronger primitives <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, Real World Crypto, Stanford, January 8, 2016
fr: Remplacement de crypto usée (anglais: Weary) : mise à niveau du réseau I2P avec des primitives plus fortes <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, Real World Crypto, Stanford, 8 janvier 2016
ru: Replacing Weary Crypto: Upgrading the I2P network with stronger primitives <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, Real World Crypto, Стэнфорд, 8 января 2016
tr: Yorgun şifrelemeyi değiştirmek: I2P ağını daha güçlü ilkellerle yükseltmek <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, Real World Crypto, Stanford, 8 Ocak 2016

source: Onions and Garlic: the protocols of I2P <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, COMPSCI 460: Computer Networking, University of Wisconsin Whitewater, February 17, 2016
fr: Onions and Garlic: the protocols of I2P <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, COMPSCI 460: Computer Networking, University of Wisconsin Whitewater, 17 février 2016
ru: Onions and Garlic: the protocols of I2P <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, COMPSCI 460: Computer Networking, Университет Висконсин в Уайтуотер Кампус, 17 февраля 2016
tr: Onion ve Garlic: I2P iletişim kuralları <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, COMPSCI 460: Computer Networking, University of Wisconsin Whitewater, 17 Şubat 2016

source: The Invisible Internet Project - An overview and guide to the technology <a href="%(link)s">(mp4)</a> <a href="%(link2)s">(webm)</a> Andrew Savchenko (bircoph), FOSDEM, Brussel, February 4, 2018
fr: Le projet de l’Internet invisible — Une vue d’ensemble et un guide des technologies <a href="%(link)s">(mp4)</a> <a href="%(link2)s">(webm)</a> Andrew Savchenko (bircoph), FOSDEM, Bruxelles, le 4 février 2018
ru: Проект Невидимый Интернет <a href="%(link)s"></a>— Обзор и руководство (mp4) <a href="%(link2)s">(webm)</a> Андрей Савченко (bircoph), конференция FOSDEM, Брюссель, 4 февраля 2018
tr: The Invisible Internet Project - Teknolojiye genel bakış ve rehber <a href="%(link)s">(mp4)</a> <a href="%(link2)s">(webm)</a> Andrew Savchenko (bircoph), FOSDEM, Brussel, 4 Şubat 2018

source: <a href="%(link)s">Intro to I2P for App Developers (mp4)</a> idk
fr: <a href="%(link)s">Présentation d’I2P pour les développeurs d’appli (mp4)</a> idk
ru: <a href="%(link)s">Гид по I2P для разработчиков приложений (mp4)</a> idk
tr: <a href="%(link)s">Uygulama Geliştiricileri için I2P dünyasına giriş (mp4)</a> idk

source: Tutorials
fr: Tutoriels
ru: Руководства
tr: Eğitimler

source: <a href="%(link)s">Felix Atari explains the basic principles of I2P</a> (Youtube Video) Agent Felix Atari of the Telecomix Crypto Munitions Bureau. By <a href="http://telecomix.org/">Telecomix</a>
fr: <a href="%(link)s">Felix Atari explique les principes de base d’I2P</a> (vidéo YouTube) Agent Felix Atari du « Telecomix Crypto Munitions Bureau ». Par <a href="http://telecomix.org/">Telecomix</a>
ru: <a href="%(link)s">Felix Atari объясняет основные принципы I2P</a> (Youtube Video) Felix Atari, сотрудник Telecomix Crypto Munitions Bureau. Автор <a href="http://telecomix.org/">Telecomix</a>
tr: <a href="%(link)s">Felix Atari temel I2P ilkelerini açıklıyor</a> (Youtube görüntü) Telecomix şifreleme bürosu ajanı Felix Atari . Sunan <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">Short garlic routing animation</a> (Youtube Video) Adrian Crenshaw.
fr: <a href="%(link)s">Courte animation du garlic routing</a> (vidéo Youtube) Adrian Crenshaw.
ru: <a href="%(link)s">Короткий роли о чесночной маршрутизации</a> (Youtube Video) Adrian Crenshaw.
tr: <a href="%(link)s">Kısa garlic yöneltme canlandırması</a> (Youtube görüntüsü) Adrian Crenshaw.

source: Articles and Interviews
fr: Articles et entrevues
ru: Статьи и интервью
tr: Makale ve röportajlar

source: Lance James (0x90) Interviewed by DistributedCity <a href="%(link1)s">Part 1</a> <a href="%(link2)s">Part 2</a> July 26, 2002.
fr: Lance James (0x90) interviewé par DistributedCity <a href="%(link1)s">Partie 1</a> <a href="%(link2)s">Partie 2</a> 26 juillet 2002.
ru: Интервью Lance James (0x90) для DistributedCity <a href="%(link1)s">Часть 1</a> <a href="%(link2)s">Часть 2</a> 26 июля 2002.
tr: Lance James (0x90) DistributedCity röportajı <a href="%(link1)s">1. bölüm</a> <a href="%(link2)s">2. bölüm</a> 26 Temmuz 2002.

source: Lance James (0x90) Interviewed by El País (original in Spanish) <a href="%(link)s">English translation</a> October 31, 2002.
fr: Lance James (0x90) interviewé par El País (original en Espagnol) <a href="%(link)s">Traduction en Anglais</a> 31 octobre 2002.
ru: Интервью Lance James (0x90) для El País (оригинал на испанском) <a href="%(link)s">Перевод на английский</a> 31 октября 2002.
tr: Lance James (0x90) El País röportajı (İspanyolca orijinal) <a href="%(link)s">İngilizce çevirisi</a> 31 Ekim 2002.

source: <a href="%(link)s">2003 Business Week article referencing invisiblenet</a> September 14, 2003.
fr: <a href="%(link)s">2003 article de Business Week référençant Invisiblenet</a> 14 septembre 2003.
ru: <a href="%(link)s">2003 Business Week статья о невидимой сети</a> 14 сентября 2003.
tr: <a href="%(link)s">2003 Business Week görünmez ağ referanslı makale</a> 14 Eylül 2003.

source: <a href="%(link)s">Netzwelt.de article about being anonymous in the Internet</a> (German) November 2007.
fr: <a href="%(link)s">Article de Netzwelt.de traitant de l’anonymat sur Internet</a> (Allemand) Novembre 2007.
ru: <a href="%(link)s">Netzwelt.de статья об анонимности в интернете</a> (на немецком), ноябрь 2007.
tr: <a href="%(link)s">Netzwelt.de İnternet üzerinde anonim olmakla ilgili makale</a> (Almanca) Kasım 2007.

source: <a href="%(link)s">zzz interviewed by gulli.com</a> March 2009 <a href="%(german)s">German translation</a>
fr: <a href="%(link)s">zzz interviewé par gulli.com</a> Mars 2009 <a href="%(german)s">Traduction allemande</a>
ru: <a href="%(link)s">интервью zzz для gulli.com</a> Март 2009 <a href="%(german)s">немецкий перевод</a>
tr: <a href="%(link)s">zzz gulli.com röportajı</a> Mart 2009 <a href="%(german)s">Almanca çevirisi</a>

source: <a href="%(mp3)s">zzz interviewed on the InfoSec Daily Podcast Ep. 454 (mp3)</a> August 18, 2011 (link dead, seeded inside I2P at <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">postman's tracker</a>)
fr: <a href="%(mp3)s">zzz lors de l’entrevue du balado « InfoSec Daily Podcast Ep. 454 » (mp3)</a>, le 18 août 2011 (lien mort, propagé dans I2P au <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">traqueur de Postman</a>)
ru: <a href="%(mp3)s">Интервью zzz в подкасте InfoSec Daily Podcast Ep. 454 (mp3)</a> 18 августа 2011 (мёртвая ссылка, раздаётся в сети I2P на <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">трекере postman'a</a>)
tr: <a href="%(mp3)s">Daily Podcast Bölüm 454 zzz InfoSec röportajı (mp3)</a> 18 Ağustos 2011 (bağlantı çalışmıyor, I2P içinde <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">postman izleyiciye</a> eklendi)

source: <a href="%(link)s">I2P - Anonymity for the Masses</a>, Jonathan Cox, November 11, 2011.
fr: <a href="%(link)s">I2P - Anonymity for the Masses</a>, Jonathan Cox, 11 novembre 2011.
ru: <a href="%(link)s">I2P - Анонимность для Всех</a>, Jonathan Cox, Ноябрь 11, 2011.
tr: <a href="%(link)s">I2P - Kitleler için anonimlik</a>, Jonathan Cox, 11 Kasım 2011.

source: <a href="%(mp3)s">zzz and Lance James interviewed on the InfoSec Daily Podcast Ep. 596 (mp3)</a> February 16, 2012 (link dead, seeded inside I2P at <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">postman's tracker</a>)
fr: <a href="%(mp3)s">zzz et Lance James lors de l’entrevue du balado « InfoSec Daily Podcast Ep. 596 » (mp3)</a>, le 16 février 2012 (lien mort, propagé dans I2P au <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">traqueur de Postman</a>)
ru: <a href="%(mp3)s">Интервью zzz и Lance James в подкасте InfoSec Daily Podcast Ep. 596 (mp3)</a> 16 февраля 2012 (мёртвая ссылка, раздаётся в сети I2P на <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">трекере postman'а</a>)
tr: <a href="%(mp3)s">InfoSec Daily Podcast Bölüm 596 zzz Ive Lance James röportajı (mp3)</a> 16 Şubat 2012 (bağlantı çalışmıyor, I2P içinde <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">postman izleyiciye</a> eklendi)

source: <a href="%(mp3)s">Jeff and Str4d interviewed on the Brakeing Down Security Podcast Ep. 2015-010 (mp3)</a> Part 1, February 28, 2015
fr: <a href="%(mp3)s">Jeff et Str4d interviewés lors du Brakeing Down Security Podcast Ep. 2015-010 (mp3)</a> Partie 1, 28 février 2015
ru: <a href="%(mp3)s">Jeff и Str4d в интервью на Brakeing Down Security Podcast Ep. 2015-010 (mp3)</a> Part 1, 28 февраля 2015
tr: <a href="%(mp3)s">Brakeing Down Security Podcast Bölüm 2015-010 Jeff ve Str4d röportajı (mp3)</a> 1. bölüm, 28 Şubat 2015

source: <a href="%(mp3)s">Jeff and Str4d interviewed on the Brakeing Down Security Podcast Ep. 2015-011 (mp3)</a> Part 2, March 6, 2015
fr: <a href="%(mp3)s">Jeff et Str4d interviewés lors du Brakeing Down Security Podcast Ep. 2015-011 (mp3)</a> Partie 2, 6 mars 2015
ru: <a href="%(mp3)s">Jeff и Str4d в интервью на Brakeing Down Security Podcast Ep. 2015-011 (mp3)</a> Part 2, 6 марта 2015
tr: <a href="%(mp3)s">Brakeing Down Security Podcast Bölüm 2015-011 Jeff ve Str4d röportajı (mp3)</a> 2. bölüm, 6 Mart 2015

source: <a href="%(link)s">Fireside With Lei - Episode 18: Lance James. Success, Failures, Grief and Buddhism.</a> <a href="%(archive)s">(archive.org)</a> <a href="%(mp3)s">(mp3)</a> Robert Lei, December 31, 2018
fr: <a href="%(link)s">Fireside avec Lei — Épisode 18 : Lance James. Succès, échec, deuil et boudhism.</a> <a href="%(archive)s">(archive.org)</a> <a href="%(mp3)s">(mp3)</a> Robert Lei, 31 décembre 2018
ru: <a href="%(link)s">Fireside With Lei - Эпизод 18: Лэнс Джеймс. Успех, неудачи, горе и буддизм.</a> <a href="%(archive)s">(archive.org)</a> <a href="%(mp3)s">(mp3)</a> Роберт Лей, 31 декабря 2018 г.
tr: <a href="%(link)s">Fireside With Lei - 18. bölüm: Lance James. Başarı, Başarısızlık, Yas ve Budizm.</a> <a href="%(archive)s">(archive.org)</a> <a href="%(mp3)s">(mp3)</a> Robert Lei, 31 Aralık 2018

source: <a href="%(mhatta)s">Articles by I2P contributor Masayuki Hatta on Medium.com</a> 2019
fr: <a href="%(mhatta)s">Articles par le contributeur d’I2p Masayuki Hatta sur medium.com</a> 2019
ru: <a href="%(mhatta)s">Статьи участника проекта I2P Масаюки Хатта на Medium.com</a> 2019 год
tr: <a href="%(mhatta)s">I2P katılımcısı Masayuki Hatta Medium.com makalesi</a> 2019

source: <a href="%(ctrl)s">Enabling both .onion and .i2p routing with Proxy Auto-Configuration</a> Daniel Aleksandersen, February 7 2019
fr: <a href="%(ctrl)s">Activer à la fois le routage .onion et .i2p grâce à la configuration automatique du mandataire</a> Daniel Aleksandersen, 7 février 2019
ru: <a href="%(ctrl)s">Включение маршрутизации .onion и .i2p с помощью автоконфигурации прокси-сервера</a> Даниэль Александерсен, 7 февраля 2019 г.
tr: <a href="%(ctrl)s">Otomatik vekil sunucu yapılandırması ile .onion ve .i2p yöneltmeyi birlikte kullanmak</a> Daniel Aleksandersen, 7 Şubat 2019

source: <a href="%(advent)s">Open-Source-Adventskalender: Die Darknets Freenet und I2P</a> Stefan Mey, December 21, 2021
ru: <a href="%(advent)s">Open-Source-Adventskalender: Die Darknets Freenet und I2P1</a> Штефан Мей, 21 декабря 2021 г.
tr: <a href="%(advent)s">Open-Source-Adventskalender: Die Darknets Freenet und I2P</a> Stefan Mey, 21 Aralık 2021

source: Other
fr: Autres
ru: Прочее
tr: Diğer

source: I2P mentioned in Netflix's "House of Cards" Season 2 Episode 2, February 14, 2014
fr: I2P mentionné dans "House of Cards" de Netflix, saison 2 épisode 2, 14 février 2014
ru: I2P упоминался во второй серии второго сезона сериала "House of Cards" от Netflix, 14 февраля 2014
tr: Netflix dizisi "House of Cards" 2. Sezon 2. Bölümünde I2P anıldı 14 Şubat 2014

source: <a href="%(meeh)s">A curated list by I2P contributor meeh of I2P implementations, libraries, resources, projects, and shiny things</a> 2019
fr: <a href="%(meeh)s">Une liste organisée par le contributeur d’I2p meeh des mises en œuvre, bibliothèques, ressources, projets et autres choses rutilantes d’I2P</a> 2019
ru: <a href="%(meeh)s">Список версий I2P, библиотек, ресурсов, проектов и удивительных находок, составленный участником I2P meeh</a> 2019
tr: <a href="%(meeh)s">I2P katılımcısı meeh trafından I2P uygulamaları, kitaplıkları, kaynakları, projeleri ve diğer konular hakkında bir liste düzenlendi </a> 2019

source: Strict Countries
fr: Pays stricts
ru: Страны с ограничениями.
tr: Kısıtlanan Ülkeler

source: This implementation of I2P (the Java implementation distributed on this site) includes a "Strict Countries List" which we use to decide how routers should behave within regions where applications like I2P may be limited by law. For example, while no countries that we know of prohibit using I2P, some have broad prohibitions on participating in routing for others. Routers that appear to be in the "Strict" countries will automatically be placed into "Hidden" mode.
fr: Cette implémentation d'I2P (l'implémentation Java distribuée sur ce site) inclut une "liste de pays stricts" que nous utilisons pour décider comment les routeurs doivent se comporter dans les régions où les applications comme I2P peuvent être censurées par la loi. Par exemple, même si il n'y a pas de pays que nous connaissons qui interdisent l'utilisation d'I2P, certains ont des interdictions larges sur la participation au routage pour d'autres personnes. Les routeurs qui sont dans des pays "stricts" seront automatiquement mis en mode "caché".
ru: Эта версия I2P (Java-версия, распространяемая на этом сайте) включает в себя «Список стран с ограничениями, который мы используем, чтобы решить, как должны вести себя маршрутизаторы в регионах, где действие таких приложений, как I2P, может быть ограничено законом. Например, хотя ни одна из известных нам стран не запрещает использование I2P, в некоторых странах существуют широкие запреты на участвовать в маршрутизации для других стран. Маршрутизаторы, которые находятся в странах с ограничениями, будут автоматически переведены в режим «Скрытый».
tr: Bu I2P uygulamasında (bu sitede dağıtılan Java uygulaması), I2P gibi uygulamaların yasalarla sınırlandırılabileceği bölgelerde yönelticilerin nasıl davranması gerektiğine karar vermek için kullandığımız bir "kısıtlanan ülkeler listesi" bulunur. Örneğin, bildiğimiz hiçbir ülke I2P kullanımını yasaklamazken, bazılarının başkaları için yöneltmeye katılma konusunda geniş yasakları vardır. "Kısıtlı" ülkelerde görünen yönelticiler otomatik olarak "Gizli" kipe alınır.
