Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/about.po
Languages: fr, ru, tr

source: Alternative I2P clients
fr: Clients I2P de remplacement
ru: Альтернативные клиенты I2P
tr: Alternatif I2P istemcileri

source: The main I2P client implementation uses Java. If for some reason you can't use Java on your device, there are alternative implementations developed by community members.
fr: L’implémentation du principal client I2P utilise Java. Si pour certaines raisons vous ne pouvez pas utiliser Java sur votre dispositif, il y a des implémentations alternatives développées par des membres de la communauté.
ru: Основная реализация клиента I2P использует Java. Если по каким-то причинам вы не можете использовать Java на вашем устройстве, существуют альтернативные реализации, разработанные членами сообщества.
tr: Temel I2P istemci uygulaması Java kullanır. Herhangi bir nedenle aygıtınızda Java kullanamıyorsanız topluluk üyeleri tarafından geliştirilmiş alternatif uygulamalardan birini kullanabilirsiniz.

source: <a href="%(i2pd)s">i2pd</a> is a I2P client implementation in C++. As of early 2016, i2pd has become stable enough to be used in production, and since summer 2016 it fully implements all I2P APIs.
fr: <a href="%(i2pd)s">i2pd</a> est une implémentation pour client I2P en C++. En début d'année 2016, i2pd est devenu suffisamment stable pour être utilisé en production et depuis l'été 2016, il a implémenté toutes les API de I2P.
ru: <a href="%(i2pd)s">i2pd</a>- это реализация клиента I2P на C++. По состоянию на начало 2016 года i2pd стал достаточно стабильным для использования в производстве, а с лета 2016 года он полностью реализует все API I2P.
tr: <a href="%(i2pd)s">i2pd</a> C++ ile geliştirilmiş bir I2P istemci uygulamasıdır. 2016 başlarında, i2pd üretim ortamında kullanılabilecek kadar kararlı duruma gelmiştir ve 2016 yazından sonra tüm I2P API uygulamaları eklenmiştir.

source: <a href="%(kovri)s">Kovri</a> is active i2pd fork developed for Monero cryptocurrency.
fr: <a href="%(kovri)s">Kovri</a> est une fourche active d’I2P développée pour la cryptomonnaie Monero.
ru: <a href="%(kovri)s">Kovri</a> — это активный форк i2pd, разрабатываемый для криптовалюты Monero.
tr: <a href="%(kovri)s">Kovri</a> Monero şifreli para birimi tarafından geliştirilen etkin bir i2pd uyarlamasıdır.

source: <a href="%(go_i2p)s">Go-I2P</a> is I2P client developed using the <a href="%(golang)s">Go</a> programming language. The project is in early development.
fr: <a href="%(go_i2p)s">Go-I2P</a> est un client I2P client développé en utilisant le langage de programmation <a href="%(golang)s">Go</a>. Le projet est au début de son développement.
ru: <a href="%(go_i2p)s">Go-I2P</a> — это клиент I2P, разрабатываемый с использованием языка программирования <a href="%(golang)s">Go</a>. Проект находится в начальной стадии разработки.
tr: <a href="%(go_i2p)s">Go-I2P</a>, <a href="%(golang)s">Go</a> programlama dili kullanılarak geliştirilmekta olan bir I2P istemcisidir.

source: Web Browser Configuration
fr: Configuration du navigateur Web
ru: Конфигурация веб-браузера
tr: Tarayıcı yapılandırması

source: Glossary
fr: Glossaire
ru: Словарь.
tr: Terimler sözlüğü

source: This table lists often-used terminology when discussing I2P and cryptography.
fr: Cette table liste du vocabulaire souvent utilisé en discutant I2P et la cryptographie.
ru: В этой таблице приведена часто используемая при обсуждении I2P и шифрования терминология.
tr: I2P ve şifreleme üzerine tartışırken sık kullanılan terminoloji bu tabloda listelenmiştir.

source: I2P: Invisible Internet Project: a project meant to provide an anonymity layer, so user can communicate anonymously using a range of applications.
fr: I2P : Projet Internet Invisible : un projet conçu pour fournir une couche d'anonymat pour que l'utilisateur puisse communiquer en utilisant plusieurs applications.
ru: 2P: Invisible Internet Project:: проект, призванный обеспечить уровень анонимности, достаточный для того, чтобы пользователь мог анонимно общаться, используя ряд приложений.
tr: I2P: Invisible Internet Project: Kullanıcının bir dizi uygulama kullanarak anonim olarak iletişim kurabilmesi için bir anonimlik katmanı sağlamayı amaçlayan bir proje.

source: Router: The core I2P software, which routes encrypted packets on the I2P network. All routers by default participate in the network, which both helps the network and provides cover traffic for any clients or servers connecting to the I2P network through the router.
fr: Routeur : le centre du logiciel I2P, qui dirige les paquets chiffrés sur le réseau I2P. Tout les routeurs participent par défaut dans le réseau ce qui aide le réseau et fournit une couverture pour le trafic sur chaque client ou serveur se connectant au réseau I2P via la routeur.
ru: Маршрутизатор: Основное программное обеспечение I2P, которое маршрутизирует зашифрованные пакеты в сети I2P. Все маршрутизаторы по умолчанию участвуют в работе сети, что помогает ей и обеспечивает прикрытие трафика для любых клиентов или серверов, подключающихся к сети I2P через маршрутизатор.
tr: Yöneltici: I2P ağında şifrelenmiş paketleri yönelten çekirdek I2P yazılımı. Varsayılan olarak tüm yönelticiler, hem ağa yardımcı olur hem de yöneltici aracılığıyla I2P ağına bağlanan tüm istemciler veya sunucular için koruma trafiği sağlar.

source: RouterIdentity: A collection of information required to communicate directly with a router, such as its IP address and listening port, public signing and encryption keys etc.
fr: IdentitéRouteur : un recueil d'informations requises pour communiquer directement au routeur, comme l'adresse IP, le port d'écoute, signature publique et les clés de chiffrement, etc...
ru: RouterIdentity: Набор информации, необходимой для непосредственного взаимодействия с маршрутизатором, например, его IP-адрес и порт прослушивания, открытые ключи подписи и шифрования и т.д.
tr: “Yöneltici kimliği” (RouterIdentity): IP adresi ve dinlenecek bağlantı noktası, genel imzalama ve şifreleme anahtarları gibi bir yöneltici ile doğrudan iletişim kurmak için gereken bir bilgi kümesi.

source: Tunnel: An anonymous communication pathway between a client or server and the I2P network. Tunnels are unidirectional, so any one client or server must have at least two Tunnels - one for inbound traffic and one for outbound traffic.
fr: Tunnel : un passage de communication anonyme entre un client ou serveur et le réseau I2P. Les Tunnels n'ont pas de directions donc chaque client ou serveur doit avoir au moins deux Tunnels - un pour le trafic entrant et un pour le trafic sortant.
ru: Туннель: Анонимный канал связи между клиентом или сервером и сетью I2P. Туннели однонаправленные, поэтому любой один клиент или сервер должен иметь как минимум два туннеля — один для входящего трафика и один для исходящего трафика.
tr: Tünel: Bir istemci veya sunucu ile I2P ağı arasında anonim bir iletişim yolu. Tüneller tek yönlüdür, bu nedenle herhangi bir istemci ya da sunucu, biri geliş diğeri gidiş trafiği için olmak üzere en az iki tünel kullanır.

source: Destination: The cryptographic identity of a tunnel. These are the identities of clients and servers within the I2P network, and are analogous to the IP:port of a computer on the normal internet.
fr: Destination : L'identité cryptographique d'un tunnel. Ce sont les identité des clients et serveurs dans le réseau I2P et sont similaires au IP:port d'un ordinateur sur l'internet normal.
ru: Destination: Криптографический идентификатор туннеля. Это идентификаторы клиентов и серверов в сети I2P, аналог IP:port компьютера в обычном Интернете.
tr: Hedef: Bir tünelin şifrelenmiş kimliği. Bunlar, I2P ağı içindeki istemci ve sunucuların kimlikleridir ve normal İnternet üzerindeki bir bilgisayarın IP:bağlantı noktası gibidir.

source: LeaseSet: A collection of information required to communicate with a client or server at a particular Destination, such as the gateways of the inbound Tunnels for that Destination.
fr: jeu de baux : un recueil d'information requis pour communiquer avec un client ou serveur dans une Destination spécifique comme les passerelles des Tunnels entrant pour cette Destination.
ru: LeaseSet: Набор информации, необходимой для связи с клиентом или сервером в определенном пункте назначения, например, шлюзы входящих туннелей для этого пункта назначения.
tr: "Kiralama kümesi" (LeaseSet): Belirli bir hedefteki bir istemci veya sunucu ile iletişim kurmak için gerekli olan, bu hedef için geliş tünellerinin ağ geçitleri gibi bir bilgi kümesi.

source: This table lists definition of different networks and their components. These terms and the definitions provided are taken from <a href="https://decentpatterns.xyz/report/#key-terms">Decentralization Off The Shelf: 7 Maxims by Simply Secure</a>(used with permission).
fr: La table liste les définitions de différents réseaux et leurs composants. Ces termes et les définitions fournies sont prises de <a href="https://decentpatterns.xyz/report/#key-terms">Decentralization Off The Shelf: 7 Maxims by Simply Secure</a> (utilisées avec permission).
ru: В этой таблице приведены определения различных сетей и их компонентов. Эти термины и определения взяты из Decentralization Off The Shelf: 7 Maxims by Simply Secure (использовано с разрешения).
tr: Bu tabloda, farklı ağların ve bileşenlerinin tanımları bulunur. Bu terimler ve tanımları şuradan alınmıştır: <a href="https://decentpatterns.xyz/report/#key-terms">Decentralization Off The Shelf: 7 Maxims by Simply Secure</a> (kullanım izni alınmıştır).

source: Decentralization: Network architecture that avoids reliance on a single party. Encompasses peer-to-peer, blockchain, federated, and distributed technologies that involve many individual users.
fr: Décentralisation : Architecture de réseau qui évite la dépendance à l'égard d'un parti unique. Cela englobe les technologies pair-à-pair, blockchain, fédérées et distribuées qui implique beaucoup d'utilisateurs individuels.
ru: Decentralization (децентрализация): Архитектура сети, которая позволяет избежать зависимости от одной стороны. Включает в себя одноранговую сеть, блокчейн, федеративные и распределенные технологии, предполагающие участие множества частных пользователей.
tr: Merkezi olmayan: Tek bir tarafa güvenmeyi önleyen ağ mimarisi. Birçok bireysel kullanıcıyı içeren eşler arası, blok zinciri, birleşmiş ve dağıtılmış teknolojileri kapsar.

source: Peer-to-Peer (p2p): Peers make a portion of their resources, such as processing power, disk storage or network bandwidth, directly available to other network participants, without the need for central coordination by servers or stable hosts. Popularized by BitTorrent, Napster, and Bitcoin.
fr: Pair-à-pair (p2p) : les pairs forment un portion de ressources, comme la puissance de calcul, le stockage de disque ou la bande passante réseau, directement disponible sur les autres participants réseaux, sans avoir besoin de coordination centralisé par les serveurs ou les hébergeurs stables. Popularisé par BitTorrent, Napster et Bitcoin.
ru: Peer-to-Peer (p2p) (одноранговая сеть): Узлы предоставляют часть своих ресурсов, таких как вычислительная мощность, дисковое хранилище или пропускная способность сети, доступных другим участникам сети. При этом не требуется центральной координации со стороны серверов или стабильных хостов. Популяризирована BitTorrent, Napster и Bitcoin.
tr: Eşler Arası (p2p): Eşler, sunucular veya kalıcı bilgisayarlar tarafından merkezi yönetime gerek duymadan, işlem gücü, disk depolama veya ağ bant genişliği gibi kaynaklarının bir kısmını doğrudan diğer ağ katılımcılarının kullanımına sunar. BitTorrent, Napster ve Bitcoin gibi uygulamalar tarafından yaygınlaştırılmıştır.

source: Federated: Federation allows separate deployments of a service to communicate with each other through a common protocol, for instance a mail server run by Google federates with a mail server run by Microsoft when you send an email from @gmail.com to @hotmail.com. Each deployment may host multiple users.
fr: Fédéré : La fédération permet des déploiements séparés d'un service pour communiquer avec d'autres par un protocole commun, par exemple un serveur courriel appartenant à Google fédère avec un serveur courriel appartenant à Microsoft quand vous envoyez un courriel d'un @gmail.com à un @hotmail.com. Chaque déploiement peut hébergé plusieurs utilisateurs.
ru: Federated (федеративность): Федеративность позволяет отдельным развертываниям взаимодействовать друг с другом через общий протокол, например, почтовый сервер, запущенный Google, взаимодействует с почтовым сервером, запущенным Microsoft, когда вы отправляете письмо с @gmail.com на @hotmail.com. В каждом развертывании может находиться несколько пользователей.
tr: Birleşmiş: Birleşim, bir hizmetin ayrı dağıtımlarının ortak bir iletişim kuralı ile birbirleriyle iletişim kurmasını sağlar. Örneğin, @gmail.com üzerinden @hotmail.com üzerine bir e-posta gönderdiğinizde, Google birleşimleri tarafından çalıştırılan bir e-posta sunucusu ile Microsoft tarafından çalıştırılan bir e-posta sunucusu arasında olduğu gibi. Her dağıtımda birden çok kullanıcı bulunabilir.

source: Blockchain: A distributed ledger that can record transactions between multiple parties efficiently and in a verifiable and permanent way.
fr: Blockchain : un registre distribué qui peut efficacement enregistrer les transactions entre plusieurs partis et de manière permanente et vérifiable.
ru: Блокчейн: Доступная всем бухгалтерская книга, которая может записывать транзакции между несколькими сторонами эффективно, с возможностью проверки и на постоянной основе.
tr: Blockchain: Birden fazla taraf arasındaki işlemleri verimli, doğrulanabilir ve kalıcı bir şekilde kaydedebilen dağıtılmış bir kayıt defteri.

source: Distributed systems: Academic topic within the discipline of Computer Science which is concerned with the design of computer systems that consist of many individual computers connected over a network. Peer-to-peer networks and blockchains are examples of distributed systems architectures.
fr: Systèmes distribués : sujet académique dans la discipline de l'informatique qui concerne le design des systèmes ordinateurs qui consiste en plusieurs ordinateurs individuels connectés sur un réseau. Les réseaux pair-à-pair et blockchain sont des exemples d'architectures système distribués.
ru: Распределенные системы: Академическая тема в рамках Дисциплины компьютерных наук, описывающая проектирование компьютерных систем, состоящих из множества отдельных компьютеров, соединенных через сеть. Одноранговые сети и блокчейн — примеры архитектуры распределенных систем.
tr: Dağıtılmış sistemler: Bilgisayar Bilimleri disiplini içinde, bir ağ üzerinden birbirine bağlı birçok bilgisayardan oluşan sistemlerin tasarımı ile ilgilenen akademik dal. Eşler arası ağlar ve blok zincirler, dağıtılmış sistem mimarilerinin örnekleridir.

source: TCP/UDP: The two foundational transport protocols used on the Internet. Common protocols used to send data between two computers.
fr: TCP/UDP : les deux protocoles de transport fondateurs utilisés sur internet. Ces protocoles sont utilisés pour envoyer des données entre deux ordinateurs.
ru: TCP/UDP: Два основополагающих транспортных протокола, используемых в Интернете. Общие протоколы, используемые для передачи данных между двумя компьютерами.
tr: TCP/UDP: İnternet üzerinde kullanılan iki temel taşıyıcı iletişim kuralı. İki bilgisayar arasında veri göndermek için kullanılan yaygın iletişim kuralları.

source: DHT: Distributed hash table, used in some projects to connect peers to each other by storing information in the form of key-value pairs in a distributed manner.
fr: DHT : table de hachage distribué, utilisé dans certains projets pour connecter les pairs entre eux en stockant l'information sous la forme de pairs à valeur clé de manière distribuée.
ru: DHT: распределенная хэш-таблица, используется в некоторых проектах для соединения узлов друг с другом путем хранения информации в виде распределенных пар ключ-значение.
tr: DHT: Dağıtılmış karma tablosu, bazı projelerde eşleri birbirine bağlamak için anahtar/değer çiftleri şeklinde bilgileri dağıtılmış bir şekilde depolamak amacıyla kullanılır.

source: IP address: A number of a computer or network which is unique and thus can be used to address it.
fr: Adresse IP : un nombre d'un ordinateur ou réseau qui lui est unique et peut donc être utilisé pour le nommer.
ru: IP-адрес: Номер компьютера или сети, который является уникальным и поэтому может быть использован для адресации.
tr: IP adresi: Benzersiz olan ve bu nedenle erişim için kullanılabilen bir bilgisayar veya ağ numarası.

source: WebRTC: A protocol standard for establishing connections in a web browser where data passes directly between users.
fr: WebRTC : un protocole classique pour établir les connexions à un navigateur web où les données passent directement entre les utilisateurs.
ru: WebRTC: Стандарт протокола для установления соединений в веб-браузере, при котором данные передаются непосредственно между пользователями.
tr: WebRTC: Verilerin doğrudan kullanıcılar arasında aktarıldığı bir tarayıcı ile bağlantı kurmak için kullanılan bir iletişim kuralı standardı.

source: Hash: A number, usually displayed as a string of letters and numbers. It can serve as a ‘fingerprint’ uniquely identifying data.
fr: Hash : un nombre, normalement affiché comme une chaîne de chiffres et de lettres. Il peut être utilisé comme 'empreinte digitale', identifiant uniquement les données.
ru: Хэш: Число, обычно отображаемое в виде набора букв и цифр. Оно может служить «отпечатка пальца», идентифицирующим данные.
tr: Karma: Genellikle bir harf ve sayı dizisi olarak görüntülenen bir değer. Verileri benzersiz şekilde tanımlayan bir 'parmak izi' işlevi görür.

source: UX: User experience, the overall experience of a person using a product or a service, especially in terms of how easy it is to use.
fr: UX : expérience utilisateur, l'expérience globale d'une personne utilisant un produit ou service, surtout en terme de facilité d'utilisation.
ru: UX: пользовательский опыт, общий опыт индивидуального использования продукта или услуги, особенно с точки зрения того, насколько легко ими пользоваться.
tr: UX: Kullanıcı deneyimi, bir ürünü veya hizmeti kullanan bir kişinin genel deneyimi. Özellikle kullanım kolaylığı açısından.

source: Hall Of Fame
fr: Temple de la renommée
ru: Зал Славы
tr: Onur listesi

source: I2P is a project made completely by spare time enthusiasts. But a big project like I2P is not made from software alone, several servers, domain registrations, and coffees need to be paid to get a great result. People all over the world donated to I2P reach the state it is in currently. Here we do track those who gave us a name to be published in a I2P hall of fame.
fr: I2P est un projet entièrement réalisé par des passionnés pendant leur temps libre. Mais un grand projet tel qu’I2P n’est pas seulement constitué de logiciels. Plusieurs serveurs, abonnements de domaines et cafés doivent être payés pour obtenir un excellent résultat. Des gens du monde entier ont fait des dons afin qu’I2P atteignent l’état où il se trouve actuellement. Nous gardons ici une trace de ceux qui nous ont donné un nom à publier dans le temple de la renommée d’I2P.
ru: Проект I2P целиком сделан энтузиастами в их свободное время. Однако крупный проект, такой как I2P не состоит только из программ; для получения выдающихся результатов может потребоваться зарегистрировать доменов, оплатить кофе и несколько серверов. Люди со всего мира осуществляли пожертвования на I2P, чтобы он достиг нынешнего вида. Здесь мы указываем тех, кто сообщил свое имя для упоминания на аллее славы I2P.
tr: I2P tamamen boş zamanlarını değerlendiren gönüllüler tarafından geliştirilmiş bir projedir I2P yalnızca yazılımdan ibaret değildir. İyi bir sonuç almak için bir kaç sunucu, etki alanı kayıtları ve kahve paralarının ödenmesi gerekiyor. Tüm dünyadan çeşitli kişiler I2P uygulamasının bugünkü durumuna gelmesi için bağış yaptılar. Bu bağışçılardan, adlarının I2P onur listesinde yer almasını isteyenlerin kaydını burada yayınlıyoruz.

source: Big thanks go to the following people who have donated to I2P!
fr: Un grand merci aux personnes suivantes qui ont donné à I2P !
ru: Большая благодарность следующим людям, сделавшим пожертвование для I2P!
tr: I2P projesine bağış yapan kişilere çok teşekkür ederiz!

source: If you have made a donation, please send an email to <a href="mailto:%(echelon)s">echelon</a> with your name or nick (and optionally homepage) so we can list you here.
fr: Si vous avez fait un don, veuillez envoyer un courriel à <a href="mailto:%(echelon)s">echelon</a> avec votre nom ou pseudo (et facultativement votre page Web) afin que nous puissions vous lister ici.
ru: Если вы сделали пожертвование, пожалуйста, отправьте email на <a href="mailto:%(echelon)s">echelon</a> с вашим именем или ником (и, по желанию, домашней страницей), чтобы мы смогли указать вас здесь.
tr: Bağış yaptıysanız <a href="mailto:%(echelon)s">echelon</a> adresine adınızı ya da takma adınızı (ve isterseniz site adresinizi) içeren bir e-posta gönderirseniz sizi bu listeye ekleriz.

source: The unsorted list of I2P donors in 15 years of I2P history, starting March 2004 til March 2019.
fr: La liste non triée de donateurs à I2P lors des quinze années d’histoire d’I2P, de mars 2004 à mars 2019.
ru: Несортированный список доноров I2P за 15 лет истории I2P, начиная с марта 2004 года по март 2019 года.
tr: 2004 Mart ayından 2019 Mart ayına kadar, 15 yıllık I2P geçmişindeki bağışçıların sıralı olmayan listesi.

source: Intro
ru: Введение
tr: Giriş

source: The Invisible Internet Project
fr: The Invisible Internet Project (le projet internet invisible)
ru: Проект Невидимый Интернет
tr: Invisible Internet Project

source: The Invisible Internet Project (I2P) is a fully encrypted private network layer that has been developed with privacy and security by design in order to provide protection for your activity, location and your identity. The software ships with a router that connects you to the network and applications for sharing, communicating and building.
fr: Le Projet Internet Invisible (I2P) est une couche réseau privée entièrement chiffrée qui fut développé avec l'intention de sécuriser et privatiser vos activités, emplacements et identité. Le logiciel est fourni avec un routeur qui vous connecte au réseau et applications pour communiquer, partager et construire.
ru: Invisible Internet Project (I2P) — это полностью зашифрованный уровень частной сети, который был разработан с учетом принципов конфиденциальности и безопасности, чтобы обеспечить защиту вашей деятельности, местоположения и вашей личности. Программное обеспечение поставляется с маршрутизатором, который подключает вас к сети, и приложениями для совместного использования, общения и программирования.
tr: Invisible Internet Project (I2P), etkinliğiniz, konumunuz ve kimliğiniz için koruma sağlamak için tasarımı gereği gizlilik ve güvenlik ile geliştirilmiş tamamen şifrelenmiş bir özel ağ katmanıdır. Yazılım, sizi paylaşmak, iletişim kurmak ve bir şeyler oluşturmak için ağa ve uygulamalara bağlayan bir yöneltici ile birlikte gelir.

source: I2P Cares About Privacy
fr: I2P se soucie de votre vie privée
ru: I2P заботится о приватности
tr: I2P kişisel gizliliğe önem verir
