Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: When you create a hidden service, you publish something called a "LeaseSet" to the I2P NetDB. The "LeaseSet" is, in the simplest terms, what other I2P users need to discover "where" your hidden service is on the I2P Network. It contains "Leases" which identify tunnels that can be used to reach your hidden service, and the public key of your destination, which clients will encrypt messages to. This type of hidden service is reachable by anyone who has the address, which is probably the most common use case for now.
pt_br: Quando você cria um serviço oculto, você publica algo chamado "LeaseSet" para o I2P NetDB. O "LeaseSet" é, em termos mais simples, o que outros usuários I2P precisam para descobrir "onde" seu serviço oculto está na rede I2P. Ele contém "Leases" que identificam túneis que podem ser usados para alcançar seu serviço oculto, e a chave pública do seu destino, para a qual os clientes criptografarão as mensagens. Este tipo de serviço oculto pode ser alcançado por qualquer um que tenha o endereço, que é provavelmente o caso de uso mais comum por enquanto.
tr: Bir gizli hizmet oluşturduğunuzda, I2P "Ağ veri tabanına" (NetDB) "Kiralama kümesi" (LeaseSet) adında bir şey yayınlarsınız. "Kiralama kümesi", en basit ifadeyle, diğer I2P kullanıcılarının gizli hizmetinizin I2P ağı üzerinde "nerede" olduğunu keşfetmesi için gerek duyduğu şeydir. Gizli hizmetinize ulaşmak için kullanılabilecek tünelleri tanımlayan "Kiralamalar" ve istemcilerin iletileri şifreleyeceği hedefinizin genel anahtarını içerir. Bu tür bir gizli servise adrese sahip olan herkes erişebilir. Büyük olasılıkla şu anda en yaygın kullanım şekli budur.

source: Sometimes, you might not want to allow your hidden services to be accessible by anyone, though. Some people use hidden services as a way of accessing an SSH server on a home PC, or to stitch together a network of IOT Devices. In these cases it's not necessary, and may be counter-productive, to make your hidden service accessible to everyone one the I2P Network. This is where "Encrypted LeaseSets" come into play.
pt_br: Às vezes, você pode não querer permitir que seus serviços ocultos sejam acessíveis por qualquer um, no entanto. Algumas pessoas usam serviços ocultos como uma forma de acessar um servidor SSH em um PC doméstico, ou para costurar uma rede de dispositivos IOT. Nesses casos, não é necessário, e pode ser contraproducente, tornar seu serviço oculto acessível a todos na rede I2P. É aqui que os "Encrypted LeaseSets" entram em cena.
tr: Yine de bazen gizli hizmetlerinize kimsenin erişmesini istemeyebilirsiniz. Bazı insanlar, bir ev bilgisayarındaki SSH sunucusuna erişmek veya bir IOT aygıtı ağını bir araya getirmek için gizli hizmetleri kullanır. Bunun gibi durumlarda, gizli hizmetinizi I2P ağındaki herkesin erişimine açmanız gerekmez ve istenmez. Bu aşamada "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) devreye girer.

source: Encrypted LeaseSets: VERY Hidden Services ------------------------------------------
pt_br: LeaseSets criptografados: serviços MUITO ocultos ------------------------------------------
tr: "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets): ÇOK Gizli Hizmetler ------------------------------------------

source: Encrypted LeaseSets are LeaseSets which are published to the NetDB in an encrypted form, where none of the Leases or public keys are visible unless the client has the keys required to decrypt the LeaseSet inside of it. Only clients you share keys with(For PSK Encrypted LeaseSets), or who share their keys with you(For DH Encrypted LeaseSets), will be able to see the destination and no one else.
pt_br: LeaseSets criptografados são LeaseSets que são publicados no NetDB em um formato criptografado , onde nenhum dos Leases ou chaves públicas são visíveis a menos que o cliente tenha as chaves necessárias para descriptografar o LeaseSet dentro dele. Apenas clientes com os quais você compartilha chaves (para LeaseSets criptografados PSK), ou que compartilham suas chaves com você (para LeaseSets criptografados DH), poderão ver o destino e mais ninguém.
tr: "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSet), "Ağ veri tabanında" (NetDB) şifrelenmiş olarak yayınlanan "Kiralama kümeleridir" (LeaseSets). İstemci, içinde "Kiralama kümesi" (LeaseSet) şifresini çözmek için gereken anahtarlara sahip olmadıkça, kiralamaların veya herkese açık anahtarların hiçbiri görünmez. Yalnızca anahtarlarını paylaştığınız (PSK "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) için) veya anahtarlarını sizinle paylaşan (Diffie-Helman "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) için) istemciler hedefi görebilir, başka kimse göremez.

source: I2P Supports several strategies for Encrypted LeaseSets. The key characteristics of each strategy are important to understand when deciding which one to use. If an Encrypted LeaseSet uses a "Pre-Shared Key(PSK)" strategy, then the server will generate a key(or keys) which the server operator then shares with each client. Of course, this exchange must happen out-of-band, possibly via an exchange on IRC for example. This version of Encrypted LeaseSets is sort of like logging into Wi-Fi with a password. Except, what you're logging into is a Hidden Service.
pt_br: O I2P suporta várias estratégias para Encrypted LeaseSets. As principais características de cada estratégia são importantes para entender ao decidir qual usar. Se um Encrypted LeaseSet usa uma estratégia de "Pre-Shared Key (PSK)", então o servidor irá gerar uma chave(s) que o operador do servidor então compartilha com cada cliente. Claro, essa troca deve acontecer fora da banda, possivelmente por meio de uma troca no IRC, por exemplo. Esta versão do Encrypted LeaseSets é meio que como fazer login no Wi-Fi com uma senha. Exceto que o que você está fazendo login é um Hidden Service.
tr: I2P, "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) için çeşitli stratejileri destekler. Hangisini kullanacağınıza karar verirken her stratejinin temel özelliklerini anlamanız önemlidir. Bir "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) bir "önceden paylaşılan anahtar (PSK)" stratejisi kullanıyorsa, sunucu, sunucu işletmecisinin daha sonra her istemciyle paylaşacağı bir anahtar (veya anahtarlar) üretir. Bu alışverişin, örneğin IRC üzerindeki bir alışveriş şeklinde, bant dışında yapılması gerektiğini unutmayın. "Şifrelenmiş kiralama kümelerinin" (EncryptedLeaseSets) bu sürümü, bir parola ile Wi-Fi bağlantısı oturumu açmak gibidir. Yalnızca oturum açtığınız şey bir gizli hizmettir.

source: If an Encrypted LeaseSet uses a "Diffie-Hellman(DH) strategy, then they keys are generated on the client instead. When a Diffie-Hellman client connects to a destination with an Encrypted LeaseSet, they must first share their keys with the server operator. The server operator then decides whether to authorize the DH client. This version of Encrypted LeaseSets is sort of like SSH with an `authorized_keys` file. Except, what you're logging into is a Hidden Service.
pt_br: Se um LeaseSet Criptografado usar uma estratégia "Diffie-Hellman(DH) , então as chaves serão geradas no cliente. Quando um cliente Diffie-Hellman se conecta a um destino com um LeaseSet Criptografado, ele deve primeiro compartilhar suas chaves com o operador do servidor. O operador do servidor então decide se autoriza o cliente DH. Esta versão do LeaseSet Criptografado é como SSH com um arquivo `authorized_keys`. Exceto que o que você está logando é um Serviço Oculto.
tr: Bir "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) bir Diffie-Hellman stratejisi kullanıyorsa, anahtarlar istemci tarafında üretilir. Bir Diffie-Hellman istemcisi bir "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) ile bir hedefe bağlandığında, önce anahtarlarını sunucu işletmecisi ile paylaşmalıdır. Daha sonra sunucu işletmecisi Diffie-Helman istemcisine yetki verip vermeyeceğine karar verir. "Şifrelenmiş kiralama kümelerinin" (EncryptedLeaseSets) bu sürümü bir "authorized_keys" dosyası kullanan SSH bağlantısına benzer.

source: By Encrypting your LeaseSet, you not only make it impossible for unauthorized users to connect to your destination, you make it impossible for unauthorized visitors to even discover the real destination of the I2P Hidden Service. Some readers have probably already considered a use-case for their own Encrypted LeaseSet.
pt_br: Ao criptografar seu LeaseSet, você não apenas torna impossível que usuários não autorizados se conectem ao seu destino, como também torna impossível que visitantes não autorizados descubram o destino real do I2P Hidden Service. Alguns leitores provavelmente já consideraram um caso de uso para seu próprio LeaseSet criptografado.
tr: "Kiralama kümenizi" (LeaseSet) şifrelemek, yalnızca yetkisiz kullanıcıların hedefinize bağlanmasını olanaksız kılmaz, yetkisi olmayan ziyaretçilerin I2P gizli hizmetinin gerçek hedefini keşfetmesini bile olanaksız kılar. Bazı okuyucular şimdiden kendi şifrelenmiş "Kiralama kümeleri" (LeaseSet) için bir kullanım senaryosu düşünmüş olabilir.

source: Using Encrypted LeaseSets to Safely Access a Router Console -----------------------------------------------------------
pt_br: Usando LeaseSets criptografados para acessar com segurança um console de roteador --------------------------------------------------------------------------
tr: Bir yöneltici panosuna güvenle erişmek için "Şifrelenmiş kiralama kümelerini" (EncryptedLeaseSets) kullanmak ----------------------------------------------------------------

source: As a general rule, the more complex information a service has access to about your device, the more dangerous it is to expose that service to the Internet or indeed, to a Hidden Service network like I2P. If you want to expose such a service, you need to protect it with something like a password, or, in the case of I2P, a much more thorough and secure option could be an Encrypted LeaseSet.
pt_br: Como regra geral, quanto mais informações complexas um serviço tem acesso sobre seu dispositivo, mais perigoso é expor esse serviço à Internet ou de fato, a uma rede de Serviços Ocultos como o I2P. Se você quiser expor tal serviço , você precisa protegê-lo com algo como uma senha, ou, no caso do I2P, uma opção muito mais completa e segura poderia ser um LeaseSet Criptografado.
tr: Genel bir kural olarak, bir hizmetin aygıtınıza erişimi ne kadar karmaşıksa, o hizmeti İnternete veya gerçekten de I2P gibi bir gizli hizmet ağına açmak o kadar tehlikelidir. Böyle bir hizmeti açmak istiyorsanız, parola gibi bir şeyle korumanız gerekir. I2P kullanıyorsanız çok daha kapsamlı ve güvenli bir seçenek "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) olabilir.

source: **Before continuing, please read and understand that if you do the following** **procedure without an Encrypted LeaseSet, you will be defeating the security of** **your I2P router. Do not configure access to your router console over I2P without** **an Encrypted LeaseSet. Additionally, do not share your Encrypted LeaseSet PSK's** **with any devices you do not control.**
pt_br: **Antes de continuar, leia e entenda que se você fizer o seguinte** **procedimento sem um Encrypted LeaseSet, você estará derrotando a segurança do** **seu roteador I2P. Não configure o acesso ao console do seu roteador por I2P sem** **um Encrypted LeaseSet. Além disso, não compartilhe seus Encrypted LeaseSet PSKs** **com nenhum dispositivo que você não controle.**
tr: **İlerlemeden önce lütfen iyi okuyun ve anlayın aşağıdaki yöntemi "Şifrelenmiş** **Kiralama kümesi" (EncryptedLeaseSet) kullanmadan uygularsanız, I2P yönelticinizin** **güvenliğini zayıflatmış olursunuz. Bir "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet)** **olmadan yöneltici panonuza I2P üzerinden erişim yapılandırmayın. Ayrıca "Şifrelenmiş** **kiralama kümesi" (EncryptedLeaseSet) PSK anahtarlarınızı kontrol edemeyeceğiniz hiçbir** **aygıtla paylaşmayın.**

source: One such service which is useful to share over I2P, but ONLY with an Encrypted LeaseSet, is the I2P router console itself. Exposing the I2P router console on one machine to I2P with an Encrypted LeaseSet allows another machine with a browser to administer the remote I2P instance. I find this useful for remotely monitoring my regular I2P Services. It could also be used to monitor a server which is used to seed a torrent long-term as a way to access I2PSnark.
pt_br: Um desses serviços que é útil para compartilhar sobre I2P, mas SOMENTE com um LeaseSet criptografado, é o próprio console do roteador I2P. Expor o console do roteador I2P em uma máquina para I2P com um LeaseSet criptografado permite que outra máquina com um navegador administre a instância I2P remota. Acho isso útil para monitorar remotamente meus serviços I2P regulares. Também pode ser usado para monitorar um servidor que é usado para semear um torrent a longo prazo como uma forma de acessar o I2PSnark.
tr: I2P üzerinden paylaşmak için yararlı olan, ancak YALNIZCA "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) ile kullanılan böyle bir hizmet, I2P yöneltici panosunun kendisidir. Bir bilgisayardaki I2P yöneltici panosunu "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) ile I2P ağına açmak, başka bir bilgisayarın uzak I2P kopyasını tarayıcı üzerinden yönetmesini sağlar. Bu durumu, normal I2P hizmetlerimi uzaktan izlemek için yararlı buluyorum. Ayrıca, I2PSnark uygulamasına erişmenin bir yolu olarak, uzun vadeli bir torrent tohumlamak amacıyla kullanılan bir sunucuyu izlemek için de kullanılabilir.

source: For as long as it takes to explain them, setting up an Encrypted LeaseSet is straightforward to configure via the Hidden Services Manager UI.
pt_br: Embora seja necessário explicá-los, configurar um Encrypted LeaseSet é simples de configurar por meio da interface do usuário do Hidden Services Manager.
tr: Onlara açıklamak gerektiğinde, bir "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet), gizli hizmetler yöneticisi kullanıcı arayüzü aracılığıyla kolayca yapılandırılabilir.

source: On the "Server" ---------------
pt_br: No "Servidor" ---------------
tr: "Sunucu" üzerinde ---------------

source: Start by opening the Hidden Services Manager at http://127.0.0.1:7657/i2ptunnelmgr and scroll to the bottom of the section that says "I2P Hidden Services." Create a new hidden service with the host "127.0.0.1" and the port "7657" with these "Tunnel Cryptography Options" and save the hidden service.
pt_br: Comece abrindo o Hidden Services Manager em http://127.0.0.1:7657/i2ptunnelmgr e role até o final da seção que diz "I2P Hidden Services". Crie um novo serviço oculto com o host "127.0.0.1" e a porta "7657" com estas "Tunnel Cryptography Options" e salve o serviço oculto.
tr: http://127.0.0.1:7657/i2ptunnelmgr adresinden gizli hizmetler yöneticisini açarak başlayın ve "I2P gizli hizmetleri" yazan bölümün en altına gidin. "Tünel şifreleme ayarları" bölümünden "127.0.0.1" sunucu adresi ve "7657" bağlantı noktası ile yeni bir gizli hizmet oluşturun ve kaydedin.

source: Then, select your new tunnel from the Hidden Services Manager main page. The Tunnel Cryptography Options should now include your first Pre-Shared Key. Copy this down for the next step, along with the Encrypted Base32 Address of your tunnel.
pt_br: Em seguida, selecione seu novo túnel na página principal do Hidden Services Manager. As Tunnel Cryptography Options agora devem incluir sua primeira Pre-Shared Key. Copie isso para a próxima etapa, junto com o Encrypted Base32 Address do seu túnel .
tr: Ardından, gizli hizmetler yöneticisi ana sayfasından yeni tünelinizi seçin. Tünel şifreleme ayarlarında şimdi ilk önceden paylaşılan anahtarınız bulunmalıdır. Bunu bir sonraki adım için tünelinizin şifrelenmiş Base32 adresi ile birlikte kopyalayın.

source: On the "Client" ---------------
pt_br: No "Cliente" ---------------
tr: "İstemci" üzerinde ---------------

source: Now switch computers to the client which will connect to the hidden service, and visit the Keyring Configuration at http://127.0.0.1:7657/configkeyring to add the keys from earlier. Start by pasting the Base32 from the Server into the field labeled: "Full destination, name, Base32, or hash." Next, paste the Pre-Shared Key from the server into the "Encryption Key" field. Click save, and you're ready to securely visit the Hidden Service using an Encrypted LeaseSet.
pt_br: Agora troque os computadores para o cliente que se conectará ao serviço oculto, e visite a Configuração do Keyring em http://127.0.0.1:7657/configkeyring para adicionar as chaves de antes. Comece colando o Base32 do Servidor em o campo rotulado: "Destino completo, nome, Base32 ou hash." Em seguida, cole a Chave Pré-Compartilhada do servidor no campo "Chave de Criptografia". Clique em salvar, e você estará pronto para visitar com segurança o Serviço Oculto usando um LeaseSet Criptografado .
tr: Şimdi gizli hizmete bağlanacak istemci bilgisayara geçin ve daha önceki anahtarları eklemek için http://127.0.0.1:7657/configkeyring adresindeki anahtarlık yapılandırmasını ziyaret edin. Base32 değerini sunucudan "Tam hedef, ad, Base32 veya karma" etiketli alana yapıştırarak başlayın. Ardından, sunucunun önceden paylaşılan anahtarını "Şifreleme anahtarı" alanına yapıştırın. "Kaydet" üzerinde tıkladığınızda, gizli hizmeti "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) kullanarak güvenli bir şekilde ziyaret etmeye hazırsınız.

source: Now You're Ready to Remotely Administer I2P -------------------------------------------
pt_br: Agora você está pronto para administrar o I2P remotamente -------------------------------------------
tr: Artık I2P Gizli Hizmetini Uzaktan Yönetmeye Hazırsınız -------------------------------------------

source: As you can see, I2P offers unique capabilities to Hidden Service Administrators which empower them to securely manage their I2P connections from anywhere in the world. Other Encrypted LeaseSets I keep on the same device for the same reason point to the SSH server, the Portainer instance I user to manage my service containers, and my personal NextCloud instance. With I2P, truly private, always reachable Self-Hosting is an achievable goal, in fact I think it's one of the things we're uniquely suited to, because of Encrypted LeaseSets. With them, I2P could become the key to securing self-hosted home automation or simply become the backbone of a new more private peer-to-peer web.
pt_br: Como você pode ver, o I2P oferece recursos exclusivos para administradores de serviços ocultos que os capacitam a gerenciar com segurança suas conexões I2P de qualquer lugar do mundo. Outros LeaseSets criptografados que mantenho no mesmo dispositivo pelo mesmo motivo apontam para o servidor SSH, a instância do Portainer que uso para gerenciar meus contêineres de serviço e minha instância pessoal do NextCloud. Com o I2P, verdadeiramente privado, sempre acessível, a auto-hospedagem é uma meta alcançável, na verdade, acho que é uma das coisas para as quais somos exclusivamente adequados, por causa dos LeaseSets criptografados. Com eles, o I2P poderia se tornar a chave para garantir a automação residencial auto-hospedada ou simplesmente se tornar a espinha dorsal de uma nova web ponto a ponto mais privada.
tr: Gördüğünüz gibi, I2P, gizli hizmet yöneticilerine, I2P bağlantılarını dünyanın her yerinden güvenli bir şekilde yönetmelerini sağlayan benzersiz özellikler sunar. Aynı nedenle aynı aygıtta tuttuğum diğer "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) SSH sunucusunu, hizmet kapsayıcılarımı yönetmek için kullandığım Portainer kopyasını ve kişisel NextCloud kopyamı gösteriyor. I2P ile, gerçekten özel, her zaman ulaşılabilir kişisel barındırma, ulaşılabilir bir hedeftir. Aslında, "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) sayesinde benzersiz şekilde uygun olduğumuz şeylerden biri olduğunu düşünüyorum. Bunlarla birlikte, I2P, kişisel barındırılan ev otomasyonunu güvence altına almanın anahtarı olabilir veya basitçe yeni, daha özel bir eşler arası internet kavramının bel kemiği haline gelebilir.

source: Improving I2P Adoption and Onboarding using Jpackage, I2P-Zero
pt_br: Melhorando a adoção e integração do I2P usando Jpackage, I2P-Zero
tr: JPackage, I2P-Zero kullanarak I2P uyumluluk ve hazırlığını iyileştirmek

source: Versatile and emerging ways of installing and embedding I2P in your application
pt_br: Formas versáteis e emergentes de instalar e incorporar I2P em sua aplicação
tr: I2P ağını uygulamanıza kurmanın ve yerleştirmenin çeşitli ve gelişmekte olan yolları

source: For the majority of I2P's existence, it's been an application that runs with the help of a Java Virtual Machine that is already installed on the platform. This has always been the normal way to distribute Java applications, but it leads to a complicated installation procedure for many people. To make things even more complicated, the "right answer" to making I2P easy to install on any given platform might not be the same as any other platform. For example, I2P is quite simple to install with standard tools on Debian and Ubuntu based operating systems, because we can simply list the required Java components as "Required" by our package, however on Windows or OSX, there is no such system allowing us to make sure that a compatible Java is installed.
pt_br: Durante a maior parte da existência do I2P, ele tem sido uma aplicação que funciona com a ajuda de uma Máquina Virtual Java que já está instalada na plataforma. Isso sempre foi o modo normal de distribuir aplicativos Java, mas leva a um procedimento de instalação complicado para muitas pessoas. Para complicar ainda mais, a "resposta certa" para tornar o I2P fácil de instalar em qualquer plataforma específica pode não ser a mesma que em qualquer outra plataforma. Por exemplo, o I2P é bastante simples de instalar com ferramentas padrão em sistemas operacionais baseados em Debian e Ubuntu, posso simplesmente listar os componentes Java necessários como "Requerido" pelo nosso pacote, no entanto, no Windows ou OSX, não existe tal sistema que nos permita ter certeza de que um Java compatível está instalado.
tr: I2P varlığının çoğu, platformda zaten kurulu olan bir Java sanal makinesi yardımıyla çalışan bir uygulama olmuştur. Bu her zaman, Java uygulamalarını dağıtmanın normal yolu olmuştur, ancak birçok kişi için karmaşık olan bir kurulum yöntemi gerektirir. İşleri daha da karmaşık hale getirmek için, I2P uygulamasını herhangi bir platform üzerine kurmayı kolaylaştırmanın "doğru yanıtı" diğer platformlarla aynı olmayabilir. Örneğin, Debian ve Ubuntu tabanlı işletim sistemlerinde standart araçlarla I2P kurulumu oldukça basittir, çünkü gerekli Java bileşenlerini paketimiz için "Gerekli" olarak listeleyebiliriz, ancak Windows veya macOS için uyumlu bir Java kurulumu olduğundan emin olmamızı sağlamak için bize bu şekilde izin veren bir sistem yoktur. .

source: The obvious solution would be to manage the Java installation ourselves, but this used to a problem in-and-of-itself, outside of the scope of I2P. However, in recent Java versions, a new set of options has emerged which has the potential to solve this problem for many Java software. This exciting tool is called **"Jpackage."**
pt_br: A solução óbvia seria gerenciar a instalação do Java nós mesmos, mas isso costumava ser um problema em si, fora do escopo do I2P. No entanto, em versões recentes do Java, um novo conjunto de opções surgiu com o potencial de resolver esse problema para muitos softwares Java. Essa ferramenta empolgante é chamada **"Jpackage."**
tr: Açık çözüm, Java kurulumunu kendimizin yönetmesi olacaktır. Ancak bu, I2P kapsamı dışında, başlı başına bir sorundu. Son Java sürümlerinde, birçok Java yazılımı için bu sorunu çözme potansiyeline sahip bir dizi yeni seçenek ortaya çıktı. Bu heyecan verici araca **"JPackage"** deniyor.
