Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: I2P fascinates me because it’s agnostic. Anyone can run anything on I2P as long as it talks TCP or UDP - and can handle some latency. Really: “the network is the computer” and the communication is truly private according to the current state of knowledge.
pt_br: O I2P me fascina porque é agnóstico. Qualquer um pode executar qualquer coisa no I2P desde que fale TCP ou UDP - e possa lidar com alguma latência. Sério: “a rede é o computador” e a comunicação é verdadeiramente privada de acordo com o estado atual do conhecimento.
tr: I2P beni büyülüyor çünkü agnostik. TCP ya da UDP ile konuştuğu sürece herkes I2P üzerinde herhangi bir şeyi çalıştırabilir ve biraz gecikmeyle başa çıkabilir. Gerçekten: “ağ bilgisayardır” ve iletişim, var olan bilgi düzeyine göre gerçekten gizlidir.

source: Who is DIVA for?
pt_br: Para quem é o DIVA?
tr: DIVA kimler içindir?

source: DIVA gets actively developed and therefore the project is for researchers, software developers, communicators (writers, illustrators…) and for people who want to learn really new stuff in the area of distributed technology.
pt_br: O DIVA é desenvolvido ativamente e, portanto, o projeto é para pesquisadores, desenvolvedores de software, comunicadores (escritores, ilustradores…) e para pessoas que querem aprender coisas realmente novas na área de tecnologia distribuída.
tr: DIVA aktif olarak geliştiriliyor. Bu nedenle araştırmacılar, yazılım geliştiriciler, iletişimciler (yazarlar, çizerler…) ve dağıtılmış teknoloji alanında gerçekten yeni şeyler öğrenmek isteyen insanlar için.

source: Once DIVA grows up - please don’t ask me when - DIVA will be a fully distributed, self-hosted bank for everyone.
pt_br: Quando o DIVA crescer - por favor, não me pergunte quando - o DIVA será um banco totalmente distribuído e auto-hospedado para todos.
tr: DIVA büyüdüğünde - lütfen ne zaman diye sormayın - DIVA herkes için tamamen dağıtılmış, kendi kendine barındırılan bir banka olacak.

source: Can you tell me about what DIVA does?
pt_br: Você pode me contar o que a DIVA faz?
tr: DIVA ne yapar anlatabilir misiniz?

source: As said, DIVA will be a fully distributed, self-hosted bank for everyone. “Banking” means: savings, payments, investments, loans - so all that stuff everybody is doing everyday. Please note in this context: DIVA works without any central infrastructure and DIVA will never - as long as I have something to say - be a coin or token. There can’t be any central business model involved. If a transaction creates fees because a node of the distributed infrastructure did some work, then these fees remain at the node which did the work.
pt_br: Como dito, DIVA será um banco totalmente distribuído e auto-hospedado para todos. “Banco” significa: poupança, pagamentos, investimentos, empréstimos - então todas essas coisas que todo mundo faz todos os dias. Observe neste contexto: DIVA funciona sem nenhuma infraestrutura central e DIVA nunca será - enquanto eu tiver algo a dizer - uma moeda ou token. Não pode haver nenhum modelo de negócio central envolvido. Se uma transação cria taxas porque um nó da infraestrutura distribuída fez algum trabalho, então essas taxas permanecem no nó que fez o trabalho.
tr: Söylendiği gibi, DIVA herkes için tamamen dağıtılmış, kendi kendine barındırılan bir banka olacak. "Bankacılık" şu anlama geliyor: tasarruflar, ödemeler, yatırımlar, krediler - yani herkesin her gün yaptığı şeyler. Lütfen bu bağlamda unutmayın: DIVA herhangi bir merkezi altyapı olmadan çalışır ve DIVA asla - söyleyecek bir şeyim olduğu sürece - bir coin veya sanal para olmayacaktır. Herhangi bir merkezi iş modeli söz konusu olamaz. Bir işlem, dağıtılmış altyapının bir düğümü bazı işler yaptığı için ücret oluşturuyorsa, bu ücretler işi yapan düğümde kalır.

source: Why a “bank”? Because financial liberty and autonomy is key to live a good and peaceful life and to be able to make all those smaller and larger daily decisions in freedom. Therefore people shall own their small and secure technology components to do whatever they like to do without being nudged.
pt_br: Por que um “banco”? Porque a liberdade financeira e a autonomia são essenciais para viver uma vida boa e pacífica e para poder tomar todas essas decisões diárias menores e maiores em liberdade. Portanto, as pessoas devem possuir seus pequenos e seguros componentes de tecnologia para fazer o que quiserem fazer sem serem pressionadas.
tr: Neden bir "banka"? Çünkü finansal özgürlük ve özerklik, iyi ve barışçıl bir yaşam sürmenin ve tüm bu küçük ve büyük günlük kararları özgürce alabilmenin anahtarıdır. Bu nedenle insanlar, istedikleri her şeyi dürtülmeden yapmak için küçük ve güvenli teknoloji bileşenlerine sahip olacaklardır.

source: Well, say hello to DIVA, based on I2P.
pt_br: Bem, diga olá para DIVA, baseado em I2P.
tr: I2P kullanan DIVA platformuna merhaba deyin.

source: What are your upcoming goals? What are your stretch goals?
pt_br: Quais são suas próximas metas? Quais são suas metas de extensão?
tr: Kısa ve uzun vadeli hedefleriniz nelerdir?

source: There is a very close goal: understanding the impact of SSU2 which has been lately implemented in I2P. This is a technical goal for the next few weeks.
pt_br: Há uma meta muito próxima: entender o impacto do SSU2 que foi recentemente implementado no I2P. Este é um objetivo técnico para as próximas semanas.
tr: Çok yakın bir hedefimiz var: Geçenlerde I2P üzerine eklenen SSU2 iletişim kuralının etkisini anlamak. Önümüzdeki birkaç hafta için teknik hedefimiz bu.

source: Then, probably this year: some cryptocurrency transactions using DIVA on testnets. Please don’t forget: DIVA is a research project and people shall be motivated to do their own stuff with DIVA - the way they need it. We don’t run any infrastructure or alike for others except some transparent test networks to increase the knowledge and wisdom of everyone. It’s recommended to stay in touch with DIVA via social networks (`twitter.com/@DigitalValueX <http://twitter.com/@DigitalValueX>`__) or chats to be inspired what to do with DIVA.
pt_br: Então, provavelmente este ano: algumas transações de criptomoeda usando DIVA em testnets. Por favor, não se esqueça: DIVA é um projeto de pesquisa e as pessoas devem ser motivadas a fazer suas próprias coisas com DIVA - do jeito que elas precisam . Não executamos nenhuma infraestrutura ou similar para outros, exceto algumas redes de teste transparentes para aumentar o conhecimento e a sabedoria de todos. É recomendado manter contato com DIVA via redes sociais (`twitter.com/@DigitalValueX <http://twitter.com/@DigitalValueX>`__) ou chats para se inspirar no que fazer com DIVA.
tr: Ardından, büyük olasılıkla bu yıl: Deneme ağlarında DIVA kullanan bazı kripto para işlemleri. Lütfen unutmayın: DIVA bir araştırma projesidir ve insanlar DIVA ile kendi işlerini gerek duydukları şekilde yapmaya motive edilecektir. Herkesin bilgisini ve bilgeliğini artırmak için bazı şeffaf deneme ağları dışında başkaları için herhangi bir altyapı veya benzeri bir şey işletmiyoruz. DIVA ile ne yapacağınızdan ilham almak için sosyal ağlar (`twitter.com/@DigitalValueX <http://twitter.com/@DigitalValueX>`__) ya da sohbetler üzerinden DIVA ile bağlantıda kalmanızı öneririm.

source: I also want to touch an important part for the I2P community: DIVA is based on divachain - which is then based on I2P. Divachain is a very generic fully distributed storage layer. So, just as an example: if some I2P developer believes that a fully distributed, trustless DNS would be a great idea - well, that’s yet another use case of divachain. Fully distributed - no trust needed - all anonymous.
pt_br: Também quero tocar em uma parte importante para a comunidade I2P: DIVA é baseado em divachain - que é então baseado em I2P. Divachain é uma camada de armazenamento totalmente distribuída muito genérica. Então, apenas como um exemplo: se algum desenvolvedor I2P acredita que um DNS totalmente distribuído e confiável seria uma ótima ideia - bem, esse é mais um caso de uso de divachain. Totalmente distribuído - nenhuma confiança necessária - tudo anônimo.
tr: Ayrıca I2P topluluğu için önemli bir parçaya da değinmek istiyorum: DIVA, I2P kullanan divachain kullanıyor. Divachain, çok genel, tamamen dağıtılmış bir depolama katmanıdır. Yani, yalnızca bir örnek olarak: Bazı I2P geliştiricileri, tamamen dağıtılmış, güvenilir olmayan bir DNS hizmetinin harika bir fikir olacağına inanıyorsa, bu da, başka bir divachain kullanımıdır. Tamamen dağıtılmış, güvenmek gerekmeyen, tamamen anonim.

source: What are some of the other services and contributions you are responsible for?
pt_br: Quais são alguns dos outros serviços e contribuições pelos quais você é responsável?
tr: Sorumlu olduğunuz ve katkıda bulunduğunuz başka hizmetler var mı?

source: DIVA.EXCHANGE - which is the open association developing DIVA - runs a reseed server for I2P since a few years. So probably almost every I2P user got somehow in touch with us in the past. Just a note: the DIVA.EXCHANGE reseed server is also available as .onion service - so I2P bootstrapping can be done via the tor network - which is, at least from my perspective, an additional protection layer while entering the network.
pt_br: A DIVA.EXCHANGE - que é a associação aberta que desenvolve a DIVA - opera um servidor de re-seed para I2P há alguns anos. Então, provavelmente quase todo usuário do I2P entrou em contato conosco de alguma forma no passado. Apenas uma nota: o servidor de re-seed DIVA.EXCHANGE também está disponível como serviço .onion - portanto, o bootstrap do I2P pode ser feito por meio da rede tor - que é, pelo menos na minha perspectiva, uma camada de proteção adicional ao entrar na rede.
tr: DIVA platformunu geliştiren açık dernek olan DIVA.EXCHANGE - birkaç yıldan beri I2P için bir yeniden tohumlama sunucusu işletiyor. Yani büyük olasılıkla her I2P kullanıcısı geçmişte bir şekilde bizimle iletişim kurmuştur. Bir not: DIVA.EXCHANGE yeniden tohumlama sunucusu .onion hizmeti olarak da kullanılabilir - ve I2P ön yüklemesi Tor ağı üzerinden yapılabilir - Böylece, en azından benim bakış açıma göre, ağa girerken ek bir koruma katmanı sağlanmış olur.

source: DIVA has also created an I2P SAM library. So developers can create any modern application based on I2P. It’s on github and getting more and more popular: `github.com/diva-exchange/i2p-sam/ <http://github.com/diva-exchange/i2p-sam/>`__. It’s complete, well documented and offers lots of examples.
pt_br: A DIVA também criou uma biblioteca I2P SAM. Assim, os desenvolvedores podem criar qualquer aplicativo moderno baseado em I2P. Está no github e está ficando cada vez mais popular: `github.com/diva-exchange/i2p-sam/ <http://github.com/diva-exchange/i2p-sam/>`__. É completo, bem documentado e oferece muitos exemplos.
tr: DIVA ayrıca bir I2P SAM kitaplığı oluşturmuştur. Böylece geliştiriciler, I2P alt yapısına dayalı herhangi bir modern uygulama oluşturabilir. Github üzerinde bulunuyor ve giderek daha popüler oluyor: `github.com/diva-exchange/i2p-sam/ <http://github.com/diva exchange/i2p-sam/>`__. Eksiksiz, iyi belgelenmiş ve birçok örnek sunuyor.

source: What are some of the priorities you think that anyone who wants to contribute to the I2P network should consider?
pt_br: Quais são algumas das prioridades que você acha que qualquer pessoa que queira contribuir para a rede I2P deve considerar?
tr: I2P ağına katkıda bulunmak isteyenlerin dikkate alması gerektiğini düşündüğünüz öncelikler nelerdir?

source: Run your I2P node. Take a look at the different flavours, like Docker versions of I2Pd, or other installs available for multiple operating systems. There are several flavours available and it’s important to be comfortable with the local installation and configuration.
pt_br: Execute seu nó I2P. Dê uma olhada nos diferentes sabores, como as versões Docker do I2Pd, ou outras instalações disponíveis para vários sistemas operacionais . Há vários sabores disponíveis e é importante estar confortável com a instalação e configuração local.
tr: I2P düğümünüzü işletin. I2Pd Docker sürümlerine ya da birden çok işletim sistemi için kullanılabilen diğer kurulumlar gibi farklı çeşitlerine göz atın. Farklı çeşitler bulunuyor ve yerel kurulum ile yapılandırma konusunda rahat hissetmek önemli.

source: Then: think about your skills - networking skills, programming skills, communication skills? I2P offers lots of interesting challenges: people with networking skills might want to run a reseed server - they are very important to the network. Programmers might help with the Go, C++ or Java version of I2P. And communicators are always needed: talking about I2P from an objective and realistic perspective is helping a lot. Every little bit is great.
pt_br: Então: pense sobre suas habilidades - habilidades de rede, habilidades de programação, habilidades de comunicação? O I2P oferece muitos desafios interessantes: pessoas com habilidades de rede podem querer executar um servidor de reseed - elas são muito importantes para a rede. Programadores podem ajudar com a versão Go, C++ ou Java do I2P. E comunicadores são sempre necessários: falar sobre I2P de uma perspectiva objetiva e realista está ajudando muito. Cada pedacinho é ótimo.
tr: Ardından: Becerilerinizi düşünün. Ağ oluşturma becerileri, programlama becerileri, iletişim becerileri? I2P çok sayıda ilginç zorluk sunuyor: Ağ oluşturma becerisine sahip kişiler yeniden tohumlama sunucusu işletmek isteyebilir. Bunlar ağ için çok önemlidir. Programcılar, I2P Go, C++ ya da Java sürümünün geliştirilmesine yardımcı olabilir. Ve iletişimcilere her zaman gerek var: I2P hakkında nesnel ve gerçekçi bir bakış açısıyla konuşmak çok yardımcı oluyor. Her küçük katkı harika olur.

source: Last but not least: if you are a researcher or student - please get in touch with us at DIVA.EXCHANGE or the I2P team - research work is important for I2P.
pt_br: Por último, mas não menos importante: se você é um pesquisador ou estudante, entre em contato conosco na DIVA.EXCHANGE ou com a equipe do I2P - o trabalho de pesquisa é importante para o I2P.
tr: Son olarak, bir araştırmacı ya da öğrenciyseniz, lütfen bizimle DIVA.EXCHANGE ya da I2P ekibi üzerinden iletişime geçin. I2P için araştırma çalışmaları önemlidir.

source: Where do you see the conversation and outlook on tools like I2P now?
pt_br: Onde você vê a conversa e a perspectiva sobre ferramentas como o I2P agora?
tr: I2P gibi araçlarla ilgili konuşmalar ve görünüm hakkında ne düşünüyorsunuz?

source: Probably I have to say something about the outlook: I2P is important to everyone. I hope that the I2P community - developers, communicators, etc. - remains motivated by the few which deeply appreciate their hard work on truly challenging technology.
pt_br: Provavelmente eu tenho que dizer algo sobre a perspectiva: I2P é importante para todos. Espero que a comunidade I2P - desenvolvedores, comunicadores, etc. - permaneça motivada pelos poucos que apreciam profundamente seu trabalho duro em tecnologias realmente desafiadoras.
tr: Görünüm hakkında şunu söylemeliyim: I2P herkes için önemlidir. Umarım I2P topluluğu, geliştiriciler, iletişimciler gibi kişiler, zorlu teknolojiler üzerindeki sıkı çalışmalarını derinden ve gerçekten takdir eden birkaç kişiden motivasyon bulmayı sürdürür

source: I hope that more and more developers see the benefit to develop software based on I2P. Because this would create more use cases for end users. Then I also hope, that the core I2P programs remain simple and become maybe even more de-coupled. Let me make an example what I mean with “de-coupled”: user interfaces probably should not be baked into applications by developers - because there are front end designers which do have great knowledge and years of experience. Developers should just create an API, like a unix or websocket or a REST interface, so that other services can use the program the way they want it. This makes developers and end users happy.
pt_br: Espero que mais e mais desenvolvedores vejam o benefício de desenvolver software baseado em I2P. Porque isso criaria mais casos de uso para usuários finais. Então também espero que os principais programas I2P permaneçam simples e se tornem talvez até mais desacoplados. Deixe-me dar um exemplo do que quero dizer com “desacoplados”: interfaces de usuário provavelmente não devem ser incorporadas em aplicativos por desenvolvedores - porque há designers de front-end que têm grande conhecimento e anos de experiência. Os desenvolvedores devem apenas criar uma API, como um unix ou websocket ou uma interface REST, para que outros serviços possam usar o programa da maneira que quiserem. Isso deixa desenvolvedores e usuários finais felizes.
tr: Umarım daha fazla geliştirici, I2P üzerine yazılım geliştirmenin faydasını görür. Böylece, son kullanıcılar için daha fazla kullanım seçeneği sağlanır. Bu olduğunda, temel I2P programlarının basit kalmasını ve belki de daha da ayrıştırılmış hale gelmesini umuyorum. "Ayrıştırılmış" ile ne demek istediğime bir örnek vereyim: Kullanıcı arayüzleri geliştiriciler tarafından uygulamalara dönüştürülmemelidir, çünkü büyük bilgiye ve yılların deneyimine sahip ön uç tasarımcıları var. Geliştiriciler, diğer hizmetlerin programı istedikleri şekilde kullanabilmesi için unix ya da websocket ya da REST arabirimi gibi bir API oluşturmalıdır. Böylece, geliştiriciler ve son kullanıcılar mutlu olur.

source: Can you tell me a bit about your own I2P workflow? What are your own use cases?
pt_br: Você pode me contar um pouco sobre seu próprio fluxo de trabalho I2P? Quais são seus próprios casos de uso ?
tr: Bana biraz kendi I2P iş akışınızdan bahseder misiniz? Kendi kullanım alanlarınız nelerdir?

source: I am a developer, tester and researcher. So I need all my stuff in containers to remain flexible. I2Pd is running in 1..n containers on multiple systems to serve stuff like: feeding reseed requests, serving the diva.i2p test website, running parts of the DIVA I2P test network - see testnet.diva.exchange and I also have containers to serve my local browsers as a combined I2P and Tor proxy.
pt_br: Sou um desenvolvedor, testador e pesquisador. Então preciso de todas as minhas coisas em contêineres para permanecer flexível. O I2Pd está sendo executado em contêineres 1..n em vários sistemas para servir coisas como: alimentar solicitações de reseed, servir o site de teste diva.i2p, executar partes da rede de teste DIVA I2P - veja testnet.diva.exchange e também tenho contêineres para servir meus navegadores locais como um proxy I2P e Tor combinado.
tr: Ben bir geliştirici, denemeci ve araştırmacıyım. Bu yüzden esnek olabilmek için her şeyi koyabileceğim kapsayıcılara gerek duyuyorum. I2Pd, aşağıdaki gibi şeylere hizmet etmek için birden fazla sistemde 1..n kapsayıcılarında çalışır: Yeniden tohumlama isteklerini karşılama, diva.i2p deneme sitesine hizmet etme, DIVA I2P deneme ağının parçalarını çalıştırma (testnet.diva.exchange adresine bakabilirsiniz) ve ayrıca yerel tarayıcılarıma birleşik bir I2P ve Tor vekil sunucusu olarak hizmet etme.

source: How can the I2P community support your work?
pt_br: Como a comunidade I2P pode apoiar seu trabalho?
tr: I2P topluluğu çalışmalarınızı nasıl destekleyebilir?

source: We are on social media, like `twitter.com/@DigitalValueX <http://twitter.com/@DigitalValueX>`__ - so follow us there. Additionally we would love to see even more involvement on `github.com/diva-exchange <http://github.com/diva-exchange>`__ - it already got more and more attention in the past months. Thanks a lot for that!
pt_br: Estamos nas redes sociais, como `twitter.com/@DigitalValueX <http://twitter.com/@DigitalValueX>`__ - então siga-nos lá. Além disso, adoraríamos ver ainda mais envolvimento em `github.com/diva-exchange <http://github.com/diva-exchange>`__ - isso já recebeu mais e mais atenção nos últimos meses. Muito obrigado por isso!
tr: Sosyal ağ üzerinde `twitter.com/@DigitalValueX <http://twitter.com/@DigitalValueX>`__ adresindeyiz. Bizi oradan izleyebilirsiniz. Ayrıca, `github.com/diva-exchange <http://github.com/diva-exchange>`__ adresinden daha fazla katılım görmeyi çok isteriz. Son aylarda artan bir ilgi görüyor. Bunun için çok teşekkürler!

source: Glossary Of Key Terms
pt_br: Glossário de termos-chave
tr: Anahtar Terimler Sözlüğü

source: I2P Terms
pt_br: Termos I2P
tr: I2P Terimleri

source: Reseed hosts are needed to for bootstrapping, that is, providing the initial set of I2P nodes for your I2P node to talk to. Depending on the status of your node it may need to bootstrap every now and then if many of the nodes it knows of aren’t contactable.
pt_br: Os hosts de reseed são necessários para bootstrapping, ou seja, fornecer o conjunto inicial de nós I2P para seu nó I2P conversar. Dependendo do status do seu nó, ele pode precisar fazer bootstrap de vez em quando se muitos dos nós que ele conhece não forem contatáveis.
tr: Ön yükleme için, yani I2P düğümünüzün konuşması için ilk I2P düğümleri kümesini sağlamak amacıyla yeniden tohumlama sunucularına gerek vardır. Düğümünüzün durumuna bağlı olarak, bildiği düğümlerin çoğuna ulaşılamıyorsa, ara sıra ön yükleme yapması gerekebilir.

source: Reseeding is done over an encrypted connection and all of the bootstrap information is signed by the reseed host you connect to, making it impossible for an unauthenticated source to provide you with false information.
pt_br: A reseed é feita por meio de uma conexão criptografada e todas as informações de bootstrap são assinadas pelo host de reseed ao qual você se conecta, tornando impossível que uma fonte não autenticada forneça informações falsas .
tr: Yeniden tohumlama, şifrelenmiş bir bağlantı üzerinden yapılır ve tüm ön yükleme bilgileri, bağlandığınız yeniden tohumlama sunucusu tarafından imzalanır. Böylece, kimliği doğrulanmamış bir kaynağın size yanlış bilgi vermesi olanaksız olur.

source: Node/Peer
pt_br: Nó/Par
tr: Düğüm/Eş

source: A node or peer is part of a network of computers sharing resources. When you download and install I2P, you participate in routing traffic for others. Every person using I2P is a node or peer. In some cases. people can supply more bandwidth or resources than others to the network. However, peer diversity is important and the more people who use I2P, the stronger the network becomes. When it comes to setting up your node, you can customize and configure your connection and workflow with the I2P network.
pt_br: Um nó ou peer é parte de uma rede de computadores que compartilham recursos. Quando você baixa e instala o I2P, você participa do roteamento de tráfego para outros. Cada pessoa que usa o I2P é um nó ou peer. Em alguns casos, as pessoas podem fornecer mais largura de banda ou recursos do que outras para a rede. No entanto, a diversidade de peers é importante e quanto mais pessoas usam o I2P, mais forte a rede se torna. Quando se trata de configurar seu nó, você pode personalizar e configurar sua conexão e fluxo de trabalho com a rede I2P.
tr: Bir düğüm veya eş, kaynakları paylaşan bir bilgisayar ağının parçasıdır. I2P uygulamasını indirip kurduğunuzda, başkaları için yöneltme trafiğine katılırsınız. I2P kullanan her kişi bir düğüm veya eştir. Bazı durumlarda. insanlar ağa diğerlerinden daha fazla bant genişliği veya kaynak sağlayabilir. Ancak, eş çeşitliliği önemlidir ve I2P uygulamasını ne kadar çok kişi kullanırsa, ağ o kadar güçlü olur. Düğümünüzü kurmaya gelince, I2P ağı ile bağlantınızı ve iş akışınızı özelleştirebilir ve yapılandırabilirsiniz.

source: I2Pd is a C++ implementation of the I2P protocol is differs from the I2P Java software in the following ways:
pt_br: I2Pd é uma implementação C++ do protocolo I2P que difere do software Java I2P das seguintes maneiras:
tr: I2Pd, I2P iletişim kuralının bir C++ uygulamasıdır ve I2P Java yazılımından şu konularda farklıdır:
