Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Increase probability of rekeying to EdDSA
pt_br: Aumentar a probabilidade de redigitação para EdDSA
tr: EdDSA yeniden anahtarlama olasılığı artırıldı

source: Detect for broken ECDSA support in Gentoo
pt_br: Detectar suporte ECDSA quebrado no Gentoo
tr: Gentoo üzerinde bozuk ECDSA desteğinin algılanması sağlandı

source: Console: Add a Java 6 warning, this is the last release to support Java 6
pt_br: Console: Adicione um aviso do Java 6, esta é a última versão com suporte ao Java 6
tr: Pano: Java 6 uyarısı eklendi. Bu sürüm, Java 6 destekleyen son sürüm

source: Changes to prepare for Java 9 compatibility
pt_br: Alterações para preparar a compatibilidade com o Java 9
tr: Java 9 uyumluluğuna hazırlanmak için değişiklikler yapıldı

source: Pass Accept-Encoding header through client and server proxies, to allow end-to-end compression
pt_br: Passe o cabeçalho Accept-Encoding pelos proxies do cliente e do servidor para permitir a compactação de ponta a ponta
tr: Uçtan uca sıkıştırmayı sağlamak için Accept-Encoding üst bilgisinin istemci ve sunucu vekil sunucuları üzerinden geçmesi sağlandı

source: Increase piece size, piece count, and file count limits
pt_br: Aumente o tamanho da peça, a contagem de peças e os limites de contagem de arquivos
tr: Parça boyutu, parça sayısı ve dosya sayısı sınırları artırıldı

source: Save added and completed times
pt_br: Salvar tempos adicionados e concluídos
tr: Eklenme ve tamamlanma süreleri kaydedildi

source: Save magnet parameters across restart
pt_br: Salvar parâmetros do ímã ao reiniciar
tr: Yeniden başlatmalar arasında magnet parametreleri kaydedildi

source: Don't delete .torrent file on errors at startup, rename to .torrent.BAD
pt_br: Não exclua o arquivo .torrent em caso de erros na inicialização, renomeie para .torrent.BAD
tr: Başlangıç hatalarında .torrent dosyasının silinmesi engellendi, .torrent.BAD olarak yeniden adlandırıldı

source: Add recheck, start, stop buttons on details pages
pt_br: Adicionar botões de nova verificação, início e parada nas páginas de detalhes
tr: Ayrıntılar sayfalarına yeniden denetle, başlat, durdur düğmeleri eklendi

source: Add option to disable "smart sort"
pt_br: Adicionar opção para desabilitar "classificação inteligente"
tr: "Akıllı sıralamayı" devre dışı bırakma seçeneği eklendi

source: Speed up IP address validation
pt_br: Acelere a validação do endereço IP
tr: IP adresi doğrulaması hızlandırıldı

source: Separate streaming blacklists for ECDSA and EdDSA
pt_br: Listas negras de streaming separadas para ECDSA e EdDSA
tr: ECDSA ve EdDSA için akış kara listeleri ayrıldı

source: ============ CCC Recap ============
pt_br: ============ Recapitulação do CCC ============
tr: ============ CCC özeti ============

source: Attending: Sadie, Colin, lazygravy, zzz, hottuna, kytv, cacapo, and eche|on.
pt_br: Presentes: Sadie, Colin, lazygravy, zzz, hottuna, kytv, cacapo e eche|on.
tr: Katılanlar: Sadie, Colin, lazygravy, zzz, hottuna, kytv, cacapo ve eche|on.

source: Start ===== The project has had another successful year at CCC. We would like to thank the volunteers at `32C3`__ for all of their help in organizing this event and for being accommodating hosts for us. Many I2P contributors were able to attend this year's Congress due to many of the generous donations from supporters like you to the project. If you would like to fund I2P, please see `our donation page`__ for more information.
pt_br: Início ===== O projeto teve mais um ano de sucesso no CCC. Gostaríamos de agradecer aos voluntários do `32C3`__ por toda a ajuda na organização deste evento e por serem anfitriões acolhedores para nós. Muitos colaboradores do I2P puderam comparecer ao Congresso deste ano devido a muitas das generosas doações de apoiadores como você para o projeto. Se você gostaria de financiar o I2P, consulte `nossa página de doações`__ para mais informações.
tr: Başlangıç ===== Proje, CCC etkinliğinde başarılı bir yılı daha geride bıraktı. `32C3`__ gönüllülerine bu etkinliğin düzenlenmesindeki tüm yardımları ve ev sahiplikleri için teşekkür ederiz. Sizin gibi destekçilerin projeye yaptığı cömert bağışlar sayesinde birçok I2P katılımcısı bu yılki kongreye katılabildi. I2P projesine destek olmak istiyorsanız, ayrıntılı bilgi almak için lütfen 'bağış sayfamıza'__ bakın.

source: Just like previous years we were located in Noisy Square, located near the EFF's table. This proved to be an ideal spot for us as our table was almost always busy with current and new users who were interested in I2P, many of whom we wouldn't have otherwise had the ability to talk to.
pt_br: Assim como nos anos anteriores, estávamos localizados na Noisy Square, perto da mesa da EFF. Este provou ser um local ideal para nós, pois nossa mesa estava quase sempre ocupada com usuários atuais e novos interessados no I2P, muitos dos quais não teríamos conseguido conversar de outra forma.
tr: Önceki yıllarda olduğu gibi, EFF masasının yanında bulunan Noisy Square alanındaydık. Bu yer bizim için ideal oldu. Çünkü masamız neredeyse her zaman I2P ile ilgilenen eski ve yeni kullanıcılarla doluydu. Çoğuyla başka türlü konuşma olanağına bulamayacaktık.

source: Reseed Status =============
pt_br: Status de nova semente =============
tr: Yeniden Tohumlama Durumu ==========================

source: Let's get more reseeds!
pt_br: Vamos conseguir mais replantações!
tr: Hadi daha fazla yeniden tohumlama edinelim!

source: If you don't know what a reseed server is, it is first the connection new routers use to find peers. There was a lot of discussion around the current status of the reseed network right now. As always, more reseed operators are needed! If you would like to strengthen the reseed infrastructure, (or if you're talented with Go) email `backup -at- i2pmail.org`__.
pt_br: Se você não sabe o que é um servidor de reseed, ele é primeiramente a conexão que novos roteadores usam para encontrar pares. Houve muita discussão sobre o status atual da rede de reseed agora. Como sempre, mais operadores de reseed são necessários! Se você quiser fortalecer a infraestrutura de reseed (ou se você tem talento para Go), envie um e-mail para `backup -at- i2pmail.org`__.
tr: Yeniden tohumlama sunucusunun ne olduğunu bilmiyorsanız, yeni yönelticilerin eş bulmak için ilk kullandığı bağlantıdır. Yeniden tohumlama ağının şu andaki durumu hakkında çok fazla tartışma yapıldı. Her zaman olduğu gibi, daha fazla yeniden tohumlama işletmecisi gerekiyor! Yeniden tohumlama altyapısını güçlendirmek istiyorsanız (veya Go konusunda yetenekliyseniz) `backup -at- i2pmail.org`__ adresine e-posta gönderin.

source: Sybil Detection (beta) ======================
pt_br: Detecção de Sybil (beta) =======================
tr: Sybil Algılaması (beta) ======================

source: Due to the decentralized nature of I2P detecting Sybil attacks is not as straight forward as on other networks (i.e. Tor). To mitigate this zzz has been working on a new router-based Sybil detection tool. To be brief, the tool runs in the router, and collects information on floodfills your router is currently aware of. Currently the tool is mainly collecting a baseline and does not act on any of the information it is collecting. Expect to see a writeup on this more as 0.9.25 or 0.9.26 approaches, as it is still in active development
pt_br: Devido à natureza descentralizada do I2P, a detecção de ataques Sybil não é tão direta quanto em outras redes (por exemplo, Tor). Para mitigar isso, a zzz tem trabalhado em uma nova ferramenta de detecção Sybil baseada em roteador. Para ser breve, a ferramenta é executada no roteador e coleta informações sobre floodfills dos quais seu roteador está ciente no momento. Atualmente, a ferramenta está coletando principalmente uma linha de base e não atua em nenhuma das informações que está coletando. Espere ver uma redação sobre isso mais à medida que 0.9.25 ou 0.9.26 se aproximam, pois ainda está em desenvolvimento ativo
tr: Merkezi olmayan I2P yapısı nedeniyle Sybil saldırılarını algılamak diğer ağlarda (yani Tor üzerinde) olduğu kadar basit değildir. zzz bunu azaltmak için, yöneltici tabanlı yeni bir Sybil algılama aracı üzerinde çalışıyor. Kısaca, araç yönelticide çalışır ve yönelticinizin şu anda farkında olduğu otomatik doldurmalar hakkında bilgi toplar. Araç şu anda, temel olarak bir referans noktası topluyor ve topladığı bilgilerin hiçbirine göre hareket etmiyor. Hala geliştirme aşamasında olduğu için bu konuda 0.9.25 veya 0.9.26 yaklaşımlarnda bir yazı görmeyi bekleyin.

source: Development Meeting ===================
pt_br: Reunião de Desenvolvimento ===================
tr: Geliştirme Toplantısı ===================

source: On the 30th we held an in person `meeting`__ at our table. The meeting focused on organizationally preparing for more project management, and public relations (both from Sadie).
pt_br: No dia 30, realizamos uma `reunião` presencial__ em nossa mesa. A reunião se concentrou na preparação organizacional para mais gerenciamento de projetos e relações públicas (ambos da Sadie).
tr: 30 Aralıkta, masamızda yüz yüze bir 'toplantı'__ düzenledik. Toplantı, proje yönetimi ve halkla ilişkileri (ikisi de Sadie tarafından) geliştirmek için organize olmaya odaklandı.

source: We discussed how much of the work done on I2P is lost in the commits and there is not much to see for our users. To remedy this lazygravy plans on preparing a series of posts explaining some technical topics in I2P. The initial ideas that we discussed writing posts on are what encrypted lease sets are, why different tunnel types are needed, and some observations seen in `I2Spy`__. But these are just the start and we would like to hear feedback on topics we should write about!
pt_br: Discutimos o quanto do trabalho feito no I2P é perdido nos commits e não há muito o que ver para nossos usuários. Para remediar isso, o lazygravy planeja preparar uma série de posts explicando alguns tópicos técnicos no I2P. As ideias iniciais que discutimos ao escrever posts são o que são conjuntos de lease criptografados, por que diferentes tipos de túneis são necessários e algumas observações vistas no `I2Spy`__. Mas isso é só o começo e gostaríamos de ouvir feedback sobre tópicos sobre os quais devemos escrever!
tr: I2P üzerinde yapılan işlerin ne kadarının gönderimler arasında kaybolduğunu ve kullanıcılarımızın göremediğini tartıştık. Bunu değiştirmek için lazygravy, I2P üzerine bazı teknik konuları açıklayan bir yazı dizisi hazırlamayı planlıyor. Üzerine yazmayı tartıştığımız ilk fikirler, "Şifrelenmiş kiralama kümelerinin" (EncryptedLeaseSets) ne olduğu, neden farklı tünel türlerine gerek duyulduğu ve `I2Spy`__ üzerindeki bazı gözlemler. Ancak bunlar yalnızca başlangıç ve yazmamız gereken konular hakkında sizlerden geri bildirim almak istiyoruz!

source: Meeting (Future) ================
pt_br: Reunião (Futuro) ================
tr: Toplantı (Gelecek) ================

source: There will be a `another meeting`__ on 2 Feburary 2016 to discuss:
pt_br: Haverá uma `outra reunião`__ em 2 de fevereiro de 2016 para discutir:
tr: 2 Şubat 2016 tarihinde aşağıdaki konuları görüşmek üzere bir 'başka bir toplantı'__ yapılacak:

source: Review of assigned tasks from 30 December meeting
pt_br: Revisão das tarefas atribuídas na reunião de 30 de dezembro
tr: 30 Aralık toplantısından atanan görevlerin gözden geçirilmesi

source: Project meeting plan for 2016
pt_br: Plano de reunião do projeto para 2016
tr: 2016 için proje toplantı planı

source: GMP 6 readiness
pt_br: Prontidão para GMP 6
tr: GMP 6 hazırlığı

source: A proposal for a code of conduct
pt_br: Uma proposta para um código de conduta
tr: Davranış kuralları için bir öneri

source: ============== 0.9.24 Release ==============
pt_br: ================= 0.9.24 Lançamento =================
tr: ====================== 0.9.24 sürümü yayınlandı ======================

source: 0.9.24 contains a variety of bug fixes and performance enhancements
pt_br: 0.9.24 contém uma variedade de correções de bugs e melhorias de desempenho
tr: 0.9.24 sürümü çeşitli hata düzeltmeleri ve başarım iyileştirmeleri ile yayınlandı

source: Update details
pt_br: Detalhes da atualização
tr: Güncelleme ayrıntıları

source: 0.9.24 contains a new version of SAM (v3.2) and numerous bug fixes and efficiency improvements. Note that this release is the first to require Java 7. Please update to Java 7 or 8 as soon as possible. Your router will not automatically update if you are using Java 6.
pt_br: A versão 0.9.24 contém uma nova versão do SAM (v3.2) e várias correções de bugs e melhorias de eficiência. Note que essa versão é a primeira a requerer Java 7. Por favor, atualize para o Java 7 ou 8 o mais breve possível. Seu roteador não atualizará automaticamente se você estiver usando Java 6.
tr: 0.9.24 sürümünde yeni SAM (v3.2) sürümünü ve çeşitli hata ve hızlandırma düzeltmelerini içeriyor. Bu sürümün çalışması için Java 7 gerekiyor. En kısa sürede Java 7 ya da 8 sürümüne yükseltmeyi unutmayın. Java 6 kullanıyorsanız, yönelticiniz otomatik olarak güncellenmez.

source: To prevent the problems caused by the ancient commons-logging library, we have removed it. This will cause very old I2P-Bote plugins (0.2.10 and below, signed by HungryHobo) to crash if they have IMAP enabled. The recommended fix is to replace your old I2P-Bote plugin with the current one signed by str4d. For more details, see `this post`__.
pt_br: Para evitar os problemas causados pela antiga biblioteca commons-logging, nós a removemos. Isso fará com que plugins I2P-Bote muito antigos (0.2.10 e anteriores, assinados por HungryHobo) travem se tiverem IMAP habilitado. A correção recomendada é substituir seu antigo plugin I2P-Bote pelo atual assinado por str4d. Para mais detalhes, veja `este post`__.
tr: Eski Commons-logging kitaplığının neden olduğu sorunları önlemek için onu kaldırdık. Bu durum, IMAP etkinleştirilmişse çok eski I2P-Bote uygulama eklerinin (HungryHobo tarafından imzalanmış 0.2.10 ve altı sürümlerin) çökmesine neden olur. Önerilen düzeltme, eski I2P-Bote uygulama eklerinizi str4d tarafından imzalanmış var olan uygulama ekiyle değiştirmektir. Ayrıntılı bilgi almak için `bu gönderiye`__ bakabilirsiniz.

source: We had a great `32C3 Congress`__ and are making good progress on our 2016 project plans. Echelon gave a talk on I2P's history and current status, and his slides are `available here`__ (pdf). Str4d attended `Real World Crypto`__ and gave a talk on our crypto migration, his slides are `here`__ (pdf).
pt_br: Tivemos um ótimo `32C3 Congress`__ e estamos progredindo bem em nossos planos de projeto para 2016. Echelon deu uma palestra sobre a história e o status atual do I2P, e seus slides estão `disponíveis aqui`__ (pdf). Str4d participou do `Real World Crypto`__ e deu uma palestra sobre nossa migração de criptomoedas, seus slides estão `aqui`__ (pdf).
tr: Harika bir `32C3 Kongresi`__ geçirdik ve 2016 proje planlarımızda iyi ilerleme kaydediyoruz. Echelon, I2P projesinin tarihi ve var olan durumu hakkında bir konuşma yaptı. Sunumuna 'buradan ulaşabilirsiniz'__ (pdf). Str4d `Real World Crypto`__ etkinliğine katıldı ve şifreleme geçişimiz hakkında bir konuşma yaptı. Sunumu 'burada'__ (pdf).

source: Java 7 now required
pt_br: Java 7, agora necessário
tr: Artık Java 7 gerekli

source: SAM 3.2, with several new advanced features, command parser improvements, and lots of bug fixes
pt_br: SAM 3.2, com vários novos recursos avançados, melhorias no analisador de comandos e muitas correções de bugs
tr: Birkaç yeni gelişmiş özellik, komut işleyici iyileştirmeleri ve birçok hata düzeltmesi içeren SAM 3.2 sürümüne geçildi

source: Router Family
pt_br: Família de Roteadores
tr: Yöneltici Ailesi

source: Commons logging removed
pt_br: Registro de Commons removido
tr: Commons günlüğü kaldırıldı

source: Fix HTML escaping in the console plugin table
pt_br: Corrigir escape de HTML na tabela de plug-ins do console
tr: Pano uygulama eki tablosunda kaçan HTML kodu düzeltildi

source: Fix rare deadlocks in the router
pt_br: Corrigir deadlocks raros no roteador
tr: Yönelticideki nadir kilitlenmeleri düzeltildi

source: Fix the tunnel build Bloom filter
pt_br: Corrigir o filtro Bloom da construção do túnel
tr: Tünel oluşturma Bloom süzgeci düzeltildi

source: Don't remove tunnel on next-hop failure indication from transport, it isn't reliable
pt_br: Não remova o túnel na indicação de falha do próximo salto do transporte, ele não é confiável
tr: Sonraki durak hatası belirtisinde tünelin taşıyıcıdan çıkarılması engellendi, bu güvenilir değil

source: Fix formatting in summary bar to prevent overflow
pt_br: Corrigir formatação na barra de resumo para evitar estouro
tr: Otomatik doldurmayı önlemek için özet çubuğu biçimlendirmesi düzeltildi

source: Fix console links in i2ptunnel error pages when on nonstandard host/port
pt_br: Corrigir links de console em páginas de erro do i2ptunnel quando em host/porta não padrão
tr: Standart olmayan sunucu/bağlantı noktası kullanıldığında i2ptunnel hata sayfalarındaki pano bağlantıları düzeltildi

source: Don't query floodfills whose version is too old to support encrypted replies
pt_br: Não consulte floodfills cuja versão seja muito antiga para suportar respostas criptografadas
tr: Sürümü şifrelenmiş yanıtları destekleyemeyecek kadar eski olan otomatik doldurmaların sorgulanmaması sağlandı

source: Reduce out-of-order delivery in SSU
pt_br: Reduzir entregas fora de ordem em SSU
tr: SSU üzerinde kullanım dışı aktarımlar azaltıldı

source: Fix a rare NPE in the tunnel build handler
pt_br: Corrigir um NPE raro no manipulador de construção do túnel
tr: Tünel oluşturma işleyicisinde nadir görülen bir NPE düzeltildi

source: Listen for Windows Service shutdown events to shutdown cleanly
pt_br: Ouça os eventos de desligamento do serviço do Windows para desligar corretamente
tr: Temiz bir kapanma için Windows hizmeti kapanma olaylarının dinlenmesi sağlandı

source: Fix some IPv6 issues on Windows
pt_br: Corrigir alguns problemas de IPv6 no Windows
tr: Windows üzerindeki bazı IPv6 sorunları düzeltildi

source: Change Jetty request logging from b64 to b32
pt_br: Alterar o registro de solicitação do Jetty de b64 para b32
tr: Jetty istek günlüğü b64 yerine b32 olarak değiştirildi

source: New 'family' indication in netdb, don't use two of the same family in a tunnel
pt_br: Nova indicação de 'família' no netdb, não use dois da mesma família em um túnel
tr: Yeni "Ağ veri tabanı" (NetDB) "aile" (family) göstergesi ile aynı aileden iki yönelticinin bir tünelde kullanılmaması sağlandı

source: New overview picture in SusiDNS
pt_br: Nova imagem geral no SusiDNS
tr: SusiDNS üzerinde yeni özet görseli

source: Close connection faster if it's for a rejected tunnel request
pt_br: Feche a conexão mais rápido se for para uma solicitação de túnel rejeitada
tr: Reddedilen bir tünel isteği içinse bağlantının daha hızlı kapatılması sağlandı

source: Use SSU extended options field for session request message
pt_br: Use o campo de opções estendidas do SSU para mensagem de solicitação de sessão
tr: Oturum isteği iletisi için SSU genişletilmiş seçenekler alanı kullanıldı

source: Request introduction in the SSU extended options
pt_br: Solicitar introdução nas opções estendidas do SSU
tr: SSU genişletilmiş seçeneklerine tanıtım isteği eklendi

source: Don't offer to introduce unless requested, to introduce only those that need it
pt_br: Não se ofereça para apresentar, a menos que seja solicitado, para apresentar apenas aqueles que precisam
tr: İstenmedikçe tanıtım teklifi yapılmıyor, yalnızca gerek duyanlar tanıtılıyor

source: Experimental Sybil analysis tool, requires routerconsole.advanced=true
pt_br: Ferramenta de análise experimental Sybil, requer routerconsole.advanced=true
tr: Deneysel Sybil inceleme aracı, routerconsole.advanced=true ayarının yapılmış olması gerekir

source: Persist some profile netdb stats that weren't being saved
pt_br: Persistir algumas estatísticas do perfil netdb que não estavam sendo salvas
tr: Kaydedilmeyen bazı profil "Ağ veri tabanı" (NetDB) istatistiklerinin kaydedilmesi sağlandı

source: Memory reduction and other efficiency improvements throughout
pt_br: Redução de memória e outras melhorias de eficiência em todo o processo
tr: Bellek azaltma ve diğer verimlilik iyileştirmeleri yapıldı

source: Increase several limits in i2psnark
pt_br: Aumente vários limites no i2psnark
tr: Bazı i2psnark sınırları artırıldı

source: New streaming unit tests
pt_br: Novos testes de unidade de streaming
tr: Yeni akış birimi testleri eklendi

source: Fix some SSU stats on /peers to be consistent with NTCP
pt_br: Corrigir algumas estatísticas SSU em /peers para serem consistentes com NTCP
tr: NTCP ile tutarlı olması için /peers üzerindeki bazı SSU istatistikleri düzeltildi

source: Change default sig type for new i2ptunnels to Ed25519
pt_br: Alterar o tipo de assinatura padrão para novos i2ptunnels para Ed25519
tr: Yeni i2p tünelleri için varsayılan imzalama türü Ed25519 olarak değiştirildi

source: Increase router rekey probability at startup again
pt_br: Aumentar a probabilidade de recodificação do roteador na inicialização novamente
tr: Yeniden başlatma sırasında yöneltici yeniden anahtarlama olasılığı artırıldı

source: New Chinese (Taiwan) translation
pt_br: Nova tradução para chinês (Taiwan)
tr: Çince (Tayvan) çevirisi eklendi

source: Full list of fixed bugs
pt_br: Lista completa de bugs corrigidos
tr: Düzeltilen hataların tam listesi

source: ============== 0.9.25 Release ==============
pt_br: ============== Lançamento 0.9.25 ==============
tr: ====================== 0.9.25 sürümü yayınlandı ======================

source: 0.9.25 contains SAM 3.3, QR codes, and bug fixes
pt_br: A versão 0.9.25 contém SAM 3.3, códigos QR, e correções de erros
tr: 0.9.25 sürümü SAM 3.3, QR kodları ve hata düzeltmeleri ile yayınlandı

source: 0.9.25 contains a major new version of SAM, v3.3, to support sophisticated multiprotocol applications. It adds QR codes for sharing hidden service addresses with others, and "identicon" images for visually distinguishing addresses.
pt_br: A versão 0.9.25 contém uma grande nova versão do SAM, v3.3, para dar suporte a aplicações multi protocolo sofisticadas. Ela adiciona QR codes para compartilhar endereços de serviços ocultos com os outros, e imagens "identicon" para distinguir endereços visualmente.
tr: 0.9.25 sürümünde karmaşık çoklu iletişim kuralı uygulamalarını destekleyen yeni SAM, v3.3 sürümü bulunuyor. Gizli hizmet adreslerini paylaşmak için QR kodları ve adresleri gözle ayırt edebilmek için "identicon" görselleri eklendi.

source: We've added a new "router family" configuration page in the console, to make it easier to declare that your group of routers is run by a single person. There are several changes to increase the capacity of the network and hopefully improve tunnel build success.
pt_br: Nós adicionamos uma nova página de configuração de "família do roteador" no console, para tornar mais fácil declarar que o seu grupo de roteadores é executado por uma única pessoa. Há várias mudanças para aumentar a capacidade da rede e, assim se espera, melhorar o sucesso de construção de túneis.
tr: Tek kişi tarafından işletilen bir yöneltici grubunu daha kolay belirtmek için panoya yeni "yöneltici ailesi" yapılandırma bölümü eklendi. Ağ kapasitesini ve tünel açma başarımını arttıracak bir kaç değişiklik yapıldı.

source: Display of identicons and QR codes in address book and i2ptunnel
pt_br: Exibição de identicons e códigos QR no catálogo de endereços e i2ptunnel
tr: Adres defterinde ve i2ptunnel üzerinde tanımlayıcıların ve QR kodlarının görüntülenmesi sağlandı

source: SAM v3.3 with advanced features
pt_br: SAM v3.3 com recursos avançados
tr: Gelişmiş özelliklere sahip SAM 3.3 sürümüne geçildi
