Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Fix i2psnark bug that changed the infohash of torrents created by Robert and fetched via magnet link
pt_br: Corrigir bug do i2psnark que alterava o infohash dos torrents criados por Robert e obtidos via magnet link
tr: Robert tarafından oluşturulan ve magnet bağlantısı ile alınan torrentlerin bilgi karmasını değiştiren i2psnark hatası düzeltildi

source: Fix version checking for plugins
pt_br: Corrige a verificação de versões de extensões
tr: Uygulama eklerinin sürüm denetimi düzeltildi

source: Fix a streaming timer bug causing frequent IRC disconnects (also affects other close-on-idle tunnels)
pt_br: Corrigir um bug do temporizador de streaming que causava desconexões frequentes do IRC (também afeta outros túneis fechados em modo inativo)
tr: Sık sık IRC bağlantısının kesilmesine neden olan bir akış zamanlayıcı hatası düzeltildi (ayrıca boşta kalan diğer tünelleri de etkiler)

source: Don't install as a service on Windows by default
pt_br: Não instalar como um serviço no Windows por padrão
tr: Windows üzerinde varsayılan olarak hizmet şeklinde kurulum kaldırıldı

source: Reduce transport idle timeouts
pt_br: Reduzir os tempos limite de inatividade do transporte
tr: Taşıyıcı boşta kalma zaman aşımları azaltıldı

source: Reduce tunnels on idle in i2psnark
pt_br: Reduzir túneis em modo inativo no i2psnark
tr: i2psnark içinde boşta kalan tüneller azaltıldı

source: Change default in i2ptunnel GUI to 3 hops
pt_br: Alterar padrão na GUI do i2ptunnel para 3 saltos
tr: i2ptunnel görsel kullanıcı arayüz varsayılanı 3 durak olarak değiştirildi

source: IE 10 support
pt_br: Suporte para IE 10
tr: IE 10 desteği eklendi

source: Individual expiration times in leases, for efficiency on destinations with a high number of tunnels
pt_br: Tempos de expiração individuais em arrendamentos, para eficiência em destinos com um grande número de túneis
tr: Çok sayıda tünele sahip hedeflerin verimliliği için kiralamalara bireysel sona erme süreleri eklendi

source: Low-level encryption and XOR speedups
pt_br: Criptografia de baixo nível e acelerações XOR
tr: Düşük düzeyli şifreleme ve XOR hızlandırmaları eklendi

source: Translation updates: Chinese, French, German, Portuguese, Russian, Spanish
pt_br: Traduções atualizadas: alemão, chinês, espanhol, francês, português e russo
tr: Çeviriler güncellendi: Çince, Fransızca, Almanca, Portekizce, Rusça, İspanyolca

source: New Turkish translation
pt_br: Nova tradução para o turco
tr: Türkçe çevirisi eklendi

source: Wrapper 3.5.19 (new installs and PPA only)
pt_br: Encapsulador 3.5.19 (novas instalações e PPA apenas)
tr: Wrapper 3.5.19 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: 0.9.7.1 Release
pt_br: Lançamento da versão 0.9.7.1
tr: 0.9.7.1 sürümü yayınlandı

source: This unscheduled release disables the RouterInfo verification messages that were used in the attack published in the UCSB paper, which should make correlating a LeaseSet and a Router much more difficult. We have also included a limited number of other fixes listed below. Our 0.9.8 release, which will include IPv6 support, is still on-schedule for late September.
pt_br: Este lançamento não programado desabilita as mensagens de verificação RouterInfo que foram usadas no ataque publicado no artigo da UCSB, o que deve tornar a correlação de um LeaseSet e um Router muito mais difícil. Também incluímos um número limitado de outras correções listadas abaixo. Nosso lançamento 0.9.8, que incluirá suporte a IPv6, ainda está programado para o final de setembro.
tr: Bu planlanmamış sürümde, UCSB belgesinde yayınlanan saldırıda kullanılan "Yöneltici bilgileri" (RouterInfo) doğrulama iletileri devre dışı bırakıldı. Böylece bir "Kiralama kümesi" (LeaseSet) ile bir yöneltici arasında ilişki kurulması çok daha zor hale getirildi. Ayrıca aşağıda listesini görebileceğiniz sınırlı sayıda başka düzeltmeler de yapıldı. IPv6 desteği sunacak 0.9.8 sürümünün, Eylül ayı sonlarında yayınlanması planlanıyor.

source: As usual, we recommend that all users update to this release.
pt_br: Como de costume, recomendamos que todos os usuários atualizem para esta versão.
tr: Her zamanki gibi, tüm kullanıcıların bu sürüme güncellemesini öneririz.

source: Disable RouterInfo verification messages
pt_br: Desabilitar mensagens de verificação do RouterInfo
tr: "Yöneltici bilgileri" (RouterInfo) doğrulama iletileri devre dışı bırakıldı

source: Extend inbound tunnel expiration
pt_br: Estender a expiração do túnel de entrada
tr: Geliş tüneli sona erme süresi uzatıldı

source: i2prouter: bashism fix
pt_br: i2prouter: correção do bashism
tr: i2prouter: bashism düzeltildi

source: i2psnark: increase max piece size, mime type updates
pt_br: i2psnark: aumentar o tamanho máximo da peça, atualizações do tipo mime
tr: i2psnark: en büyük parça boyutu artırıldı, MIME türü güncellemeleri yapıldı

source: New reseed host
pt_br: Novo host repropagador
tr: Yeni yeniden tohumlama sunucusu eklendi

source: New update hosts, thanks Meeh and dg
pt_br: Novos hosts de atualização, obrigado Meeh e dg
tr: Meeh ve dg sayesinde yeni güncelleme sunucuları eklendi

source: Streaming: RTO changes
pt_br: Transmissão: mudanças no RTO
tr: Akış: RTO değişimleri

source: Updater: Increase update-via-torrent to 30 percent
pt_br: Atualizador: Aumentar atualização via torrent para 30 por cento
tr: Güncelleyici: Torrent ile güncelleme yüzde otuza çıkarıldı

source: UPnP fix for some hardware
pt_br: Correção UPnP para alguns hardwares
tr: Bazı donanımlar için UPnP düzeltmesi yapıldı

source: 0.9.8 Release
pt_br: Lançamento da versão 0.9.8
tr: 0.9.8 sürümü yayınlandı

source: 0.9.8 includes the long-awaited support for IPv6. It's enabled by default, but of course you need a public IPv6 address to use it. Configuration is on the 'network' configuration tab in your console. We also have anonymity improvements including padding of SSU packets and longer router private keys.
pt_br: 0.9.8 inclui o tão esperado suporte para IPv6. Ele é habilitado por padrão, mas é claro que você precisa de um endereço IPv6 público para usá-lo. A configuração está na aba de configuração 'rede' no seu console. Também temos melhorias de anonimato, incluindo preenchimento de pacotes SSU e chaves privadas de roteador mais longas.
tr: 0.9.8 sürümünde, uzun zamandır beklenen IPv6 desteği bulunuyor. IPv6 varsayılan olarak etkin, ancak doğal olarak kullanmak için herkese açık bir IPv6 adresiniz olmalı. Panodaki 'ağ' yapılandırma sekmesinden yapılandırılabilir. Ayrıca, SSU paketlerinin doldurulması ve daha uzun yöneltici özel anahtarları gibi bazı anonimlik geliştirmeleri de yapıldı.

source: 30%(pc)s of you will update via in-network torrent in this update cycle.
pt_br: 30%(pc)s de vocês atualizarão via torrent na rede neste ciclo de atualização.
tr: Bu güncelleme döngüsünde, ağ 30%(pc)s oranında ağ içi torrent ile güncellenecek.

source: IPv6 Details
pt_br: Detalhes sobre o IPv6
tr: IPv6 Ayrıntıları

source: IPv6 is enabled and preferred by default. If you have a public IPv6 address and you are connecting to another router with a published IPv6 address, it will connect via IPv6. There is a new IPv6 configuration section on /confignet in the router console. If IPv6 is causing problems you may disable it there.
pt_br: O IPv6 é habilitado e preferido por padrão. Se você tem um endereço IPv6 público e está se conectando a outro roteador com um endereço IPv6 publicado, ele se conectará via IPv6. Há uma nova seção de configuração IPv6 em /confignet no console do roteador. Se o IPv6 estiver causando problemas, você pode desabilitá-lo lá.
tr: IPv6 seçeneği varsayılan olarak etkin ve yeğlenen olarak ayarlandı. Herkese açık bir IPv6 adresiniz varsa ve yayınlanmış bir IPv6 adresi bulunan başka bir yöneltici ile bağlantı kuruyorsanız, bağlantı IPv6 üzerinden kurulur. Yöneltici panosunda /confignet üzerine yeni bir IPv6 yapılandırma bölümü eklendi. IPv6 kullanmak sorunlara neden olursa, bu bölümnden devre dışı bırakabilirsiniz.

source: As a part of the IPv6 development effort, I2P now supports multiple published IP addresses. If you have multiple public IP addresses (IPv4, IPv6, or both), you may enable or disable them individually on /confignet. The default is to use the first IPv4 and IPv6 addresses it discovers. If you have multiple addresses you should review the configuration on /confignet and adjust it if necessary. Note that while you may enable multiple IPv4 and IPv6 addresses on /confignet, we recommend that you use only one IPv4 and one IPv6 address. There are bugs still to be fixed with multiple addresses of each type.
pt_br: Como parte do esforço de desenvolvimento do IPv6, o I2P agora suporta múltiplos endereços IP publicados. Se você tiver múltiplos endereços IP públicos (IPv4, IPv6, ou ambos), você pode habilitá-los ou desabilitá-los individualmente em /confignet. O padrão é usar os primeiros endereços IPv4 e IPv6 que ele descobrir. Se você tiver múltiplos endereços, você deve revisar a configuração em /confignet e ajustá-la se necessário. Observe que, embora você possa habilitar múltiplos endereços IPv4 e IPv6 em /confignet, recomendamos que você use apenas um endereço IPv4 e um IPv6. Há bugs ainda a serem corrigidos com múltiplos endereços de cada tipo.
tr: IPv6 geliştirme çalışmalarının bir parçası olarak, I2P üzerinde artık birden çok IP adresinin yayınlanması destekleniyor. Birden fazla herkese açık IP adresiniz varsa (IPv4, IPv6 veya ikisi de), /confignet üzerinde bunları ayrı ayrı etkinleştirebilir veya devre dışı bırakabilirsiniz. Varsayılan olarak, keşfedilen ilk IPv4 ve IPv6 adresi kullanılır. Birden fazla adresiniz varsa /confignet yapılandırmasını gözden geçirmeli ve gerekirse ayarlamalısınız. /confignet üzerinde birden çok IPv4 ve IPv6 adresini etkinleştirebilseniz de, yalnızca bir IPv4 ve bir IPv6 adresi kullanmanız önerilir. Birden fazla adres kullanımında hala düzeltilmesi gereken her türden hata bulunuyor.

source: While IPv6 support was designed and developed over several years, it has only been tested by a limited number of users and is still beta. If you do have a public IPv6 address, please monitor your router and the logs for problems, and disable it necessary. Please report any bugs on http://trac.i2p2.i2p.
pt_br: Embora o suporte a IPv6 tenha sido projetado e desenvolvido ao longo de vários anos, ele foi testado apenas por um número limitado de usuários e ainda é beta. Se você tiver um endereço IPv6 público, monitore seu roteador e os logs para problemas, e desabilite-o, se necessário. Por favor, relate quaisquer bugs em http://trac.i2p2.i2p.
tr: IPv6 desteği birkaç yıldır tasarlanıp geliştiriliyor olsa da, yalnızca sınırlı sayıda kullanıcı tarafından denenmiştir ve hala beta sürümüdür. Herkese açık bir IPv6 adresiniz varsa, lütfen sorun olup olmadığını görmek için yönelticinizi ve günlükleri izleyin ve gerekli görürseniz devre dışı bırakın. Lütfen hataları http://trac.i2p2.i2p adresinden bildirin.

source: Rekeying Details
pt_br: Detalhes de recodificação
tr: Yeniden Anahtarlama Ayrıntıları

source: For those of you running I2P on faster hardware (generally, 64-bit x86) the router will generate a new identity using longer keys. This will substantially reduce your participating traffic for 48 hours or more, while your router re-integrates into the network. Due to the new keys, the large number of torrent updates, and the recent network growth, we expect substantial disruption to the network for a week or more after the update is released. Please be patient and things should start to improve after a few days.
pt_br: Para aqueles que executam I2P em hardware mais rápido (geralmente, 64 bits x86), o roteador gerará uma nova identidade usando chaves mais longas. Isso reduzirá substancialmente seu tráfego participante por 48 horas ou mais, enquanto seu roteador se reintegra à rede. Devido às novas chaves, ao grande número de atualizações de torrent e ao recente crescimento da rede, esperamos uma interrupção substancial na rede por uma semana ou mais após o lançamento da atualização. Seja paciente e as coisas devem começar a melhorar depois de alguns dias.
tr: Daha hızlı donanım üzerinde (genellikle 64-bit x86) I2P çalıştıranlar için, yöneltici daha uzun anahtarlar kullanarak yeni bir kimlik oluşturur. Böylece yönelticiniz ağ ile yeniden bütünleşirlken, katılımcı trafiğiniz 48 saat veya daha uzun bir süre önemli ölçüde azalır. Yeni anahtarlar, çok sayıda torrent güncellemesi ve yakın zamandaki ağ büyümesi nedeniyle, güncellemenin yayınlanmasından sonra ağda bir hafta veya daha uzun süreli bir önemli kesinti olmasını bekliyoruz. Lütfen sabırlı olun. İşler birkaç gün sonra düzelmeye başlayacak.

source: These changes may result in higher CPU usage for some of you. We're doing our best to increase efficiency, but stronger security generally requires more computation. Performance may also be poor during the first week due to the network churn. We will evaluate the network performace before deciding whether to change the key length on slower hardware in a future release.
pt_br: Essas mudanças podem resultar em maior uso da CPU para alguns de vocês. Estamos fazendo o nosso melhor para aumentar a eficiência, mas uma segurança mais forte geralmente requer mais computação. O desempenho também pode ser ruim durante a primeira semana devido à rotatividade da rede. Avaliaremos o desempenho da rede antes de decidir se alteraremos o comprimento da chave em hardware mais lento em uma versão futura.
tr: Bu değişiklikler, bazılarınız için daha yüksek istemci kullanımına neden olabilir. Verimliliği artırmak için elimizden gelenin en iyisini yapıyoruz. Ancak daha güçlü güvenlik genellikle daha fazla hesaplama gerektiriyor. Ağ dalgalanması nedeniyle ilk hafta boyunca başarım da zayıf olabilir. Gelecekteki bir sürümde, daha yavaş donanımlarda anahtar uzunluğunu değiştirip değiştirmemeye karar vermeden önce ağ başarımını değerlendireceğiz.

source: We are experiencing rapid network growth in the last few weeks, which is causing a bit of a bumpy ride for some, especially on weekends. However, the network is still performing fairly well, so keep spreading the word.
pt_br: Estamos vivenciando um rápido crescimento da rede nas últimas semanas, o que está causando um pouco de dificuldade para alguns, especialmente nos fins de semana. No entanto, a rede ainda está com um desempenho razoavelmente bom, então continue espalhando a palavra.
tr: Son birkaç haftadır hızlı bir ağ büyümesi yaşıyoruz ve bu da özellikle hafta sonları bazılarınız için biraz inişli çıkışlı bir deneyime neden oluyor. Ancak, ağ başarımı hala oldukça iyi. Bu yüzden I2P uygulamasını duyurmayı sürdürün.

source: More Changes Coming
pt_br: Mais mudanças estão a caminho
tr: Yaklaşan Değişiklikler

source: We're in the initial stages of desiging major changes to strengthen our crypto. Stronger crypto will use more CPU and it may possibly require a Java 7 JRE at a minimum. We understand your desire to run I2P on low-power and/or older hardware. We're working hard to minimize the impacts, but some loss of performance is inevitable. In addition, Java 5 and 6 are no longer supported by Oracle. Now is a good time to upgrade to Java 7. Any change in minimum requirements will be announced well in advance.
pt_br: Estamos nos estágios iniciais de projetar grandes mudanças para fortalecer nossa criptografia . Uma criptografia mais forte usará mais CPU e pode possivelmente exigir um Java 7 JRE no mínimo. Entendemos seu desejo de executar o I2P em hardware de baixo consumo e/ou mais antigo. Estamos trabalhando duro para minimizar os impactos, mas alguma perda de desempenho é inevitável. Além disso, Java 5 e 6 não são mais suportados pela Oracle. Agora é um bom momento para atualizar para o Java 7. Qualquer alteração nos requisitos mínimos será anunciada com bastante antecedência.
tr: Şifrelemeyi güçlendirmek için büyük değişiklikler tasarlamanın ilk aşamalarındayız. Daha güçlü şifreleme, daha fazla işlemci kullanacak ve büyük olasılıkla en az Java 7 JRE isteyecek. I2P' uygulamasını düşük güçlü ve/veya daha eski donanımlarda çalıştırma isteğinizi anlıyoruz ve etkileri en aza indirmek için çok çalışıyoruz. Ancak başarımın bir miktar düşmesi kaçınılmaz. Ayrıca Java 5 ve 6 artık Oracle tarafından desteklenmiyor. Şimdi Java 7 sürümüne yükseltmek için iyi bir zaman. En düşük gereksinimlerde yapılacak herhangi bir değişikliği önceden duyuracağız.

source: New Website
pt_br: Novo website
tr: Yeni site

source: After a heroic effort by str4d, the new website preview is available at http://i2hq.srv.i2p2.de. We hope to see it go live at https://geti2p.net and http://www.i2p2.i2p soon. Please contribute to the new website translations on Transifex, especially the website_priority resource.
pt_br: Após um esforço heróico de str4d, uma prévia do novo website encontra-se em http://i2hq.srv.i2p2.de. Esperamos vê-lo em breve em https://geti2p.net e http://www.i2p2.i2p. Por favor, contribua traduzindo o novo website no Transifex, em especial o recurso website_priority.
tr: str4d tarafından harcanan kahramanca çabalardan sonra, yeni site ön izlemesi http://i2hq.srv.i2p2.de adresinde yayınlandı. Yakında https://geti2p.net ve http://www.i2p2.i2p adreslerinde canlı yayında görmeyi umuyoruz. Lütfen, özellikle website_priority kaynağı olmak üzere, Transifex üzerindeki yeni site çevirilerine katkıda bulunun.

source: Community Participation
pt_br: Participação da Comunidade
tr: Topluluk Katılımı

source: In early August, hottuna and zzz attended DEFCON 21 in Las Vegas. Last weekend, echelon attended the CTS IV conference in Berlin and psi attended the Tahoe-LAFS hackfest at GNU 30 in Cambridge, Mass. Several of us will be at 30C3 in Hamburg late this year. It's great to see people participating at these events and representing I2P.
pt_br: No início de agosto, hottuna e zzz compareceram à DEFCON 21 em Las Vegas. No último final de semana, echelon compareceu à conferência CTS IV em Berlim e psi compareceu ao hackfest Tahoe-LAFS no GNU 30 em Cambridge, Massachusetts. Vários de nós estaremos na 30C3 em Hamburgo no final deste ano. É ótimo ver pessoas participando desses eventos e representando o I2P.
tr: Ağustos ayının başlarında, hottuna ve zzz Las Vegas'taki DEFCON 21 etkinliğine katıldı. Geçen hafta sonu, echelon Berlin'deki CTS IV konferansına katıldı ve psi Cambridge, Mass'taki GNU 30 toplantısındaki Tahoe-LAFS hackfest etkinliğine katıldı. Birçoğumuz bu yılın sonlarında Hamburg'da 30C3 etkinliğinde olacağız. Bu etkinliklere katılan ve I2P projesini temsil eden insanları görmek harika.

source: IPv6 support for both NTCP and SSU
pt_br: Suporte de IPv6 para ambos NTCP e SSU
tr: NTCP ve SSU için IPv6 desteği

source: SSU protocol obfuscation by adding random padding
pt_br: Ofuscação do protocolo SSU pela adição de preenchimento aleatório
tr: Rastgele dolgu ekleyerek SSU iletişim kuralında karıştırma eklendi

source: Longer encryption and DH private keys for users on faster platforms
pt_br: Criptografia mais longa e chaves privadas DH para usuários em plataformas mais rápidas
tr: Daha hızlı platformlardaki kullanıcılar için daha uzun şifreleme ve Diffie-Hellman özel anahtarları eklendi

source: Fix I2PTunnel / I2CP locking and duplicates (partial)
pt_br: Corrigir bloqueio e duplicatas do I2PTunnel / I2CP (parcial)
tr: I2PTunnel / I2CP kilitlemesi ve kopyaları düzeltildi (kısmen)

source: Fix translation of HTTP proxy error pages
pt_br: Corrige traduções das páginas de erros do proxy HTTP
tr: HTTP vekil sunucu hata sayfalarının çevirisi düzeltildi

source: Fix occasional runtime exception in NTCP
pt_br: Corrige ocasional exceção de ciclo de execução no NTCP
tr: NTCP üzerinde ara sıra görülen çalışma zamanı istisnası sorunu düzeltildi

source: Big rework of transport code to accommodate multiple addresses and IPv6
pt_br: Grande reformulação do código de transporte para acomodar vários endereços e IPv6
tr: Birden fazla adres ve IPv6 kullanımı için taşıyıcı kodu büyük ölçüde yeniden yazıldı

source: Streaming: Improved recovery from lost acks, other fixes
pt_br: Streaming: Recuperação aprimorada de acks perdidos, outras correções
tr: Akış: Kaybedilen onaylardan iyileştirilmiş kurtarma, diğer düzeltmeler

source: Use Transifex for translation of initial news and HTTP proxy error pages
pt_br: Usa o Transifex para a tradução de novidades iniciais e páginas de erros do proxy HTTP
tr: İlk haberlerin ve HTTP vekil sunucu hata sayfalarının çevirisi için Transifex kullanılmaya başlandı

source: Translation updates: Chinese, French, German, Portuguese, Russian, Swedish, Turkish
pt_br: Traduções atualizadas: alemão, chinês, francês, português, russo, sueco e turco
tr: Çeviriler güncellendi: Çince, Fransızca, Almanca, Portekizce, Rusça, İsveççe, Türkçe

source: New Romanian translation
pt_br: Nova tradução para o romeno
tr: Romence çevirisi eklendi

source: Wrapper 3.5.20 (new installs and PPA only)
pt_br: Encapsulador 3.5.20 (novas instalações e PPA apenas)
tr: Wrapper 3.5.20 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: 0.9.8.1 Release
pt_br: Lançamento da versão 0.9.8.1
tr: 0.9.8.1 sürümü yayınlandı

source: 0.9.8.1 fixes a problem with updating to 0.9.8 on Windows for some people. New installs and non-Windows platforms are not affected, however all platforms will automatically update even if running 0.9.8.
pt_br: 0.9.8.1 corrige um problema com a atualização para 0.9.8 no Windows para algumas pessoas. Novas instalações e plataformas não Windows não são afetadas, no entanto, todas as plataformas serão atualizadas automaticamente, mesmo se estiverem executando 0.9.8.
tr: 0.9.8.1 sürümünde, bazı kullanıcılar için Windows üzerinde 0.9.8 sürümüne güncelleme ile ilgili bir sorun giderildi. Bu sorun yeni kurulumları ve Windows dışındaki platformları etkilemez. Ancak 0.9.8 olsa bile tüm sürümler otomatik olarak güncellenir.

source: See the `Trac ticket`__ for details and workarounds. See `the 0.9.8 release notes`__ for information on IPv6 and other changes.
pt_br: Veja o `Trac ticket`__ para detalhes e soluções alternativas. Veja `the 0.9.8 release notes`__ para informações sobre IPv6 e outras mudanças.
tr: Ayrıntılar ve geçici çözümler için 'Trac kaydına'__' bakın. IPv6 ve diğer değişiklikler hakkında ayrıntılı bilgi almak için '0.9.8 sürüm notlarına'__ bakabilirsiniz.

source: Due to recent attacks, logins are disabled on `Trac`_ and new registrations are disabled on `zzz.i2p`_. Until those services are restored, please report all bugs on IRC freenode or IRC2P #i2p-dev.
pt_br: Devido a ataques recentes, os logins estão desabilitados em `Trac`_ e novos registros estão desabilitados em `zzz.i2p`_. Até que esses serviços sejam restaurados, por favor, reporte todos os bugs no IRC freenode ou IRC2P #i2p-dev.
tr: Son saldırılar nedeniyle, `Trac`_ üzerinde oturum açma ve `zzz.i2p`_ üzerinde yeni hesap açma işlemleri devre dışı bırakıldı. Bu hizmetler geri yüklenene kadar, lütfen tüm hataları IRC freenode veya IRC2P #i2p-dev üzerinden bildirin.

source: 0.9.9 Release
pt_br: Lançamento da versão 0.9.9
tr: 0.9.9 sürümü yayınlandı
