Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: We have spent the last three months working on our new UDP transport protocol "SSU2" with a small number of volunteer testers. This release completes the implementation, including relay and peer testing. We are enabling it by default for Android and ARM platforms, and a small percentage of other routers at random. This will allow us to do much more testing in the next three months, finish the connection migration feature, and fix any remaining issues. We plan to enable it for everyone in the next release scheduled for November. No manual configuration is necessary. Of course, there's the usual collection of bug fixes in this release as well. We also added an automatic deadlock detector that has already found a rare deadlock that is now fixed.
pt_br: Passamos os últimos três meses trabalhando em nosso novo protocolo de transporte UDP "SSU2" com um pequeno número de testadores voluntários. Esta versão conclui a implementação, incluindo testes de retransmissão e pares. Estamos habilitando-o por padrão para plataformas Android e ARM, e uma pequena porcentagem de outros roteadores aleatoriamente. Isso nos permitirá fazer muito mais testes nos próximos três meses, finalizar o recurso de migração de conexão, e corrigir quaisquer problemas restantes. Planejamos habilitá-lo para todos na próxima versão agendada para novembro. Nenhuma configuração manual é necessária. Claro, há a coleção usual de correções de bugs nesta versão também. Também adicionamos um detector automático de deadlock que já encontrou um deadlock raro que agora foi corrigido.
tr: Son üç ayı az sayıda gönüllü deneme kullanıcısıyla yeni UDP taşıyıcı iletişim kuralımız "SSU2" üzerinde çalışarak geçirdik. Bu sürüm, aktarıcı ve eş sınaması ile birlikte uyarlamayı tamamlıyor. Bu özellikleri Android ve ARM platformları için varsayılan olarak ve diğer yönelticilerin rastgele ve küçük bir yüzdesi için etkinleştiriyoruz. Böylece önümüzdeki üç ay içinde çok daha fazla deneme yapabileceğiz ve bağlantı taşıma özelliğini tamamlayarak kalan sorunları giderebileceğiz. Kasım ayında çıkması planlanan bir sonraki sürümde bu özelliği herkes için etkinleştirmeyi planlıyoruz. El ile herhangi bir yapılandırma gerekmiyor. Bu sürümde de her zamanki gibi bir dizi hata düzeltmesi yapıldı. Ayrıca nadiren karşılaşılan bir kilitlenmeyi engelleyecek bir otomatik kilitlenme algılayıcısı ekledik.

source: Add deadlock detector
pt_br: Adicionar detector de deadlock
tr: Kilitlenme engelleyicisi eklendi

source: Periodically send our RI to connected peers
pt_br: Enviar periodicamente nosso RI para pares conectados
tr: Bağlı eşlere düzenli olarak aktarıcı bilgilerinin iletilmesi sağlandı

source: SSU MTU/PMTU improvements and fixes
pt_br: Melhorias e correções de SSU MTU/PMTU
tr: SSU MTU/PMTU üzerinde geliştirme ve düzeltmeler yapıldı

source: SSU2 base protocol fixes and improvements
pt_br: Correções e melhorias no protocolo base SSU2
tr: SSU2 temel iletişim kuralı üzerinde geliştirme ve düzeltmeler yapıldı

source: SSU2 peer test and relay implementation
pt_br: Implementação de teste e retransmissão de pares SSU2
tr: SSU2 eş sınaması ve aktarıcısı uygulandı

source: SSU2 published address fixes
pt_br: Correções de endereço publicadas pelo SSU2
tr: SSU2 yayınlanan adresler düzeltildi

source: SSU2: Enable for Android, ARM, and a small portion of others at random
pt_br: SSU2: Habilitar para Android, ARM e uma pequena parcela de outros aleatoriamente
tr: SSU2: Android, ARM ve az sayıda diğerleri için rastgele etkinleştirildi

source: Clock: Fix deadlock after clock shift
pt_br: Relógio: Corrigir deadlock após mudança de relógio
tr: Saat: Saat sapmasından sonra kilitlenme sorunu düzeltildi

source: Debian: Apparmor profile fixes
pt_br: Debian: correções de perfil do Apparmor
tr: Debian: Apparmor profili düzeltildi

source: Don't allow family key errors to crash router
pt_br: Não permita que erros de chave familiar causem falha no roteador
tr: Yönelticinin çökmesine neden olan aile anahtarı hataları engellendi

source: Fix EC family key loading on Android
pt_br: Corrigir o carregamento da chave da família EC no Android
tr: Android üzerinde EC aile anahtarının yüklenmesi düzeltildi

source: Fix EdDSA key loading on Java 15+
pt_br: Corrigir carregamento de chave EdDSA no Java 15+
tr: Java 15+ üzerinde EdDSA anahtarının yüklenmesi düzeltildi

source: i2psnark: Fix DHT not restarting after router restart
pt_br: i2psnark: Corrigir DHT não reiniciando após reiniciar o roteador
tr: i2psnark: Yöneltici yeniden başlatıldıktan sonra yeniden başlamayan "Dağıtılmış karma tablosu" (DHT) sorunu düzeltildi

source: OSX: Prevent hangs at shutdown after dock right-click quit
pt_br: OSX: Evite travamentos no desligamento após clicar com o botão direito do mouse no dock
tr: macOS: Dock üzerine sağ tıkladıktan sonra kapatma sırasındaki kilitlenme engellendi

source: SSU: Fix publishing of MTU in addresses without IPs
pt_br: SSU: Corrigir publicação de MTU em endereços sem IPs
tr: SSU: IP olmayan adreslere MTU yayınlanması düzeltildi

source: SSU: Fix rare HMAC NPE
pt_br: SSU: Corrigir HMAC NPE raro
tr: SSU: Nadir HMAC NPE düzeltildi

source: SusiDNS CSS fixes
pt_br: Correções CSS do SusiDNS
tr: SusiDNS CSS düzeltmeleri

source: Transport: Improve processing after message delivery failure
pt_br: Transporte: Melhore o processamento após falha na entrega da mensagem
tr: Taşıyıcı: Aktarılamayan iletilerin işlenmesi iyileştirildi

source: UPnP: Don't briefly bind to all addresses at startup
pt_br: UPnP: Não vincule brevemente todos os endereços na inicialização
tr: UPnP: Başlangıçta kısa süre için tüm adresler ile bağlantı kurulması kaldırıldı

source: Set outproxy to exit.stormycloud.i2p (new installs only)
pt_br: Defina outproxy para exit.stormycloud.i2p (somente novas instalações)
tr: Çıkış vekil sunucusu olarak exit.stormycloud.i2p ayarlandı (yalnızca yeni kurulumlar için)

source: Disable SSU introductions on Android
pt_br: Desabilitar introduções SSU no Android
tr: Android üzerinde SSU bilgileri devre dışı bırakıldı

source: API version: 0.9.55
pt_br: Versão da API: 0.9.55
tr: API sürümü: 0.9.55 olarak güncellendi

source: New translation: Spanish (Argentina)
pt_br: Nova tradução: Espanhol (Argentina)
tr: Yeni çeviri: İspanyolca (Arjantin)

source: Windows Easy-Install Bundle 1.9.0 Release
pt_br: Lançamento do pacote Windows Easy-Install 1.9.0
tr: Windows kolay kurulum paketi 1.9.0 sürümü

source: Windows Easy-Install Bundle 1.9.0 - Major Stability/Compatibility Improvements
pt_br: Windows Easy-Install Bundle 1.9.0 - Principais melhorias de estabilidade/compatibilidade
tr: Windows kolay kurulum paketi 1.9.0 sürümü. Büyük kararlılık ve uyumluluk geliştirmeleri yapıldı

source: This update includes the new 1.9.0 router and major quality-of-life improvements for bundle users
pt_br: Esta atualização inclui o novo roteador 1.9.0 e grandes melhorias na qualidade de vida para usuários do pacote
tr: Bu güncellemede, yeni 1.9.0 yönelticisi ve paket kullanıcıları için önemli yaşam kalitesi iyileştirmeleri bulunuyor

source: This release includes the new I2P 1.9.0 router and is based on Java 18.02.1.
pt_br: Esta versão inclui o novo roteador I2P 1.9.0 e é baseada no Java 18.02.1.
tr: Bu sürümde, Java 18.02.1 tabanlı yeni I2P 1.9.0 yönelticisi bulunuyor.

source: The old batch scripts have been phased out in favor of a more flexible and stable solution in the jpackage itself. This should fix all bugs related to path-finding and path-quoting which were present in the batch scripts. After you upgrade, the batch scripts can be safely deleted. They will be removed by the installer in the next update.
pt_br: Os scripts de lote antigos foram eliminados em favor de uma solução mais flexível e estável no próprio jpackage. Isso deve corrigir todos os bugs relacionados a path-finding e path-quoting que estavam presentes nos scripts de lote. Após você atualizar, os scripts de lote podem ser excluídos com segurança. Eles serão removidos pelo instalador na próxima atualização.
tr: Eski toplu işlem betikleri, jpackage üzerindeki daha esnek ve kararlı bir çözümü kullanmak için aşamalı olarak kaldırıldı. Bu güncelleme, toplu işlem betiklerinde bulunan tüm yol bulma ve yol alıntılama sorunlarını düzeltmelidir. Yükseltmeden sonra, toplu işlem betikleri güvenle silinebilir. Bir sonraki güncellemede yükleyici tarafından kaldırılacaktır.

source: A sub-project for managing browsing tools has been started: i2p.plugins.firefox which has extensive capabilities for configuring I2P browsers automatically and stably on many platforms. This was used to replace the batch scripts but also functions as a cross-platform I2P Browser management tool. Contributions are welcome here: http://git.idk.i2p/idk/i2p.plugins.firefox at the source repository.
pt_br: Um subprojeto para gerenciar ferramentas de navegação foi iniciado: i2p.plugins.firefox que tem capacidades extensivas para configurar navegadores I2P automaticamente e de forma estável em muitas plataformas. Isso foi usado para substituir os scripts em lote mas também funciona como uma ferramenta de gerenciamento de navegador I2P multiplataforma. Contribuições são bem-vindas aqui: http://git.idk.i2p/idk/i2p.plugins.firefox no repositório de origem.
tr: Tarama araçlarını yönetmek için bir alt proje başlattık: I2P tarayıcılarını birçok platformda otomatik ve kararlı bir şekilde yapılandırmak için kapsamlı yeteneklere sahip i2p.plugins.firefox. Bu proje, toplu işlem betiklerini değiştirmek için kullanıldı, ancak aynı zamanda platformlar arası bir I2P tarayıcı yönetim aracı olarak da kullanılıyor. Katkılarınızı http://git.idk.i2p/idk/i2p.plugins.firefox adresindeki kaynak deposuna yapabilirsiniz. .

source: This release improves compatibility with externally-running I2P routers such as those provided by the IzPack installer and by third-party router implementations such as i2pd. By improving external router discovery it requires less of a system's resources, improves start-up time, and prevents resource conflicts from occurring.
pt_br: Esta versão melhora a compatibilidade com roteadores I2P de execução externa, como aqueles fornecidos pelo instalador IzPack e por implementações de roteadores de terceiros, como i2pd. Ao melhorar a descoberta de roteadores externos, ele requer menos recursos do sistema, melhora o tempo de inicialização e evita que conflitos de recursos ocorram.
tr: Bu sürüm, IzPack yükleyici tarafından sağlananlar gibi dışarıdan çalışan I2P yönelticileri ve i2pd gibi üçüncü taraf yöneltici uygulamaları ile uyumluluğu geliştiriyor. Dış yöneltici keşfini iyileştirerek, sistem kaynağı gereksinimi azaltıyor, başlatma süresini iyileştiriyor ve kaynak çakışmalarının oluşmasını önlüyor.

source: Besides that, the profile has been updated to the latest version of the Arkenfox profile. I2P in Private Browsing and NoScript have both been updated. The profile has been restructured in order to allow for evaluating different configurations for different threat models.
pt_br: Além disso, o perfil foi atualizado para a versão mais recente do perfil Arkenfox. I2P em Private Browsing e NoScript foram atualizados. O perfil foi reestruturado para permitir que avalie diferentes configurações para diferentes modelos de ameaças.
tr: Bunun yanı sıra profil, Arkenfox profilinin son sürümüne güncellendi. Gizli taramada I2P ve NoScript güncellendi. Profil, farklı tehdit modelleri için farklı yapılandırmaların değerlendirilmesini sağlayacak şekilde yeniden yapılandırıldı.

source: Apple Silicon Easy Install
pt_br: Instalação fácil do Apple Silicon
tr: Apple Silicon Kolay Kurulum Paketi

source: Easy Install bundle BETA for Apple Silicon Macs available
pt_br: Pacote Easy Install BETA disponível para Apple Silicon Macs
tr: Apple Silicon Mac bilgisayarlar için kolay kurulum paketinin BETA sürümü yayınlandı

source: We are pleased to offer an Easy Install BETA bundle for Mac OS running on Apple Silicon hardware. You can download it here:
pt_br: Temos o prazer de oferecer um pacote Easy Install BETA para Mac OS rodando em hardware Apple Silicon. Você pode baixá-lo aqui:
tr: Apple Silicon donanımı üzerinde çalışan macOS kolay kurulum paketinin BETA sürümünü sunmaktan mutluluk duyuyoruz. Şuradan indirebilirsiniz:

source: I2P Mac OS Easy Install bundles
pt_br: Pacotes de instalação fácil do I2P Mac OS
tr: I2P macOS kolay kurulum paketleri

source: Speed
pt_br: Velocid
tr: Hız

source: In our internal benchmarks the cryptographic operations are between 2 and 2.5 times faster than when running the Intel bundle under Rosetta.
pt_br: Em nossos benchmarks internos, as operações criptográficas são entre 2 e 2,5 vezes mais rápidas do que ao executar o pacote Intel no Rosetta.
tr: İçimizde yaptığımız karşılaştırmalı değerlendirmelerde, şifreleme işlemlerinin Intel paketinin Rosetta altında çalıştırılmasına göre 2 - 2,5 kat daha hızlı olduğunu gördük.

source: Known Issues
pt_br: Problemas conhecidos
tr: Bilinen Sorunlar

source: Quitting I2P by right-clicking on the dock icon causes I2P to freeze and a "Force Quit" is necessary. This issue will be fixed for the 1.9 release.
pt_br: Sair do I2P clicando com o botão direito no ícone do dock faz com que o I2P congele e um "Forçar Encerramento" seja necessário. Esse problema será corrigido na versão 1.9.
tr: Dock simgesine sağ tıklayarak I2P uygulamasından çıkmak, uygulamanın donmasına neden oluyor ve "Zorla Kapat" işleminin yapılması gerekiyor. Bu sorun 1.9 sürümünde düzeltilecek.

source: If you already had an Intel bundle installed on your Mac, you need to modify some settings to prevent in-network updates from reverting you to an Intel bundle. Please see the instructions on the download page.
pt_br: Se você já tinha um pacote Intel instalado no seu Mac, precisa modificar algumas configurações para evitar que atualizações na rede revertam você para um pacote Intel. Veja as instruções na página de download.
tr: Mac bilgisayarınızda önceden kurulmuş bir Intel paketi varsa, ağ içi güncellemelerin sizi yeniden Intel paketine döndürmesini önlemek için bazı ayarları değiştirmeniz gerekir. Lütfen indirme sayfasındaki yönergelere bakın.

source: Thank you for testing!
pt_br: Obrigado por testar!
tr: Deneme sürecimize yardımcı olduğunuz için teşekkürler!

source: How to Switch to the StormyCloud Outproxy Service
pt_br: Como mudar para o serviço StormyCloud Outproxy
tr: StormyCloud çıkış vekil sunucusu hizmetine nasıl geçilir

source: A New, Professional Outproxy
pt_br: Um novo proxy profissional
tr: Yeni, profesyonel bir çıkış vekil sunucusu

source: For years, I2P has been served by a single default outproxy, `false.i2p` who's reliability has been degrading. Although several competitors have emerged to take up some of the slack, they are mostly unable to volunteer to serve the clients of an entire I2P implementation by default. However, StormyCloud, a professional, non-profit organization which runs Tor exit nodes, has started a new, professional outproxy service which has been tested by members of the I2P community and which will become the new default outproxy in the upcoming release.
pt_br: Por anos, o I2P foi atendido por um único outproxy padrão, `false.i2p` cuja confiabilidade tem se degradado. Embora vários concorrentes tenham surgido para assumir parte da folga, eles são, em sua maioria, incapazes de se voluntariar para atender os clientes de uma implementação I2P inteira por padrão. No entanto, a StormyCloud, uma organização profissional sem fins lucrativos que executa nós de saída do Tor, iniciou um novo serviço outproxy profissional que foi testado por membros da comunidade I2P e que se tornará o novo outproxy padrão na próxima versão.
tr: Yıllardır, I2P ağına, güvenilirliği azalmakta olan tek bir varsayılan çıkış vekil sunucusu olan 'false.i2p' hizmet etti. Boşluğu doldurmak için birkaç rakip ortaya çıkmış olsa da, çoğunlukla varsayılan olarak tüm I2P ağının müşterilerine hizmet vermeye gönüllü olamıyorlar. Ancak, Tor çıkış aktarıcılarını çalıştıran profesyonel, kar amacı gütmeyen bir kuruluş olan StormyCloud, I2P topluluğu üyeleri tarafından denenmiş olan ve gelecek sürümde yeni varsayılan çıkış vekil sunucusu olacak yeni, profesyonel bir çıkış vekil sunucusu hizmeti başlattı.

source: Who are StormyCloud
pt_br: Quem é StormyCloud
tr: StormyCloud kimdir

source: Mission of StormyCloud Inc To defend Internet access as a universal human right. By doing so, the group protects users’ electronic privacy and builds community by fostering unrestricted access to information and thus the free exchange of ideas across borders. This is essential because the Internet is the most powerful tool available for making a positive difference in the world.
pt_br: Missão da StormyCloud Inc Defender o acesso à Internet como um direito humano universal. Ao fazer isso, o grupo protege a privacidade eletrônica dos usuários e constrói uma comunidade ao promover o acesso irrestrito à informação e, assim, a livre troca de ideias através das fronteiras. Isso é essencial porque a Internet é a ferramenta mais poderosa disponível para fazer uma diferença positiva no mundo.
tr: StormyCloud Inc kuruluşunun misyonu İnternet erişimini evrensel bir insan hakkı olarak savunmaktır. Grup bunu yaparken, kullanıcıların elektronik kişisel gizliliğini koruyarak, bilgiye sınırsız erişimi ve dolayısıyla sınırlar arasında özgür fikir alışverişini teşvik ederek bir topluluk oluşturur. Bu çok önemlidir, çünkü internet dünyada olumlu bir fark yaratabilecek var olan en güçlü araçtır.

source: Hardware We own all of our hardware and currently colocate at a Tier 4 data center. As of now have a 10GBps uplink with the option to upgrade to 40GBps without the need for much change. We have our own ASN and IP space (IPv4 & IPv6).
pt_br: Hardware Nós possuímos todo o nosso hardware e atualmente colocamos em um data center Tier 4. No momento, temos um uplink de 10 GBps com a opção de atualizar para 40 GBps sem a necessidade de muitas mudanças. Temos nosso próprio ASN e espaço IP (IPv4 & IPv6).
tr: Donanım Kullandığımız tüm donanımın sahibiyiz ve şu anda bir Tier 4 veri merkezi kullanıyoruz. Şu andan itibaren, fazla bir değişikliğe gerek kalmadan 40 GB/sn hıza yükseltme seçeneğiyle birlikte 10 GB/sn hızında bir çıkış bağlantımız var. Kendi ASN kaydımız ve IP adresi aralığımız var (IPv4 ve IPv6).

source: To learn more about StormyCloud visit their `web site <https://www.stormycloud.org/>`_.
pt_br: Para saber mais sobre o StormyCloud, visite o site <https://www.stormycloud.org/>`_.
tr: StormyCloud hakkında ayrıntılı bilgi almak için `siteye <https://www.stormycloud.org/>`_ bakabilirsiniz.

source: Or, visit them on `I2P <http://stormycloud.i2p/>`_.
pt_br: Ou visite-os em `I2P <http://stormycloud.i2p/>`_.
tr: Ya da `I2P<http://stormycloud.i2p/>`_ üzerinde ziyaret edebilirsiniz.

source: Switching to the StormyCloud Outproxy on I2P
pt_br: Mudando para o StormyCloud Outproxy no I2P
tr: I2P üzerinde StormyCloud çıkış vekil sunucusuna geçmek

source: To switch to the StormyCloud outproxy *today* you can visit `the Hidden Services Manager <http://127.0.0.1:7657/i2ptunnel/edit?tunnel=0>`_. Once you're there, you should change the value of **Outproxies** and **SSL Outproxies** to `exit.stormycloud.i2p`. Once you have done this, scroll down to the bottom of the page and click on the "Save" button.
pt_br: Para alternar para o StormyCloud outproxy *hoje*, você pode visitar `o Hidden Services Manager <http://127.0.0.1:7657/i2ptunnel/edit?tunnel=0>`_. Quando estiver lá, você deve alterar o valor de **Outproxies** e **SSL Outproxies** para `exit.stormycloud.i2p`. Depois de fazer isso, role para baixo até o final da página e clique no botão "Salvar".
tr: StormyCloud çıkış vekil sunucusuna *bugün* geçmek için `Gizli hizmetler yönetimi <http://127.0.0.1:7657/i2ptunnel/edit?tunnel=0>`_ bölümüne bakabilirsiniz. **Çıkış vekil sunucuları** ve **SSL çıkış vekil sunucuları** değerini 'exit.stormycloud.i2p' olarak değiştirin. Ardından sayfanın en altına gidin ve "Kaydet" düğmesine tıklayın.

source: Thanks to StormyCloud
pt_br: Graças ao StormyCloud
tr: StormyCloud kuruluşuna teşekkür ederiz

source: We would like to thank StormyCloud for volunteering to provide high-quality outproxy services to the I2P network.
pt_br: Gostaríamos de agradecer à StormyCloud por se voluntariar para fornecer serviços outproxyde alta qualidade para a rede I2P.
tr: StormyCloud kuruluşuna I2P ağına yüksek kaliteli çıkış vekil sunucusu hizmetleri sağlamakta gönüllü olduğu için teşekkür ederiz.

source: Jetty 7.6.11
tr: Jetty 7.6.11 sürümüne güncellendi

source: Tomcat 6.0.37
tr: Tomcat 6.0.37 sürümüne güncellendi

source: ============== I2P Summer Dev ==============
tr: ================= I2P geliştirme yazı =================

source: 0.9.36 with NTCP2 and bug fixes
tr: 0.9.36 sürümü NTCP2 ve hata düzeltmeleri ile yayınlandı

source: Reseed: Use DNSOverHTTPS
tr: Yeniden tohumlama: DNSOverHTTPS kullanıldı

source: Reseed Host
tr: Yeniden Tohumlama Sunucusu

source: Blockchain
tr: Blok zinciri

source: BOB: Remove
tr: BOB: Kaldırıldı
