Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Restrictions in peer selection for netdb verifies
pt_br: Restrições na seleção de pares para verificações netdb
tr: "Ağ veri tabanı" (NetDB) doğrulaması için eş seçimindeki kısıtlamalar eklendi

source: New advanced netdb search form
pt_br: Novo formulário de pesquisa avançada netdb
tr: Yeni gelişmiş "Ağ veri tabanı" (NetDB) arama formu eklendi

source: Sybil tool enhancements
pt_br: Melhorias na ferramenta Sybil
tr: Sybil aracı iyileştirmeleri

source: Blocklist updates in news feed
pt_br: Atualizações da lista de bloqueio no feed de notícias
tr: Haber akışındaki engelleme listesi güncellendi

source: Support IPv6 in blocklist
pt_br: Suporte IPv6 na lista de bloqueio
tr: Engelleme listelerine IPv6 desteği eklendi

source: Add Java version to jar manifests
pt_br: Adicionar versão Java aos manifestos jar
tr: Jar envanterlerine Java sürümü eklendi

source: Remove dead console home page links
pt_br: Remover links da página inicial do console inativo
tr: Ölü pano ana sayfası bağlantıları kaldırıldı

source: Add initial news to bottom of full news page
pt_br: Adicionar notícias iniciais ao final da página de notícias completa
tr: İlk haberler tam haber sayfasının altına eklendi

source: Fix periodic re-logging of dup log messages
pt_br: Corrigir o novo registro periódico de mensagens de log dup
tr: Dup log iletilerinin periyodik olarak yeniden kaydedilmesi düzeltildi

source: Periodic saving of profiles and i2psnark DHT nodes
pt_br: Salvamento periódico de perfis e nós DHT i2psnark
tr: Profillerin ve i2psnark "Dağıtılmış karma tablosu" (DHT) düğümlerinin periyodik olarak kaydedilmesi sağlandı

source: Catch rare UPnP exceptions
pt_br: Capture exceções raras de UPnP
tr: Nadir UPnP istisnaları yakalandı

source: Add logout button to more susimail pages
pt_br: Adicionar botão de logout para mais páginas do susimail
tr: Daha fazla susimail sayfasına oturumu kapatma düğmesi eklendi

source: Truncate history.txt in installers
pt_br: Truncar history.txt em instaladores
tr: Kurucularda history.txt dosyası budandı

source: Use NTCP even before SSU minimums are met or SSU is broken
pt_br: Use NTCP mesmo antes que os mínimos de SSU sejam atingidos ou o SSU seja quebrado
tr: En düşük SSU gereksinimleri karşılanmadan veya SSU bozulmadan önce bile NTCP kullanılması sağlandı

source: Reduce default tunnel build records to 4
pt_br: Reduzir os registros de construção de túnel padrão para 4
tr: Varsayılan tünel oluşturma kayıtları 4 olarak küçültüldü

source: Improved IPv6 address selection
pt_br: Seleção de endereço IPv6 aprimorada
tr: IPv6 adres seçimi geliştirildi

source: Add force-firewalled IPv6 setting
pt_br: Adicionar configuração IPv6 com firewall forçado
tr: Güvenlik duvarı arkasında IPv6 dayatma ayarı eklendi

source: Improved handling of webapps that fail to start
pt_br: Melhoria no tratamento de webapps que falham ao iniciar
tr: Başlatılamayan internet uygulamalarının kullanımı iyileştirildi

source: New configuration for test networks
pt_br: Nova configuração para redes de teste
tr: Test ağları için yeni yapılandırma eklendi

source: Remove deprecated Sha256Standalone, Syndie 1.105 must upgrade
pt_br: Remover o obsoleto Sha256Standalone, Syndie 1.105 deve ser atualizado
tr: Kullanımdan kaldırılan Sha256Standalone kaldırıldı, Syndie 1.105 sürümüne yükseltilmesi gerekiyor

source: Actually use a random nonzero byte in ElGamal, as specified
pt_br: Na verdade, use um byte aleatório diferente de zero em ElGamal, conforme especificado
tr: Belirtildiği gibi aslında ElGamal üzerinde rastgele sıfır olmayan bir bayt kullanıldı

source: Disallow RSA for netdb entries
pt_br: Não permitir RSA para entradas netdb
tr: "Ağ veri tabanı" (NetDB) kayıtları için RSA kullanılması engellendi

source: Add library jars to jar classpath for Debian builds
pt_br: Adicionar jars de biblioteca ao classpath jar para compilações Debian
tr: Debian derlemeleri için jar sınıf yoluna kitaplık jar dosyaları eklendi

source: Remove old systray code
pt_br: Remover código antigo da bandeja do sistema
tr: Eski sistem tepsisi kodu kaldırıldı

source: Fix low-memory warnings without wrapper
pt_br: Corrigir avisos de pouca memória sem wrapper
tr: Wrapper olmayan düşük bellek uyarıları düzeltildi

source: Various code consolidation and cleanup
pt_br: Consolidação e limpeza de vários códigos
tr: Çeşitli kod düzenlemeleri ve temizlik

source: New translations: Galician, Korean
pt_br: Novas traduções: Galego, Coreano
tr: Galiçyaca ve Korece çevirileri eklendi

source: New translations for some subsytems: Chinese (Taiwan)
pt_br: Novas traduções para alguns subsistemas: Chinês (Taiwan)
tr: Bazı alt sistemler için Çince (Tayvan) çevirisi eklendi

source: ============== 0.9.29 Release ==============
pt_br: ============== Lançamento 0.9.29 ==============
tr: ====================== 0.9.29 sürümü yayınlandı ======================

source: 0.9.29 contains bug fixes
pt_br: 0.9.29 contém correções de falha
tr: 0.9.29 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.29 contains fixes for numerous Trac tickets, including workarounds for corrupt compressed messages. We now support NTP over IPv6. We've added preliminary Docker support. We now have translated man pages. We now pass same-origin Referer headers through the HTTP proxy. There are more fixes for Java 9, although we do not yet recommend Java 9 for general use.
pt_br: A versão 0.9.29 contém correções para diversos tickets Trac, incluindo alternativas para mensagens compactadas corrompidas. Nós agora suportamos NTP sobre IPv6. Nós adicionamos suporte preliminar ao Docker. Nós agora traduzimos as páginas de manual. Nós agora passamos headers Referer same-origin pelo proxy HTTP. Há mais correções para o Java 9, embora nós ainda não recomendemos o Java 9 para uso geral.
tr: 0.9.29 sürümünde, bozuk sıkıştırılmış iletilerle ilgili çözümleri de içeren çeşitli Trac bildirimleri düzeltildi Artık IPv6 üzerinden NTP destekleniyor. Ön Docker desteği eklendi. Rehber sayfalarını çevirme olanağı eklendi. Artık HTTP vekil sunucusu üzerinden aynı kaynaktan gelen yönlendirme üst bilgileri aktarılıyor. Java 9 için ek düzeltmeler yapıldı. Bununla birlikte henüz genel amaçlar için Java 9 kullanılmasını önermiyoruz.

source: BOB database refactor
pt_br: Refatoração do banco de dados BOB
tr: BOB veri tabanı kodu elden geçirildi

source: Fixes for Java 9, still not recommended for general use
pt_br: Correções para Java 9, ainda não recomendado para uso geral
tr: Java 9 için düzeltmeler yapıldı, hala genel kullanım için önerilmez

source: NTP fixes for security and standards
pt_br: Correções NTP para segurança e padrões
tr: Güvenlik ve standartlar için NTP düzeltmeleri yapıldı

source: NTP IPv6 support
pt_br: Suporte NTP IPv6
tr: NTP IPv6 desteği eklendi

source: Don't display very old news in console
pt_br: Não exibir notícias muito antigas no console
tr: Panoda çok eski haberlerin görüntülenmesi engellendi

source: Blocklist checking improvements
pt_br: Melhorias na verificação da lista de bloqueio
tr: Engelleme listesinin denetlenmesi iyileştirildi

source: Add preliminary Docker support
pt_br: Adicionar suporte preliminar ao Docker
tr: Ön Docker desteği eklendi

source: Add Referrer-Policy headers to console
pt_br: Adicionar cabeçalhos Referrer-Policy ao console
tr: Panoya Referrer-Policy üst bilgileri eklendi

source: Pass same-origin Referer headers through proxy
pt_br: Passe cabeçalhos Referer de mesma origem por meio de proxy
tr: Same-origin Referer üst bilgilerinin vekil sunucudan geçmesi sağlandı

source: Translated man pages
pt_br: Páginas de manual traduzidas
tr: Rehber sayfalarının çevirisi eklendi

source: Add support for outproxy plugin to CONNECT proxy
pt_br: Adicionar suporte para o plugin outproxy ao proxy CONNECT
tr: CONNECT vekil sunucusuna çıkış vekil sunucusu uygulama eki desteği eklendi

source: Replace random tunnel keys when rekeying
pt_br: Substituir chaves de túnel aleatórias ao recodificar
tr: Yeniden anahtarlama sırasında tünel anahtarlarının rastgele değiştirilmesi sağlandı

source: Fix streaming optional delay and choking
pt_br: Corrigir atraso e engasgo opcional de streaming
tr: İsteğe bağlı akış gecikmesi ve kısma düzeltildi

source: Don't hard fail on message expired error in streaming
pt_br: Não faça failover forçado em caso de erro de mensagem expirada no streaming
tr: Akışta ileti süresi doldu hatasında başarısız olmak engellendi

source: Fix javadoc errors
pt_br: Corrigir erros do javadoc
tr: Javadoc hataları düzeltildi

source: Fix broken unit tests
pt_br: Corrigir testes unitários quebrados
tr: Bozuk birim sınamaları düzeltildi

source: Ensure i2psnark finishes writing config files at shutdown
pt_br: Garanta que o i2psnark termine de gravar os arquivos de configuração no desligamento
tr: Kapatma sırasında i2psnark tarafından yapılandırma dosyalarını yazma işleminin tamamlandığından emin olundu

source: Fix rare NPE in AES via NTCP
pt_br: Corrigir NPE raro em AES via NTCP
tr: NTCP nedeniyle AES üzerinde nadir NPE düzeltildi

source: Disable caching of compressors, in an attempt to fix corruption
pt_br: Desabilitar o cache de compressores, em uma tentativa de corrigir a corrupção
tr: Bozulmayı düzeltmek amacıyla sıkıştırıcıların ön belleğe alınması devre dışı bırakıldı

source: Don't close SAM or BOB session on receipt of corrupt compressed data
pt_br: Não feche a sessão SAM ou BOB ao receber dados compactados corrompidos
tr: Bozuk sıkıştırılmış veri alındığında SAM veya BOB oturumunun kapatılmaması sağlandı

source: Add support for ports to CONNECT proxy
pt_br: Adicionar suporte para portas ao proxy CONNECT
tr: CONNECT vekil sunucusuna bağlantı noktaları desteği eklendi

source: Consolidate stream copy code
pt_br: Consolidar código de cópia de fluxo
tr: Akış kopyalama kodu toparlandı

source: Consolidate console timer threads
pt_br: Consolidar threads do timer do console
tr: Pano zamanlayıcı iş parçacıkları toparlandı

source: New streaming test harness
pt_br: Novo equipamento de teste de streaming
tr: Yeni akış sınaması düzeneği

source: ============================ 0.9.29 Windows Installer Fix ============================
pt_br: ============================= 0.9.29 Correção do Windows Installer =============================
tr: =============================== 0.9.29 Windows kurucu düzeltmesi ===============================

source: 0.9.29 Windows installer fix
pt_br: Correção do instalador do Windows 0.9.29
tr: 0.9.29 Windows kurucu düzeltmesi

source: The 0.9.29 Windows installer posted on our website two days ago fails during install with an Exception. We have fixed the bug and posted the new installer to our website. This does not affect upgrades from previous releases or non-Windows installers. We apologize for the issue.
pt_br: O instalador do Windows 0.9.29 publicado em nosso site há dois dias falha durante a instalação com uma exceção. Corrigimos o bug e publicamos o novo instalador em nosso site. Isso não afeta atualizações de versões anteriores ou instaladores que não sejam do Windows. Pedimos desculpas pelo problema.
tr: İki gün önce sitemizde yayınlanan 0.9.29 Windows paketi, kurulum sırasında bir hata ile tamamlanamıyor. Hatayı düzelttik ve yeni kurucuyu sitemizde yayınladık. Bu durum, önceki sürümlerden veya Windows olmayan kuruculardan yapılan yükseltme işlemlerini etkilemiyor. Sorun için özür dileriz.

source: ============== 0.9.30 Release ==============
pt_br: ============== Lançamento 0.9.30 ==============
tr: ====================== 0.9.30 sürümü yayınlandı ======================

source: 0.9.30 with Jetty 9
pt_br: 0.9.30 com Jetty 9
tr: 0.9.30 sürümü Jetty 9. sürümü ile yayınlandı

source: 0.9.30 contains an upgrade to Jetty 9 and Tomcat 8. The previous versions are no longer supported, and are not available in the upcoming Debian Stretch and Ubuntu Zesty releases.
pt_br: 0.9.30 contém uma atualização para Jetty 9 e Tomcat 8. As versões anteriores não são mais suportadas e não estão disponíveis nas próximas versões do Debian Stretch e Ubuntu Zesty.
tr: 0.9.30 sürümü, Jetty 9 ve Tomcat 8 güncellemeleri ile yayınlandı. Önceki sürümler artık desteklenmiyor ve gelecek Debian Stretch ve Ubuntu Zesty sürümlerinde bulunmayacak.

source: The router will migrate the jetty.xml configuration file for each Jetty website to the new Jetty 9 setup. This should work for recent, unmodified configurations but may not work for modified or very old setups. Verify that your Jetty website works after upgrading, and contact us on IRC if you need assistance.
pt_br: O roteador migrará o arquivo de configuração jetty.xml de cada site Jetty para a nova configuração do Jetty 9. Isso deve funcionar para configurações recentes e não modificadas, mas pode não funcionar para configurações modificadas ou muito antigas. Verifique se seu site Jetty funciona após a atualização e entre em contato conosco no IRC se precisar de assistência.
tr: Yöneltici, her Jetty sitesi için jetty.xml yapılandırma dosyasını yeni Jetty 9 kurulumuna geçirecek. Bu geçiş, yeni, değiştirilmemiş yapılandırmalar için sorunsuz yapılabilmelidir. Ancak değiştirilmiş veya çok eski kurulumlar için yapılamayabilir. Güncelleme sonrası Jetty sitenizin çalıştığını doğrulayın ve yardıma gerek duyarsanız IRC üzerinden bizimle görüşün.

source: Several plugins are not compatible with Jetty 9 and must be updated. The following plugins have been updated to work with 0.9.30, and your router should update them after restart:
pt_br: Vários plugins não são compatíveis com o Jetty 9 e precisam ser atualizados. Os seguintes plugins foram atualizados para funcionar com a versão 0.9.30, e seu roteador deve atualizá-los após a reinicialização:
tr: Bazı uygulama ekleri Jetty 9 ile uyumlu değildir ve güncellenmesi gerekir. Aşağıdaki uygulama ekleri 0.9.30 sürümü ile çalışacak şekilde güncellendi. Yönelticiniz yeniden başlatıldıktan sonra bu uygulama eklerini güncellemelidir:

source: The following plugins (with current versions listed) will not work with 0.9.30. Contact the appropriate plugin developer for the status of new versions:
pt_br: Os seguintes plugins (com versões atuais listadas) não funcionarão com a versão 0.9.30. Entre em contato com o desenvolvedor do plugin apropriado para saber o status das novas versões:
tr: Aşağıdaki uygulama ekleri (var olan sürümler listelenmiştir) 0.9.30 sürümü ile çalışmayacak. Yeni sürümlerin durumu için ilgili uygulama ekinin geliştiricisiyle görüşün:

source: This release also supports migration of old (2014 and earlier) DSA-SHA1 hidden services to the more-secure EdDSA signature type. See http://zzz.i2p/topics/2271 for further information, including a guide and FAQ.
pt_br: Esta versão também oferece suporte à migração de serviços ocultos DSA-SHA1 antigos (2014 e anteriores) para o tipo de assinatura EdDSA mais seguro. Consulte http://zzz.i2p/topics/2271 para obter mais informações, incluindo um guia e perguntas frequentes.
tr: Bu sürüm ayrıca eski (2014 ve daha öncesi) DSA-SHA1 gizli hizmetlerinin daha güvenli EdDSA imza türüne aktarılmasını destekler. Ayrıntılı bilgi almak, rehber ve SSS için http://zzz.i2p/topics/2271 adresine bakabilirsiniz.

source: Note: On non-Android ARM platforms such as the Raspberry Pi, the blockfile database will upgrade on restart, which may take several minutes. Please be patient.
pt_br: Nota: Em plataformas ARM não Android, como o Raspberry Pi, o banco de dados blockfile será atualizado na reinicialização, o que pode levar vários minutos. Por favor, seja paciente.
tr: Not: Raspberry Pi gibi Android çalıştırmayan ARM platformlarında, yeniden başlatma sırasında blok dosyası veri tabanı güncellenir ve bu işlem bir kaç dakika sürebilir. Lütfen sabırla bekleyin.

source: Jetty 9, Tomcat 8
pt_br: Cais 9, Tomcat 8

source: Stretch / Zesty support
pt_br: Suporte elástico/Zesty
tr: Stretch / Zesty desteği

source: Migration support for DSA-SHA1 hidden services
pt_br: Suporte de migração para serviços ocultos DSA-SHA1
tr: DSA-SHA1 gizli hizmetleri için geçiş desteği

source: ARM (non-Android) router signature type migration
pt_br: Migração de tipo de assinatura de roteador ARM (não Android)
tr: ARM (Android olmayan) yöneltici imza türü geçişi

source: ARM (non-Android) blockfile format migration
pt_br: Migração de formato de arquivo de bloco ARM (não Android)
tr: ARM (Android olmayan) blok dosyası biçimi geçişi

source: Introducer expiration (proposal 133)
pt_br: Expiração do introdutor (proposta 133)
tr: Tanıtıcı sona ermesi (133 numaralı öneri)

source: Fix disappearing i2psnark start button
pt_br: Corrigir o desaparecimento do botão iniciar do i2psnark
tr: Kaybolan i2psnark başlat düğmesi düzeltildi

source: Fix saving of libjcpuid.jnilib file on Macs
pt_br: Corrigir salvamento do arquivo libjcpuid.jnilib em Macs
tr: Mac bilgisayarlarda libjcpuid.jnilib dosyasının kaydedilmesi düzeltildi

source: Fix fallback to 'none' architecture for jbigi
pt_br: Corrigir fallback para arquitetura 'none' para jbigi
tr: jbigi için 'yok' mimarisine geri dönüş düzeltildi

source: Fixes for multiple destinations in SusiDNS
pt_br: Correções para vários destinos no SusiDNS
tr: SusiDNS üzerinde birden çok hedef için düzeltmeler yapıldı

source: Fix config directory location in Gentoo
pt_br: Corrigir a localização do diretório de configuração no Gentoo
tr: Gentoo üzerinde yapılandırma klasörü konumu düzeltildi

source: Fix rapid firewalled/not-firewalled transitions
pt_br: Corrigir transições rápidas com firewall/sem firewall
tr: Hızlı güvenlik duvarı arkasında olan/olmayan geçişler düzeltildi

source: Fix startup crash on very old Android platforms
pt_br: Corrigir falha de inicialização em plataformas Android muito antigas
tr: Çok eski Android platformlarındaki başlangıç çökmesi düzeltildi

source: Fixes for advanced authentication strings in i2ptunnel
pt_br: Correções para strings de autenticação avançadas no i2ptunnel
tr: i2ptunnel üzerindeki gelişmiş kimlik doğrulama dizgeleri için düzeltmeler yapıldı

source: Fix exception caused by corrupt stored i2psnark DHT data
pt_br: Corrigir exceção causada por dados DHT i2psnark armazenados corrompidos
tr: Bozuk depolanmış i2psnark "Dağıtılmış karma tablosu" (DHT) verilerinin neden olduğu hata düzeltildi

source: Speed up writes of i2psnark files at shutdown
pt_br: Acelere as gravações de arquivos i2psnark no desligamento
tr: Kapatma sırasında i2psnark dosyalarının yazma işlemleri hızlandırıldı

source: Recognize AMD Ryzen processor
pt_br: Reconhecer o processador AMD Ryzen
tr: AMD Ryzen işlemcinin tanınması sağlandı

source: Support for new i2psnark-rpc remote plugin
pt_br: Suporte para o novo plugin remoto i2psnark-rpc
tr: Yeni i2psnark-rpc uzak uygulama eki desteği eklendi

source: Build addressbook as a jar, not a webapp
pt_br: Crie o catálogo de endereços como um jar, não como um webapp
tr: Adres defterinin bir internet uygulaması olarak değil, bir jar olarak oluşturulması sağlandı

source: Support client registration in app context
pt_br: Suporte ao registro de clientes no contexto do aplicativo
tr: Uygulama bağlamında istemci kaydı desteği eklendi

source: Add support for i2psnark-rpc plugin
pt_br: Adicionar suporte para o plugin i2psnark-rpc
tr: i2psnark-rpc uygulama eki desteği eklendi

source: Adjust thresholds for probabalistic throttling on slow platforms
pt_br: Ajustar limites para limitação probabilística em plataformas lentas
tr: Yavaş platformlarda olasılık kısıtlaması için eşikler ayarlandı

source: Add reset() to I2PSocket API
pt_br: Adicionar reset() à API I2PSocket
tr: I2PSocket API uygulamasına reset() eklendi

source: Add date parameter to subscription authentication strings
pt_br: Adicionar parâmetro de data às strings de autenticação de assinatura
tr: Abonelik doğrulama dizgelerine tarih parametresi eklendi

source: Add bash completion scripts to Debian packages
pt_br: Adicionar scripts de conclusão bash aos pacotes Debian
tr: Debian paketlerine bash tamamlama komut dosyaları eklendi

source: ================================ I2P Summer Dev 2017: MOAR Speed! ================================
pt_br: ================================= I2P Summer Dev 2017: MAIS velocidade! =================================
tr: ================================ I2P geliştirme yazı 2017: MOAR hızı! ================================

source: This year's Summer Dev will be focused on metrics collection and performance improvements for the network.
pt_br: O Summer Dev deste ano se concentrará na coleta de métricas e melhorias de desempenho para a rede.
tr: Bu yılki geliştirme yazı, ağ ölçümlerini toplama ve başarım iyileştirmeleri çalışmalarına odaklanacak.

source: It's that time of year again! We're embarking on our summer development programme, where we focus on a particular aspect of I2P to push it forward. For the next three months, we'll be encouraging both new contributors and existing community members to pick a task and have fun with it!
pt_br: É aquela época do ano de novo! Estamos embarcando em nosso programa de desenvolvimento de verão , onde focamos em um aspecto particular do I2P para levá-lo adiante. Durante os próximos três meses, encorajaremos tanto os novos colaboradores quanto os membros existentes da comunidade a escolher uma tarefa e se divertir com ela!
tr: Yine yılın o zamanı geldi! I2P projesini ilerletmek için belirli bir yöne odaklandığımız yaz geliştirme programımıza başlıyoruz. Önümüzdeki üç ay boyunca hem yeni katkıda bulunanları hem de var olan topluluk üyelerini bir görev seçmeye ve onunla eğlenmeye teşvik edeceğiz!

source: `Last year`__, we focused on helping users and developers leverage I2P, by improving API tooling and giving some love to applications that run over I2P. This year, we want to improve the user experience by working on an aspect that affects everyone: performance.
pt_br: `No ano passado`__, nos concentramos em ajudar usuários e desenvolvedores a alavancar o I2P, aprimorando as ferramentas de API e dando um pouco de atenção aos aplicativos executados no I2P. Este ano, queremos melhorar a experiência do usuário trabalhando em um aspecto que afeta a todos: o desempenho.
tr: `Geçen yıl`__, API araçlarını geliştirerek ve I2P üzerinden çalışan uygulamalara biraz sevgi vererek, kullanıcıların ve geliştiricilerin I2P uygulamasından yararlanmasına yardımcı olmaya odaklandık. Bu yıl, herkesi etkileyen bir konu üzerinde çalışarak kullanıcı deneyimini geliştirmek istiyoruz: başarım.

source: Despite onion-routing networks often being called "low-latency" networks, there is significant overhead created by routing traffic through additional computers. I2P's unidirectional tunnel design means that by default, a round trip between two Destinations will involve twelve participants! Improving the performance of these participants will help to both reduce the latency of end-to-end connections [1]_, and increase the quality of tunnels network-wide.
pt_br: Apesar das redes de roteamento onion serem frequentemente chamadas de redes de "baixa latência", há uma sobrecarga significativa criada pelo roteamento de tráfego por meio de computadores adicionais. O design de túnel unidirecional do I2P significa que, por padrão, uma viagem de ida e volta entre dois destinos envolverá doze participantes! Melhorar o desempenho de esses participantes ajudará a reduzir a latência das conexões de ponta a ponta [1]_ e a aumentar a qualidade dos túneis em toda a rede.
tr: Onion yöneltme ağları genellikle "düşük gecikmeli" ağlar olarak adlandırılsa da, trafiği ek bilgisayarlar üzerinden yöneltmenin yarattığı önemli bir ek yük vardır. I2P uygulamasının tek yönlü tünel tasarımı, varsayılan olarak, iki varış noktası arasındaki bir gidiş-dönüş yolculuğunun on iki katılımcıyı içereceği anlamına gelir! Bu katılımcıların başarımının iyileştirilmesi, hem uçtan uca bağlantıların gecikmesini [1]_ azaltmaya hem de ağ genelindeki tünellerin kalitesini artırmaya yardımcı olacaktır.
