Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Hottuna and Sadie organized most of the details, getting graphic assets created, posters printed and a banner made for the podium. Nick at Hacklab, where the event would take place, helped with making sure the space was ready for the event. Sadie reached out to the local infosec community and helped secure guest speakers as well. The event happened on one of the hottest weekends of the Summer, with attendees arriving from America and Europe. The I2P community did an amazing job of supporting the event by postering, giving talks, and spreading the word in forums and on social media. The talks can be viewed on KYTV’s YouTube Channel https://www.youtube.com/channel/UCZfD2Dk6POE-VU8DOqW7VVw
pt_br: Hottuna e Sadie organizaram a maioria dos detalhes, criando recursos gráficos , imprimindo pôsteres e fazendo um banner para o pódio. Nick no Hacklab, onde o evento aconteceria, ajudou a garantir que o espaço estivesse pronto para o evento. Sadie entrou em contato com a comunidade local de infosec e ajudou a garantir palestrantes convidados também. O evento aconteceu em um dos fins de semana mais quentes do verão, com participantes chegando da América e da Europa. A comunidade I2P fez um trabalho incrível de apoiar o evento com pôsteres, palestras e divulgação em fóruns e nas redes sociais. As palestras podem ser assistidas no canal do YouTube da KYTV https://www.youtube.com/channel/UCZfD2Dk6POE-VU8DOqW7VVw
tr: Hottuna ve Sadie ayrıntıların çoğuyla ilgilendi, görsel materyali tasarladı, posterler bastırdı ve podyum için bir afiş hazırladı. Etkinliğin gerçekleşeceği Hacklab alanında Nick etkinlik için hazırlıklara yardımcı oldu. Sadie yerel bilgi güvenliği topluluğuna ulaştı ve konuk konuşmacıların güvenliğinin sağlanmasına da yardımcı oldu. Etkinlik, Amerika ve Avrupa'dan gelen katılımcılarla, Yazın en sıcak hafta sonlarından birinde gerçekleştirildi. I2P topluluğu, afişler yayınlayarak, konuşmalar yaparak, forumlarda ve sosyal medyada haberi yayarak etkinliği desteklemekte harika bir iş çıkardı. Konuşmalar KYTV YouTube Kanalında izlenebilir https://www.youtube.com/channel/UCZfD2Dk6POE VU8DOqW7VVw

source: In January 2016 at Real World Crypto Stanford — str4d gave a talk on the crypto migration progress and future plans for the project. zzz and others would continue weekly meetings to plan the migration over the next few years.
pt_br: Em janeiro de 2016, na Real World Crypto Stanford — str4d deu uma palestra sobre o progresso da migração de criptomoedas e os planos futuros para o projeto. zzz e outros continuariam com as reuniões semanais para planejar a migração nos próximos anos.
tr: 2016 yılının Ocak ayında Stanford Real World Crypto etkinliğinde - str4d, şifreleme geçişinin ilerlemesi ve proje için gelecek planları hakkında bir konuşma yaptı. zzz ve diğerleri, önümüzdeki birkaç yıl içinde geçişi planlamak için haftalık toplantıları sürdürecekti.

source: NTCP2 was implemented in 2018, in release 0.9.36. It was disabled by default so that it could be tested. It was enabled in 0.9.37. NTCP1 was disabled in 0.9.40.
pt_br: O NTCP2 foi implementado em 2018, na versão 0.9.36. Ele foi desabilitado por padrão para que pudesse ser testado. Ele foi habilitado na versão 0.9.37. O NTCP1 foi desabilitado na versão 0.9.40.
tr: 2018 yılında 0.9.36 sürümünde NTCP2 uygulandı. Denemeler için varsayılan olarak devre dışı bırakıldı. 0.9.37 sürümünde etkinleştirildi. 0.9.40 sürümünde NTCP1 devre dışı bırakıldı.

source: The new I2P transport protocol provides effective resistance against DPI censorship. It also results in reduced CPU load because of the faster, modern cryptography used. It makes I2P more likely to run on low-end devices, such as smartphones and home routers. Both major I2P implementations have full support for NTCP2 and it make NTCP2 available for use starting with version 0.9.36 (Java) and 2.20 (i2pd, C++).
pt_br: O novo protocolo de transporte I2P fornece resistência efetiva contra censura de DPI. Ele também resulta em carga de CPU reduzida por causa da criptografia mais rápida e moderna usada. Ele torna o I2P mais provável de rodar em dispositivos de baixo custo, como smartphones e roteadores domésticos. Ambas as principais implementações I2P têm suporte total para NTCP2 e tornam o NTCP2 disponível para uso a partir da versão 0.9.36 (Java) e 2.20 (i2pd, C++).
tr: Yeni I2P taşıyıcı iletişim kuralı, "Derin paket denetimi" (DPI) sansürüne karşı etkili direnç sağlar. Ayrıca kullanılan daha hızlı ve modern şifreleme nedeniyle işlemci yükünün azalmasını sağlar. I2P uygulamasını akıllı telefonlar ve ev yönelticileri gibi düşük kaliteli aygıtlar üzerinde çalıştırma olasılığını artırır. Her iki büyük I2P uygulamasının da NTCP2 için tam desteği vardır ve NTCP2 iletişim kuralını 0.9.36 (Java) ve 2.20 (i2pd, C++) sürümlerinden başlayarak kullanıma sunar.

source: The complete implementation details can be read here https://geti2p.net/en/blog/post/2018/08/20/NTCP2
pt_br: Os detalhes completos da implementação podem ser lidos aqui https://geti2p.net/en/blog/post/2018/08/20/NTCP2
tr: Tam uygulama ayrıntıları şuradan okunabilir https://geti2p.net/en/blog/post/2018/08/20/NTCP2

source: 0.9.39 included extensive changes for new network database types (proposal 123). The i2pcontrol plugin was bundled as a web-app to support development of RPC applications.
pt_br: 0.9.39 incluiu mudanças extensivas para novos tipos de banco de dados de rede (proposta 123). O plugin i2pcontrol foi empacotado como um web-app para dar suporte ao desenvolvimento de aplicativos RPC.
tr: 0.9.39 sürümünde, yeni ağ veri tabanı türleri için kapsamlı değişiklikler bulunuyordu (123 numaralı öneri). RPC uygulamalarının geliştirilmesini desteklemek için i2pcontrol uygulama eki bir internet uygulaması olarak pakete eklendi.

source: In 2019, the team decided to attend more conferences. That year IDK and zzz attended DefCon, and IDK gave a workshop on I2P application development. At Monero Village, zzz gave a talk called I2P for Cryptocurrency Developers.
pt_br: Em 2019, a equipe decidiu participar de mais conferências. Naquele ano, IDK e zzz participaram da DefCon, e IDK deu um workshop sobre desenvolvimento de aplicativos I2P . Na Monero Village, zzz deu uma palestra chamada I2P para desenvolvedores de criptomoedas.
tr: 2019 yılında ekip daha fazla konferansa katılmaya karar verdi. O yıl IDK ve zzz DefCon etkinliğine katıldı ve IDK, I2P uygulama geliştirme üzerine bir çalıştay düzenledi. Monero Köyünde zzz, Cryptocurrency Developers için I2P adlı bir konuşma yaptı.

source: Late that year, Sadie and IDK attended Our Networks in Toronto, where IDK gave a lightning talk about I2P.
pt_br: No final daquele ano, Sadie e IDK compareceram ao Our Networks em Toronto, onde IDK deu uma palestra rápida sobre I2P.
tr: O yılın sonlarında, Sadie ve IDK, IDK tarafından I2P hakkında bir yıldırım konuşmasının yapıldığı Toronto'daki Our Networks etkinliğine katıldı.

source: Sadie attended RightsCon in Tunis and the Internet Freedom Festival in Valencia to meet with NGO’s and Human Right Defenders. Thanks to the the connections we made, the project received grants for usability and accessibility support from Open Tech Fund, and most recently Internews. This will ensure more user friendly onboarding, UX, and information architecture improvements to support the growing interest in the network. It will also support specific tooling to help in-need users with specific risk surfaces through user research.
pt_br: Sadie participou do RightsCon em Tunis e do Internet Freedom Festival em Valência para se encontrar com ONGs e defensores dos direitos humanos. Graças às conexões que fizemos, o projeto recebeu subsídios para usabilidade e suporte de acessibilidade do Open Tech Fund e, mais recentemente, da Internews. Isso garantirá uma integração mais amigável ao usuário, UX e melhorias na arquitetura de informações para dar suporte ao crescente interesse na rede. Também dará suporte a ferramentas específicas para ajudar usuários necessitados com superfícies de risco específicas por meio de pesquisa de usuário.
tr: Sadie, Sivil Toplum Kuruluşları ve İnsan Hakları Savunucuları ile görüşmek üzere Tunus'ta RightsCon etkinliğine ve Valensiya'da İnternet Özgürlüğü Festivali'ne katıldı. Yaptığımız bağlantılar sayesinde proje, Open Tech Fund ve Internews kuruluşlarından kullanılabilirlik ve erişilebilirlik desteği için hibe aldı. Bu kaynaklar, ağa artan ilgiyi desteklemek için daha kullanıcı dostu arayüz, daha iyi kullanıcı deneyimi ve bilgi mimarisi iyileştirmeleri sağlayacak. Ayrıca, kullanıcı araştırması yoluyla belirli risk yüzeylerinde gerek duyan kullanıcılara yardımcı olacak belirli araçları destekleyecek.

source: That Summer, Hoàng Nguyên Phong had his research into I2P censorship accepted too FOCI at USENIX in Santa Clara. Sadie had supported the research and they attended together. I2P Metrics was created during this time https://i2p-metrics.np-tokumei.net/, and well as research into more resistant reseed servers for the I2P network https://homepage.np-tokumei.net/post/notes-i2p-reseed-over-cloudflare/. You can read the research report here https://homepage.np-tokumei.net/post/notes-otf-wrapup-blogpost/.
pt_br: Naquele verão, Hoàng Nguyên Phong teve sua pesquisa sobre censura I2P aceita também pela FOCI na USENIX em Santa Clara. Sadie apoiou a pesquisa e eles compareceram juntos. O I2P Metrics foi criado durante esse tempo https://i2p-metrics.np-tokumei.net/, e também a pesquisa sobre mais servidores de reseed resistentes para a rede I2P https://homepage.np-tokumei.net/post/notes-i2p-reseed-over-cloudflare/. Você pode ler o relatório da pesquisa aqui https://homepage.np-tokumei.net/post/notes-otf-wrapup-blogpost/.
tr: O yaz, Hoàng Nguyên Phong, I2P sansürüyle ilgili araştırmasını Santa Clara'daki USENIX derneğinde de FOCI olarak kabul ettirdi. Sadie araştırmayı desteklemişti ve birlikte katılmışlardı. Bu arada I2P ölçümleri https://i2p-metrics.np-tokumei.net/ oluşturuldu ve ayrıca I2P ağı için daha dayanıklı yeniden tohumlama sunucularına yönelik araştırmalar yapıldı https://homepage.np-tokumei.net/post/notes -i2p-reseed over-cloudflare/. Araştırma raporunu şuradan okuyabilirsiniz: https://homepage.np-tokumei.net/post/notes-otf-wrapup blogpost/.

source: At CCC that year, the decision was made to migrate from Monotone too GitLab. The project was one of the last to use Monotone, and it was time to prepare to move on. IDK would spend 2020 ensuring the process was as smooth as it could be. The pandemic would result in the team not being able to see each other that year to celebrate the ( mostly) smooth move to Gitlab. On December 10. 2020, the project switched off the old mtn i2p.i2p branch, and moved the development of the core Java I2P libraries from Monotone to Git officially.
pt_br: No CCC naquele ano, a decisão foi tomada para migrar do Monotone também GitLab. O projeto foi um dos últimos a usar o Monotone, e era hora de se preparar para seguir em frente. O IDK passaria 2020 garantindo que o processo fosse o mais tranquilo possível. A pandemia resultaria na equipe não ser capaz de se ver naquele ano para comemorar a mudança (principalmente) tranquila para o Gitlab. Em 10 de dezembro de 2020, o projeto desligou o antigo branch mtn i2p.i2p e moveu o desenvolvimento das principais bibliotecas Java I2P do Monotone para o Git oficialmente.
tr: O yıl CCC etkinliğinde Monotone platformundan GitLab üzerine geçiş kararı alındı. Proje, en son Monotone kullanacılarından biriydi ve sonraki aşamaya geçme zamanı gelmişti. IDK, 2020 yılı boyunca bu sürecin olabildiğince sorunsuz geçmesini sağlamak için çalışacaktı. Salgın, ekibin GitLab üzerine (olabildiğince) sorunsuz geçişini kutlamak için o yıl birbirini görememesine neden olacaktı. 10 Aralık 2020 tarihinde projenin eski mtn i2p.i2p dalı kapatıldı ve çekirdek Java I2P kitaplıklarının geliştirilmesi resmi olarak Monotone üzerinden Git üzerine geçirildi.

source: Congratulations and thanks to everyone who helped in the git migration, especially zzz, eche|on, nextloop, and our site mirror operators! While some of us will miss Monotone, it has become a barrier for new and existing participants in I2P development and we’re excited to join the world of developers using Git to manage their distributed projects.
pt_br: Parabéns e obrigado a todos que ajudaram na migração do git , especialmente zzz, eche|on, nextloop e nossos operadores de espelho de site ! Embora alguns de nós sintam falta do Monotone, ele se tornou uma barreira para participantes novos e existentes no desenvolvimento I2P e estamos animados para nos juntar ao mundo dos desenvolvedores que usam o Git para gerenciar seus projetos distribuídos.
tr: Başta zzz, eche|on, nextloop ve site yansı işletmecilerimiz olmak üzere Git geçişinde yardımcı olan herkese tebrikler ve teşekkürler! Bazılarımız Monotone platformunu özleyecek olsa da, I2P geliştirme çalışmalarında, var olan ve yeni katılımcılar için bir engel haline gelmişti. Dağıtılmış projelerini yönetmek için Git kullanan geliştiricilerin dünyasına katılmaktan heyecan duyuyoruz.

source: 0.9.47 enabled the new end-to-end encryption protocol (proposal 144) by default for some services. A Sybil analysis and blocking tool was also now enabled by default. 0.9.48 enabled the new end-to-end encryption protocol (proposal 144) for most services. Preliminary support was added for new tunnel build message encryption (proposal 152). There were significant performance improvements throughout the router.
pt_br: 0.9.47 habilitou o novo protocolo de criptografia ponta a ponta (proposta 144) por padrão para alguns serviços. Uma ferramenta de análise e bloqueio Sybil também foi agora habilitada por padrão. 0.9.48 habilitou o novo protocolo de criptografia ponta a ponta (proposta 144) para a maioria dos serviços. Suporte preliminar foi adicionado para nova criptografia de mensagem de construção de túnel (proposta 152). Houve melhorias significativas de desempenho em todo o roteador.
tr: 0.9.47 sürümünde, bazı hizmetler için varsayılan olarak yeni uçtan uca şifreleme iletişim kuralı (144 numaralı öneri) etkinleştirildi. Bir Sybil inceleme ve engelleme aracı da varsayılan olarak etkinleştirildi. 0.9.48 sürümünde, çoğu hizmet için yeni uçtan uca şifreleme iletişim kuralı (144 numaralı öneri) etkinleştirildi. Yeni tünel oluşturma iletisinin şifrelemesi için hazırlık eklendi (152 numaralı öneri). Yöneltici genelinde önemli başarım iyileştirmeleri yapıldı.

source: 0.9.49 was the release that brought faster crypto. The I2P network became faster and more secure. Improvements and fixes for the SSU (UDP) transport resulted in faster speeds. The release also started the migration to new, faster ECIES-X25519 encryption for routers. The project had been working on the specifications and protocols for new encryption for several years, and was getting close to the end of it. The migration would take several releases to complete.
pt_br: 0.9.49 foi o lançamento que trouxe criptografia mais rápida. A rede I2P se tornou mais rápida e segura. Melhorias e correções para o transporte SSU (UDP) resultaram em velocidades mais rápidas. O lançamento também iniciou a migração para a nova criptografia ECIES-X25519 mais rápida para roteadores. O projeto estava trabalhando nas especificações e protocolos para a nova criptografia por vários anos e estava chegando perto do fim. A migração levaria vários lançamentos para ser concluída.
tr: 0.9.49 sürümünde, şifreleme hızlandırıldı. I2P ağı daha hızlı ve daha güvenli hale geldi. SSU (UDP) taşıyıcısı için iyileştirmeler ve düzeltmeler daha yüksek hızlar sağladı. Bu sürümde ayrıca yönelticiler için yeni, daha hızlı ECIES-X25519 şifrelemesine geçiş de başlatıldı. Proje, birkaç yıldır yeni şifreleme için teknik özellikler ve iletişim kuralları üzerinde çalışıyordu ve sonuca yaklaşıyordu. Geçişin tamamlanması birkaç sürüm alacak.

source: To minimize disruption, only new installs and a very small percentage of existing installs (randomly selected at restart) would be using the new encryption.
pt_br: Para minimizar a interrupção, apenas novas instalações e uma porcentagem muito pequena de instalações existentes (selecionadas aleatoriamente na reinicialização) usariam a nova criptografia .
tr: Kesintiyi en aza indirmek için, yalnızca yeni kurulumlar ve var olan kurulumların çok küçük bir yüzdesi (yeniden başlatma sırasında rastgele seçilir) yeni şifrelemeyi kullanacak.

source: The project had “rekeyed” the network twice before, when changing the default signature type, but this was the first time it had changed the default encryption type. 0.9.50 enabled DNS over HTTPS for reseeding to protect users from passive DNS snooping. There were numerous fixes and improvements for IPv6 addresses, including new UPnP support.
pt_br: O projeto havia “recodificado” a rede duas vezes antes, ao alterar o tipo de assinatura padrão , mas esta foi a primeira vez que ele alterou o tipo de criptografia padrão . 0.9.50 habilitou DNS sobre HTTPS para reseeding para proteger usuários de espionagem passiva de DNS. Houve inúmeras correções e melhorias para endereços IPv6, incluindo novo suporte UPnP.
tr: Proje, varsayılan imza türünü değiştirirken ağı daha önce iki kez "yeniden anahtarlamıştı". Ancak bu sefer, varsayılan şifreleme türü ilk kez değiştiriliyordu. Kullanıcıları pasif DNS gözetlemesinden korumak amacıyla yeniden tohumlama için 0.9.50 sürümünde HTTPS üzerinden DNS etkinleştirildi. Yeni UPnP desteği ile birlikte IPv6 adresleri için çok sayıda düzeltme ve iyileştirme yapıldı.

source: 1.5.0 — The early anniversary release because it is so good!
pt_br: 1.5.0 — O lançamento de aniversário antecipado porque é muito bom!
tr: 1.5.0 — Erken yıldönümü sürümü yayınlandı çünkü çok iyi!

source: Yes, that’s right, after 9 years of 0.9.x releases, we are going straight from 0.9.50 to 1.5.0. This does not signify a major API change, or a claim that development is now complete. It is simply a recognition of almost 20 years of work to provide anonymity and security for our users.
pt_br: Sim, isso mesmo, depois de 9 anos de lançamentos 0.9.x, estamos indo direto de 0.9.50 para 1.5.0. Isso não significa uma grande mudança de API , ou uma alegação de que o desenvolvimento agora está completo. É simplesmente um reconhecimento de quase 20 anos de trabalho para fornecer anonimato e segurança para nossos usuários.
tr: Evet, doğru. 9 yıldır süren 0.9.x sürümlerinden sonra, doğrudan 0.9.50 sürümünden 1.5.0 sürümüne geçiyoruz. Bu durum, büyük bir API değişikliği olduğu ya da geliştirmenin tamamlandığı anlamına gelmiyor. Yaklaşık 20 yıldır kullanıcılarımıza anonimlik ve güvenlik sağlamak için süren çalışmaları onurlandırıyor.

source: This release finishes implementation of smaller tunnel build messages to reduce bandwidth. We continue the transition of the network’s routers to X25519 encryption. Of course there are also numerous bug fixes and performance improvements.
pt_br: Esta versão finaliza a implementação de mensagens de construção de túneis menores para reduzir a largura de banda. Continuamos a transição dos roteadores da rede para criptografia X25519. Claro que também há inúmeras correções de bugs e melhorias de desempenho.
tr: Bu sürüm, bant genişliğini azaltmak için daha küçük tünel oluşturma iletileri uygulamasını tamamlar. Ağ yönelticilerinin X25519 şifrelemesine geçişini sürdürüyoruz. Elbette çok sayıda hata düzeltmesi ve başarım iyileştirmesi de var.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release.
pt_br: Como de costume, recomendamos que você atualize para esta versão. A melhor maneira de manter a segurança e ajudar a rede é executar a versão mais recente .
tr: Her zamanki gibi yeni sürüme güncellemeniz önerilir. Güvenliği korumanın ve ağa yardımcı olmanın en iyi yolu güncel sürümü kullanmaktır.

source: Congratulations team. Let’s do another 20.
pt_br: Parabéns, equipe. Vamos fazer mais 20.
tr: Tüm ekibe tebrikler. Bir 20 yıl daha yapalım.

source: Level up your I2P Skills with Encrypted LeaseSets
pt_br: Aumente suas habilidades I2P com LeaseSets criptografados
tr: "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) ile I2P becerilerinizi yükseltin

source: It has been said that I2P emphasizes Hidden Services, we examine one interpretation of this
pt_br: Foi dito que o I2P enfatiza os Serviços Ocultos, examinamos uma interpretação disso
tr: I2P ağının gizli hizmetlerin önemini belirttiği söylendi, bunun bir yorumunu inceliyoruz.

source: It has been said in the past that I2P emphasizes support for Hidden Services, which is true in many ways. However, what this means to users, developers, and hidden service administrators isn't always the same. Encrypted LeaseSets and their use-cases provide a unique, practical window into how I2P makes hidden services more versatile, easier to administer, and how I2P extends on the Hidden Service concept to provide security benefits for potentially interesting use-cases.
pt_br: Foi dito no passado que o I2P enfatiza o suporte para Serviços Ocultos, o que é verdade de muitas maneiras. No entanto, o que isso significa para usuários, desenvolvedores e administradores de serviços ocultos nem sempre é o mesmo. LeaseSets criptografados e seus casos de uso fornecem uma janela única e prática sobre como o I2P torna os serviços ocultos mais versáteis, mais fáceis de administrar e como o I2P se estende no conceito de Serviço Oculto para fornecer benefícios de segurança para casos de uso potencialmente interessantes.
tr: Geçmişte, I2P ağının birçok yönden doğru olan gizli hizmetlere desteğin önemini belirttiği söylendi. Ancak bunun kullanıcılar, geliştiriciler ve gizli hizmet yöneticileri için anlamı her zaman aynı değildir. "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) ve kullanım durumları, I2P ağının gizli hizmetleri nasıl daha çok yönlü ve kolay yönetilir hale getirdiği, potansiyel olarak ilginç kullanım durumlarında güvenlik avantajları sağlamak üzere I2P ağının gizli hizmet kavramını nasıl genişlettiği hakkında benzersiz, pratik bir bakış açısı sunar.

source: What is a LeaseSet? -------------------
pt_br: O que é um LeaseSet? -------------------
tr: "Kiralama kümesi" (LeaseSet) nedir? -------------------
