Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: jrandom wished to rewrite the IIP code base in Java, a language he was familiar with, and the same language Freenet was using. He also wished to redesign the IIP protocols based on recent papers and the early design decisions that Tor and Freenet were making. Some of these concepts and naming conventions, such as “onion routing”, were modified to become “garlic routing”. For several of the design decisions, jrandom made different choices than Tor did, including selecting different cryptographic primitives in a number of places. Many (but not all) of these choices turned out quite well. For some others, such as using unidirectional tunnels rather than Tor’s bidirectional tunnels, the benefits and trade-offs are still not well-studied.
pt_br: jrandom desejava reescrever a base de código do IIP em Java, uma linguagem com a qual ele estava familiarizado, e a mesma linguagem que a Freenet estava usando. Ele também desejava redesenhar os protocolos do IIP com base em artigos recentes e nas primeiras decisões de design que o Tor e a Freenet estavam tomando. Alguns desses conceitos e convenções de nomenclatura, como “roteamento cebola”, foram modificados para se tornarem “roteamento alho”. Para várias das decisões de design, jrandom fez escolhas diferentes do que o Tor, incluindo selecionar diferentes primitivas criptográficas em vários lugares. Muitas (mas não todas) dessas escolhas acabaram sendo muito boas. Para alguns outros, como usar túneis unidirecionais em vez dos túneis bidirecionais do Tor, os benefícios e compensações ainda não foram bem estudados.
tr: jrandom, IIP kod tabanını iyi bildiği ve Freenet tarafından kullanılan dil olan Java ile yeniden yazmak istedi. Ayrıca son makalelere ve Tor ile Freenet tarafından alınan erken tasarım kararlarına dayanarak IIP iletişim kurallarını yeniden tasarlamak istedi. Bu kavramlardan ve "onion yöneltme" gibi adlandırma kurallarından bazıları, "garlic yöneltme" olarak değiştirildi. Tasarım kararlarının birçoğu için jrandom, birçok yerde farklı şifreleme ilkellerinin seçilmesi ile birlikte Tor projesinden farklı seçimler yaptı. Bu seçimlerin çoğu (tümü değil) oldukça iyi sonuç verdi. Tor projesindeki çift yönlü tüneller yerine tek yönlü tüneller kullanmak gibi diğerleri için, yararları ve sağladıkları üzerine hala yeterince çok çalışma yapılmamıştır.

source: jrandom also set out a clear vision for the architecture of the code. It would be a client/server model, with the server (i.e. the router) isolated from any “client” protocols. Clients such as web browsers, web servers, IRC clients and servers, and others, would communicate through the router using I2CP, the I2P Client Protocol.
pt_br: jrandom também definiu uma visão clara para a arquitetura do código. Ele seria um modelo cliente/servidor, com o servidor (ou seja, o roteador) isolado de quaisquer protocolos “cliente”. Clientes como navegadores da web, servidores da web, clientes e servidores IRC, e outros, se comunicariam através do roteador usando I2CP, o Protocolo de Cliente I2P.
tr: jrandom ayrıca kodun mimarisi için net bir vizyon belirledi. Sunucunun (yani yönelticinin) herhangi bir "istemci" iletişim kuralından yalıtıldığı bir istemci/sunucu modeli tanımladı. Tarayıcılar, site sunucuları, IRC istemci ve sunucuları ile diğer uygulama istemcileri, I2CP I2P istemci iletişim kuralını kullanarak yöneltici aracılığıyla iletişim kuracaktı.

source: jrandom also had strong opinions on the direction of the project and its philosophy. He was strongly committed to open source and free software. He explicitly set a goal of protection from organizations with “unlimited financial and political resources.”
pt_br: jrandom também tinha opiniões fortes sobre a direção do projeto e sua filosofia . Ele estava fortemente comprometido com o código aberto e software livre. Ele explicitamente estabeleceu uma meta de proteção contra organizações com “recursos financeiros e políticos ilimitados”.
tr: jrandom, projenin yönü ve felsefesi hakkında da güçlü fikirlere sahipti. Açık kaynak ve özgür yazılıma son derece bağlıydı. Açıkça “sınırsız mali ve politik kaynaklara” sahip kuruluşlardan korunma hedefi koydu.

source: By late summer 2003, jrandom had taken control of the project, and renamed it the Invisible Internet Project or “I2P”. He published a document outlining the philosophy of the project, and placed its technical goals and design in the context of mixnets and anonymizing layers. He also published the specification of two protocols (I2CP and I2NP) and their underlying data structures, that formed the basis of the network I2P uses today. Lance (“nop”) was last seen in a project meeting on November 11, 2003.
pt_br: No final do verão de 2003, jrandom assumiu o controle do projeto e o renomeou como Invisible Internet Project ou “I2P”. Ele publicou um documento descrevendo a filosofia do projeto e colocou seus objetivos técnicos e design no contexto de mixnets e anonimização de camadas. Ele também publicou a especificação de dois protocolos (I2CP e I2NP) e suas estruturas de dados subjacentes, que formaram a base da rede que o I2P usa hoje. Lance (“nop”) foi visto pela última vez em uma reunião do projeto em 11 de novembro de 2003.
tr: 2003 yazının sonlarına doğru jrandom projenin denetimini ele aldı ve onu Invisible Internet Project veya “I2P” olarak yeniden adlandırdı. Projenin felsefesini özetleyen bir belge yayınladı ve teknik hedefleri ile tasarımını karma ağlar ve anonimleştirme katmanları bağlamına yerleştirdi. Ayrıca, bugün I2P tarafından kullanılan ağın temelini oluşturan iki iletişim kuralı (I2CP ve I2NP) ile bunların altında yatan veri yapılarının teknik özelliklerini yayınladı. Lance (“nop”) en son 11 Kasım 2003 tarihinde bir proje toplantısında görüldü.

source: By fall 2003, I2P, Freenet, and Tor were rapidly developing. Business Week published an article on “The Underground Internet” which referenced InvisibleNet and discussed “darknets” extensively. jrandom released I2P version 0.2 on November 1, 2003, and continued rapid releases for the next 3 years. He maintained regular weekly meetings and status notes during this time. Several popular services and “respites” emerged during this time. Auto updates via clearnet HTTP became available in 2004.
pt_br: No outono de 2003, I2P, Freenet e Tor estavam se desenvolvendo rapidamente. A Business Week publicou um artigo sobre “The Underground Internet” que fazia referência a InvisibleNet e discutia “darknets” extensivamente. jrandom lançou a versão 0.2 do I2P em 1º de novembro de 2003 e continuou com lançamentos rápidos pelos próximos 3 anos. Ele manteve reuniões semanais regulares e notas de status durante esse período. Vários serviços populares e “descansos” surgiram durante esse período. Atualizações automáticas via HTTP clearnet ficaram disponíveis em 2004.
tr: 2003 sonbaharında I2P, Freenet ve Tor hızla gelişiyordu. Business Week, InvisibleNet ile ilgili atıfta bulunan ve “darknet” kavramını kapsamlı bir şekilde tartışan “The Underground Internet” hakkında bir makale yayınladı. jrandom, 1 Kasım 2003 tarihinde I2P 0.2 sürümünü yayınladı ve sonraki 3 yıl boyunca hızlı bir tempoyla yeni sürümler yayınlanmayı sürdürdü. Düzenli haftalık toplantılar yaptı ve durum notları tuttu. Bu süre içinde beğenilen birkaç hizmet ve “erteleme” ortaya çıktı. 2004 yılında herkese açık İnternet üzerinden HTTP aracılığıyla otomatik güncellemeler sunuldu.

source: Through 2004 and 2005, router development continued, and several “clients” or applications were added to the I2P package. “Mihi” wrote the first streaming protocol implementation and the i2ptunnel interface for configuring and starting client tunnels. “Susi” wrote the web mail and address book applications SusiMail and SusiDNS. Many people worked on the router console web interface. A bridge to make it easier for non-I2P clients to communicate over I2P, called “SAM” (Simple Anonymous Messaging) was added.
pt_br: Durante 2004 e 2005, o desenvolvimento do roteador continuou, e vários “clientes” ou aplicativos foram adicionados ao pacote I2P. “Mihi” escreveu a primeira implementação do protocolo de streaming e a interface i2ptunnel para configurar e iniciar túneis de cliente. “Susi” escreveu o webmail e os aplicativos de catálogo de endereços SusiMail e SusiDNS. Muitas pessoas trabalharam na interface web do console do roteador. Uma ponte para facilitar a comunicação de clientes não I2P por I2P, chamada “SAM” (Simple Anonymous Messaging) foi adicionada.
tr: 2004 ve 2005 boyunca, yönelticinin geliştirilmesi sürdürüldü ve I2P paketine birkaç "istemci" veya uygulama eklendi. “Mihi”, istemci tünellerini yapılandırmak ve başlatmak için ilk akış iletişim kuralı uygulamasını ve i2ptunnel arabirimini yazdı. “Susi” internet e-postası ve adres defteri olarak SusiMail ve SusiDNS uygulamalarını yazdı. Yöneltici panosu internet arayüzünde birçok kişi çalıştı. I2P olmayan istemcilerin I2P üzerinden iletişim kurmasını kolaylaştırmak için “SAM” (basit anonim iletişim) adı verilen bir köprü eklendi.

source: In February 2005, zzz installed I2P for the first time.
pt_br: Em fevereiro de 2005, o zzz instalou o I2P pela primeira vez.
tr: 2005 Şubat ayında zzz ilk kez I2P kurdu.

source: Anonymity projects were in the news. After surveying the field, he installed Freenet, and found it ambiguous, and difficult to explore. Not only that, it was very resource heavy and it was difficult to get anything to load. Tor and I2P were the other options, and he tried I2P.
pt_br: Projetos de anonimato estavam nas notícias. Depois de pesquisar o campo, ele instalou o Freenet e achou-o ambíguo e difícil de explorar. Não só isso, ele era muito pesado em recursos e era difícil fazer qualquer coisa carregar. Tor e I2P eram as outras opções, e ele tentou I2P.
tr: Anonimlik projeleri güncel haberlerdeydi. Alanı inceledikten sonra kurduğu Freenet uygulamasını belirsiz ve keşfetmesi zor buldu. Yalnızca bu da değil, çok fazla kaynak harcıyordu ve kuracak bir şey bulmak zordu. Tor ve I2P diğer seçeneklerdi ve I2P uygulamasını denedi.

source: zzz had no preconceived plans to contribute to the project, and had never written a line of Java. He had maybe used IRC once. At this time, I2P was at version 0.5, with maybe a thousand users and three hard-coded floodfills. Forum.i2p and postman’s tracker were up and running at the time, and weekly meetings and status notes, and releases every couple of week were happening.
pt_br: zzz não tinha planos preconcebidos para contribuir com o projeto, e nunca escreveu uma linha de Java. Ele talvez tenha usado IRC uma vez. Nessa época, o I2P estava na versão 0.5, com talvez mil usuários e três floodfills codificados. O Forum.i2p e o rastreador do postman estavam funcionando no horário , e reuniões semanais e notas de status, e lançamentos a cada duas semanas estavam acontecendo.
tr: zzz önceleri projeye katkıda bulunmayı düşünmemişti ve o güne kadar bir satır Java kodu yazmamıştı. Belki bir kez IRC kullanmıştı. O sıralar I2P, belki bin kullanıcı ve üç sabit kodlanmış otomatik doldurma ile 0.5 sürümündeydi. Forum.i2p ve postman izleyici o zaman çalışır durumdaydı ve haftalık toplantılar ile durum notlarının yanında birkaç haftada bir yeni sürümler yayınlanıyordu.

source: By summer 2005, zzz had set up two websites. The first was zzz.i2p, which over the years became a central resource for I2P development, and still is. The second was stats.i2p, the first site to gather statistics on I2P network performance and present graphs on both the network and individual routers. While the individual router statistics eventually had to be shut down due to the tremendous growth of the network, the overall performance graphs remain. We are not sure that he ever planned to become the release manger for almost 2 decades, but we are happy he did. The project has not only stayed active, it has thrived and scaled to the demands of its growth.
pt_br: No verão de 2005, zzz havia criado dois sites. O primeiro foi zzz.i2p, que ao longo dos anos se tornou um recurso central para o desenvolvimento do I2P, e ainda é. O segundo foi stats.i2p, o primeiro site a reunir estatísticas sobre o desempenho da rede I2P e apresentar gráficos tanto na rede quanto em roteadores individuais. Enquanto as estatísticas individuais do roteador eventualmente tiveram que ser fechadas devido ao tremendo crescimento da rede, os gráficos de desempenho geral permanecem. Não temos certeza se ele planejou se tornar o gerente de lançamento por quase 2 décadas, mas estamos felizes que ele o fez. O projeto não apenas permaneceu ativo, como também prosperou e cresceu de acordo com as demandas de seu crescimento.
tr: 2005 yazında, zzz iki site kurmuştu. İlki, yıllar içinde I2P geliştirme çalışmaları için merkezi bir kaynak haline gelen ve hala öyle olan zzz.i2p idi. İkincisi, I2P ağ başarımı hakkında istatistikler toplayan ve hem ağın hem de bireysel yönelticilerin grafiklerini sunan ilk site olan stats.i2p idi. Ağın muazzam büyümesi nedeniyle sonunda bireysel yöneltici istatistikleri kapatılmak zorunda kalınırken, genel başarım grafikleri kaldı. Neredeyse 20 yıl boyunca sürüm yayınlama yöneticisi olmayı planladığını sanmıyoruz, ama bunu sürdürdüğü için mutluyuz. Proje yalnızca etkin olmakla kalmadı, genişledi ve büyüme isteklerine uygun olarak ölçeklendi.

source: On July 27, 2005, jrandom released I2P version 0.6, including an innovative new UDP transport protocol he designed called “SSU”, for Secure Semi-reliable UDP. It contained features for IP discovery and firewall traversal.
pt_br: Em 27 de julho de 2005, jrandom lançou a versão 0.6 do I2P, incluindo um novo e inovador protocolo de transporte UDP que ele projetou chamado “SSU”, para Secure Semi-reliable UDP. Ele continha recursos para descoberta de IP e travessia de firewall.
tr: 27 Temmuz 2005 tarihinde jrandom, güvenli yarı güvenilir UDP için “SSU” olarak adlandırılan yenilikçi yeni UDP taşıyıcı iletişim kuralı ile birlikte I2P 0.6 sürümünü yayınladı. Bu sürümde IP keşfi ve güvenlik duvarı geçişi için özellikler bulunuyordu.

source: In September 2005, jrandom bundled “Syndie”, his new high-latency anonymous messaging system. In October 2005, jrandom ported Snark, a Java BitTorrent client, to become an I2P application and bundled it with the I2P package. This completed the collection of client applications that are still bundled with I2P today.
pt_br: Em setembro de 2005, jrandom empacotou o “Syndie”, seu novo sistema de mensagens anônimas de alta latência . Em outubro de 2005, jrandom portou o Snark, um cliente Java BitTorrent , para se tornar um aplicativo I2P e o empacotou com o pacote I2P. Isso completou a coleção de aplicativos clientes que ainda são empacotados com o I2P hoje.
tr: 2005 Eylül ayında jrandom, yeni yüksek gecikmeli anonim iletişim sistemi olan “Syndie” uygulamasını pakete ekledi. 2005 Ekim ayında jrandom, bir Java BitTorrent istemcisi olan Snark uygulamasını bir I2P uygulaması haline getirdi ve I2P paketine ekledi. Böylece, bugün hala I2P ile birlikte verilen istemci uygulamaları derlemesi tamamlanmış oldu.

source: In late 2005 and early 2006, jrandom redesigned the way that I2P built tunnels. This was a major effort that was done to increase the security of the tunnel building, which is crucial to maintain anonymity and resist attacks. He worked closely with the Freenet developers, including “Toad”, on this design. The new build protocol required new I2NP messages and a hard cut-over or “flag day”. These changes were released in version 0.6.1.10 on February 16, 2006. This is significant as it is the last flag day I2P has had. While, in practice, an 0.6.1.10 router would not work well, if at all, in today’s network, we are, technically speaking, backwards-compatible with this ten-year-old version today.
pt_br: No final de 2005 e início de 2006, jrandom redesenhou a maneira como o I2P construiu túneis. Este foi um grande esforço que foi feito para aumentar a segurança da construção do túnel, o que é crucial para manter o anonimato e resistir a ataques. Ele trabalhou em estreita colaboração com os desenvolvedores da Freenet, incluindo “Toad”, neste projeto. O novo protocolo de construção exigiu novas mensagens I2NP e um hard cut-over ou “dia de sinalização”. Essas mudanças foram lançadas na versão 0.6.1.10 em 16 de fevereiro de 2006. Isso é significativo, pois é o último dia de sinalização que o I2P teve. Embora, na prática, um roteador 0.6.1.10 não funcionasse bem, se é que funcionaria, na rede atual, somos, tecnicamente falando, compatíveis com versões anteriores desta versão de dez anos.
tr: 2005 yılının sonlarında ve 2006 yılının başlarında jrandom, I2P uygulamasının tünel oluşturma şeklini yeniden tasarladı. Bu, anonimliği korumak ve saldırılara direnmek için çok önemli olan tünel oluşturma güvenliğini artırmak için harcanan büyük bir çabaydı. Bu tasarım üzerinde “Toad” dahil olmak üzere Freenet geliştiricileriyle yakın çalıştı. Yeni oluşturma iletişim kuralı, yeni I2NP iletileri ve kesin bir geçiş veya “flag day” gerektiriyordu. Bu değişiklikler 16 Şubat 2006 tarihinde 0.6.1.10 sürümünde yayınlandı. Bu, sürüm, son I2P flag day olması nedeniyle önemlidir. Pratikte, bir 0.6.1.10 yönelticisi bugünün ağında hiç iyi çalışmazken, teknik olarak konuşursak, bugün bu on yıllık sürümle geriye dönük olarak uyumluyuz.

source: By early 2006, the I2P software was at least feature-complete, but it was still not widely-known. jrandom’s view was that it shouldn’t be marketed publicly until it was near-perfect, and labeled as version 1.0. The network had perhaps a thousand users at the time. Project members were discouraged from talking about it online, and the website (`i2p.net <http://i2p.net>`__) was unpolished and incomplete.
pt_br: No início de 2006, o software I2P estava pelo menos completo em termos de recursos, mas ainda não era amplamente conhecido. A visão de jrandom era que ele não deveria ser comercializado publicamente até que estivesse quase perfeito e rotulado como versão 1.0. A rede tinha talvez mil usuários na época. Os membros do projeto foram desencorajados de falar sobre isso online, e o site (`i2p.net <http://i2p.net>`__) não era polido e estava incompleto.
tr: 2006 yılının başlarında, en azından I2P yazılımının tüm özellikleri tamamlanmıştı, ancak hala yaygın olarak bilinmiyordu. jrandom, mükemmele yakın olana ve 1.0 sürümü olarak etiketlenene kadar herkese açık olarak yayınlanmaması gerektiğini düşünüyordu. Ağın o sırada belki de bin kullanıcısı vardı. Proje üyeleri bu konuda çevrimiçi konuşmaktan caydırıldı. Site (`i2p.net <http://i2p.net>`__) ise eksik ve bakımsızdı.

source: On July 27, 2006, jrandom released I2P version 0.6.1.23, including an innovative new TCP transport protocol he designed called “NTCP”, for new-IO-based TCP. It used Java’s new IO library for efficient handling of large numbers of TCP connections.
pt_br: Em 27 de julho de 2006, jrandom lançou a versão 0.6.1.23 do I2P, incluindo um novo protocolo de transporte TCP inovador que ele projetou chamado “NTCP”, para TCP baseado em novo IO. Ele usou a nova biblioteca IO do Java para manipulação eficiente de grandes números de conexões TCP.
tr: 27 Temmuz 2006 tarihinde jrandom, yeni IO tabanlı TCP için “NTCP” adlı yenilikçi bir TCP taşıyıcı iletişim kuralı ile birlikte I2P 0.6.1.23 sürümünü yayınladı. Çok sayıda TCP bağlantısının verimli bir şekilde işlenmesi için yeni Java IO kitaplığını kullandı.

source: In late 2006, jrandom turned his focus to Syndie. He came to see it as his top priority, and the “killer application” for I2P. Highly secure and almost unusable, it delayed messages for up to two days before delivery to resist traffic analysis. Later in 2006, he stopped work on the bundled Syndie application and started a new, incompatible, standalone messaging application. This application was, confusingly, also called “Syndie”. The new Syndie was a large and complex development, and it was essentially a one-man project.
pt_br: No final de 2006, jrandom voltou seu foco para Syndie. Ele passou a vê-lo como sua principal prioridade, e o “aplicativo matador” para I2P. Altamente seguro e quase inutilizável, ele atrasava mensagens por até dois dias antes da entrega para resistir à análise de tráfego. Mais tarde, em 2006, ele parou de trabalhar no aplicativo Syndie empacotado e iniciou um novo aplicativo de mensagens independente, incompatível. Este aplicativo era, confusamente, também chamado de “Syndie”. O novo Syndie era um desenvolvimento grande e complexo , e era essencialmente um projeto de uma pessoa só.
tr: 2006 yılının sonlarında jrandom, odağını Syndie uygulamasına çevirdi. Bunu en önemli önceliği ve I2P için “vurucu uygulama” olarak görmeye başladı. Son derece güvenli ve neredeyse kullanılamaz durumda olan bu sistem, trafik analizine direnmek için iletileri teslimattan iki gün sonrasına kadar geciktirebiliyordu. Daha sonra 2006 yılında, birlikte verilen Syndie uygulaması üzerindeki çalışmayı durdurdu ve yeni, uyumsuz, bağımsız bir iletişim uygulaması başlattı. Bu uygulamaya da kafa karıştırıcı bir şekilde “Syndie" deniyordu. Yeni Syndie, büyük ve karmaşık bir gelişmeydi ve özünde tek kişilik bir projeydi.

source: From late 2006 into 2007, core I2P development and releases slowed dramatically. From almost 30 releases in 2005 and 13 in the first half of 2006, there were only 5 in the second half of 2006 and only 4 in all of 2007. During this time, zzz and a developer named Complication had source code commit privileges and were making changes, but their understanding of the code base was limited. zzz worked, for example, on improving i2psnark, fixing bugs, and redesigning the strategy for anticipatory tunnel building. But there was a lot more that needed to be done. Complication and zzz did what they could, and they wrote the code for almost all the changes in the four 2007 releases (0.6.1.27–0.6.1.30). By this time, jrandom was providing very little guidance, code review, or direction for the project.
pt_br: Do final de 2006 até 2007, o desenvolvimento e lançamentos do núcleo I2P desaceleraram drasticamente. De quase 30 lançamentos em 2005 e 13 no primeiro semestre de 2006, houve apenas 5 no segundo semestre de 2006 e apenas 4 em todo de 2007. Durante esse tempo, zzz e um desenvolvedor chamado Complication tinham privilégios de confirmação de código-fonte e estavam fazendo alterações, mas seu entendimento da base de código era limitado. zzz trabalhou, por exemplo, em melhorar o i2psnark, corrigir bugs e redesenhar a estratégia para construção antecipada de túneis. Mas havia muito mais que precisava ser feito. Complication e zzz fizeram o que puderam e escreveram o código para quase todas as mudanças nas quatro versões de 2007 (0.6.1.27–0.6.1.30). Nessa época, jrandom estava fornecendo muito pouca orientação, revisão de código ou direção para o projeto.
tr: 2006 yılının sonundan 2007 yılına kadar, çekirdek I2P geliştirme ve sürümleri önemli ölçüde yavaşladı. 2005 yılında 30 taneye yakın ve 2006 yılının ilk yarısında 13 taneye yakın sürümün yayınlanmasından sonra, 2006 yılının ikinci yarısında yalnızca 5 ve 2007 yılının tamamında yalnızca 4 sürüm yayınlandı. Bu sürede, zzz ve Complication adlı bir geliştirici, kaynak kodu kaydetme ayrıcalıklarına sahipti ve yapabilecekleri değişiklikler, ancak kod tabanını anlamaları ile sınırlıydı. örneğin zzz, i2psnark uygulamasını geliştirmek, hataları düzeltmek ve ileriye dönük tünel oluşturma için stratejiyi yeniden tasarlamak üzerine çalıştı. Ama daha yapılması gereken çok şey vardı. Complication ve zzz ellerinden geleni yaptılar ve 2007 yılındaki dört sürümde (0.6.1.27–0.6.1.30) neredeyse tüm değişiklik kodlarını yazdılar. O sıralarda jrandom, proje için rehberlik, kod incelemesi veya yönlendirme için çok az katkıda bulunuyordu.
