Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: MOAR speed! ===========
pt_br: Velocidade MOAR! ===========
tr: MOAR hızı! ===========

source: Our development programme this year will have four components:
pt_br: Nosso programa de desenvolvimento deste ano terá quatro componentes:
tr: Bu yılki geliştirme programımızın dört bileşeni olacak:

source: Measure -------
pt_br: Medida -------
tr: Ölçmek (Measure) -------

source: We can't tell if we improve performance without a baseline! We'll be creating a metrics system for collecting usage and performance data about I2P in a privacy-preserving way, as well as porting various benchmarking tools to run over I2P (e.g. iperf3_).
pt_br: Não podemos dizer se melhoramos o desempenho sem uma linha de base! Criaremos um sistema de métricas para coletar dados de uso e desempenho sobre I2P de uma forma que preserve a privacidade, bem como portar várias ferramentas de benchmarking para rodar sobre I2P (por exemplo, iperf3_).
tr: Bir temel olmadan başarımı iyileştirip iyileştirmediğimizi söyleyemeyiz! I2P ile ilgili kullanım ve başarım verilerini gizliliği koruyacak bir şekilde toplamak için bir ölçüm sistemi oluşturacağız ve ayrıca I2P üzerinden çalışacak çeşitli karşılaştırma araçlarını taşıyacağız (iperf3_ gibi).

source: Optimise --------
pt_br: Otimizar --------
tr: İyileştirmek (Optimise) --------

source: There's a lot of scope for improving the performance of our existing code, to e.g. reduce the overhead of participating in tunnels. We will be looking at potential improvements to:
pt_br: Há muito espaço para melhorar o desempenho do nosso código existente, para por exemplo, reduzir a sobrecarga de participar de túneis. Estaremos analisando melhorias potenciais para:
tr: Var olan kodumuzun başarımını iyileştirebileceğimiz çok fazla yer var, Örneğin tünellere katılmanın ek yükünü azaltabiliriz. Aşağıdakiler için potansiyel iyileştirmelere bakacağız:

source: Cryptographic primitives
pt_br: Primitivas criptográficas
tr: Şifreleme ön koşulları

source: Network transports, both at the link-layer (NTCP_, SSU_) and end-to-end (Streaming_)
pt_br: Transportes de rede, tanto na camada de enlace (NTCP_, SSU_) quanto de ponta a ponta (Streaming_)
tr: Hem bağlantı katmanında (NTCP_, SSU_) hem de uçtan uca (Streaming_) ağ taşıyıcıları

source: Peer profiling
pt_br: Criação de perfil de pares
tr: Eş profilleme

source: Tunnel path selection
pt_br: Seleção do caminho do túnel
tr: Tünel yolu seçimi

source: Advance -------
pt_br: Avançar -------
tr: Geliştirmek (Advance) -------

source: We have several open proposals for improving the scalability of the I2P network (e.g. Prop115_, Prop123_, Prop124_, Prop125_, Prop138_, Prop140_). We will be working on these proposals, and begin implementing the finalised ones in the various network routers. The more feedback these proposals receive, the sooner we can roll them out, and the sooner I2P services can start using them!
pt_br: Temos várias propostas abertas para melhorar a escalabilidade da rede I2P (por exemplo, Prop115_, Prop123_, Prop124_, Prop125_, Prop138_, Prop140_). Estaremos trabalhando nessas propostas e começaremos a implementar as finalizadas nos vários roteadores de rede. Quanto mais feedback essas propostas receberem, mais cedo poderemos implementá-las e mais cedo os serviços I2P poderão começar a usá-las!
tr: I2P ağının ölçeklenebilirliğini geliştirmek için birkaç açık öneri var (Öneri115_, Öneri123_, Öneri124_, Öneri125_, Öneri138_, Öneri140_ gibi). Bu öneriler üzerinde çalışacağız ve çeşitli ağ yönelticilerinde sonuçlandırılmış olanları uygulamaya başlayacağız. Bu öneriler ne kadar çok geri bildirim alırsa, onları o kadar çabuk kullanıma sunabiliriz ve I2P hizmetleri de onları o kadar çabuk kullanmaya başlayabilir!

source: Research --------
pt_br: Pesquisa --------
tr: Araştırmak (Research) --------

source: I2P is a packet-switched network, like the internet it runs on top of. This gives us significant flexibility in how we route packets, both for performance and privacy. The majority of this flexibility is unexplored! We want to encourage research into how various clearnet techniques for improving bandwidth can be applied to I2P, and how they might affect the privacy of network participants.
pt_br: I2P é uma rede comutada por pacotes, como a internet sobre a qual ela roda. Isso nos dá flexibilidade significativa em como roteamos pacotes, tanto para desempenho quanto para privacidade. A maior parte dessa flexibilidade é inexplorada! Queremos encorajar pesquisas sobre como várias técnicas de clearnet para melhorar a largura de banda podem ser aplicadas ao I2P, e como elas podem afetar a privacidade dos participantes da rede .
tr: I2P, üzerinde çalıştığı İnternet gibi paket anahtarlamalı bir ağdır. Bu bize, hem başarım hem de gizlilik açısından paketleri nasıl yönelteceğimiz konusunda önemli bir esneklik sağlar. Bu esnekliğin çoğu keşfedilmemiş durumda! Bant genişliğini iyileştirmek için herkese açık normal İnternet tekniklerinin I2P üzerine nasıl uygulanabileceği ve bunların ağ katılımcılarının gizliliğini nasıl etkileyebileceği konusunda araştırmaları teşvik etmek istiyoruz.

source: We have many more ideas for things we'd like to get done in these areas. If you're interested in hacking on privacy and anonymity software, designing protocols (cryptographic or otherwise), or researching future ideas - come and chat with us on IRC or Twitter! We are always happy to welcome newcomers into our community, both inside and outside the I2P network. We'll also be sending I2P stickers out to all new contributors taking part! If you want to chat about a specific idea, contact `@GetI2P`_, `@i2p`_ or `@str4d`_ on Twitter. You can also find us in #i2p-dev on OFTC or Freenode.
pt_br: Temos muito mais ideias para coisas que gostaríamos de fazer nessas áreas. Se você estiver interessado em hackear software de privacidade e anonimato, projetar protocolos (criptográficos ou não) ou pesquisar ideias futuras - venha e converse conosco no IRC ou Twitter! Estamos sempre felizes em receber novatos em nossa comunidade, tanto dentro quanto fora da rede I2P. Também enviaremos adesivos I2P para todos os novos colaboradores que participarem! Se quiser conversar sobre uma ideia específica, entre em contato com `@GetI2P`_, `@i2p`_ ou `@str4d`_ no Twitter. Você também pode nos encontrar em #i2p-dev no OFTC ou Freenode.
tr: Bu alanlarda yapmak istediğimiz şeyler için daha birçok fikrimiz var. Gizlilik ve anonimlik yazılımlarını hacklemek, iletişim kuralları tasarlamak (şifrelenmiş veya başka türlü) veya gelecekteki fikirleri araştırmakla ilgileniyorsanız - gelin ve bizimle IRC veya Twitter üzerinde sohbet edin! Hem I2P ağının içinde hem de dışında topluluğumuza yeni gelenleri memnuniyetle karşılıyoruz. Ayrıca tüm yeni katılımcılara I2P çıkartmaları göndereceğiz! Belirli bir fikir hakkında sohbet etmek istiyorsanız, Twitter üzerinde `@GetI2P`_, `@i2p`_ veya `@str4d`_ ile görüşebilirsiniz. Ayrıca OFTC veya Freenode üzerinde #i2p-dev kanalında bizi bulabilirsiniz.

source: Low-latency onion-routing networks are vulnerable to traffic confirmation attacks, so it would be reasonable to ask whether improved performance equates to reduced privacy. Some latency can help privacy if applied correctly via random delays or batching (neither of which are currently employed by any general-purpose onion-routing network). However, if a tunnel has uniform overall latency, then traffic confirmation attacks should be just as viable with or without that latency; thus there should be little statistical difference when the latency is reduced uniformly.
pt_br: Redes de roteamento onion de baixa latência são vulneráveis a ataques de confirmação de tráfego, então seria razoável perguntar se desempenho melhorado equivale a privacidade reduzida. Alguma latência pode ajudar a privacidade se aplicada corretamente por meio de atrasos aleatórios ou loteamento (nenhum dos quais é atualmente empregado por qualquer rede de roteamento onion de propósito geral). No entanto, se um túnel tiver latência geral uniforme, então ataques de confirmação de tráfego devem ser igualmente viáveis com ou sem essa latência; portanto, deve haver pouca diferença estatística quando a latência é reduzida uniformemente.
tr: Düşük gecikmeli onion yöneltme ağları, trafik doğrulama saldırılarına karşı savunmasızdır. Bu nedenle, iyileştirilmiş başarımın azaltılmış gizliliğe eşit olup olmadığını sormak mantıklı olacaktır. Bazı gecikmeler, rastgele gecikmeler veya toplu işlem yoluyla doğru şekilde uygulanırsa gizliliğe yardımcı olabilir (bunların hiçbiri şu anda herhangi bir genel amaçlı onion yöneltme ağı tarafından kullanılmamaktadır). Ancak, bir tünelde tek tip genel gecikme varsa, trafik doğrulama saldırıları bu gecikmeyle veya gecikme olmadan aynı şekilde uygulanabilir olmalıdır. Bu nedenle gecikme eşit olarak azaltıldığında çok az istatistiksel fark olmalıdır.

source: ============== 0.9.31 Release ==============
pt_br: ============== Lançamento 0.9.31 ==============
tr: ===================== 0.9.31 sürümü yayınlandı =====================

source: 0.9.31 with Console Updates
pt_br: 0.9.31 com atualizações de console
tr: 0.9.31 sürümü pano güncellemeleri ile yayınlandı

source: The changes in this release are much more noticeable than usual! We have refreshed the router console to make it easier to understand, improve accessibility and cross-browser support, and generally tidy things up. This is the first step in a longer-term plan to make the router console more user-friendly. We have also added torrent ratings and comments support to i2psnark.
pt_br: As mudanças nesta versão são muito mais perceptíveis do que o normal! Atualizamos o console do roteador para torná-lo mais fácil de entender, melhoramos a acessibilidade e o suporte entre navegadores, e arrumamos as coisas de modo geral. Este é o primeiro passo em um plano de longo prazo para tornar o console do roteador mais amigável. Também adicionamos suporte a classificações de torrent e comentários ao i2psnark.
tr: Bu sürümdeki değişiklikler normalden çok daha belirgin! Anlamayı kolaylaştırmak, erişilebilirliği ve tarayıcılar arası desteği iyileştirmek ve genel olarak işleri düzene sokmak için yöneltici panosunu yeniledik. Bu çalışmalar, yöneltici panosunu daha kullanıcı dostu yapmak için uzun vadeli bir planın ilk adımıdır. Ayrıca i2psnark üzerine torrent değerlendirme ve yorum desteği ekledik.

source: Console updates
pt_br: Atualizações do console
tr: Pano güncellemeleri

source: i2psnark ratings and comments
pt_br: avaliações e comentários do i2psnark
tr: i2psnark değerlendirmeleri ve yorumları

source: Fix compile error with Jetty 9.2.22
pt_br: Corrigir erro de compilação com Jetty 9.2.22
tr: Jetty 9.2.22 sürümü ile derleme hatası düzeltildi

source: Preserve CRT parameters for RSA private keys
pt_br: Preservar parâmetros CRT para chaves privadas RSA
tr: RSA özel anahtarları için CRT parametrelerinin korunması sağlandı

source: Fix AES NPE on 4-core Rasp. Pi
pt_br: Corrigir AES NPE em Rasp. Pi de 4 núcleos
tr: 4 çekirdekli Raspberry Pi üzerindeki AES NPE düzeltildi

source: Fix NPE in GeoIP
pt_br: Corrigir NPE no GeoIP
tr: GeoIP üzerindeki NPE düzeltildi

source: Fix bencoding for scrape response in zzzot plugin
pt_br: Corrigir bencoding para resposta de scrape no plugin zzzot
tr: zzzot uygulama ekinde kazıma yanıtının kodlaması düzeltildi

source: Fix display of default SusiDNS subscription
pt_br: Corrigir exibição da assinatura padrão do SusiDNS
tr: Varsayılan SusiDNS aboneliğinin görüntüsü düzeltildi

source: Fix Debian apparmor profile
pt_br: Corrigir perfil do Debian apparmor
tr: Debian apparmor profili düzeltildi

source: Improve handling of read-only i2psnark directory
pt_br: Melhorar o manuseio do diretório i2psnark somente leitura
tr: Salt okunur i2psnark dizininin işlenmesi iyileştirildi

source: Hostname lookup caching improvements
pt_br: Melhorias no cache de pesquisa de nome de host
tr: Sunucu adı arama ön belleği iyileştirmeleri yapıldı

source: Move blockfile support from i2p.jar to addressbook.jar
pt_br: Mover suporte a blockfile de i2p.jar para addressbook.jar
tr: Blockfile desteği i2p.jar üzerinden addressbook.jar üzerine taşındı

source: Locale-independent Jetty directory listing
pt_br: Listagem de diretório Jetty independente de localidade
tr: Yerel ayardan bağımsız Jetty klasör listesi

source: ============== 0.9.32 Release ==============
pt_br: ============== Lançamento 0.9.32 ==============
tr: ====================== 0.9.32 sürümü yayınlandı ======================

source: 0.9.32 with Console Updates
pt_br: 0.9.32 com atualizações de console
tr: 0.9.32 sürümü pano güncellemeleri ile yayınlandı

source: 0.9.32 contains a number of fixes in the router console and associated webapps (addressbook, i2psnark, and susimail). We have also changed the way we handle configured hostnames for published router infos, to eliminate some network enumeration attacks via DNS. We have added some checks in the console to resist rebinding attacks.
pt_br: A versão 0.9.32 contém várias correções no console do roteador e aplicações web associadas (livro de endereços, i2psnark, e susimail). Nós também mudamos a forma como nós lidamos com nomes de host configurados para informações de roteador publicadas, para eliminar alguns ataques de enumeração de rede via DNS. Nós adicionamos algumas verificações no console para resistir a ataques de revinculação.
tr: 0.9.32 sürümünde yöneltici panosunda ve ilgili internet uygulamalarında (adres defteri, i2psnark ve susimail) çeşitli hata düzeltmeleri yapıldı. Ayrıca DNS üzerinden yapılan bazı ağ listeleme saldırılarını engellemek amacıyla yayınlanmış yöneltici bilgileri için yapılandırılmış sunucu adlarının işlenme yöntemi değiştirildi. Yeniden bağlanma saldırılarını engellemek amacıyla panoya bazı denetimler eklendi.

source: Disallow hostnames in router addresses (proposal 141)
pt_br: Não permitir nomes de host em endereços de roteador (proposta 141)
tr: Yöneltici adreslerinde sunucu adları engellendi (141 numaralı öneri)

source: Validate Host header in console
pt_br: Validar cabeçalho do host no console
tr: Panoda sunucu üst bilgileri doğrulaması eklendi

source: Numerous console, i2psnark, susidns, and susimail UI fixes
pt_br: Várias correções de interface de usuário do console, i2psnark, susidns e susimail
tr: Çok sayıda pano, i2psnark, sudns ve susimail kullanıcı arayüzü düzeltmeleri yapıldı

source: Fix i2psnark issues with expanding sections in some browsers
pt_br: Corrigir problemas do i2psnark com expansão de seções em alguns navegadores
tr: Bazı tarayıcılarda genişleyen bölümlerle ilgili i2psnark sorunları düzeltildi

source: Debian packaging fixes
pt_br: Correções de empacotamento Debian
tr: Debian paketleri düzeltildi

source: New benchmarking framework
pt_br: Nova estrutura de benchmarking
tr: Yeni kıyaslama çatısı

source: New Indonesian translation
pt_br: Nova tradução para o indonésio
tr: Endonezyaca çevirisi eklendi

source: 0.9.33 Release
pt_br: Lançamento 0.9.33
tr: 0.9.33 sürümü yayınlandı

source: 0.9.33 with Bug Fixes
pt_br: 0.9.33 com correções de bugs
tr: 0.9.33 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.33 contains a large number of bug fixes, including i2psnark, i2ptunnel, streaming, and SusiMail. For those who cannot access the reseed sites directly, we now support several types of proxies for reseeding. We now set rate limits by default in the hidden services manager. For those that run high-traffic servers, please review and adjust the limits as necessary.
pt_br: A versão 0.9.33 contém um grande número de correções de bugs, incluindo o i2psnark, o i2ptunnel, streaming, e o SusiMail. Para aqueles que não conseguem acessar os sites de repropagação diretamente, nós agora suportamos vários tipos de proxies para repropagação. Nós agora definimos limites de taxa por padrão no gerenciador de serviços ocultos. Para aqueles que executam servidores de alto tráfego, por favor, revisem e ajustem os limites conforme necessário.
tr: 0.9.33 sürümünde i2psnark, i2ptunnel, akış ve SusiMail üzerinde çok sayıda hata düzeltildi. Yeniden tohumlanan sitelere erişemeyenler için bir kaç yeniden tohumlama vekil sunucusu türü daha destekleniyor. Artık gizli hizmetler yönetimi bölümündeki hız sınırlamaları varsayılan olarak uygulanıyor. Yüksek trafikli site kullanıcılarının bu sınırları gözden geçirdikten sonra ayarlaması gerekebilir.

source: DesktopGui: Enable on OSX
pt_br: DesktopGui: Habilitar no OSX
tr: DesktopGui: OSX üzerinde etkinleştirildi

source: i2ptunnel: Set default rate limits
pt_br: i2ptunnel: Definir limites de taxa padrão
tr: i2ptunnel: Varsayılan hız sınırları ayarlandı

source: Reseeding: Add support for proxies
pt_br: Reseeding: Adicionar suporte para proxies
tr: Yeniden tohumlama: Vekil sunucu desteği eklendi

source: new installs only
pt_br: somente novas instalações
tr: yalnızca yeni kurulumlar

source: Client: Remove key when stopping or disabling encrypted lease set
pt_br: Cliente: Remover chave ao parar ou desabilitar conjunto de arrendamento criptografado
tr: İstemci: "Şifrelenmiş kiralama kümesini" (EncryptedLeaseSet) durdururken veya devre dışı bırakırken anahtarın silinmesi sağlandı

source: Console: Several keyring configuration fixes
pt_br: Console: Várias correções de configuração de chaveiro
tr: Pano: Birkaç anahtarlık yapılandırması düzeltildi

source: EepGet: Detect and reject redirect to https
pt_br: EepGet: Detectar e rejeitar redirecionamento para https
tr: EepGet: https yönlendirmesi algılandı ve reddedildi

source: HTTP Proxy: Fix up characters in URLs not escaped by browsers
pt_br: Proxy HTTP: Corrigir caracteres em URLs que não foram escapados pelos navegadores
tr: HTTP vekil sunucusu: Tarayıcılar tarafından kaçmayan adreslerdeki karakterler düzeltildi

source: i2psnark: Fix bad completion status on recheck
pt_br: i2psnark: Corrigir status de conclusão incorreto na nova verificação
tr: i2psnark: Yeniden denetim sırasında hatalı tamamlama durumu düzeltildi

source: i2psnark: Prohibit comments unless name is set
pt_br: i2psnark: Proibir comentários a menos que o nome esteja definido
tr: i2psnark: Ad ayarlanmadıysa yorum yapılamaması sağlandı

source: i2psnark: Fix crash stopping update torrent
pt_br: i2psnark: Corrigir travamento interrompendo atualização de torrent
tr: i2psnark: Torrent güncellemesini durduran kilitlenme düzeltildi

source: i2ptunnel: Don't erase messages on refresh in UI
pt_br: i2ptunnel: Não apague mensagens ao atualizar na IU
tr: i2ptunnel: Kullanıcı arayüzü yenilenirken iletilerin silinmemesi sağlandı

source: i2ptunnel: Propagate reset to and from streaming
pt_br: i2ptunnel: Propagar reset de e para streaming
tr: i2ptunnel: Sıfırlamayı akışa yayma ve akıştan alma eklendi

source: i2ptunnel: Add header read timeouts to client proxies
pt_br: i2ptunnel: Adicionar tempos limite de leitura de cabeçalho aos proxies do cliente
tr: i2ptunnel: İstemci vekil sunucularına üst bilgi okuma zaman aşımları eklendi

source: i2ptunnel: Prevent changing sig type after creating destination
pt_br: i2ptunnel: Impedir alteração do tipo de assinatura após a criação do destino
tr: i2ptunnel: Hedef oluşturulduktan sonra sig türünün değiştirilmesi önlendi

source: Jetty: Fix zero length in request log for static content
pt_br: Jetty: Corrigir comprimento zero no log de solicitação para conteúdo estático
tr: İskele: Durağan içerik için istek günlüğündeki sıfır uzunluk düzeltildi

source: Router: Reduce router info lock contention
pt_br: Roteador: reduza a contenção de bloqueio de informações do roteador
tr: Yöneltici: Yöneltici bilgileri kilidi çakışması azaltıldı

source: Streaming: Fix loopback hangs
pt_br: Streaming: Corrigir travamentos de loopback
tr: Akış: Geri döngü takılmaları düzeltildi

source: Streaming: Fix bug causing excessive acks
pt_br: Streaming: Corrigir bug que causava acks excessivos
tr: Akış: Aşırı onaylara neden olan hata düzeltildi

source: Streaming: Fix connection close after reset
pt_br: Streaming: Corrigir conexão fechada após redefinição
tr: Akış: Sıfırlamadan sonra bağlantı kapanması düzeltildi

source: SusiMail: Fix several issues when using multiple browser tabs
pt_br: SusiMail: Corrigir vários problemas ao usar várias guias do navegador
tr: SusiMail: Birden çok tarayıcı sekmesi kullanırken oluşan birkaç sorun düzeltildi

source: SusuMail: Fix bugs corrupting text attachments and large message bodies
pt_br: SusuMail: Corrigir bugs que corrompem anexos de texto e corpos de mensagens grandes
tr: SusiMail: Metin ek dosyalarını ve büyük ileti gövdelerini bozan hatalar düzeltildi

source: SusiMail: Reject sending messages that exceed server limits
pt_br: SusiMail: Rejeitar o envio de mensagens que excedam os limites do servidor
tr: SusiMail: Sunucu sınırlarını aşan iletilerin gönderilmesi reddedildi

source: SusiMail: Reduce chance of crashes sending large attachments
pt_br: SusiMail: Reduza a chance de travamentos ao enviar anexos grandes
tr: SusiMail: Büyük ek dosyaları gönderirken çökme olasılığı azaltıldı

source: SusiMail: Subject line encoding fixes
pt_br: SusiMail: correções na codificação da linha de assunto
tr: SusiMail: Konu satırı kodlama düzeltmeleri yapıldı

source: SusiMail: Fix Cc header
pt_br: SusiMail: Corrigir cabeçalho Cc
tr: SusiMail: Cc üst bilgisi düzeltildi

source: SusiMail: Fix encoding for attachment file names
pt_br: SusiMail: Corrigir codificação para nomes de arquivos anexos
tr: SusiMail: Ek dosya adları için kodlama düzeltildi

source: SusiMail: POP3 socket close after failure
pt_br: SusiMail: Socket POP3 fechado após falha
tr: SusiMail: POP3 soketinin başarısızlık sonra kapanması düzeltildi

source: Unit test fixes
pt_br: Correções de testes unitários
tr: Birim testi düzeltmeleri yapıldı

source: Utils: Use constant-time method to check passwords
pt_br: Utilitários: Use o método de tempo constante para verificar senhas
tr: Araçlar: Parolaları denetlemek için sabit zaman yöntemi kullanıldı

source: Build: Add partial Gradle support
pt_br: Build: Adicionar suporte parcial ao Gradle
tr: Yapım: Kısmi Gradle desteği eklendi

source: Console: Hide or combine aliased tunnels on tunnels pages
pt_br: Console: Ocultar ou combinar túneis com alias em páginas de túneis
tr: Pano: Tünel sayfalarındaki takma ad tünelleri gizlendi ya da birleştirildi

source: Console: Note encrypted leasesets on netdb page
pt_br: Console: Observe os leasesets criptografados na página netdb
tr: Pano: "Ağ veri tabanı" (NetDB) sayfasında "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) belirtildi

source: Console: Use bandwidth setting for burst bandwidth
pt_br: Console: Use a configuração de largura de banda para largura de banda de pico
tr: Pano: Ani bant genişliği artışı için bant genişliği ayarı kullanıldı

source: Console: Refactor multipart form handling to use Servlet 3.0 API
pt_br: Console: Refatorar o tratamento de formulários multipartes para usar a API do Servlet 3.0
tr: Pano: Servlet 3.0 API uygulamasını kullanmak için çok parçalı form işleme kodu elden geçirildi

source: Console: Move most handlers and helpers to the war
pt_br: Console: Mova a maioria dos manipuladores e ajudantes para a guerra
tr: Pano: Çoğu işleyiciyi ve yardımcıyı war üzerine taşındı

source: Debian: Xenial build is now separate, Zesty+ matches Buster
pt_br: Debian: a compilação Xenial agora é separada, Zesty+ corresponde ao Buster
tr: Debian: Xenial yapısı artık ayrı, Zesty+ Buster ile eşleşiyor

source: Debian: Remove ecj dependency; replace glassfish with libtaglibs where able
pt_br: Debian: Remover dependência ecj; substituir glassfish por libtaglibs quando possível
tr: Debian: ecj bağımlılığını kaldırıldı; yapılabildiğinde glassfish libtaglibs ile değiştirildi

source: Debian: Fix builds for x32
pt_br: Debian: Corrigir compilações para x32
tr: Debian: x32 için derlemeler düzeltildi
