Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: I prefer to store the SAM address as a String and an Integer, and re-combine them in a function at runtime.
pt_br: Prefiro armazenar o endereço SAM como uma String e um Inteiro e recombiná-los em uma função em tempo de execução.
tr: SAM adresini bir dizge ve tamsayı olarak saklamayı ve bunları runtime içinde bir işlevde yeniden birleştirmeyi yeğliyorum.

source: Storing the Signature Type
pt_br: Armazenando o tipo de assinatura
tr: İmza türünü kaydetmek

source: The valid signature types for an I2P Tunnel are DSA_SHA1, ECDSA_SHA256_P256, ECDSA_SHA384_P384, ECDSA_SHA512_P521, EdDSA_SHA512_Ed25519, but it is strongly recommended that you use EdDSA_SHA512_Ed25519 as a default if you implement at least SAM 3.1. In java, the 'enum' datastructure lends itself to this task, as it is intended to contain a group of constants. Add the enum, and an instance of the enum, to your java class definition.
pt_br: Os tipos de assinatura válidos para um túnel I2P são DSA_SHA1, ECDSA_SHA256_P256, ECDSA_SHA384_P384, ECDSA_SHA512_P521, EdDSA_SHA512_Ed25519, mas é fortemente recomendado que você use EdDSA_SHA512_Ed25519 como padrão se você implementar pelo menos SAM 3.1. Em Java, a estrutura de dados 'enum' se presta a essa tarefa, pois ela se destina a conter um grupo de constantes. Adicione o enum e uma instância do enum à sua definição de classe Java.
tr: Bir I2P tüneli için geçerli imza türleri DSA_SHA1, ECDSA_SHA256_P256, ECDSA_SHA384_P384, ECDSA_SHA512_P521, EdDSA_SHA512_Ed25519 şeklindedir. Ancak en azından SAM uygularsanız, varsayılan olarak EdDSA_SHA512_Ed25519 kullanmanız şiddetle önerilir. Java üzerinde 'enum' veri yapısı, bir sabitler grubu içermesi amaçlandığından bu göreve uygundur. Java sınıfı tanımınıza enum ve bir enum kopyasını ekleyin.

source: Retrieving the signature type:
pt_br: Recuperando o tipo de assinatura:
tr: İmza türünü almak:

source: That takes care of reliably storing the signature type in use by the SAM connection, but you've still got to retrieve it as a string to communicate it to the bridge.
pt_br: Isso cuida do armazenamento confiável do tipo de assinatura em uso pela conexão SAM , mas você ainda precisa recuperá-lo como uma string para comunicá-lo à ponte.
tr: SAM bağlantısı tarafından kullanılan imza türünü güvenilir bir şekilde saklamayı sağlar. Ancak yine de onu köprüye iletmek için bir dizge olarak almanız gerekir.

source: It's important to test things, so let's write some tests:
pt_br: É importante testar coisas, então vamos escrever alguns testes:
tr: Bir şeyleri denemek önemlidir. Bu yüzden bazı deneme kodları yazalım:

source: Once that's done, begin creating your constructor. Note that we've given our library defaults which will be useful in default situations on all existing I2P routers so far.
pt_br: Uma vez feito isso, comece a criar seu construtor. Note que demos à nossa biblioteca padrões que serão úteis em situações padrão em todos os roteadores I2P existentes até agora.
tr: Bu yapıldıktan sonra, kurucunuzu oluşturmaya başlayın. Şu ana kadar var olan tüm I2P yönelticilerinde varsayılan durumlarda faydalı olacak kitaplık varsayılanlarımızı verdiğimizi unutmayın.

source: Establishing a SAM Connection
pt_br: Estabelecendo uma conexão SAM
tr: SAM bağlantısı kurmak

source: Finally, the good part. Interaction with the SAM bridge is done by sending a "command" to the address of the SAM bridge, and you can parse the result of the command as a set of string-based key-value pairs. So bearing that in mind, let's estabish a read-write connection to the SAM Address we defined before, then write a "CommandSAM" Function and a reply parser.
pt_br: Finalmente, a parte boa. A interação com a ponte SAM é feita enviando um "comando" para o endereço da ponte SAM, e você pode analisar o resultado do comando como um conjunto de pares de chave-valor baseados em string. Então, tendo isso em mente, vamos estabelecer uma conexão de leitura-escrita para o Endereço SAM que definimos antes, então escrever uma Função "CommandSAM" e um analisador de resposta.
tr: Son olarak, iyi bölüm. SAM köprüsüyle etkileşim, SAM köprüsünün adresine bir "komut" gönderilerek yapılır ve komutun sonucunu bir dizi dizge tabanlı anahtar/değer çifti olarak ayrıştırabilirsiniz. Bunu akılda tutarak, daha önce tanımladığımız SAM adresine bir okuma-yazma bağlantısı kuralım. Ardından bir "CommandSAM" işlevi ve bir yanıt işleyici yazalım.

source: Connecting to the SAM Port
pt_br: Conectando à porta SAM
tr: SAM bağlantı noktasına bağlanmak

source: We're communicating with SAM via a Socket, so in order to connect to, read from, and write to the socket, you'll need to create the following private variables in the Jsam class:
pt_br: Estamos nos comunicando com o SAM por meio de um Socket, então, para conectar, ler, e escrever no socket, você precisará criar as seguintes variáveis privadas na classe Jsam:
tr: SAM ile bir Soket aracılığıyla iletişim kuruyoruz. Bu nedenle sokete bağlanmak, soketten okumak ve sokete yazmak için Jsam sınıfında aşağıdaki özel değişkenleri oluşturmanız gerekir:

source: You will also want to instantiate those variables in your Constructors by creating a function to do so.
pt_br: Você também vai querer instanciar essas variáveis em seus Construtores criando uma função para fazer isso.
tr: Ayrıca, bunu yapmak için bir işlev oluşturarak Yapıcılarınızda bu değişkenleri başlatmak isteyeceksiniz.

source: Sending a Command to SAM
pt_br: Enviando um comando para o SAM
tr: SAM üzerine bir komut göndermek

source: Now you're all set up to finally start talking to SAM. In order to keep things nicely organized, let's create a function which sends a single command to SAM, terminated by a newline, and which returns a Reply object, which we will create in the next step:
pt_br: Agora você está pronto para finalmente começar a falar com o SAM. Para manter as coisas bem organizadas, vamos criar uma função que envie um único comando para o SAM, terminado por uma nova linha, e que retorne um objeto Reply, que criaremos na próxima etapa:
tr: Artık SAM ile konuşmaya başlamaya hazırsınız. İşleri güzel bir şekilde düzenlemek için, SAM üzerine tek bir komut gönderen, bir satır sonu ile tamalanan ve bir sonraki adımda oluşturacağımız bir yanıt nesnesi döndüren bir işlev oluşturalım:

source: Note that we are using the writer and reader we created from the socket in the previous step as our inputs and outputs to the socket. When we get a reply from the reader, we pass the string to the Reply constructor, which parses it and returns the Reply object.
pt_br: Note que estamos usando o writer e o reader que criamos do socket no passo anterior como nossas entradas e saídas para o socket. Quando obtemos uma resposta do reader, passamos a string para o construtor Reply, que a analisa e retorna o objeto Reply.
tr: Bir önceki adımda soketten oluşturduğumuz yazıcı ve okuyucuyu, sokete giriş ve çıkışlarımız olarak kullandığımızı unutmayın. Okuyucudan bir yanıt aldığımızda, dizgeyi, onu ayrıştıran ve yanıt nesnesini döndüren yanıt yapıcısına iletiriz.

source: Parsing a reply and creating a Reply object.
pt_br: Analisando uma resposta e criando um objeto Reply.
tr: Bir yanıtı işlemek ve bir yanıt nesnesi oluşturmak.

source: In order to more easily handle replies, we'll use a Reply object to automatically parse the results we get from the SAM bridge. A reply has at least a topic, a type, and a result, as well as an arbitrary number of key-value pairs.
pt_br: Para lidar com respostas mais facilmente, usaremos um objeto Reply para analisar automaticamente os resultados que obtemos da ponte SAM. Uma resposta tem pelo menos um tópico, um tipo e um resultado, bem como um número arbitrário de pares de chave-valor .
tr: Yalnızca sistem taraından veya tüm kullanıcılara gönderilen iletilerin yönetilebileceğini unutmayın. Gönderildikten sonra bu iletiyi buradan yönetemezsiniz.

source: As you can see, we will be storing the "result" as an enum, REPLY_TYPES. This enum contains all the possible reply results which the SAM bridge might respond with.
pt_br: Como você pode ver, armazenaremos o "resultado" como um enum, REPLY_TYPES. Este enum contém todos os resultados de resposta possíveis com os quais a ponte SAM pode responder .
tr: Gördüğünüz gibi, "sonucu" REPLY_TYPES enum olarak saklayacağız. Bu enum, SAM köprüsünün verebileceği tüm olası yanıt sonuçlarını içerir.

source: Now let's create our constructor, which takes the reply string recieved from the socket as a parameter, parses it, and uses the information to set up the reply object. The reply is space-delimited, with key-value pairs joined by an equal sign and terminated by a newline.
pt_br: Agora vamos criar nosso construtor, que pega a string de resposta recebida do socket como um parâmetro, analisa-a e usa as informações para configurar o objeto de resposta . A resposta é delimitada por espaços, com pares de chave-valor unidos por um sinal de igual e terminados por uma nova linha.
tr: Şimdi, soketten alınan yanıt dizisini parametre olarak alan, onu işleyen ve yanıt nesnesini kurmak için bilgiyi kullanan yapıcımızı oluşturalım. Yanıt boşlukla sınırlandırılır, anahtar/değer çiftleri eşittir işaretiyle birleştirilir ve yeni satır karakteriyle sonlandırılır.

source: Lastly, for the sake of convenience, let's give the reply object a toString() function which returns a string representation of the Reply object.
pt_br: Por fim, por uma questão de conveniência, vamos dar ao objeto de resposta uma função toString() que retorna uma representação de string do objeto Reply.
tr: Son olarak, kolaylık olması açısından, yanıt nesnesine, yenıt nesnesinin dizge gösterimini döndüren bir toString() işlevi verelim.

source: Saying "HELLO" to SAM
pt_br: Dizendo "OLÁ" para SAM
tr: SAM programına "Merhaba" demek

source: Now we're ready to establish communication with SAM by sending a "Hello" message. If you're writing a new SAM library, you should probably target at least SAM 3.1, since it's available in both I2P and i2pd and introduces support for the SIGNATURE_TYPE parameter.
pt_br: Agora estamos prontos para estabelecer comunicação com o SAM enviando uma mensagem "Hello" . Se você estiver escrevendo uma nova biblioteca SAM, você provavelmente deve mirar em pelo menos SAM 3.1, já que ele está disponível tanto em I2P quanto em i2pd e introduz suporte para o parâmetro SIGNATURE_TYPE.
tr: Artık "Merhaba" iletisi göndererek SAM ile iletişim kurmaya hazırız. Yeni bir SAM kitaplığı yazıyorsanız, hem I2P hem de i2pd üzerinde var olduğundan ve SIGNATURE_TYPE parametresi için destek sunduğundan, büyük olasılıkla en azından SAM 3.1 sürümünü hedeflemelisiniz.

source: As you can see, we use the CommandSAM function we created before to send the newline-terminated command ``HELLO VERSION MIN=3.0 MAX=3.1 \n``. This tells SAM that you want to start communicating with the API, and that you know how to speak SAM version 3.0 and 3.1. The router, in turn, will respond with like ``HELLO REPLY RESULT=OK VERSION=3.1`` which is a string you can pass to the Reply constructor to get a valid Reply object. From now on, we can use our CommandSAM function and Reply object to deal with all our communication across the SAM bridge.
pt_br: Como você pode ver, usamos a função CommandSAM que criamos antes para enviar o comando terminado em nova linha ``HELLO VERSION MIN=3.0 MAX=3.1 \n``. Isso diz ao SAM que você quer começar a se comunicar com a API e que você sabe como falar as versões 3.0 e 3.1 do SAM. O roteador, por sua vez, responderá com como ``HELLO REPLY RESULT=OK VERSION=3.1`` que é uma string que você pode passar para o construtor Reply para obter um objeto Reply válido. De agora em diante, podemos usar nossa função CommandSAM e o objeto Reply para lidar com toda a nossa comunicação através da ponte SAM.
tr: Gördüğünüz gibi, yeni satır karakteriyle biten ``HELLO VERSION MIN=3.0 MAX=3.1 \n`` komutunu göndermek için daha önce oluşturduğumuz CommandSAM işlevini kullanıyoruz. Bu, SAM yazılımına API ile iletişim kurmaya başlamak istediğinizi ve SAM sürüm 3.0 ve 3.1 ile nasıl konuşacağınızı bildiğinizi söyler. Yöneltici sırayla ``HELLO REPLY RESULT=OK VERSION=3.1`` gibi yanıt verir; bu, geçerli bir yanıt nesnesi almak için yanıt oluşturucuya iletebileceğiniz bir dizgedir. Şu andan başlayarak, SAM köprüsü üzerindeki tüm iletişimimizle ilgilenmek için CommandSAM işlevimizi ve yanıt nesnemizi kullanabiliriz.

source: Finally, let's add a test for our "HelloSAM" function.
pt_br: Por fim, vamos adicionar um teste para nossa função "HelloSAM".
tr: Son olarak "HelloSAM" işlevimiz için bir deneme ekleyelim.

source: Now that you've negotiated your connection to SAM and agreed on a SAM version you both speak, you can set up peer-to-peer connections for your application to connect to other i2p applications. You do this by sending a "SESSION CREATE" command to the SAM Bridge. To do that, we'll use a CreateSession function that accepts a session ID and a destination type parameter.
pt_br: Agora que você negociou sua conexão com o SAM e concordou com uma versão do SAM vocês dois falam, você pode configurar conexões peer-to-peer para seu aplicativo para se conectar a outros aplicativos i2p. Você faz isso enviando um comando "SESSION CREATE" para o SAM Bridge. Para fazer isso, usaremos uma função CreateSession que aceita um ID de sessão e um parâmetro de tipo de destino.
tr: Artık SAM ile bağlantı kurmak için anlaştığınıza ve ikinizin de konuştuğu bir SAM sürümü seçtiğinize göre, uygulamanızın diğer i2p uygulamaları ile bağlantı kurması için eşler arası bağlantılar kurabilirsiniz. Bunu, SAM köprüsüne bir "SESSION CREATE" komutu göndererek yaparsınız. Bunu yapmak için, bir oturum kimliği ve bir hedef türü parametresi kabul eden bir CreateSession işlevi kullanacağız.

source: That was easy, right? All we had to do was adapt the pattern we used in our HelloSAM function to the ``SESSION CREATE`` command. A good reply from the bridge will still return OK, and in that case we return the ID of the newly created SAM connection. Otherwise, we return an empty string because that's an invalid ID anyway and it failed, so it's easy to check. Let's see if this function works by writing a test for it:
pt_br: Isso foi fácil, certo? Tudo o que tivemos que fazer foi adaptar o padrão que usamos em nossa função HelloSAM para o comando ``SESSION CREATE``. Uma boa resposta da ponte ainda retornará OK, e nesse caso retornamos o ID da conexão SAM recém-criada . Caso contrário, retornamos uma string vazia porque esse é um ID inválido de qualquer maneira e falhou, então é fácil de verificar. Vamos ver se esta função funciona escrevendo um teste para ela:
tr: Oldukça kolay değil mi? Tek yapmamız gereken HelloSAM işlevinde kullandığımız kalıbı ``SESSION CREATE`` komutuna uyarlamaktı. Köprüden gelen iyi bir yanıt yine de OK değerini döndürür ve bu durumda yeni oluşturulan SAM bağlantısının kimliğini döndürürüz. Aksi takdirde boş bir dizge döndürürüz çünkü bu zaten geçersiz bir kimliktir ve başarısız olur, bu nedenle denetlenmesi kolaydır. Bir deneme kodu yazarak bu işlevin çalışıp çalışmadığını görelim:

source: Note that in this test, we *must* call HelloSAM first to establish communication with SAM before starting our session. If not, the bridge will reply with an error and the test will fail.
pt_br: Note que neste teste, *devemos* chamar HelloSAM primeiro para estabelecer comunicação com SAM antes de iniciar nossa sessão. Se não, a ponte responderá com um erro e o teste falhará.
tr: Bu denemede, oturumumuza başlamadan önce SAM ile iletişim kurmak için ilk olarak HelloSAM işlevini çağırmamız *gerektiğini* unutmayın. Yoksa, köprü bir hatayla yanıt verir ve deneme başarısız olur.

source: Now you have your session established and your local destination, and need to decide what you want to do with them. Your session can now be commanded to connect to a remote service over I2P, or to wait for incoming connections to respond to. However, before you can connect to a remote destination, you may need to obtain the base64 of the destination, which is what the API expects. In order to do this, we'll create a LookupName function, which will return the base64 in a usable form.
pt_br: Agora você tem sua sessão estabelecida e seu destino local, e precisa decidir o que quer fazer com eles. Sua sessão agora pode ser comandada para conectar-se a um serviço remoto por I2P, ou esperar por conexões de entrada para responder. No entanto, antes de poder se conectar a um destino remoto, você pode precisar obter o base64 do destino, que é o que a API espera. Para fazer isso, criaremos uma função LookupName, que retornará o base64 em um formato utilizável.
tr: Artık oturumunuzu ve yerel hedefinizi belirlediniz ve bunlarla ne yapmak istediğinize karar vermeniz gerekiyor. Oturumunuza I2P üzerinden uzak bir hizmete bağlanma veya geliş bağlantılarına yanıt vermesini bekleme komutu verilebilir. Ancak, uzak bir hedefe bağlanmadan önce, API yazılımının beklediği hedefin base64 değerini edinmeniz gerekebilir. Bunu yapmak için base64 değerini kullanılabilir bir biçimde döndürecek bir LookupName işlevi oluşturacağız.

source: Again, this is almost the same as our HelloSAM and CreateSession functions, with one difference. Since we're looking for the VALUE specifically and the NAME field will be the same as the ``name`` argument, it simply returns the base64 string of the destination requested.
pt_br: Novamente, isso é quase o mesmo que nossas funções HelloSAM e CreateSession, com uma diferença. Como estamos procurando pelo VALUE especificamente e o campo NAME será o mesmo que o argumento ``name``, ele simplesmente retorna a string base64 do destino solicitado.
tr: Yine, bu durum, bir farkla, HelloSAM ve CreateSession işlevlerimizle hemen hemen aynıdır. Özellikle DEĞER aradığımız için ve NAME alanı "name" argümanıyla aynı olacağından, istenen hedefin base64 dizgesi döndürülür.

source: Now that we have our LookupName function, let's test it:
pt_br: Agora que temos nossa função LookupName, vamos testá-la:
tr: Artık LookupName işlevimiz olduğuna göre deneyebiliriz:

source: At last, we are going to establish a connection to another service with our new library. This part confused me a bit at first, but the most astute Java developers were probably wondering why we didn't extend the socket class instead of creating a Socket variable inside of the Jsam class. That's because until now, we've been communicating with the "Control Socket" and we need to create a new socket to do the actual communication. So we've waited to extend the the Socket class with the Jsam class until now:
pt_br: Por fim, vamos estabelecer uma conexão com outro serviço com nossa nova biblioteca . Esta parte me confundiu um pouco no começo, mas os desenvolvedores Java mais astutos provavelmente estavam se perguntando por que não estendemos a classe socket em vez de criar uma variável Socket dentro da classe Jsam. Isso porque até agora, estávamos nos comunicando com o "Control Socket" e precisamos criar um novo socket para fazer a comunicação real. Então esperamos para estender a classe Socket com a classe Jsam até agora:
tr: Son olarak yeni kitaplığımız ile başka bir hizmete bağlanacağız. Bu bölüm başta biraz kafamı karıştırdı, ancak en zeki Java geliştiricileri büyük olasılıkla Jsam sınıfının içinde bir soket değişkeni oluşturmak yerine neden soket sınıfını genişletmediğimizi merak ediyorlardı. Çünkü şimdiye kadar "Denetim soketi" üzerinden haberleşiyorduk ve asıl iletişimi yapmak için yeni bir soket oluşturmamız gerekiyor. Bu yüzden şimdiye kadar soket sınıfını Jsam sınıfıyla genişletmeyi bekledik:

source: Also, let's alter our startConnection function so that we can use it to switch over from the control socket to the socket we'll be using in our application. It will now take a Socket argument.
pt_br: Além disso, vamos alterar nossa função startConnection para que possamos usá-la para alternar do socket de controle para o socket que usaremos em nossa aplicação. Ela agora receberá um argumento Socket.
tr: Ayrıca startConnection işlevimizi, uygulamamızda kullanacağımız denetim soketinden sokete geçmek için kullanabileceğimiz şekilde değiştirelim. Şimdi bir soket argümanı alacak.

source: This allows us to quickly and easily open a new socket to communicate over, perform the "Hello SAM" handshake over again, and connect the stream.
pt_br: Isso nos permite abrir de forma rápida e fácil um novo soquete para comunicação, executar o handshake "Hello SAM" novamente e conectar o fluxo.
tr: Böylece, iletişim kurmak için hızlı ve kolay bir şekilde yeni bir soket açabilir, "Merhaba SAM" el sıkışmasını yeniden gerçekleştirebilir ve akış bağlantısı kurabiliriz.

source: And now you have a new Socket for communicating over SAM! Let's do the same thing for Accepting remote connections:
pt_br: E agora você tem um novo Socket para se comunicar por SAM! Vamos fazer a mesma coisa para Aceitar conexões remotas:
tr: Ve artık SAM üzerinden iletişim kurmak için yeni bir soketiniz var! Uzak bağlantıları kabul etmek için de aynı şeyi yapalım:

source: There you have it. That's how you build a SAM library, step-by-step. In the future, I will cross-reference this with the working version of the library, Jsam, and the SAM v3 specification but for now I've got to get some other stuff done.
pt_br: Aí está. É assim que você constrói uma biblioteca SAM, passo a passo. No futuro , farei uma referência cruzada com a versão funcional da biblioteca, Jsam, e a especificação SAM v3, mas por enquanto preciso fazer outras coisas .
tr: Tamamdır. Adım adım bir SAM kitaplığı bu şekilde oluşturursunuz. Gelecekte, bunu kitaplığın çalışan sürümü, Jsam ve SAM v3 teknik özellikleri ile çapraz referans şeklinde yapacağım ama şimdi başka şeyler yapmam gerekiyor.

source: 0.9.41 Release
pt_br: Lançamento 0.9.41
tr: 0.9.41 sürümü yayınlandı

source: 0.9.41 with bug fixes
pt_br: 0.9.41 com bugs corrigidos
tr: 0.9.41 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.41 continues the work to implement new features for proposal 123, including per-client authentication for encrypted leasesets. The console has an updated I2P logo and several new icons. We've updated the Linux installer.
pt_br: 0.9.41 continua com o trabalho de implementar novas funcionalidade para a proposta 123, incluindo autenticação entre clientes para leasesets criptografados. O console possui uma logo do I2P atualizada e diversos novos ícones. Atualizamos o instalador do Linux.
tr: 0.9.41 sürümünde 123 numaralı önerideki yeni özellikleri ekleme çalışmaları sürdürüldü. "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSet) için her istemcinin kimliğinin doğrulanması özelliği eklendi. Panodaki I2P logosu güncellendi ve bir kaç yeni simge eklendi. Linux kurucusu güncellendi.

source: Startup should be faster on platforms such as Raspberry Pi. We've fixed several bugs, including some serious ones affecting low-level network messages.
pt_br: A inicialização deve estar mais rápida para plataformas como o Raspberry Pi. Corrigimos diversos bugs, incluindo alguns erros graves afetando mensagens de baixo nível da rede.
tr: Başlangıç artık Raspberry Pi gibi platformlarda daha hızlı olmalı. Bazı alt düzey ağ iletilerini etkileyen ciddi sorunları ve bir kaç hatayı giderdik.

source: Add configuration UI for encrypted leasesets, including per-client authentication (proposal 123)
pt_br: Adicionar interface de usuário de configuração para conjuntos de arrendamento criptografados, incluindo autenticação por cliente (proposta 123)
tr: Her istemci için ayrı kimlik doğrulama ile "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) için yapılandırma kullanıcı arabirimi eklendi (123 numaralı öneri)

source: Switch to IzPack 5 for non-Windows installer
pt_br: Mude para o IzPack 5 para instalador não Windows
tr: Windows olmayan kurucularda IzPack 5 sürümüne geçildi
