Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Header encryption is vitally important to prevent traffic classification, protocol identification, and censorship. Headers also contain information that would make it easier for attackers to interfere with or even decrypt packet contents. While nation-state firewalls are mostly focused on classification and possible disruption of TCP traffic, we anticipate that their UDP capabilities will increase to meet the challenges of new UDP protocols such as QUIC and WireGuard. Ensuring that SSU2 headers are adequately obfuscated and/or encrypted was the first task we addressed.
pt_br: A criptografia de cabeçalhos é de vital importância para evitar a classificação de tráfego, identificação de protocolos e censura. Os cabeçalhos também contêm informações que tornariam mais fácil para os invasores interferirem ou até mesmo descriptografarem o conteúdo dos pacotes. Embora os firewalls de estado-nação sejam focados principalmente na classificação e possível interrupção do tráfego TCP, prevemos que suas capacidades UDP aumentarão para atender aos desafios de novos protocolos UDP, como QUIC e WireGuard. Garantir que os cabeçalhos SSU2 sejam adequadamente ofuscados e/ou criptografados foi a primeira tarefa que abordamos.
tr: Üst bilgilerin şifrelenmesi, trafiğin sınıflandırılmasında, iletişim kuralının tanımlanmasında ve sansürün aşılmasında hayati önem taşır. Ayrıca üst bilgilerde saldırganların işine yarayacak ve paket içeriğinin şifresinin çözülmesini sağlayabilecek bilgiler de bulunur. Devlet düzeyindeki güvenlik duvarları çoğunlukla sınıflandırmaya ve TCP trafiğinin olası bozulmasına odaklanırken, QUIC ve WireGuard gibi yeni UDP iletişim kurallarının zorluklarını karşılamak için UDP yeteneklerinin artacağını öngörüyoruz. SSU2 üst bilgilerinin yeterince gizlenmiş ve/veya şifrelenmiş olmasını sağlamak, ele aldığımız ilk görevdi.

source: Headers are encrypted using a header protection scheme by XORing with data calculated from known keys, using ChaCha20, similar to QUIC RFC-9001_ and `Nonces are Noticed <%(link1)s>`_. This ensures that the encrypted headers will appear to be random, without any distinguishable pattern.
pt_br: Os cabeçalhos são criptografados usando um esquema de proteção de cabeçalho por XORing com dados calculados a partir de chaves conhecidas, usando ChaCha20, semelhante ao QUIC RFC-9001_ e `Nonces are Noticed <%(link1)s>`_. Isso garante que os cabeçalhos criptografados parecerão aleatórios, sem nenhum padrão distinguível.
tr: Üst bilgiler, QUIC RFC-9001_ ve `Nonces are Noticed <%(link1)s>`_ benzeri ChaCha20 kullanılarak bilinen anahtarlardan hesaplanan verilerle XORing tarafından bir üst bilgi koruma şeması kullanılarak şifrelenir. Böylece, şifrelenmiş üst bilgilerin herhangi bir ayırt edilebilir model olmadan rastgele görünmesi sağlanır.

source: Unlike the QUIC RFC-9001_ header protection scheme, all parts of all headers, including destination and source connection IDs, are encrypted. QUIC RFC-9001_ and `Nonces are Noticed <%(link1)s>`_ are primarily focused on encrypting the "critical" part of the header, i.e. the packet number (ChaCha20 nonce). While encrypting the session ID makes incoming packet classification a little more complex, it makes some attacks more difficult.
pt_br: Ao contrário do esquema de proteção de cabeçalho QUIC RFC-9001_, todas as partes de todos os cabeçalhos, incluindo IDs de conexão de destino e origem, são criptografadas. QUIC RFC-9001_ e `Nonces são notados <%(link1)s>`_ são focados principalmente em criptografar a parte "crítica" do cabeçalho, ou seja, o número do pacote (nonce ChaCha20). Embora criptografar o ID da sessão torne a classificação de pacotes recebidos um pouco mais complexa, isso torna alguns ataques mais difíceis.
tr: QUIC RFC-9001_ üst bilgi koruma şemasının aksine, hedef ve kaynak bağlantı kimlikleri ile birlikte tüm üst bilgilerin tüm parçaları şifrelenir. QUIC RFC-9001_ ve `Nonces are Noticed <%(link1)s>``, öncelikle üst bilginin "kritik" kısmını, yani paket numarasını (ChaCha20 nonce) şifrelemeye odaklanır. Oturum kimliğini şifrelemek, gelen paket sınıflandırmasını biraz daha karmaşık hale getirirken, bazı saldırıları daha da zorlaştırır.

source: Our threat model assumes that censorship firewalls do not have real-time access to I2P's network database. Headers are encrypted with known keys published in the network database or calculated later. In the handshake phase, header encryption is for traffic classification resistance only, as the decryption key is public and the key and nonces are reused. Header encryption in this phase is effectively just obfuscation. Note that the header encryption is also used to obfuscate the X25519 ephemeral keys in the handshake, for additional protection.
pt_br: Nosso modelo de ameaça pressupõe que os firewalls de censura não tenham acesso em tempo real ao banco de dados de rede do I2P. Os cabeçalhos são criptografados com chaves conhecidas publicadas no banco de dados de rede ou calculadas posteriormente. Na fase de handshake, a criptografia de cabeçalho é apenas para resistência à classificação de tráfego, já que a chave de descriptografia é pública e a chave e os nonces são reutilizados. A criptografia de cabeçalho nesta fase é efetivamente apenas ofuscação. Observe que a criptografia de cabeçalho também é usada para ofuscar as chaves efêmeras X25519 no handshake, para proteção adicional.
tr: Tehdit modelimiz, engellemeyi yapan güvenlik duvarlarının I2P ağ veri tabanına gerçek zamanlı erişimi olmadığını varsayar. Üst bilgiler, ağ veri tabanında yayınlanan ya da daha sonra hesaplanan bilinen anahtarlarla şifrelenir. El sıkışma aşamasında, şifre çözme anahtarı herkese açık olduğundan ve anahtar ve nonce yeniden kullanıldığından, üst bilgi şifrelemesi yalnızca trafik sınıflandırma direnci içindir. Bu aşamadaki başlık şifreleme, etkili bir şekilde yalnızca gizlemedir. Üst bilgi şifrelemesinin, ek koruma için el sıkışma sırasında X25519 kısa ömürlü anahtarlarını gizlemek için de kullanıldığını unutmayın.

source: In the data phase, only the session ID field is encrypted with a key from the network database. The critical nonce field is encrypted with a key derived from the handshake, so it may not be decrypted even by a party with access to the network database.
pt_br: Na fase de dados, apenas o campo ID da sessão é criptografado com uma chave do banco de dados da rede. O campo nonce crítico é criptografado com uma chave derivada do handshake, portanto, ele não pode ser descriptografado nem mesmo por uma parte com acesso ao banco de dados da rede.
tr: Veri aşamasında, yalnızca oturum kimliği alanı ağ veri tabanından bir anahtarla şifrelenir. Kritik olmayan alan, anlaşmadan türetilen bir anahtarla şifrelenir. Bu nedenle ağ veri tabanına erişimi olan bir tarafça bile şifresi çözülemeyebilir.

source: Packet Numbering, ACKS, and Retransmission
pt_br: Numeração de pacotes, ACKS e retransmissão
tr: Paket numaralandırma, onaylar ve yeniden aktarım

source: SSU2 contains several improvements over SSU for security and efficiency. The packet number is the AEAD nonce, and each packet number is only used once. Acknowledgements (ACKs) are for packet numbers, not I2NP message numbers or fragments. ACKs are sent in a very efficient, compact format adapted from QUIC. An immediate-ack request mechanism is supported, similar to SSU. Congestion control, windowing, timers, and retransmission strategies are not fully specified, to allow for implementation flexibility and improvements, but general guidance is taken from the RFCs for TCP. Additional algorithms for timers are adapted from I2P's `streaming protocol <%(link1)s>`_ and SSU implementations.
pt_br: O SSU2 contém várias melhorias em relação ao SSU para segurança e eficiência. O número do pacote é o nonce AEAD, e cada número de pacote é usado apenas uma vez. Os reconhecimentos (ACKs) são para números de pacotes, não para números de mensagens I2NP ou fragmentos. Os ACKs são enviados em um formato compacto e muito eficiente, adaptado do QUIC. Um mecanismo de solicitação de confirmação imediata é suportado, semelhante ao SSU. O controle de congestionamento, o janelamento, os temporizadores e as estratégias de retransmissão não são totalmente especificados, para permitir flexibilidade e melhorias na implementação, mas a orientação geral é retirada dos RFCs para TCP. Algoritmos adicionais para temporizadores são adaptados do `protocolo de streaming <%(link1)s>`_ e implementações SSU do I2P.
tr: SSU2, güvenlik ve verimlilik açısından SSU iletişim kuralına göre çeşitli iyileştirmeler içerir. Paket numarası AEAD nonce değeridir ve her paket numarası yalnızca bir kez kullanılır. Onaylar (ACK), paket numaraları içindir, I2NP ileti numaraları veya parçaları değildir. ACK iletileri, QUIC üzerinden uyarlanmıştır. Çok verimli ve kompakt bir biçimde gönderilir. SSU benzeri bir anında onay isteği mekanizması desteklenir. Uygulama esnekliği ve iyileştirme sağlamak için tıkanıklık denetimi, pencereleme, zamanlayıcılar ve yeniden aktarım stratejileri tam olarak belirtilmemiştir. Ancak TCP için genel RFC rehberliği alınmıştır. Zamanlayıcılar için ek algoritmalar, I2P `akış iletişim kuralı <%(link1)s>`_ ve SSU uygulamalarından uyarlanmıştır.

source: Connection Migration
pt_br: Migração de conexão
tr: Bağlantı birleştirilmesi

source: UDP protocols are susceptible to breakage from peer port and IP changes caused by NAT rebinding, IPv6 temporary address changes, and mobile device address changes. Previous SSU implementations attempted to handle some of these cases with complex and brittle heuristics. SSU2 provides a formal, documented process to detect and validate peer address changes and migrate connections to the peer's new address without data loss. It prevents migration caused by packet injection or modification by attackers. The protocol to implement connection migration is adapted and simplified from QUIC.
pt_br: Os protocolos UDP são suscetíveis a quebras de alterações de porta e IP de pares causadas por revinculação de NAT, alterações de endereço temporário IPv6 e alterações de endereço de dispositivo móvel. Implementações anteriores de SSU tentaram lidar com alguns desses casos com heurísticas complexas e frágeis. O SSU2 fornece um processo formal e documentado para detectar e validar alterações de endereço de pares e migrar conexões para o novo endereço do par sem perda de dados. Ele evita a migração causada por injeção de pacotes ou modificação por invasores. O protocolo para implementar a migração de conexão é adaptado e simplificado do QUIC.
tr: UDP iletişim kuralları, NAT yeniden bağlama, IPv6 geçici adres değişiklikleri ve mobil aygıt adresi değişikliklerinin neden olduğu eş bağlantı noktası ve IP değişikliklerinden kaynaklanan kırılmalara karşı duyarlıdır. Önceki SSU uygulamaları, bu durumların bazılarını karmaşık ve kırılgan buluşsal yöntemlerle ele almaya çalıştı. SSU2, eş adres değişikliklerini algılamak, doğrulamak ve bağlantıları eşin yeni adresiyle veri kaybı olmadan birleştimek için resmi, belgelenmiş bir süreç sağlar. Saldırganlar tarafından paket enjeksiyonu ya da değiştirilmesinden kaynaklanan birleştirmeyi önler. Bağlantı birleştirmeyi uygulamaya yönelik iletişim kuralı, QUIC üzerinden uyarlandı ve basitleştirildi.

source: Peer Test and Relay
pt_br: Teste de pares e revezamento
tr: Eş sınaması ve aktarım

source: SSU provides two important services in addition to the transport of I2NP messages. First, it supports Peer Test, which is a cooperative scheme to determine local IP and detect the presence of network address translation (NAT) and firewall devices. This detection is used to update router state, share that state with other transports, and publish current address and state in I2P's network database. Second, it supports Relaying, in which routers cooperate to traverse firewalls so that all routers may accept incoming connections. These two services are essentially sub-protocols within the SSU transport.
pt_br: O SSU fornece dois serviços importantes além do transporte de mensagens I2NP. Primeiro, ele suporta Peer Test, que é um esquema cooperativo para determinar IP local e detectar a presença de dispositivos de tradução de endereços de rede (NAT) e firewall. Essa detecção é usada para atualizar o estado do roteador, compartilhar esse estado com outros transportes, e publicar o endereço e o estado atuais no banco de dados de rede do I2P. Segundo, ele suporta Relaying, no qual os roteadores cooperam para atravessar firewalls para que todos os roteadores possam aceitar conexões de entrada. Esses dois serviços são essencialmente subprotocolos dentro do transporte SSU.
tr: SSU, I2NP iletilerinin aktarılmasının yanında iki önemli hizmet sunar. İlk olarak, yerel IP adresini belirlemek, ağ adresi çevirisi (NAT) yapan ve güvenlik duvarı aygtılarının varlığını algılamak için işbirliğine dayalı eş sınaması şemasını destekler. Bu algılama, yöneltirici durumunu güncellemek, bu durumu diğer aktarımlarla paylaşmak ve geçerli adresi ve durumu I2P ağ veri tabanında yayınlamak için kullanılır. İkinci olarak, tüm yönelticilerin gelen bağlantıları kabul edebilmesi için yönelticilerin güvenlik duvarlarını aşmak için işbirliği yaptığı Aktarma işlemini destekler. Bu iki hizmet, aslında SSU aktarımı içindeki alt iletişim kurallarıdır.

source: SSU2 updates the security and reliability of these services by enhancing them to add more response codes, encryption, authentication, and restrictions to the design and implementation.
pt_br: O SSU2 atualiza a segurança e a confiabilidade desses serviços aprimorando-os para adicionar mais códigos de resposta, criptografia, autenticação e restrições ao design e à implementação.
tr: SSU2, tasarım ve uygulamaya daha fazla yanıt kodu, şifreleme, kimlik doğrulama ve kısıtlamalar eklemek için bu hizmetleri geliştirir ve bu hizmetlerin güvenliğini ve güvenilirliğini artırır.

source: Performance
pt_br: Desempenho
tr: Başarım

source: The I2P network is a complex mix of diverse routers. There are two primary implementations running all over the world on hardware ranging from high-performance data center computers to Raspberry Pis and Android phones. Routers use both TCP and UDP transports. While the SSU2 improvements are significant, we do not expect them to be apparent to the user, either locally or in end-to-end transfer speeds. End-to-end transfers depend on the performance of 13 other routers and 14 point-to-point transport links, each of which could be SSU2, NTCP2, or SSU.
pt_br: A rede I2P é uma mistura complexa de roteadores diversos. Existem duas implementações principais em execução no mundo todo em hardware que variam de computadores de data center de alto desempenho a Raspberry Pis e telefones Android. Os roteadores usam transportes TCP e UDP. Embora as melhorias do SSU2 sejam significativas, não esperamos que elas sejam aparentes para o usuário, seja localmente ou em velocidades de transferência de ponta a ponta. As transferências de ponta a ponta dependem do desempenho de 13 outros roteadores e 14 links de transporte ponto a ponto, cada um dos quais pode ser SSU2, NTCP2 ou SSU.
tr: I2P ağı, çeşitli yönelticilerin karmaşık bir karışımıdır. Yüksek başarımlı veri merkezi bilgisayarlarından Raspberry Pi aygıtlarından Android telefonlara kadar tüm dünyada bulunan donanım üzerinde çalışan iki temel uygulama vardır. Yönelticiler hem TCP hem de UDP aktarımlarını kullanır. SSU2 iyileştirmeleri önemli olsa da, bunların yerel olarak veya uçtan uca aktarım hızlarında kullanıcı tarafından fark edilmesini beklemiyoruz. Uçtan uca aktarımlar, her biri SSU2, NTCP2 ya da SSU olabilen 13 diğer yönelticinin ve 14 noktadan noktaya aktarım bağlantısının başarımına bağlıdır.

source: In the live network, latency and packet loss varies widely. Even in a test setup, performance depends on configured latency and packet loss. The i2pd project reports that maximum transfer rates for SSU2 were over 3 times faster than SSU in some tests. However, they completely redesigned their SSU code for SSU2 as their previous implementation was rather poor. The Java I2P project does not expect that their SSU2 implementation will be any faster than SSU.
pt_br: Na rede ativa, a latência e a perda de pacotes variam muito. Mesmo em uma configuração de teste, o desempenho depende da latência configurada e da perda de pacotes. O projeto i2pd relata que as taxas máximas de transferência para SSU2 foram mais de 3 vezes mais rápidas do que SSU em alguns testes. No entanto, eles redesenharam completamente seu código SSU para SSU2, pois sua implementação anterior era bastante ruim. O projeto Java I2P não espera que sua implementação SSU2 seja mais rápida do que SSU.
tr: Canlı ağda gecikme ve paket kaybı büyük ölçüde değişir. Bir deneme kurulumunda bile başarım, yapılandırılan gecikme süresine ve paket kaybına bağlıdır. i2pd projesi, bazı denemelerde SSU2 için en fazla aktarım hızlarının SSU iletişim kuralına göre 3 kat daha hızlı olduğunu bildiriyor. Ancak, önceki uygulamaları oldukça zayıf olduğu için SSU kodlarını SSU2 için tamamen yeniden tasarladılar. Java I2P projesi, SSU2 uygulamalarının SSU iletişim kuralından daha hızlı olmasını beklemiyor.

source: Very low-end platforms such as Raspberry Pis and OpenWRT may see substantial improvements from the elimination of SSU. ElGamal is extremely slow and limits performance on those platforms.
pt_br: Plataformas de baixo custo, como Raspberry Pis e OpenWRT, podem ver melhorias substanciais com a eliminação do SSU. ElGamal é extremamente lento e limita o desempenho nessas plataformas.
tr: Raspberry Pis ve OpenWRT gibi kaynakları çok az olan platformlar, SSU iletişim kuralının kaldırılmasıyla önemli gelişmeler sağlayabilir. ElGamal son derece yavaştır ve bu platformlarda başarımı sınırlar.

source: SSU2 data phase encryption uses ChaCha20/Poly1305, compared to AES with a MD5 HMAC for SSU. Both are very fast and the change is not expected to measurably affect performance.
pt_br: A criptografia de fase de dados SSU2 usa ChaCha20/Poly1305, em comparação com AES com um MD5 HMAC para SSU. Ambos são muito rápidos e não se espera que a mudança afete o desempenho de forma mensurável.
tr: SSU2 veri aşaması şifrelemesi, SSU için MD5 HMAC kullanan AES ile karşılaştırıldığında ChaCha20/Poly1305 kullanır. Her ikisi de çok hızlıdır. Bu değişikliğin başarımı ölçülebilir şekilde etkilemesi beklenmiyor.

source: Here are some highlights of the estimated improvements for SSU2 vs. SSU:
pt_br: Aqui estão alguns destaques das melhorias estimadas para SSU2 vs. SSU:
tr: SSU2 ile SSU karşılaştırması için öngörülen bazı önemli iyileştirmeler şunlardır:

source: 40% reduction in total handshake packet size
pt_br: Redução de 40% no tamanho total do pacote de handshake
tr: El sıkışma paketinin toplam boyutunda %40 azalma

source: 50% or more reduction in handshake CPU
pt_br: Redução de 50% ou mais no handshake da CPU
tr: El sıkışma için işlemci gereksiniminde %50 azalma

source: 90% or more reduction in ACK overhead
pt_br: Redução de 90% ou mais na sobrecarga de ACK
tr: ACK işlemi yükünde %90 ya da daha fazla azalma

source: 50% reduction in packet fragmentation
pt_br: Redução de 50% na fragmentação de pacotes
tr: Paket bölünmesinde %50 azalma

source: 10% reduction in data phase overhead
pt_br: Redução de 10% na sobrecarga da fase de dados
tr: Veri aşamasındaki ek yükte %10 azalma

source: Transition Plan
pt_br: Plano de Transição
tr: Geçiş planı

source: I2P strives to maintain backward compatibility, both to ensure network stability, and to allow older routers to continue to be useful and secure. However, there are limits, because compatibility increases code complexity and maintenance requirements.
pt_br: O I2P se esforça para manter a compatibilidade com versões anteriores, tanto para garantir a estabilidade da rede, quanto para permitir que roteadores mais antigos continuem sendo úteis e seguros. No entanto, há limites, porque a compatibilidade aumenta a complexidade do código e os requisitos de manutenção.
tr: I2P, hem ağ kararlılığını sağlamak hem de eski yönelticilerin kullanışlı ve güvenli olmayı sürdürmesini sağlamak için geriye dönük uyumluluğu korumaya çalışır. Bununla birlikte, uyumluluk kod karmaşıklığını ve bakım gereksinimlerini artırdığından bazı sınırlar vardır.

source: The Java I2P and i2pd projects will both enable SSU2 by default in their next releases (2.0.0 and 2.44.0) in late November 2022. However, they have different plans for disabling SSU. I2pd will disable SSU immediately, because SSU2 is a vast improvement over their SSU implementation. Java I2P plans to disable SSU in mid-2023, to support a gradual transition and give older routers time to upgrade. Because Java I2P release 0.9.36 and i2pd release 2.20.0 (2018) were the first to support NTCP2, routers older than that will not be able to connect to i2pd routers 2.44.0 or higher, as they have no compatible transports.
pt_br: Os projetos Java I2P e i2pd habilitarão o SSU2 por padrão em suas próximas versões (2.0.0 e 2.44.0) no final de novembro de 2022. No entanto, eles têm planos diferentes para desabilitar o SSU. O I2pd desabilitará o SSU imediatamente, porque o SSU2 é uma grande melhoria em relação à implementação do SSU. O Java I2P planeja desabilitar o SSU em meados de 2023, para dar suporte a uma transição gradual e dar tempo para que roteadores mais antigos atualizem. Como o Java I2P versão 0.9.36 e o i2pd versão 2.20.0 (2018) foram os primeiros a oferecer suporte ao NTCP2, roteadores mais antigos que isso não poderão se conectar a roteadores i2pd 2.44.0 ou superiores, pois não têm transportes compatíveis.
tr: Java I2P ve i2pd projelerinin ikisi de, 2022 Kasım ayının sonlarında çıkacak sonraki sürümlerinde (2.0.0 ve 2.44.0) varsayılan olarak SSU2 iletişim kuralını kullanacak. Ancak, SSU iletişim kuralını devre dışı bırakma planları farklı. I2pd üzerinde, SSU iletişim kuralı hemen devre dışı bırakılacak çünkü SSU2, SSU uygulamasına göre çok büyük bir gelişme sağlıyor. Java I2P üzerinde, kademeli bir geçiş sağlamak ve eski yönelticilere yükseltme için zaman tanımak için 2023 ortalarında SSU iletişim kuralının devre dışı bırakılması planlanıyor. Java I2P 0.9.36 ve i2pd 2.20.0 (2018) NTCP2 destekleyen ilk sürümler olduğundan, bundan daha eski yönelticiler, uyumlu taşıyıcıları olmadığından, sürümü 2.44.0 ya da üzerinde olan i2pd yönelticileri ile bağlantı kuramayacak.

source: Summary
pt_br: Resumo
tr: Özet
