Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: *Java I2P has built-in applications for torrents, e-mail and so on. i2pd is just a router which you can use with other software through I2CP interface.* *i2pd does not require Java. It’s written in C++.* *i2pd consumes less memory and CPU.* *i2pd can be compiled everywhere gcc or clang presented (including Raspberry and routers).* *i2pd has some major optimizations for faster cryptography which leads to less consumption of processor time and energy.*
pt_br: *O Java I2P tem aplicativos integrados para torrents, e-mail e assim por diante. O i2pd é apenas um roteador que você pode usar com outro software por meio da interface I2CP .* *O i2pd não requer Java. Ele é escrito em C++.* *O i2pd consome menos memória e CPU.* *O i2pd pode ser compilado em qualquer lugar onde o gcc ou o clang sejam apresentados (incluindo Raspberry e roteadores).* *O i2pd tem algumas otimizações importantes de para criptografia mais rápida, o que leva a menos consumo de tempo de processador e energia.*
tr: *Java I2P, içinde torrent, e-posta gibi yerleşik uygulamalar bulunur. i2pd, yalnızca I2CP arabirimi üzerinden diğer yazılımlarla kullanabileceğiniz bir yönelticidir.* *i2pd, için Java gerekmez. C++ ile yazılmıştır.* *i2pd, daha az bellek ve işlemci kullanıcı.* *i2pd, gcc ya da clang sunulan her yerde derlenebilir (Raspberry ve yönelticiler dahil).* *i2pd içinde, daha hızlı şifreleme için bazı önemli iyileştirmeler bulunur, bu da daha az işlemci süresi ve enerji tüketimi sağlar.*

source: Citation: https://i2pd.readthedocs.io/en/latest/user-guide/FAQ/ Site: https://i2pd.website/
pt_br: Citação: https://i2pd.readthedocs.io/en/latest/user-guide/FAQ/ Site: https://i2pd.website/
tr: Alıntı: https://i2pd.readthedocs.io/en/latest/user-guide/FAQ/ Site: https://i2pd.website/

source: In terms of the differences or benefits of using either the C++ or Java version of I2P, the question often comes up. Recently, idk responded to this question on the I2P subreddit. Ultimately, it depends on a persons own use case or desired workflow.
pt_br: Em termos de diferenças ou benefícios de usar a versão C++ ou Java do I2P, a questão surge frequentemente. Recentemente, idk respondeu a esta questão no subreddit do I2P. No final das contas, depende do caso de uso próprio ou do fluxo de trabalho desejado de uma pessoa .
tr: I2P C++ ya da Java sürümünü kullanmanın farklılıkları ya da faydaları, sorusu sıklıkla ortaya çıkar. Son zamanlarda idk, bu soruyu I2P alt dizininde yanıtladı. Sonuç olarak bu seçim, kişinin kendi kullanım durumuna veya istenilen iş akışına bağlıdır.

source: *Easy-Install Bundle is the best way to use I2P on Windows for people just getting started. It will automatically get you from starting the router to successfully browsing, every time. However, it doesn’t register as a Windows service, so it’s not as good to use as a 24/7 transit node yet. It contains everything you need to browse, but it’s designed around using I2P interactively and not running services, necessarily.*
pt_br: *O Easy-Install Bundle é a melhor maneira de usar o I2P no Windows para pessoas que estão apenas começando. Ele automaticamente fará com que você inicie o roteador e navegue com sucesso, todas as vezes. No entanto, ele não se registra como um serviço do Windows, então ainda não é tão bom para usar como um nó de trânsito 24/7 . Ele contém tudo o que você precisa para navegar, mas é projetado para usar o I2P interativamente e não executar serviços, necessariamente.*
tr: *Kolay kurulum paketi, yeni başlayan kişiler için Windows üzerinde I2P kullanmanın en iyi yoludur. Her seferinde otomatik olarak yönelticiyi başlatarak göz atmaya başlamanızı sağlar. Ancak, bir Windows hizmeti olarak kaydedilmediğinden, henüz 7/24 geçiş düğümü olarak kullanılacak kadar iyi değildir. Gezinmek için gerek duyacağınız her şeyi içerir. Ancak I2P uygulamasını etkileşimli olarak kullanmak için ve gerekli hizmetleri çalıştırmayacak şekilde tasarlanmıştır.*

source: *i2pd on the other hand is very light and efficient and is designed expressly to run as a service. It’s great at being a 24/7 transit node, especially if you install it on your router, or on a Linux server somewhere. It’s got less tools built-in though, so if you want to torrent or browse, you will need to add those tools externally.*
pt_br: *i2pd por outro lado é muito leve e eficiente e foi projetado expressamente para rodar como um serviço. Ele é ótimo para ser um nó de trânsito 24/7, especialmente se você instalá-lo em seu roteador, ou em um servidor Linux em algum lugar. Ele tem menos ferramentas integradas, então se você quiser torrent ou navegar, você precisará adicionar essas ferramentas externamente.*
tr: *Diğer taraftan i2pd çok hafif ve verimlidir ve özellikle bir hizmet olarak çalışacak şekilde tasarlanmıştır. 7/24 geçiş düğümü olarak harikadır. Özellikle de onu yönelticinize ya da herhangi bir yerdeki bir Linux sunucusuna kurarsanız. Ancak içinde daha az araç bulunur. Bu nedenle torrent ya da gezinme işlemleri için kullanılacak araçları ayrıca eklemeniz gerekir.*

source: Diva Terms
pt_br: Termos de Diva
tr: Diva Terimleri

source: Konrad has provided insight into of some of the terms used during the conversation.
pt_br: Konrad forneceu informações sobre alguns dos termos usados durante a conversa .
tr: Konrad, konuşma sırasında kullanılan bazı terimler hakkında bilgi verdi.

source: Bank for Everyone
pt_br: Banco para Todos
tr: Herkes için bir banka

source: The possibility to run locally installed software which is able to do everything a well-known bank can: send and receive payments for anything, give and receive loans, manage investments, etc. Such banking software shall neither be depending on any central software components nor supervised or censored by central components. It’s run and managed by its owner only with all its benefits and reliabilities. The network (see “Blockchain” and “Consensus”) tries to make sure that no network participant (a user running his own bank) is able to cheat.
pt_br: A possibilidade de executar software instalado localmente que é capaz de fazer tudo que um banco conhecido pode fazer: enviar e receber pagamentos por qualquer coisa, dar e receber empréstimos, gerenciar investimentos, etc. Esse software bancário não deve depender de nenhum componente central de software nem ser supervisionado ou censurado por componentes centrais. Ele é executado e gerenciado apenas por seu proprietário com todos os seus benefícios e confiabilidades. A rede (veja “Blockchain” e “Consenso”) tenta garantir que nenhum participante da rede (um usuário que administra seu próprio banco) seja capaz de trapacear.
tr: Tanınmış bir bankanın yapabileceği her şeyi yapabilen yerel olarak kurulmuş yazılımı çalıştırma olanağı: herhangi bir şey için ödeme gönderip almak, kredi vermek ve almak, yatırımları yönetmek gibi merkezi bileşenler tarafından denetlenir ya da engellenir. Tüm faydaları ve güvenilirlikleri ile yalnızca sahibi tarafından işletilir ve yönetilir. Ağ (“Blok zinciri” ve “Uzlaşma” gibi) hiçbir ağ katılımcısının (kendi bankasını işleten bir kullanıcı) hile yapamayacağından emin olmaya çalışır.

source: A piece of software which is able to reliably store arbitrary data. Copies of the software and the storage space is distributed within a network of any size where the network participants do not necessarily trust each other (or maybe not even know each other). A synonym of “blockchain” is “Distributed Layer Technology (DLT)”. A blockchain has nothing to do with “coins” or “tokens”. These are just blockchain based applications. Blockchain is a base technology which mainly solves the problem of “trust & abuse” within a network.
pt_br: Um pedaço de software que é capaz de armazenar dados arbitrários de forma confiável. Cópias do software e do espaço de armazenamento são distribuídas dentro de uma rede de qualquer tamanho onde os participantes da rede não necessariamente confiam uns nos outros (ou talvez nem se conheçam). Um sinônimo de “blockchain” é “Distributed Layer Technology (DLT)”. Um blockchain não tem nada a ver com “moedas” ou “tokens”. Estes são apenas aplicativos baseados em blockchain . Blockchain é uma tecnologia base que resolve principalmente o problema de “abuso de confiança & ” dentro de uma rede.
tr: İsteğe bağlı verileri güvenilir bir şekilde depolayabilen bir yazılım parçası. Yazılımın ve depolama alanının kopyaları, ağ katılımcılarının birbirlerine güvenmek zorunda olmadığı (hatta belki birbirlerini tanımadıkları) herhangi bir boyuttaki ağ içinde dağıtılır. “Blok zinciri” teriminin eşanlamlısı olarak “Dağıtılmış Katman Teknolojisi (DLT)” kullanılabilir. Bir blok zincirinin "coins" ya da "tokens" ile hiçbir ilgisi yoktur. Bunlar yalnızca blok zinciri tabanlı uygulamalardır. Blok zinciri, bir ağ içindeki “güven ve kötüye kullanma” sorununu kökten çözen temel bir teknolojidir.

source: Consensus
pt_br: Consenso
tr: Uzlaşma

source: In a distributed system the majority of the participants need to agree on the state of data (the “truth, as defined by the majority” - from a data perspective). This is a continuous process driven by locally installed software and this is called consensus. There are multiple valid consensus algorithms available. Bottom line: all consensus algorithms cost something: CPU cycles, communication capacity etc. - in short: a bunch of data sets is the input and a single reliable, fully distributed data set valid for the majority in the network is the output.
pt_br: Em um sistema distribuído, a maioria dos participantes precisa concordar sobre o estado dos dados (a “verdade, conforme definida pela maioria” - de uma perspectiva de dados ). Este é um processo contínuo conduzido por software instalado localmente e isso é chamado de consenso. Existem vários algoritmos de consenso válidos disponíveis. Resumindo: todos os algoritmos de consenso custam algo: ciclos de CPU, capacidade de comunicação etc. - em curto: um monte de conjuntos de dados é a entrada e um único conjunto de dados confiável, totalmente distribuído válido para a maioria na rede é a saída.
tr: Dağıtılmış bir sistemde, katılımcıların çoğunluğunun verilerin durumu (veriler açısından, "çoğunluk tarafından tanımlandığı şekliyle gerçek") üzerinde uzlaşması gerekir. Bu, yerel olarak kurulan yazılım tarafından yürütülen sürekli bir süreçtir ve buna uzlaşma denir. Birden fazla geçerli uzlaşma algoritması vardır. Özetle: Tüm uzlaşma algoritmalarının bir maliyeti vardır: İşlemci döngüleri, iletişim kapasitesi vb.

source: Year in Review: 2021
pt_br: Ano em revisão: 2021
tr: Yıllık değerlendirme: 2021

source: I2P Turns 20, Faster Crypto and A Growing Network
pt_br: I2P completa 20 anos, criptografia mais rápida e uma rede crescente
tr: I2P 20 yaşında. Daha hızlı şifreleme ve büyüyen bir ağ

source: Development Highlights
pt_br: Destaques do desenvolvimento
tr: Geliştirmede Öne Çıkanlar

source: The 0.9.49 release began the migration to the new, faster ECIES-X25519 encryption for routers. It took many years of work on the specifications and protocols for new encryption, and this release, new installs and a very small percentage of existing installs (randomly selected at restart) began using the new encryption. This is the first time that the default encryption type has ever been changed, so the full migration would take place over several releases in order to minimize any issues.
pt_br: A versão 0.9.49 iniciou a migração para a nova criptografia mais rápida ECIES-X25519 para roteadores. Foram necessários muitos anos de trabalho nas especificações e protocolos para nova criptografia, e esta versão, novas instalações e uma porcentagem muito pequena de instalações existentes (selecionadas aleatoriamente na reinicialização) começaram a usar a nova criptografia . Esta é a primeira vez que o tipo de criptografia padrão foi alterado, então a migração completa ocorreria em várias versões para minimizar quaisquer problemas.
tr: 0.9.49 sürümü ile, yönelticiler için yeni ve daha hızlı ECIES-X25519 şifrelemesine geçiş başladı. Yeni şifreleme için teknik özellikler ve iletişim kuralları üzerinde uzun yıllar çalışmak gerekti. Bu sürüm, yeni kurulumlar ve var olan kurulumların çok küçük bir yüzdesi (yeniden başlatma sırasında rastgele seçilen) yeni şifrelemeyi kullanmaya başladı. Varsayılan şifreleme türü ilk kez değiştirildiğinden, sorunları en aza indirmek için tam geçiş birkaç sürüme yayılarak gerçekleştirilecek.

source: Full release notes
pt_br: Notas de lançamento completas
tr: Tam sürüm notları

source: 0.9.50 enabled DNS over HTTPS for reseeding to protect users from passive DNS snooping. Additionally, work was done to protect the network from possible malicious and buggy routers, and numerous fixes and improvements for IPv6 addresses, including new UPnP support were completed.
pt_br: 0.9.50 habilitou DNS sobre HTTPS para reseeding para proteger usuários de DNS passivo snooping. Além disso, o trabalho foi feito para proteger a rede de possíveis roteadores maliciosos e com bugs, e várias correções e melhorias para endereços IPv6 , incluindo novo suporte UPnP foram concluídas.
tr: 0.9.50 sürümünde, kullanıcıları pasif DNS gözetlemesinden korumak için yeniden tohumlama sırasında HTTPS üzerinden DNS kullanımına geçildi. Ayrıca, ağı olası kötü niyetli ve hatalı yönelticilerden korumak için de çalışmalar yapıldı. IPv6 adresleri için yeni UPnP desteği ile birlikte çok sayıda düzeltme ve iyileştirme yapıldı.

source: In recognition of almost 20 years of work to provide anonymity and security, the team decided to go straight from 0.9.50 to 1.5.0. The 1.5.0 release finished support for new build messages (proposal 157), and finished implementation of smaller tunnel build messages to reduce bandwidth. The transition of the network’s routers to X25519 encryption continued.
pt_br: Em reconhecimento a quase 20 anos de trabalho para fornecer anonimato e segurança, a equipe decidiu ir direto de 0.9.50 para 1.5.0. O lançamento 1.5.0 finalizou o suporte para novas mensagens de construção (proposta 157) e finalizou a implementação de mensagens de construção de túnel menores para reduzir a largura de banda. A transição dos roteadores da rede para criptografia X25519 continuou.
tr: Anonimlik ve güvenlik sağlamak için yaklaşık 20 yıllık çalışmanın farkında olan ekip, 0.9.50 sürümünden doğrudan 1.5.0 sürümüne geçmeye karar verdi. 1.5.0 sürümü, yeni derleme iletileri desteğini tamamladı (157 numaralı öneri) ve bant genişliğini azaltmak için daha küçük tünel oluşturma iletilerinin kullanılmasını sağladı. Ağdaki yönelticilerin X25519 şifrelemesine geçişi sürdürüldü.

source: The rollout of two major protocol updates reached completed in 1.6.1. Almost all routers will be rekeyed by the end of the year. Also, short tunnel build messages were enabled for a significant bandwidth reduction. Progress on the design of the new UDP transport SSU2 began, and is expected to start implementation early next year.
pt_br: A implementação de duas atualizações importantes de protocolo foi concluída em 1.6.1. Quase todos os roteadores serão recodificados até o final do ano. Além disso, mensagens de construção de túnel curto foram habilitadas para uma redução significativa da largura de banda. O progresso no design do novo transporte UDP SSU2 começou e espera-se que comece a implementação no início do próximo ano.
tr: 1.6.1 sürümüyle, iki ana iletişim kuralı güncellemesinin kullanımına geçilmesi tamamlandı. Neredeyse tüm yönelticiler yıl sonuna kadar yeniden anahtarlanacak. Ayrıca, önemli bir bant genişliği azalması için kısa tünel oluşturma iletileri etkinleştirildi. Yeni SSU2 UDP taşıyıcısının tasarımında ilerleme başladı ve gelecek yılın başlarında kullanımına başlanması bekleniyor.

source: Easier Installs: JPackage
pt_br: Instalações mais fáceis: JPackage
tr: Daha kolay kurulum: JPackage

source: With upwards of 30 steps required to install both the I2P software and Java, the process for new user onboarding has not been historically easy. Unfamiliar and unintuitive, it was a process that has created issues for usability for many years.
pt_br: Com mais de 30 etapas necessárias para instalar o software I2P e o Java, o processo de integração de novos usuários não tem sido historicamente fácil. Desconhecido e não intuitivo, foi um processo que criou problemas de usabilidade por muitos anos.
tr: Hem I2P hem de Java kurmak için gereken 30 üzerinde adımla, yeni kullanıcı katılımı süreci geçmişte de hiç bir zaman kolay olmadı. Süreç alışılmadık ve sezgisel değildi. Uzun yıllardır kullanılabilirlik sorunlarına yol açıyordu.

source: However, in recent Java versions, a new option emerged that had the potential to solve this issue for the Java software. The tool is called “Jpackage” and would allow for the creation of a Jpackage powered I2P Router.
pt_br: No entanto, em versões recentes do Java, surgiu uma nova opção que tinha o potencial de resolver esse problema para o software Java. A ferramenta é chamada de “Jpackage” e permitiria a criação de um roteador I2P alimentado por Jpackage.
tr: Ancak son Java sürümlerinde, Java yazılımı için bu sorunu çözme olasılığı bulunan yeni bir seçenek ortaya çıktı. Bu araca “JPackage” adı veriliyor ve JPackage destekli bir I2P yöneltici oluşturulmasını sağlıyor.

source: We removed dozens of steps from the installation process by switching from an external JVM to a Jpackage, built standard packages for target operating systems, and signed them in a way the operating system would recognize to keep the user secure. Since then, the jpackage routers have reached a new milestone, they have recieved their first incremental updates. These updates will replace the JDK 16 jpackage with an updated JDK 17 jpackage and provide fixes for some small bugs which we caught after the release.
pt_br: Removemos dezenas de etapas do processo de instalação ao alternar de uma JVM externa para um Jpackage, criamos pacotes padrão para sistemas operacionais de destino, e os assinamos de uma forma que o sistema operacional reconheceria para manter o usuário seguro. Desde então, os roteadores jpackage atingiram um novo marco, eles receberam suas primeiras atualizações incrementais. Essas atualizações substituirão o JDK 16 jpackage por um JDK 17 jpackage atualizado e fornecerão correções para alguns pequenos bugs que detectamos após o lançamento.
tr: Bir dış JVM üzerinden JPackage yapısına geçerek kurulum sürecinden onlarca adımı kaldırdık, hedef işletim sistemleri için standart paketler oluşturduk ve kullanıcıyı güvende tutmak için bu paketleri işletim sisteminin tanıyacağı şekilde imzaladık. O zamandan beri, JPackage yönelticileri yeni bir dönüm noktasına ulaştı ve ilk artımlı güncellemelerini almak üzereler. Bu güncellemeler, JPackage içeriğini JDK 16 yerine JDK 17 ile güncelleyecek ve paketi yayınlandıktan sonra yakaladığımız bazı küçük hataların düzeltilmesini sağlayacak.

source: JPackages Get their First Update
pt_br: JPackages recebem sua primeira atualização
tr: JPackage paketleri ilk güncellemesini aldı

source: Bitcoin Core added Support for I2P
pt_br: Bitcoin Core adicionou suporte para I2P
tr: Bitcoin Core I2P desteği ekledi

source: Bitcoin-over-I2P nodes can now fully interact with the rest of the Bitcoin nodes, using the help of nodes that operate within both I2P and the clearnet.
pt_br: Os nós Bitcoin sobre I2P agora podem interagir totalmente com o restante dos nós Bitcoin, usando a ajuda de nós que operam tanto no I2P quanto na clearnet.
tr: I2P üzerinden Bitcoin düğümleri artık, hem I2P hem de normal internet üzerinde çalışan düğümlerin yardımıyla tüm Bitcoin düğümleriyle tamamen etkileşimde bulunabilir.

source: Read the full blog post
pt_br: Leia o post completo do blog
tr: Günlük yazısının tamamını okuyun

source: I2P Usability Lab
pt_br: Laboratório de Usabilidade I2P
tr: I2P Kullanılabilirlik Laboratuvarı

source: This year, the I2P Usability Lab was created. The focus will be on user research, product development and tooling to support adoption. Additionally, better focus on localization efforts, protocol bridge building within the privacy community and sustainability considerations will be part of the ongoing effort to bring I2P to more people.
pt_br: Este ano, o I2P Usability Lab foi criado. O foco será na pesquisa do usuário, desenvolvimento de produtos e ferramentas para dar suporte à adoção. Além disso, um melhor foco em esforços de localização, construção de pontes de protocolo dentro da comunidade de privacidade e considerações de sustentabilidade farão parte do esforço contínuo para levar o I2P a mais pessoas.
tr: Bu yıl, I2P kullanılabilirlik laboratuvarı oluşturuldu. Odağında, benimsemeyi destekleyecek kullanıcı araştırması, ürün geliştirme ve araçlar olacak. Ayrıca yerelleştirme çabalarına, kişisel gizlilik topluluğu içinde iletişim kuralı köprüsü oluşturmaya ve sürdürülebilirlik konularına daha iyi odaklanılmasını sağlayarak, I2P uygulamasını daha fazla kişiye ulaştırmak için süregelen çabaların bir parçası olacak.

source: New User Onboarding Research
pt_br: Pesquisa de integração de novos usuários
tr: Yeni Kullanıcı Alıştırma Araştırması

source: In 2020 the I2P UX team worked with Simply Secure on a usability sprint to assess user interaction with the I2P website. Many changes were applied, however, feedback has indicated that there are still issues with some aspects of new user onboarding.
pt_br: Em 2020, a equipe de UX do I2P trabalhou com a Simply Secure em um sprint de usabilidade para avaliar a interação do usuário com o site do I2P. Muitas mudanças foram aplicadas, no entanto, o feedback indicou que ainda há problemas com alguns aspectos da integração de novos usuários.
tr: 2020 yılında I2P kullanıcı deneyimi ekibi, I2P sitesiyle kullanıcı etkileşimini değerlendirmek için bir kullanılabilirlik araştırmasında Simply Secure ile çalıştı. Birçok değişiklik yapıldı. Ancak geri bildirimler, hala yeni kullanıcıların katılmasıyla ilgili sorunlar olduğunu gösterdi.

source: We have expanded our team thanks to the BASICS project (Building Analytical and Support Infrastructure for Critical Security tools), and not only revisiting the new user onboarding, but we are also expanding the scope to include onboarding for developers and researchers. The goal will be to present an improved information architecture.
pt_br: Expandimos nossa equipe graças ao projeto BASICS (Building Analytical and Support Infrastructure for Critical Security tools), e não apenas revisitando a integração de novos usuários, mas também estamos expandindo o escopo para incluir a integração de desenvolvedores e pesquisadores. O objetivo será apresentar uma arquitetura de informações aprimorada.
tr: BASICS projesi (Kritik Güvenlik araçları için Analitik ve Destek Altyapısı Oluşturma, Building Analytical and Support Infrastructure for Critical Security) sayesinde ekibimizi genişlettik ve yalnızca yeni kullanıcı katılımını yeniden ele almakla kalmayarak, kapsamı geliştiriciler ve araştırmacılar için de alışma aşamasını içerecek şekilde genişletiyoruz. Amaç, geliştirilmiş bir bilgi mimarisi sunmak olacak.
