Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Improve handling of unsupported encryption throughout
pt_br: Melhore o tratamento de criptografia sem suporte em todo o
tr: Desteklenmeyen şifrelemenin ele alınışı iyileştirildi

source: More error checking of client I2CP messages by the router
pt_br: Mais verificação de erros de mensagens I2CP do cliente pelo roteador
tr: Yöneltici tarafından istemci I2CP iletilerine daha fazla hata denetimi eklendi

source: Initial work on hooks for pluggable transports
pt_br: Trabalho inicial em ganchos para transportes plugáveis
tr: Değiştirilebilir taşıyıcılar için bağlantılar üzerine ilk çalışma başlatıldı

source: Enforce request timestamp in tunnel build messages
pt_br: Aplicar registro de data e hora da solicitação em mensagens de construção de túnel
tr: Tünel oluşturma iletilerinde istek zaman damgası dayatıldı

source: Re-enable message status in streaming, but treat no leaseset as a soft failure for now
pt_br: Reative o status da mensagem no streaming, mas trate nenhum leaseset como uma falha leve por enquanto
tr: Akışta ileti durumu yeniden etkinleştirildi. Ancak şimdilik hiçbir "Kiralama kümesi" (LeaseSet) yumuşak bir hata olarak kabul edilmiyor

source: Return unused DH keypairs to the pool for efficiency
pt_br: Retorne os pares de chaves DH não utilizados ao pool para maior eficiência
tr: Verimlilik için kullanılmayan Diffie-Hellman anahtar çiftlerinin havuza iade edilmesi sağlandı

source: Raise failsafe tagset limit and improve deletion strategy when hit
pt_br: Aumente o limite do conjunto de tags à prova de falhas e melhore a estratégia de exclusão quando atingido
tr: Hataya dayanıklı etiket kümesi sınırını yükseltildi ve sınıra ulaşılması durumunda silme stratejisi iyileştirildi

source: Change eepsite Jetty threadpool and queue configuration (new installs only)
pt_br: Alterar a configuração do threadpool e da fila do eepsite Jetty (somente novas instalações)
tr: Eepsite Jetty iş parçacığı havuzu ve kuyruk yapılandırması değiştirildi (yalnızca yeni kurulumlar)

source: NTCP establishment refactoring in prep for NTCP2 and PT
pt_br: Refatoração do estabelecimento NTCP em preparação para NTCP2 e PT
tr: NTCP2 ve PT için hazırlık aşamasında NTCP kurulumu kodu elden geçirildi

source: ============== 0.9.17 Release ==============
pt_br: ============================ Lançamento da versão 0.9.17 ============================
tr: ===================== 0.9.17 sürümü yayınlandı =====================

source: 0.9.17 with more crypto migration and many fixes
pt_br: 0.9.17 com mais migração de criptografia e muitas correções
tr: 0.9.17 sürümü daha fazla şifreleme geçişi ve pek çok düzeltme ile yayınlandı

source: 0.9.17 is primarily a bugfix release, but it also continues our migration to stronger cryptographic signatures.
pt_br: A versão 0.9.17 é principalmente uma correção de bugs, mas também continua nossa migração para assinaturas criptográficas mais fortes.
tr: 0.9.17 ağırlıklı olarak bir hata düzeltme sürümüdür. Bununla birlikte daha güçlü şifreleme imzalarına geçişi de sürdürüyor.

source: We have moved the news feed system used for the news on your console and the latest router version indication to a signed format using RSA 4096-bit keys for enhanced security.
pt_br: Movemos o sistema de feed de notícias usado para as notícias no seu console e a indicação da versão mais recente do roteador para um formato assinado usando chaves RSA de 4096 bits para maior segurança.
tr: Panonuzdaki haberler için kullanılan haber akışı sistemi ve güncel yöneltici sürümü göstergesi, gelişmiş güvenlik için RSA 4096 bit anahtarları kullanılarak imzalı biçime dönüştürüldü.

source: New eepsites and servers will be ECDSA-signed by default, if ECDSA is available. There is now a warning in the console sidebar if ECDSA is not available. For RedHat users, we have reports of successful installs of the BouncyCastle Provider (bcprov) jar to add ECDSA support.
pt_br: Novos eepsites e servidores serão assinados pelo ECDSA por padrão, se o ECDSA estiver disponível. Agora há um aviso na barra lateral do console se o ECDSA não estiver disponível. Para usuários do RedHat, temos relatos de instalações bem-sucedidas do jar do BouncyCastle Provider (bcprov) para adicionar suporte ao ECDSA.
tr: ECDSA kullanılabiliyorsa, yeni eepsiteleri ve sunucuların varsayılan olarak ECDSA imzalı olması sağlandı. ECDSA kullanılamıyorsa pano yan çubuğuna bir uyarı eklendi. RedHat kullanıcıları için, ECDSA desteği eklemek amacıyla BouncyCastle Provider (bcprov) jar kurulumunun başarılı olduğu bildirildi.

source: We've fixed several serious bugs, including an SSU packet corruption problem, and a SAM bug affecting i2p-messenger and other SAM applications. There are several fixes for the preliminary ECDSA router signatures added in the last release but not yet enabled.
pt_br: Corrigimos vários bugs sérios, incluindo um problema de corrupção de pacotes SSU, e um bug SAM que afeta o i2p-messenger e outros aplicativos SAM. Há várias correções para as assinaturas preliminares do roteador ECDSA adicionadas na última versão, mas ainda não habilitadas.
tr: Bir SSU paketi bozulma sorunu ve i2p-messenger ile diğer SAM uygulamalarını etkileyen bir SAM hatasının yanında birkaç ciddi hata düzeltildi. Son sürümde eklenen ancak henüz etkinleştirilmemiş öncü ECDSA yöneltici imzaları için birkaç düzeltme yapıldı.

source: Many of us will be attending 31C3 in Hamburg in December. Stop by our table and say hi!
pt_br: Muitos de nós estaremos presentes no 31C3 em Hamburgo em dezembro. Passe na nossa mesa e diga oi!
tr: Birçoğumuz Aralık ayında Hamburg'da yapılacak 31C3 etkinliğine katılacağız. Tanışmak için masamıza uğrayın!

source: Signed news
pt_br: Notícia assinada
tr: Haberler imzalandı

source: ECDSA default for new server tunnels
pt_br: Padrão ECDSA para novos túneis de servidor
tr: Yeni sunucu tünelleri için ECDSA varsayılan yapıldı

source: Reseeding now SSL-only by default
pt_br: Reseeding agora somente SSL por padrão
tr: Yeniden tohumlama varsayılan olarak yalnızca SSL üzerinden yapılıyor

source: Fix SSU sending corrupt ack-only packets with partial bitfields
pt_br: Corrigir SSU enviando pacotes corrompidos somente de confirmação com campos de bits parciais
tr: Kısmi bit alanları içeren bozulmuş yalnızca ack paketleri gönderen SSU düzeltildi

source: Fix SSU inbound connection fail from non-DSA router
pt_br: Corrigir falha de conexão de entrada SSU de roteador não DSA
tr: DSA olmayan yönelticiden gelen SSU geliş bağlantısı sorunu düzeltildi

source: Don't select incompatible peers if we are a non-DSA router
pt_br: Não selecione pares incompatíveis se formos um roteador não DSA
tr: Yöneltici DSA değilse uyumsuz eşlerin seçilmesi engellendi

source: Fix EdDSA signature verification bug
pt_br: Corrigir bug de verificação de assinatura EdDSA
tr: EdDSA imza doğrulama hatası düzeltildi

source: Set I2NP lookup type flags in all cases, not just when a reply tunnel is used
pt_br: Defina sinalizadores de tipo de pesquisa I2NP em todos os casos, não apenas quando um túnel de resposta for usado
tr: Yalnızca bir yanıt tüneli kullanıldığında değil, her durumda I2NP arama türü işaretleri ayarlandı

source: Stop i2ptunnel server acceptor thread after close
pt_br: Parar o thread do aceitador do servidor i2ptunnel após o fechamento
tr: Kapattıldıktan sonra i2ptunnel sunucu alıcı iş parçacığının durdurulması sağlandı

source: Fix bug preventing some plugins from stopping completely
pt_br: Corrigir bug que impedia que alguns plugins parassem completamente
tr: Bazı uygulama eklerinin tamamen durmasını engelleyen hata düzeltildi

source: Fix SAM v3 bug causing failures in incoming connections
pt_br: Corrigir bug do SAM v3 causando falhas em conexões de entrada
tr: Geliş bağlantılarında hatalara neden olan SAM v3 hatası düzeltildi

source: Add a warning in the console sidebar if ECDSA not supported
pt_br: Adicione um aviso na barra lateral do console se ECDSA não for compatível
tr: ECDSA desteklenmiyorsa pano yan çubuğunda uyarı görüntülenmesi sağlandı

source: Log warnings for Java 6 that we will eventually require Java 7
pt_br: Avisos de log para Java 6 de que eventualmente precisaremos do Java 7
tr: Java 7 sürümüne gerek duyulan Java 6 uyarılarının günlüğe kaydedilmesi sağlandı

source: Don't let proxied routers auto-floodfill
pt_br: Não deixe que roteadores proxy sejam preenchidos automaticamente
tr: Vekil sunucu kullanan yönelticilerin otomatik doldurma yapması engellendi

source: Don't resend SSU acks that are too old
pt_br: Não reenvie confirmações SSU muito antigas
tr: Çok eski SSU ack paketlerinin yeniden gönderilmesi engellendi

source: Don't publish direct info in SSU address if introducers are required
pt_br: Não publique informações diretas no endereço da SSU se forem necessários apresentadores
tr: Tanıtıcılar zorunluysa doğrudan bilgilerin SSU adresinde yayınlanması engellendi

source: New default opentrackers in i2psnark
pt_br: Novos opentrackers padrão no i2psnark
tr: i2psnark üzerinde açık izleyiciler varsayılan olarak ayarlandı

source: Add support for specifiying data directory per-torrent in i2psnark
pt_br: Adicionar suporte para especificar diretório de dados por torrent no i2psnark
tr: i2psnark üzerinde her torrent için ayrı veri klasörü belirtme desteği eklendi

source: Changes in streaming accept() error behavior
pt_br: Alterações no comportamento do erro accept() de streaming
tr: Akış accept() hata davranışında değişiklikler yapıldı

source: Minor blockfile format changes
pt_br: Pequenas alterações no formato do blockfile
tr: Blok dosyasında küçük biçim değişiklikleri yapıldı

source: New option for persistent random key to preserve peer ordering across restarts
pt_br: Nova opção para chave aleatória persistente para preservar a ordenação de pares em reinicializações
tr: Yeniden başlatma sonrasında eş sıralamasını korumak için yeni kalıcı rastgele anahtar seçeneği eklendi

source: ==================== Android app releases ====================
pt_br: ======================================== Lançamentos de aplicativos para Android ========================================
tr: =========================== Android uygulaması sürümleri ===========================

source: I2P Android 0.9.17 and Bote 0.3 have been released on the website, Google Play and F-Droid.
pt_br: Lançados I2P Android 0.9.17 e Bote 0.3 no website, Google Play e F-Droid.
tr: I2P Android 0.9.17 ve Bote 0.3 site, Google Play ve F-Droid üzerinde yayınlandı.

source: It has been some time since I last posted updates about our Android development, and several I2P releases have gone by without any matching Android releases. At last, the wait is over!
pt_br: Já faz algum tempo desde a última vez que postei atualizações sobre nosso desenvolvimento no Android, e vários lançamentos do I2P passaram sem nenhum lançamento correspondente do Android. Finalmente, a espera acabou!
tr: Android geliştirmemizle ilgili son güncellemeleri yayınladığımdan bu yana biraz zaman geçti ve birkaç I2P sürümü, denk herhangi bir Android sürümü olmadan yayınlandı. Sonunda, bekleyiş sona erdi!

source: New app versions ----------------
pt_br: Novas versões do aplicativo ----------------
tr: Yeni uygulama sürümleri ----------------

source: New versions of I2P Android and Bote have been released! They can be downloaded from these URLs:
pt_br: Novas versões do I2P Android e Bote foram lançadas! Elas podem ser baixadas dessas URLs:
tr: I2P Android ve Bote uygulamalarının yeni sürümleri yayınlandı! Şu adreslerden indirilebilir:

source: The main change in these releases is the transition to Android's new Material design system. Material has made it much easier for app developers with, shall we say, "minimalist" design skills (like myself) to create apps that are nicer to use. I2P Android also updates its underlying I2P router to the just-released version 0.9.17. Bote brings in several new features along with many smaller improvements; for example, you can now add new email destinations via QR codes.
pt_br: A principal mudança nesses lançamentos é a transição para o novo sistema de design Material do Android. O Material tornou muito mais fácil para desenvolvedores de aplicativos com, digamos habilidades de design "minimalistas" (como eu) criar aplicativos que são mais agradáveis de usar. O I2P Android também atualiza seu roteador I2P subjacente para a recém-lançada versão 0.9.17. O Bote traz vários novos recursos junto com muitas melhorias menores ; por exemplo, agora você pode adicionar novos destinos de e-mail por meio de códigos QR.
tr: Bu sürümlerdeki ana değişiklik, yeni Android Material tasarım sistemine geçilmesi oldu. Material, benim gibi "minimalist" tasarım becerilerine sahip uygulama geliştiricilerinin kullanımı daha hoş uygulamalar oluşturmasını oldukça kolaylaştıdı. I2P Android ayrıca, temel I2P yönelticisini yeni yayınlanan 0.9.17 sürümüne güncelliyor. Bote uygulamasında, birçok küçük iyileştirmenin yanında birkaç yeni özellik eklendi. Örneğin, artık QR kodları ile yeni e-posta hedefleri ekleyebilirsiniz.

source: As I mentioned in `my last update`__, the release key that signs the apps has changed. The reason for this was because we needed to change the package name of I2P Android. The old package name (``net.i2p.android.router``) had already been taken on Google Play (we still don't know who was using it), and we wanted to use the same package name and signing key for all distributions of I2P Android. Doing so means that a user could initially install the app from the I2P website, and then later if the website was blocked they could upgrade it using Google Play. Android OS considers an application to be completely different when its package name changes, so we took the opportunity to increase the strength of the signing key.
pt_br: Como mencionei em `minha última atualização`__, a chave de lançamento que assina os aplicativos foi alterada. O motivo para isso foi porque precisávamos alterar o nome do pacote do I2P Android. O nome antigo do pacote (``net.i2p.android.router``) já havia sido adotado no Google Play (ainda não sabemos quem o estava usando), e queríamos usar o mesmo nome de pacote e chave de assinatura para todas as distribuições do I2P Android. Isso significa que um usuário poderia inicialmente instalar o aplicativo do site I2P e, mais tarde, se o site fosse bloqueado, ele poderia atualizá-lo usando Google Play. O sistema operacional Android considera um aplicativo completamente diferente quando o nome do pacote muda, então aproveitamos a oportunidade para aumentar a força da chave de assinatura.
tr: `Son güncellememde`__ bahsettiğim gibi, uygulamaları imzalayan sürüm anahtarı değişti. I2P Android paketinin adını değiştirmemiz gerektiğinden bunu yapmalıydık. Eski paket adı (``net.i2p.android.router``) Google Play üzerinde daha önce kullanılmıştı (hala kimin kullandığını bilmiyoruz). Ayrıca tüm I2P Android dağıtımları için aynı paket adını ve imzalama anahtarını kullanmak istedik. Böylece, bir kullanıcı uygulamayı başlangıçta I2P sitesinden kurabilir ve daha sonra siteye erişim engellenirse Google Play ile güncellemeleri yapabilir. Android işletim sistemi, paket adı değiştiğinde bir uygulamayı tamamen farklı olarak değerlendirir. Bu nedenle imzalama anahtarının gücünü artırma fırsatını yakaladık.

source: The fingerprint (SHA-256) of the new signing key is:
pt_br: A impressão digital (SHA-256) da nova chave de assinatura é:
tr: Yeni imzalama anahtarının parmak izi (SHA-256):

source: A few months ago we `released`__ both I2P Android and Bote on Google Play in Norway, to test the release process there. We are pleased to announce that both apps are now being released globally by `Privacy Solutions`__. The apps can be found at these URLs:
pt_br: Alguns meses atrás, `lançamos`__ tanto o I2P Android quanto o Bote no Google Play em Noruega, para testar o processo de lançamento lá. Temos o prazer de anunciar que ambos os aplicativos agora estão sendo lançados globalmente pela `Privacy Solutions`__. Os aplicativos podem ser encontrados nestas URLs:
tr: Birkaç ay önce, oradaki yayınlama sürecini sınamak için Norveç içinde hem I2P Android hem de Bote uygulamarını Google Play üzerinde `yayınladık`__. Her iki uygulama da artık `Privacy Solutions`__ tarafından küresel olarak sunulduğunu duyurmaktan mutluluk duyuyoruz. Uygulamaları şu adreslerde bulabilirsiniz:

source: The global release is being done in several stages, starting with the countries for which we have translations. The notable exception to this is France; due to import regulations on cryptographic code, we are unable yet to distribute these apps on Google Play France. This is the same issue that has affected other apps like TextSecure and Orbot.
pt_br: O lançamento global está sendo feito em vários estágios, começando com os países para os quais temos traduções. A exceção notável a isso é a França; devido a regulamentações de importação em código criptográfico, ainda não conseguimos distribuir esses aplicativos no Google Play França. Esse é o mesmo problema que afetou outros aplicativos como TextSecure e Orbot.
tr: Küresel sürüm, çevirilerimizin olduğu ülkelerden başlayarak birkaç aşamada yayınlanıyor. Burada önemli bir istisna Fransa'dır; Şifreleme koduyla ilgili ithalat düzenlemeleri nedeniyle, bu uygulamaları henüz Google Play Fransa üzerinde dağıtamıyoruz. Aynı sorun, TextSecure ve Orbot gibi diğer uygulamaları da etkiliyor.

source: Don't think we have forgotten about you, F-Droid users! In addition to the two locations above, we have set up our own F-Droid repository. If you are reading this post on your phone, `click here`__ to add it to F-Droid (this only works in some Android browsers). Or, you can manually add the URL below to your F-Droid repository list:
pt_br: Não pense que nos esquecemos de vocês, usuários do F-Droid! Além dos dois locais acima, nós configuramos nosso próprio repositório F-Droid. Se você estiver lendo este post no seu telefone, `clique aqui`__ para adicioná-lo ao F-Droid (isso só funciona em alguns navegadores Android). Ou você pode adicionar manualmente a URL abaixo à sua lista de repositórios do F-Droid:
tr: F-Droid kullanıcıları sizi unuttuk sanmayın! Yukarıdaki iki konuma ek olarak kendi F-Droid depomuzu kurduk. Bu yazıyı telefonunuzdan okuyorsanız, depoyu F-Droid uygulamasına eklemek için `buraya tıklayın`__ (yalnızca bazı Android tarayıcılarında çalışıyor) ya da aşağıdaki adresi F-Droid depo listenize el ile ekleyin:

source: If you would like to manually verify the fingerprint (SHA-256) of the repository signing key, or type it in when adding the repository, here it is:
pt_br: Se você quiser verificar manualmente a impressão digital (SHA-256) da chave de assinatura do repositório , ou digitá-la ao adicionar o repositório, aqui está:
tr: Depo imzalama anahtarının parmak izini (SHA-256) el ile doğrulamak veya depoyu eklerken yazmak isterseniz, işte burada:

source: Unfortunately the I2P app in the main F-Droid repository has not been updated because our F-Droid maintainer has disappeared. We hope that by maintaining this binary repository, we can better support our F-Droid users and keep them up-to-date. If you have already installed I2P from the main F-Droid repository, you will need to uninstall it if you want to upgrade, because the signing key will be different. The apps in our F-Droid repository are the same APKs that are provided on our website and on Google Play, so in future you will be able to upgrade using any of these sources.
pt_br: Infelizmente, o aplicativo I2P no repositório principal do F-Droid não foi atualizado porque nosso mantenedor do F-Droid desapareceu. Esperamos que, ao manter este repositório binário, possamos oferecer melhor suporte aos nossos usuários do F-Droid e mantê-los atualizados. Se você já instalou o I2P do repositório principal do F-Droid, você precisará desinstalá-lo se quiser atualizar, porque a chave de assinatura será diferente. Os aplicativos em nosso repositório do F-Droid são os mesmos APKs que são fornecidos em nosso site e no Google Play, então no futuro você poderá atualizar usando qualquer uma dessas fontes.
tr: Ne yazık ki, ana F-Droid deposundaki I2P uygulaması, F-Droid bakıcımız ortadan kaybolduğu için güncellenmedi. Bu ikili depoyu koruyarak F-Droid kullanıcılarımızı daha iyi destekleyebileceğimizi ve güncel kalmalarını sağlayabileceğimizi umuyoruz. I2P ana F-Droid deposundan kurulduysa ve güncellemek istiyorsanız imzalama anahtarı farklı olduğundan o sürümü kaldırmanız gerekir. F-Droid depomuzdaki uygulamalar, sitemizde ve Google Play üzerinde sunulan APK dosyaları ile aynıdır. Böylece gelecekte bu kaynaklardan herhangi birini kullanarak güncelleme yapabilirsiniz.

source: ================ 31C3 trip report ================
pt_br: ================ Relatório de viagem 31C3 ================
tr: =================== 31C3 etkinliği raporu ===================

source: CCC has always been a productive time for us, and 31C3 was no exception. Here is a summary of our various meetings and discussions.
pt_br: O CCC sempre foi um momento produtivo para nós, e o 31C3 não foi exceção. Aqui está um resumo de nossas várias reuniões e discussões.
tr: CCC bizim için her zaman verimli bir etkinlik oldu ve 31C3 de farklı değildi. İşte çeşitli toplantı ve tartışmalarımızın özeti.

source: We were, for the second year in a row, at a great location in the Congress, in `Noisy Square`_, right next to the EFF table. Being part of Noisy Square has really increased our visibility and helped many people find us. Thanks to Noisy Square and the 31C3 organizers for a great Congress.
pt_br: Estávamos, pelo segundo ano consecutivo, em um ótimo local no Congresso, em `Noisy Square`_, bem ao lado da mesa da EFF. Fazer parte do Noisy Square realmente aumentou nossa visibilidade e ajudou muitas pessoas a nos encontrarem. Obrigado ao Noisy Square e aos organizadores do 31C3 por um ótimo Congresso.
tr: Üst üste ikinci yıl, kongrede harika bir yerde, `Noisy Square`_ içinde, EFF masasının hemen yanındaydık. Noisy Square içinde olmak görünürlüğümüzü gerçekten artırdı ve birçok insanın bizi bulmasını sağladı. Harika bir kongre için Noisy Square ve 31C3 organizatörlerine teşekkürler.

source: We also thank Gabriel Weinberg and his fabulous search engine `DuckDuckGo`__ for their support of open source anonymity tools and their `generous contribution`__ to I2P in 2014. Funding from DuckDuckGo and others helped support our attendance at CCC. This is the primary annual meetup for I2P developers and it is critical to our success.
pt_br: Agradecemos também a Gabriel Weinberg e seu fabuloso mecanismo de busca `DuckDuckGo`__ por seu suporte às ferramentas de anonimato de código aberto e sua `generosa contribuição`__ para o I2P em 2014. O financiamento do DuckDuckGo e outros ajudou a sustentar nossa participação no CCC. Este é o principal encontro anual para desenvolvedores do I2P e é crítico para nosso sucesso.
tr: Ayrıca Gabriel Weinberg'e ve muhteşem 'DuckDuckGo'__ arama motoruna açık kaynaklı anonimlik araçlarına verdikleri destek ve 2014 yılında I2P projesine yaptıkları 'cömert katkı'__ için teşekkür ederiz. DuckDuckGo ve diğerlerinden sağlanan fonlar CCC etkinliğine katılmamızı sağladı. I2P geliştiricileri için öncelikli olan bu yıllık buluşmanın başarımız için kritik önemi bulunuyor.

source: Discussions with others =======================
pt_br: Discussões com outros ========================
tr: Başkalarıyla tartışmalar =======================
