Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: I2P Mac OS Jpackage Updates
pt_br: Atualizações do I2P Mac OS Jpackage
tr: I2P macOS JPackage Güncellemeleri

source: Mac OS only packages recieve the following updates: * No Mac-Specific changes. Mac OS is updated to build with JDK 17. For a summary of development see the `checkins in i2p-jpackage-mac <https://i2pgit.org/i2p-hackers/i2p-jpackage-mac>`_
pt_br: Pacotes somente para Mac OS recebem as seguintes atualizações: * Nenhuma alteração específica para Mac. O Mac OS é atualizado para ser construído com o JDK 17. Para um resumo do desenvolvimento, veja `checkins em i2p-jpackage-mac <https://i2pgit.org/i2p-hackers/i2p-jpackage-mac>`_
tr: Yalnızca macOS paketlerinde şu güncellemeler bulunur: * Mac özelinde bir değişiklik yoktur. macOS JDK 17 kullanacak şekilde güncellendi. Geliştirmelerin özeti için `checkins in i2p-jpackage-mac <https://i2pgit.org/i2p-hackers/i2p-jpackage-mac>`_ bölümüne bakabilirsiniz

source: 1.6.1 Release
pt_br: Versão 1.6.1
tr: 1.6.1 sürümü yayınlandı

source: 1.6.1 enables new tunnel build messages
pt_br: 1.6.1 habilita novas mensagens de construção de túnel
tr: 1.6.1 sürümünde yeni tünel oluşturma iletileri etkinleştirildi

source: Note: 1.6.1 is the current release. 1.6.0 was tagged but not released.
pt_br: Observação: 1.6.1 é a versão atual. 1.6.0 foi marcada, mas não foi lançada.
tr: Not: 1.6.1 geçerli sürümdür. 1.6.0 sürümü hazırlandı ancak yayınlanmadı.

source: This release completes the rollout of two major protocol updates developed in 2021. The transition to X25519 encryption for routers is accelerated, and we expect almost all routers to be rekeyed by the end of the year. Short tunnel build messages are enabled for a significant bandwidth reduction.
pt_br: Este lançamento completa a implementação de duas grandes atualizações do protocolo desenvolvidas em 2021. A transição para a criptografia X25519 para roteadores é acelerada, e esperamos que quase todos os roteadores sejam chaveados novamente até o final do ano. As mensagens de construção dos túneis curtos são habilitadas para uma redução significativa da largura de banda.
tr: Bu sürümde, 2021 yılında geliştirilen iki büyük iletişim kuralı güncellemesinin dağıtımını tamamlanıyor. Yöneltici için X25519 şifrelemesi geçişi hızlandı ve yıl sonuna kadar neredeyse tüm yönelticilerin yeniden anahtarlanmasını bekliyoruz. Bant genişliğinde önemli bir azalma sağlayacak olan kısa tünel oluşturma iletileri etkinleştirildi.

source: We added a theme selection panel to the new install wizard. We've improved SSU performance and fixed an issue with SSU peer test messages. The tunnel build Bloom filter was adjusted to reduce memory usage. We have enhanced support for non-Java plugins.
pt_br: Adicionamos um painel de seleção de temas ao novo assistente de instalação. Melhoramos o desempenho da SSU e corrigimos um problema com as mensagens de teste dos pares da SSU. O filtro Bloom construído no túnel foi ajustado para reduzir o uso de memória. Melhoramos o suporte para plugins não-Java.
tr: Yeni kurulum yardımcısına tema seçim panosu eklendi. SSU başarımı iyileştirildi ve SSU eş sınaması iletileriyle ilgili bir sorun düzeltildi. Tünel oluşturma Bloom süzgeci, bellek kullanımını azaltacak şekilde ayarlandı. Java dışı eklenti desteği genişletildi.

source: In other news, we are making excellent progress on the design of our new UDP transport SSU2 and expect to start implementation early next year.
pt_br: Em outras palavras, estamos fazendo excelentes progressos no projeto de nosso novo SSU2 de transporte UDP e esperamos começar a implementação no início do próximo ano.
tr: Diğer yandan, yeni UDP ulaşım SSU2 tasarımında harika bir ilerleme kaydettik ve önümüzdeki yılın başlarında uygulamaya geçirmeyi umuyoruz.

source: Console: Add theme selection to new-install wizard
pt_br: Console: Adicionar seleção de tema ao assistente de nova instalação
tr: Pano: Yeni kurulum yardımcısına tema seçimi eklendi

source: Router: Increase probability of rekey to X25519
pt_br: Roteador: Aumenta a probabilidade de rekey para X25519
tr: Yöneltici: X25519 yeniden anahtarlama olasılığı artırıldı

source: SSU: Performance improvements
pt_br: SSU: Melhorias de desempenho
tr: SSU: Başarım iyileştirmeleri yapıldı

source: SSU: Improve security of peer test
pt_br: SSU: Melhorar a segurança do teste de pares
tr: SSU: Eş sınamasında güvenlik iyileştirildi

source: Tunnels: Enable sending new short build messages
pt_br: Túneis: Habilitar o envio de novas mensagens de compilação curtas
tr: Tüneller: Yeni kısa tünel oluşturma iletileri etkinleştirildi

source: i2ptunnel: Fix encryption type selection logic
pt_br: i2ptunnel: Corrigir lógica de seleção de tipo de criptografia
tr: i2ptunnel: Şifreleme türü seçme mantığı düzeltildi

source: Improve support for non-Java plugins
pt_br: Melhore o suporte para plugins não Java
tr: Java olmayan uygulama eklerinin desteklenmesi iyileştirildi

source: Router: Reduce tunnel build Bloom filter memory usage
pt_br: Roteador: reduza o uso de memória do filtro Bloom na construção do túnel
tr: Yöneltici: Tünel oluşturma Bloom süzgecinin bellek kullanımı azaltıldı

source: Updates: More changes to support bundled updaters
pt_br: Atualizações: Mais mudanças para oferecer suporte a atualizadores agrupados
tr: Güncellemeler: Paketlenmiş güncelleyicileri desteklemek için ek değişiklikler yapıldı

source: I2P is not affected by the log4j vulnerability
pt_br: O I2P não é afetado pela vulnerabilidade do log4j
tr: I2P log4j güvenlik açığından etkinlenmiyor

source: I2P doesn't use log4j and is therefore unaffected by CVE-2021-44228
pt_br: O I2P não usa log4j e, portanto, não é afetado pelo CVE-2021-44228
tr: I2P log4j kullanmadığı için CVE-2021-44228 güvenlik açığından etkilenmiyor

source: I2P is not affected by the log4j 0-Day vulnerability which was published yesterday, CVE-2021-44228. I2P doesn't use log4j for logging, however we also needed to review our dependencies for log4j usage, especially jetty. This review has not revealed any vulnerabilities.
pt_br: O I2P não é afetado pela vulnerabilidade log4j 0-Day que foi publicada ontem, CVE-2021-44228. O I2P não usa log4j para registro, no entanto, também precisamos revisar nossas dependências para uso do log4j, especialmente jetty. Esta revisão não revelou nenhuma vulnerabilidade.
tr: I2P, dün yayınlanan CVE-2021-44228 log4j 0-Day güvenlik açığından etkilenmiyor. I2P, log4j kullanmıyor. Ancak bağımlılıklarımızı denetleyerek özellikle jetty için log4j kullanıma bakmamız gerekiyordu. Bu inceleme sonucunda herhangi bir güvenlik açığı ile karşılaşmadık.

source: It was also important to check all of our plugins. Plugins may bring in their own logging systems, including log4j. We found that most plugins also do not use log4j, and those that do did not use a vulnerable version of log4j.
pt_br: Também era importante verificar todos os nossos plugins. Os plugins podem trazer seus próprios sistemas de registro , incluindo log4j. Descobrimos que a maioria dos plugins também não usa log4j, e aqueles que usam não usam uma versão vulnerável do log4j.
tr: Tüm uygulama eklerimizin denetlenmesi de önemliydi. Uygulama ekleri, log4j ya da kendi günlük sistemlerini kurabiliyor. Çoğu uygulama ekinin de log4j kullanmadığını ve kullananların da güvenlik açığı bulunan bir log4j sürümünü kullanmadığını gördük.

source: We haven't found any dependency, plugin or app that's vulnerable.
pt_br: Não encontramos nenhuma dependência, plugin ou aplicativo vulnerável.
tr: Güvenlik açığı olan herhangi bir bağımlılık, uygulama eki veya uygulama bulamadık.

source: We bundle a log4j.properties file with jetty for plugins that introduce log4j. This file only has an effect on plugins which use log4j logging internally. We have checked in the recommended mitigation to the log4j.properties file. Plugins which enable log4j will run with the vulnerable feature disabled. As we cannot find any usage of log4j 2.x anywhere, we have no plans to do an emergency release at this time.
pt_br: Nós agrupamos um arquivo log4j.properties com jetty para plugins que introduzem log4j. Este arquivo só tem efeito em plugins que usam log4j logging internamente. Nós verificamos a mitigação recomendada para o arquivo log4j.properties. Plugins que habilitam log4j serão executados com o recurso vulnerável desabilitado. Como não conseguimos encontrar nenhum uso de log4j 2.x em lugar nenhum, não temos planos de fazer um lançamento de emergência neste momento.
tr: log4j kullanan uygulama ekleri için bir log4j.properties dosyasını jetty ile birlikte paketledik. Bu dosya yalnızca içeride log4j günlüğünü kullanan uygulama ekleri üzerinde etkilidir. log4j.properties dosyasında önerilen azaltmayı sağladık. Log4j kullanan uygulama ekleri, güvenlik açığına yol açan özellik devre dışı bırakılarak çalışır. Herhangi bir yerde log4j 2.x sürümünün kullanıldığını göremediğimizden, şu anda bir acil durum sürümü yapma planımız yok.

source: Meet Your Maintainer: StormyCloud
pt_br: Conheça seu mantenedor: StormyCloud
tr: Destekleyicinizle tanışın: StormyCloud

source: An interview with the maintainers of the StormyCloud Outproxy
pt_br: Uma entrevista com os mantenedores do StormyCloud Outproxy
tr: StormyCloud çıkış vekil sunucusunun sorumluları ile röportaj

source: A conversation with StormyCloud Inc.
pt_br: Uma conversa com a StormyCloud Inc.
tr: StormyCloud Inc. ile görüşme

source: With the most recent `I2P Java release <https://geti2p.net/en/blog/post/2022/08/22/1.9.0-Release>`__, the existing outproxy, false.i2p was replaced with the new StormyCloud outproxy for new I2P installs. For people who are updating their router, changing over to the Stormycloud service can be done quickly.
pt_br: Com o lançamento mais recente do `I2P Java <https://geti2p.net/en/blog/post/2022/08/22/1.9.0-Release>`__, o outproxy existente, false.i2p, foi substituído pelo novo StormyCloud outproxy para novas instalações do I2P. Para pessoas que estão atualizando seus roteadores, a mudança para o serviço Stormycloud pode ser feita rapidamente.
tr: Son `I2P Java sürümü <https://geti2p.net/en/blog/post/2022/08/22/1.9.0-Release>`__ ile, var olan outproxy false.i2p yeni I2P kurulumları için yeni StormyCloud çıkış vekil sunucusu ile değiştirildi. Yönelticilerini güncelleyen kişiler Stormycloud hizmetine hızlı bir şekilde geçebilir.

source: In your Hidden Services Manager, change both Outproxies and SSL Outproxies to exit.stormycloud.i2p and click on the save button at the bottom of the page.
pt_br: No seu Hidden Services Manager, altere Outproxies e SSL Outproxies para exit.stormycloud.i2p e clique no botão salvar na parte inferior da página.
tr: Gizli hizmetler yöneticinizde hem çıkış vekil sunucularını hem de SSL çıkış vekil sunucularını exit.stormycloud.i2p olarak değiştirin ve sayfanın altındaki kaydet düğmesine tıklayın.

source: Who is StormyCloud Inc?
pt_br: Quem é StormyCloud Inc?
tr: StormyCloud Inc kimdir?

source: To defend Internet access as a universal human right. By doing so, the group protects users’ electronic privacy and builds community by fostering unrestricted access to information and thus the free exchange of ideas across borders. This is essential because the Internet is the most powerful tool available for making a positive difference in the world.
pt_br: Defender o acesso à Internet como um direito humano universal. Ao fazer isso, o grupo protege a privacidade eletrônica dos usuários e constrói uma comunidade ao promover o acesso irrestrito à informação e, portanto, a livre troca de ideias através das fronteiras. Isso é essencial porque a Internet é a ferramenta mais poderosa disponível para fazer uma diferença positiva no mundo.
tr: StormyCloud Inc kuruluşunun misyonu internet erişimini evrensel bir insan hakkı olarak savunmaktır. Grup bunu yaparken, kullanıcıların elektronik kişisel gizliliğini koruyarak, bilgiye sınırsız erişimi ve dolayısıyla sınırlar arasında özgür fikir alışverişini teşvik ederek bir topluluk oluşturur. Bu çok önemlidir, çünkü internet dünyada olumlu bir fark yaratabilecek var olan en güçlü araçtır.

source: Vision Statement
pt_br: Declaração de Visão
tr: Vizyonu

source: To become a pioneer in providing free and open Internet to everyone in the universe because Internet access is a basic human right `(https://stormycloud.org/about-us/) <https://stormycloud.org/about-us/>`__
pt_br: Tornar-se um pioneiro na oferta de Internet livre e aberta para todos no enuniverso porque o acesso à Internet é um direito humano básico `(https://stormycloud.org/about-us/) <https://stormycloud.org/about-us/>`__
tr: İnternet erişimi temel bir insan hakkı olduğu için evrendeki herkese ücretsiz ve açık internet sağlamakta öncü olmak `(https://stormycloud.org/about-us/) <https://stormycloud.org/about-us />`__

source: I met with Dustin to say hello, and to talk more about privacy, the need for services like StormyCloud, and what drew the company to I2P.
pt_br: Encontrei-me com Dustin para dizer olá e conversar mais sobre privacidade, a necessidade de serviços como o StormyCloud e o que atraiu a empresa para o I2P.
tr: Merhaba demek ve kişisel gizlilik için StormyCloud gibi hizmetlere duyulan gereksinim ile şirketi I2P projesine çeken şeyler hakkında konuşmak için Dustin ile görüştüm.

source: What was the inspiration behind starting StormyCloud?
pt_br: Qual foi a inspiração para começar a StormyCloud?
tr: StormyCloud fikrine ilham veren neydi?

source: It was late 2021, I was on the /r/tor subreddit. There was a person who had responded in a thread about how to use Tor who talked about how they relied on Tor in order to stay in contact with their family. Their family lived in the United States, but at the time they resided in a country where internet access was very restricted. They needed to be very cautious about who they communicated with and what they said. For these reasons, they relied on Tor. I thought about how I can communicate with people without fear or restrictions and that it should be the same for everyone.
pt_br: Era final de 2021, eu estava no subreddit /r/tor. Havia uma pessoa que havia respondido em um tópico sobre como usar o Tor que falou sobre como eles dependiam do Tor para manter contato com sua família. Sua família vivia nos Estados Unidos, mas na época eles residiam em um país onde o acesso à internet era muito restrito. Eles precisavam ser muito cautelosos sobre com quem se comunicavam e o que diziam. Por esses motivos, eles dependiam do Tor. Pensei em como posso me comunicar com as pessoas sem medo ou restrições e que deveria ser o mesmo para todos.
tr: 2021 sonlarıydı ve alt reddit /r/tor üzerindeydim. Tor uygulamasının nasıl kullanılacağına hakkında bir ileti dizisini yanıtlayan ve ailesiyle iletişimde kalmak için Tor uygulamasına nasıl güvendiklerini anlatan bir kişi vardı. Aileleri Amerika Birleşik Devletleri'nde yaşıyordu, ancak o zamanlar internet erişiminin çok kısıtlı olduğu bir ülkede yaşıyorlardı. Kiminle iletişim kurdukları ve ne söyledikleri konusunda çok dikkatli olmaları gerekiyordu. Bu nedenlerle Tor uygulamasına güvendiler. İnsanlarla korku ve kısıtlama olmadan nasıl iletişim kurabileceğimi ve herkesin bu olanaklara sahip olması gerektiğini düşündüm.

source: The goal of StormyCloud is to help as many people as we can to do that.
pt_br: O objetivo do StormyCloud é ajudar o máximo de pessoas possível a fazer isso.
tr: StormyCloud, olabildiğince çok insana bu olanakları sağlamayı amaçlıyor.

source: What have been some of the challenges of getting StormyCloud started?
pt_br: Quais foram alguns dos desafios para começar o StormyCloud ?
tr: StormyCloud projesine başlarken hangi zorluklarla karşılaştınız?

source: The cost — it is ungodly expensive. We went the data centre route since the scale of what we are doing is not something that can be done on a home network. There are equipment expenses and reoccurring hosting costs.
pt_br: O custo — é absurdamente caro. Fomos pela rota do data center já que a escala do que estamos fazendo não é algo que pode ser feito em uma rede doméstica. Há despesas com equipamentos e custos recorrentes de hospedagem .
tr: Maliyet - İnanılmaz derecede pahalı. Yaptığımız şeyin bir ev ağı ölçeğinde yapılabilecek bir şey olmadığından veri merkezi kullanma yoluna gittik. Ekipman giderleri ve düzenli ödenmesi gereken barındırma maliyetleri var.

source: In regard to setting up the non-profit, we followed in Emerald Onion’s path and utilized some of their documents and lessons learned. The Tor community has many resources available that are very helpful.
pt_br: Em relação à criação da organização sem fins lucrativos, seguimos o caminho da Emerald Onion e utilizamos alguns de seus documentos e lições aprendidas. A comunidade Tor tem muitos recursos disponíveis que são muito úteis.
tr: Kâr amacı gütmeyen bir kuruluşun kurulmasıyla ilgili olarak, Emerald Onion projesinin yolunu izledik ve bazı belgeleri ile aldıkları derslerden yararlandık. Tor topluluğunda, çok yararlı birçok kaynak var.

source: How has the response been to your services?
pt_br: Como tem sido a resposta aos seus serviços?
tr: Hizmetlerinize nasıl tepkiler verildi?

source: In July we served 1.5 billion DNS requests over all of our services. People appreciate that there is no logging being done. The data is just not there, and people like that.
pt_br: Em julho, atendemos 1,5 bilhão de solicitações de DNS em todos os nossos serviços. As pessoas apreciam que não haja registro sendo feito. Os dados simplesmente não estão lá, e as pessoas gostam disso.
tr: Temmuz ayında, tüm hizmetlerimiz üzerinden 1,5 milyar DNS isteği sunduk. İnsanlar günlük kaydı yapılmamasını beğeniyor. Herhangi bir veri tutulmuyor ve insanlar bunu seviyor.

source: What is an outproxy?
pt_br: O que é um outproxy?
tr: Çıkış vekil sunucusu nedir?

source: An outproxy is similar to Tor’s exit nodes, it allows for clearnet (normal internet traffic) to be relayed through the I2P network. In other words, it allows I2P users to access the internet through the safety of the I2P network.
pt_br: Um outproxy é similar aos nós de saída do Tor, ele permite que o clearnet (tráfego normal da internet) seja retransmitido pela rede I2P. Em outras palavras, ele permite que usuários I2P acessem a internet pela segurança da rede I2P.
tr: Çıkış vekil sunucusu, Tor çıkış aktarıcılarına benzer. temiz ağ verilerinin (normal internet trafiği) I2P ağı üzerinden aktarılmasını sağlar. Başka bir deyişle, I2P kullanıcılarının I2P ağının güvenliğini kullanarak internete erişmelerini sağlar.

source: What is special about the StormyCloud I2P Outproxy?
pt_br: O que há de especial no StormyCloud I2P Outproxy?
tr: StormyCloud I2P çıkış vekil sunucusunun özelliği nedir?

source: To start with we are multi-homed which means we have several servers serving outproxy traffic. This ensures the service is always available to the community. All the logs on our servers are wiped every 15 minutes. This ensures both law enforcement and ourselves do not have access to any data. We support visiting Tor onion links though the outproxy, and our outproxy is pretty fast.
pt_br: Para começar, somos multi-homed, o que significa que temos vários servidores servindo tráfego outproxy. Isso garante que o serviço esteja sempre disponível para a comunidade. Todos os logs em nossos servidores são apagados a cada 15 minutos. Isso garante que tanto a polícia quanto nós não tenhamos acesso a nenhum dado. Oferecemos suporte para visitar links onion do Tor por meio do outproxy, e nosso outproxy é bem rápido.
tr: Başlangıç olarak, birden çok barındırma kullanıyoruz. Yani çıkış vekil sunucusu trafiğine hizmet eden birkaç sunucumuz var. bu şekilde, topluluğun her zaman hizmeti kullanabilmesini sağlıyoruz. Sunucularımızdaki tüm günlükler 15 dakikada bir siliniyor. Böylece, hem kolluk kuvvetlerinin hem de bizim herhangi bir veriye erişmemiz engellenmiş olur. Çıkış vekil sunucusu üzerinden Tor onion bağlantılarının açılmasını destekliyoruz ve çıkış vekil sunucumuza oldukça hızlı.

source: How do you define privacy? What are some of the issues you see with overreach and data handling?
pt_br: Como você define privacidade? Quais são alguns dos problemas que você vê com o excesso de e o tratamento de dados?
tr: Kişisel gizliliği nasıl tanımlarsınız? Verilere aşırı erişilmesi ve işlenmesi ile ilgili hangi sorunlarla karşılaşıyorsunuz?

source: Privacy is freedom from unauthorized access. Transparency is important, such as opting in — the example being GDPR requirements.
pt_br: Privacidade é liberdade de acesso não autorizado. Transparência é importante, como optar por — o exemplo são os requisitos do GDPR.
tr: Kişisel gizlilik, verilere izinsiz erişilmesini engelleme özgürlüğüdür. Katılmak kadar şeffaflık da önemlidir. Buna örnek olarak KVKK (GDPR) gereksinimleri verilebilir.

source: There are big companies hoarding data that is being used for `warrantless access to location data. <https://www.eff.org/deeplinks/2022/08/fog-revealed-guided-tour-how-cops-can-browse-your-location-data>`__ There is overreach of tech companies into what people think is, and should be private, like photos or messages.
pt_br: Há grandes empresas acumulando dados que estão sendo usados para `acesso sem mandado aos dados de localização . <https://www.eff.org/deeplinks/2022/08/fog-revealed-guided-tour-how-cops-can-browse-your-location-data>`__ Há um exagero das empresas de tecnologia no que as pessoas pensam que é, e deveria ser privado, como fotos ou mensagens.
tr: Konum verilerini herhangi bir garanti vermeden erişerek istifleyen büyük şirketler var. <https://www.eff.org/deeplinks/2022/08/fog-revealed-guided tour-how-cops-can-browse-your-location-data>`__ Teknoloji şirketleri, fotoğraflar ya da iletiler gibi insanların ne düşündüğü hakkında ve kişisel olması gereken veriler konusunda aşırıya kaçıyor.

source: It is important to keep doing outreach about how to keep your communication safe, and what tools or apps will help a person do so. The way that we interact with all of the information out there is important as well. We need to trust but verify.
pt_br: É importante continuar fazendo divulgação sobre como manter sua comunicação segura e quais ferramentas ou aplicativos ajudarão uma pessoa a fazer isso. A maneira como interagimos com todas as informações disponíveis é importante também. Precisamos confiar, mas verificar.
tr: İletişiminizi nasıl güvende tutacağınız ve bir kişinin bunu yapmasına hangi araçların veya uygulamaların yardımcı olacağı konusunda sosyal yardım sağlamayı sürdürmek önemlidir. Dışarıdaki tüm bilgilerle etkileşim şeklimiz de önemlidir. Güvenmeye ama doğrulamaya gerek duyuyoruz

source: How does I2P fit into StormyCloud’s Mission and Vision Statement?
pt_br: Como o I2P se encaixa na Declaração de Missão e Visão da StormyCloud?
tr: I2P, StormyCloud misyonuna ve vizyonuna nasıl uyuyor?

source: I2P is an open source project, and what it offers aligns with the mission of StormyCloud Inc. I2P provides a layer of privacy and protection for traffic and communication, and the project believes that everybody has a right to privacy.
pt_br: O I2P é um projeto de código aberto e o que ele oferece está alinhado com a missão da StormyCloud Inc. O I2P fornece uma camada de privacidade e proteção para tráfego e comunicação, e o projeto acredita que todos têm direito à privacidade.
tr: I2P, açık kaynaklı bir proje ve sundukları, StormyCloud Inc kuruluşunun misyonuyla uyumlu. I2P, trafik ve iletişim için bir gizlilik ve koruma katmanı sağlar ve herkesin kişisel gizlilik hakkının olduğuna inanır.
