Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Remove connect delay, profile, and I2CP options in i2ptunnel UI
pt_br: Remover opções de atraso de conexão, perfil e I2CP na interface do usuário do i2ptunnel
tr: i2ptunnel kullanıcı arayüzünde bağlantı gecikmesi, profil ve I2CP seçenekleri kaldırıldı

source: How to volunteer by helping I2P-Bote bootstrap
pt_br: Como ser voluntário ajudando o I2P-Bote a se auto-inicializar
tr: I2P-Bote başlangıcını desteklemeye gönüllü olun

source: Help Bootstrap I2P-Bote!
pt_br: Ajude a inicializar o I2P-Bote!
tr: I2P-Bote başlangıcına yardımcı olun!

source: An easy way to help people message eachother privately is to run an I2P-Bote peer which can be used by new bote users to bootstrap their own I2P-Bote peers. Unfortunately, until now, the process of setting up an I2P-Bote bootstrap peer has been much more obscure than it should be. It's actually extremely simple!
pt_br: Uma maneira fácil de ajudar as pessoas a enviar mensagens umas às outras de forma privada é executar um peer I2P-Bote que pode ser usado por novos usuários de bote para inicializar seus próprios peers I2P-Bote . Infelizmente, até agora, o processo de configuração de um peer bootstrap I2P-Bote tem sido muito mais obscuro do que deveria ser. Na verdade, é extremamente simples!
tr: İnsanların birbirlerine özel ileti göndermelerine kolayca yardımcı olmak için, yeni bote kullanıcıları kendi I2P-Bote eşlerini başlatmak için kullanılabilecek bir I2P-Bote eşi işletebilir. Ne yazık ki, şimdiye kadar bir I2P-Bote başlatma eşi kurulum süreci olması gerekenden çok daha belirsizdi. Aslında son derece basit!

source: :: What is I2P-bote? I2P-bote is a private messaging system built on i2p, which has additional features to make it even more difficult to discern information about the messages that are transmitted. Because of this, it can be used to transmit private messages securely while tolerating high latency and not relying on a centralized relay to send messages when the sender goes offline. This is in contrast to almost every other popular private messaging system, which either require both parties to be online or rely on a semi-trusted service which transmits messages on behalf of senders who go offline. or, ELI5: It's used similarly to e-mail, but it suffers from none of e-mail's privacy defects.
pt_br: :: O que é I2P-bote? I2P-bote é um sistema de mensagens privadas construído em i2p, que tem recursos adicionais para tornar ainda mais difícil discernir informações sobre as mensagens que são transmitidas. Por isso, ele pode ser usado para transmitir mensagens privadas com segurança, tolerando alta latência e não dependendo de um retransmissor centralizado para enviar mensagens quando o remetente fica offline. Isso é diferente de quase todos os outros sistemas populares de mensagens privadas, que exigem que ambas as partes estejam online ou dependem de um serviço semiconfiável que transmite mensagens em nome dos remetentes que ficam offline. ou ELI5: É usado de forma semelhante ao e-mail, mas não sofre de nenhum dos defeitos de privacidade do e-mail.
tr: :: I2P-bote nedir? I2P-bote aktarılan iletilerle ilgili bilgileri ayırt etmeyi daha da zorlaştıran özelliklerine sahip I2P üzerine kurulu bir özel ileti gönderme sistemidir. Bu nedenle, gönderici çevrimdışı olduğunda ileti göndermek için merkezi bir aktarıcıya güvenmeden ve yüksek bir gecikme ile özel iletileri güvenli bir şekilde göndermek için kullanılabilir. Bu her iki tarafın da çevrimiçi olmasını gerektiren veya çevrimdışı göndericiler adına iletileri aktaran yarı güvenilir bir hizmet kullanan hemen hemen tüm diğer ileti gönderme sistemlerinden farklıdır. Ya da, ELI5: E-postaya benzer şekilde kullanılır. Ancak e-postanın gizlilik kusurlarından etkilenmez.

source: Step One: Install I2P-Bote
pt_br: Etapa um: instalar o I2P-Bote
tr: Birinci adım: I2P-Bote kurun

source: I2P-Bote is an i2p plugin, and installing it is very easy. The original instructions are available at the `bote eepSite, bote.i2p <http://bote.i2p/install/>`__, but if you want to read them on the clearnet, these instructions come courtesy of bote.i2p:
pt_br: I2P-Bote é um plugin i2p, e instalá-lo é muito fácil. As instruções originais estão disponíveis no `bote eepSite, bote.i2p <http://bote.i2p/install/>`__, mas se você quiser lê-las no clearnet, essas instruções são cortesia do bote.i2p:
tr: I2P-Bote bir i2p uygulama ekidir ve kurulumu çok kolaydır. Özgün yönergeler `bote eepSite, bote.i2p <http://bote.i2p/install/>`__ bulunabilir. Ancak bunları herkese açık İnternet üzerinden okumak isterseniz, bu yönergeler bote.i2p izniyle gelir:

source: 1. Go to the plugin install form in your routerconsole: http://127.0.0.1:7657/configclients#plugin 2. Paste in the URL http://bote.i2p/i2pbote.su3 3. Click Install Plugin. 4. Once installed, click SecureMail in the routerconsole sidebar or homepage, or go to http://127.0.0.1:7657/i2pbote/
pt_br: 1. Vá para o formulário de instalação do plugin no seu routerconsole: http://127.0.0.1:7657/configclients#plugin 2. Cole a URL http://bote.i2p/i2pbote.su3 3. Clique em Instalar plugin. 4. Depois de instalado, clique em SecureMail na barra lateral do routerconsole ou na página inicial ou vá para http://127.0.0.1:7657/i2pbote/
tr: 1. Yöneltici panonuzdaki uygulama eki kurma formuna gidin: http://127.0.0.1:7657/configclients#plugin 2. http://bote.i2p/i2pbote.su3 adresini yapıştırın 3. Uygulama ekini kur üzerine tıklayın. 4. Kurulumdan sonra, yöneltici panosu yan çubuğunda SecureMail üzerine tıklayın ya da açılışa ya da http://127.0.0.1:7657/i2pbote/ adresine gidin.

source: Step Two: Get your I2P-Bote node's base64 address
pt_br: Etapa dois: obtenha o endereço base64 do seu nó I2P-Bote
tr: İkinci adım: I2P-Bote düğümünüzün base64 adresini alın

source: This is the part where a person might get stuck, but fear not. While a little hard to find instructions, this is actually easy and there are several tools and options available to you, depending on what your circumstances are. For people who want to help run bootstrap nodes as volunteers, the best way is to retrieve the required information from the private key file used by the bote tunnel.
pt_br: Esta é a parte em que uma pessoa pode ficar presa, mas não tema. Embora seja um pouco difícil encontrar instruções, isso é realmente fácil e há várias ferramentas e opções disponíveis para você, dependendo de quais são suas circunstâncias. Para pessoas que querem ajudar a executar nós bootstrap como voluntários, a melhor maneira é recuperar as informações necessárias do arquivo de chave privada usado pelo túnel bote.
tr: Bu, bir kişinin sıkışıp kalabileceği, ancak korkmadığı bölümdür. Yönergeleri bulmak biraz zor olsa da, aslında kolaydır ve durumunuza bağlı olarak kullanabileceğiniz çeşitli araçlar ve seçenekler var. Başlatma düğümlerini gönüllü olarak çalıştırmaya yardımcı olmak isteyenler için en iyi yol, gerekli bilgileri bote tüneli tarafından kullanılan özel anahtar dosyasından almaktır.

source: Where are the keys?
pt_br: Onde estão as chaves?
tr: Anahtarlar nerede?

source: I2P-Bote stores it's destination keys in a text file which, on Debian, is located at */var/lib/i2p/i2p-config/i2pbote/local_dest.key*. In non-Debian systems where i2p is installed by the user, the key will be in *$HOME/.i2p/i2pbote/local_dest.key*, and on Windows, the file will be in *C:\\ProgramData\\i2p\\i2pbote\\local_dest.key*.
pt_br: O I2P-Bote armazena suas chaves de destino em um arquivo de texto que, no Debian, está localizado em */var/lib/i2p/i2p-config/i2pbote/local_dest.key*. Em sistemas não Debian onde o i2p é instalado pelo usuário, a chave estará em *$HOME/.i2p/i2pbote/local_dest.key*, e no Windows, o arquivo estará em *C:\\ProgramData\\i2p\\i2pbote\\local_dest.key*.
tr: I2P-Bote, hedef anahtarlarını Debian üzerinde */var/lib/i2p/i2p-config/i2pbote/local_dest.key* konumunda bulunan bir metin dosyasında tutar. i2p uygulamasının kullanıcı tarafından kurulduğu Debian olmayan sistemlerde, anahtar *$HOME/.i2p/i2pbote/local_dest.key* ve Windows üzerinde *C:\\ProgramData\\i2p\\i2pbote\\local_dest.key* konumunda bulunur.

source: Method A: Convert the plain-text key to the base64 destination
pt_br: Método A: converter a chave de texto simples para o destino base64
tr: Yöntem A: Düz metin anahtarını base64 hedefine dönüştürün

source: In order to convert a plain-text key into a base64 destination, one needs to take the key and separate only the destination part from it. In order to do this properly, one must take the following steps:
pt_br: Para converter uma chave de texto simples em um destino base64, é preciso pegar a chave e separar apenas a parte de destino dela. Para fazer isso corretamente, é preciso seguir os seguintes passos:
tr: Bir düz metin anahtarını base64 hedefine dönüştürmek için, anahtarın alınması ve yalnızca hedef parçasının ayrılması gerekir. Bunu doğru bir şekilde yapmak için aşağıdaki işlemleri yapmanız gerekir:

source: 1. First, take the full destination and decode it from i2p's base64 character set into binary. 2. Second, take bytes 386 and 387 and convert them to a single Big-Endian integer. 3. Add the number you computed from the two bytes in step two to 387. This is the length of the base64 destination. 4. Take that nummber of bytes from the front of the full destination to get the destination as a range of bytes. 5. Convert back to a base64 representation using i2p's base64 character set.
pt_br: 1. Primeiro, pegue o destino completo e decodifique-o do conjunto de caracteres base64 do i2p para binário. 2. Segundo, pegue os bytes 386 e 387 e converta-os em um único inteiro Big-Endian. 3. Adicione o número que você calculou dos dois bytes na etapa dois a 387. Isso é o comprimento do destino base64. 4. Pegue esse número de bytes da frente do destino completo para obter o destino como um intervalo de bytes. 5. Converta de volta para uma representação base64 usando o conjunto de caracteres base64 do i2p.
tr: 1. Önce, tam hedefi alın ve onu i2p base64 karakter kümesinden binary olarak çözün. 2. İkinci olarak, 386 ve 387. baytları alın ve bunları tek bir Big-Endian tamsayısına dönüştürün. 3. İkinci adımdaki iki bayttan hesapladığınız sayıyı 387. bayta ekleyin. Bu, base64 hedefinin uzunluğudur. 4. Hedefi bir bayt aralığı olarak almak için tam hedefin önünden bu sayıda baytı alın. 5. i2p base64 karakter kümesini kullanarak tekrar base64 görünümüne dönüştürün.

source: A number of applications and scripts exist to perform these steps for you. Here are some of them, but this is far from exhaustive:
pt_br: Existem vários aplicativos e scripts para executar essas etapas para você. Aqui estão alguns deles, mas isso está longe de ser exaustivo:
tr: Bu adımları sizin için gerçekleştirecek bazı uygulama ve komut dosyaları var. İşte bunlardan bazıları, ancak fazla ayrıntılı değil:

source: - `the i2p.scripts collection of scripts(Mostly java and bash) <https://github.com/i2p/i2p.scripts>`__ - `my application for converting keys(Go) <https://github.com/eyedeekay/keyto>`__
pt_br: - `a coleção de scripts i2p.scripts (principalmente java e bash) <https://github.com/i2p/i2p.scripts>`__ - `meu aplicativo para converter chaves (Go) <https://github.com/eyedeekay/keyto>`__
tr: - `i2p.scripts komut dosyası koleksiyonu (Çoğunlukla Java ve bash) <https://github.com/i2p/i2p.scripts>`__ - `Anahtar dönüştürme uygulamam (Go) <https://github.com/eyedeekay/keyto>`__

source: These capabilities are also available in a number of I2P application development libraries.
pt_br: Esses recursos também estão disponíveis em diversas bibliotecas de desenvolvimento de aplicativos I2P .
tr: Bu yetenekler ayrıca bazı I2P uygulama geliştirme kitaplıklarında da bulunur.

source: Shortcut:
pt_br: Atalho:
tr: Kısayol

source: Since the local destination of your bote node is a DSA destination, then it's quicker to just truncate the local_dest.key file to the first 516 bytes. To do that easily, run this command when running I2P-Bote with I2P on Debian:
pt_br: Como o destino local do seu nó bote é um destino DSA, então é mais rápido apenas truncar o arquivo local_dest.key para os primeiros 516 bytes. Para fazer isso facilmente, execute este comando ao executar o I2P-Bote com I2P no Debian:
tr: Bot düğümünüzün yerel hedefi bir DSA hedefi olduğundan, local_dest.key dosyasının ilk 516 baytını almak daha hızlıdır. Bunu kolayca yapmak için, I2P-Bote uygulamasını I2P Debian üzerinde çalıştırırken şu komutu yürütün:

source: :: sudo -u i2psvc head -c 516 /var/lib/i2p/i2p-config/i2pbote/local_dest.key
pt_br: :: sudo -u i2psvc cabeça -c 516 /var/lib/i2p/i2p-config/i2pbote/local_dest.key

source: Or, if I2P is installed as your user:
pt_br: Ou, se o I2P estiver instalado como seu usuário:
tr: Ya da, I2P kullanıcınız için kurulmuş ise:

source: :: head -c 516 ~/.i2p/i2pbote/local_dest.key
pt_br: :: cabeça -c 516 ~/.i2p/i2pbote/local_dest.key

source: Methon B: Do a lookup
pt_br: Método B: Faça uma pesquisa
tr: Yöntem B: Bir arama yapın

source: If that seems like a bit too much work, it's possible for you to look up the base64 destination of your Bote connection by querying it's base32 address using any of the available means for looking up a base32 address. The base32 address of your Bote node is available on the "Connection" page under the bote plugin application, at `127.0.0.1:7657/i2pbote/network <http://127.0.0.1:7657/i2pbote/network>`__
pt_br: Se isso parece muito trabalhoso, é possível que você procure o destino base64 da sua conexão Bote consultando seu endereço base32 usando qualquer um dos meios disponíveis para procurar um endereço base32 . O endereço base32 do seu nó Bote está disponível na página "Conexão" no aplicativo do plugin bote, em `127.0.0.1:7657/i2pbote/network <http://127.0.0.1:7657/i2pbote/network>`__
tr: Bunlar fazla geldiyse, bir base32 adresini aramak için, var olan yöntemlerden birini kullanarak, base32 adresini sorgulanarak Bote bağlantınızın base64 hedefini arayabilirsiniz. Bote düğümünüzün base32 adresi, bote uygulama eki uygulamasının altındaki "Bağlantı" sayfasında, `127.0.0.1:7657/i2pbote/network <http://127.0.0.1:7657/i2pbote/network>`__ adresinde bulunabilir.

source: Step Three: Contact Us!
pt_br: Terceiro passo: Entre em contato conosco!
tr: Üçüncü adım: Bize ulaşın!

source: .. _update-the-built-in-peerstxt-file-with-your-new-node:
pt_br: .. _update-o-built-in-peerstxt-file-with-your-new-node:
tr: .. _built--in-peerstxt-dosyasini-yeni-dugumunuz-ile-guncelleyin:

source: Update the built-in-peers.txt file with your new node
pt_br: Atualize o arquivo .txt pares internos com seu novo nó
tr: built-in-peers.txt dosyasını yeni düğümünüz ile güncelleyin

source: Now that you've got the correct destination for your I2P-Bote node, the final step is to add yourself to the default peers list for `I2P-Bote here <https://github.com/i2p/i2p.i2p-bote/tree/master/core/src/main/resources/i2p/bote/network>`__ here. You can do this by forking the repository, adding yourself to the list with your name commented out, and your 516-char destination directly below it, like this:
pt_br: Agora que você tem o destino correto para seu nó I2P-Bote, o passo final é adicionar você mesmo à lista de pares padrão para `I2P-Bote aqui <https://github.com/i2p/i2p.i2p-bote/tree/master/core/src/main/resources/i2p/bote/network>`__ aqui. Você pode fazer isso bifurcando o repositório, adicionando você mesmo à lista com seu nome comentado, e seu destino de 516 caracteres diretamente abaixo dele, assim:
tr: Artık I2P-Bote düğümünüz için doğru hedefe sahip olduğunuza göre, son adım kendinizi `I2P-Bote burada <https://github.com/i2p/i2p.i2p bote/ tree/master/core/src/main/resources/i2p/bote/network>`__ için varsayılan eşler listesine eklemektir. Bunun için, depoyu dallandırın, adınız yoruma yazarak listeye kendinizi ekleyin ve bunun hemen altında 516 karakterlik hedefinizi aşağıdaki gibi alın:

source: :: # idk QuabT3H5ljZyd-PXCQjvDzdfCec-2yv8E9i6N71I5WHAtSEZgazQMReYNhPWakqOEj8BbpRvnarpHqbQjoT6yJ5UObKv2hA2M4XrroJmydPV9CLJUCqgCqFfpG-bkSo0gEhB-GRCUaugcAgHxddmxmAsJVRj3UeABLPHLYiakVz3CG2iBMHLJpnC6H3g8TJivtqabPYOxmZGCI-P~R-s4vwN2st1lJyKDl~u7OG6M6Y~gNbIzIYeQyNggvnANL3t6cUqS4v0Vb~t~CCtXgfhuK5SK65Rtkt2Aid3s7mrR2hDxK3SIxmAsHpnQ6MA~z0Nus-VVcNYcbHUBNpOcTeKlncXsuFj8vZL3ssnepmr2DCB25091t9B6r5~681xGEeqeIwuMHDeyoXIP0mhEcy3aEB1jcchLBRLMs6NtFKPlioxz0~Vs13VaNNP~78bTjFje5ya20ahWlO0Md~x5P5lWLIKDgaqwNdIrijtZAcILn1h18tmABYauYZQtYGyLTOXAAAA
pt_br: :: # não sei QuabT3H5ljZyd-PXCQjvDzdfCec-2yv8E9i6N71I5WHAtSEZgazQMReYNhPWakqOEj8BbpRvnarpHqbQjoT6yJ5UObKv2hA2M4XrroJmydPV9CLJUCqgCqFfpG-bkSo0gEhB-GRCUaugcAgHxddmxmAsJVRj3UeABLPHLYiakVz3CG2iBMHLJpnC6H3g8TJivtqabPYOxmZGCI-P~R-s4vwN2st1lJyKDl~u7OG6M6Y~gNbIzIYeQyNggvnANL3t6c UqS4v0Vb~t~CCtXgfhuK5SK65Rtkt2Aid3s7mrR2hDxK3SIxmAsHpnQ6MA~z0Nus-VVcNYcbHUBNpOcTeKlncXsuFj8vZL3ssnepmr2DCB25091t9B6r5~681xGEeqeIwuMHDeyoXIP0mhEcy3aEB1jcchLBRLMs6NtFKPlioxz0~Vs13VaNNP~78bTjFje5ya20ahWlO0Md~x5P5lWLIKDgaqwNdIrijtZAcILn1h18tmABYauYZQtYGyLTOXAAAA

source: and submitting a pull request. That's all there is to it so help keep i2p alive, decentralized, and reliable.
pt_br: e enviar uma solicitação de pull. É só isso, então ajude a manter o i2p vivo, descentralizado e confiável.
tr: bir pull isteği gönderin. Hepsi bu kadar, i2p ağının canlı, merkezi olmayan ve güvenilir kalmasına yardımcı olacaksınız.

source: Basic i2ptunnel Setup
pt_br: Configuração básica do i2ptunnel
tr: Temel i2ptunnel kurulumu

source: Basic I2P Tunnels Tutorial with Pictures
pt_br: Tutorial básico de túneis I2P com imagens
tr: Görsellerle temel I2P tünelleri eğitimi

source: Although the Java I2P router comes pre-configured with a static web server, jetty, to provide the user's first eepSite, many require more sophisticated functionality from their web server and would rather create an eepSite with a different server. This is of course possible, and actually is really easy once you've done it one time.
pt_br: Embora o roteador Java I2P venha pré-configurado com um servidor web estático, jetty, para fornecer o primeiro eepSite do usuário, muitos exigem funcionalidades mais sofisticadas de seu servidor web e preferem criar um eepSite com um servidor diferente. Isso é possível, é claro, e na verdade é muito fácil depois que você tiver feito isso uma vez.
tr: Java I2P yöneltici, kullanıcının ilk eepSitesini sunması için durağan bir site sunucusu olan Jetty ile önceden yapılandırılmış olarak gelse de, birçok kişi daha karmaşık işlevleri olan bir site sunucusuna gerek duyar ve farklı bir sunucuyla bir eepSite oluşturmayı yeğler. Tabi ki bu yapılabilir ve bir kez yaptıktan sonra gerçekten çok kolaydır.

source: Although it is easy to do, there are a few things you should consider before doing it. You will want to remove identifying characteristics from your web server, like potentially identifying headers and default error pages that report the server/distro type. More information about threats to anonymity posed by improperly configured applications see: `Riseup here: <https://riseup.net/en/security/network-security/tor/onionservices-best-practices>`__, `Whonix Here: <https://www.whonix.org/wiki/Onion_Services>`__, `This blog article for some opsec fails: <https://blog.0day.rocks/securing-a-web-hidden-service-89d935ba1c1d>`__, `and the I2P applications page here <https://geti2p.net/en/docs/applications/supported>`__. Although much of this information is expressed for Tor Onion Services, the same procedures and principles apply to hosting applications over I2P.
pt_br: Embora seja fácil de fazer, há algumas coisas que você deve considerar antes de fazê-lo. Você vai querer remover características de identificação do seu servidor web , como cabeçalhos de identificação em potencial e páginas de erro padrão que relatam o tipo de servidor/distro. Mais informações sobre ameaças ao anonimato representadas por aplicativos configurados incorretamente, veja: `Riseup aqui: <https://riseup.net/en/security/network-security/tor/onionservices-best-practices>`__, `Whonix aqui: <https://www.whonix.org/wiki/Onion_Services>`__, `Este artigo do blog para algumas falhas de opsec: <https://blog.0day.rocks/securing-a-web-hidden-service-89d935ba1c1d>`__, `e a página de aplicativos I2P aqui <https://geti2p.net/en/docs/applications/supported>`__. Embora muitas dessas informações sejam expressas para os Serviços Tor Onion, os mesmos procedimentos e princípios se aplicam à hospedagem de aplicativos por I2P.
tr: Yapması kolay olsa da, yapmadan önce göz önünde bulundurmanız gereken birkaç şey var. Potansiyel olarak tanımlayıcı üst bilgiler ve sunucu/dağıtım türünü bildiren varsayılan hata sayfaları gibi tanımlayıcı özellikleri site sunucunuzdan kaldırmak istersiniz. Yanlış yapılandırılmış uygulamaların oluşturduğu anonimliğe yönelik tehditler hakkında ayrıntılı bilgi almak için `Riseup sitesine: <https://riseup.net/en/security/network-security/tor/onionservices-best-practices>`__, `Whonix sitesine: <https://www.whonix.org/wiki/Onion_Services>`__, `bazı opsec sorunları için blog makalesine: <https://blog.0day.rocks/securing-a-web-hidden-service-89d935ba1c1d>`__ . `ve I2P uygulamaları sayfasına <https://geti2p.net/en/docs/applications/supported>`__ bakabilirsiniz. Bu bilgilerin çoğu Tor Onion hizmetleri için verilse de, uygulamaları I2P üzerinde barındırmak için de aynı prosedür ve ilkeler geçerlidir.

source: Step One: Open the Tunnel Wizard
pt_br: Etapa um: abra o assistente de túnel
tr: Birinci adım: Tünel yardımcısını açın

source: Go to the I2P web interface at 127.0.0.1:7657 and open the `Hidden Services Manager <http://127.0.0.1:7657/i2ptunnelmgr>`__\ (links to localhost). Click the button that says "Tunnel Wizard" to begin.
pt_br: Vá para a interface web do I2P em 127.0.0.1:7657 e abra o `Hidden Services Manager <http://127.0.0.1:7657/i2ptunnelmgr>`__\ (links para localhost). Clique no botão que diz "Tunnel Wizard" para começar.
tr: 127.0.0.1:7657 adresindeki I2P internet arayüzüne gidin ve `Gizli hizmetler yönetimi <http://127.0.0.1:7657/i2ptunnelmgr>`__\ (localhost sunucusuna bağlanır) açın. Başlamak için "Tünel yardımcısı" düğmesine tıklayın.

source: Step Two: Select a Server Tunnel
pt_br: Etapa dois: selecione um túnel de servidor
tr: İkinci adım: Bir sunucu tüneli seçin

source: The tunnel wizard is very simple. Since we're setting up an http *server*, all we need to do is select a *server* tunnel.
pt_br: O assistente de túnel é muito simples. Como estamos configurando um *servidor* http, tudo o que precisamos fazer é selecionar um túnel *servidor*.
tr: Tünel yardımcısı çok basittir. Bir http *sunucu* kurduğumuz için tek yapmamız gereken bir *sunucu* tüneli seçmektir.

source: Step Three: Select an HTTP Tunnel
pt_br: Etapa três: selecione um túnel HTTP
tr: Üçüncü adım: Bir HTTP tüneli seçin
