Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: I also had the good fortune to spend time with Mhatta, who is an I2P contributor, and to make connections for future funding. A huge thank you to the community builders I met in Tunis who I met again and who are offering so much support to the project. This has been an exciting year so far, and I2P has so much work to do. Please consider donating your time or funding the project as it needs to scale quickly to new challenges.
pt_br: Também tive a sorte de passar um tempo com Mhatta, que é um colaborador do I2P , e fazer conexões para financiamento futuro. Um grande obrigado a os construtores de comunidade que conheci em Túnis, que reencontrei e que estão oferecendo tanto apoio ao projeto. Este tem sido um ano emocionante até agora, e o I2P tem muito trabalho a fazer. Por favor, considere doar seu tempo ou financiar o projeto , pois ele precisa escalar rapidamente para novos desafios.
tr: Ayrıca I2P projesine katkıda bulunan Mhatta ile zaman geçirme ve gelecekteki fonlar için bağlantılar kurma şansına da sahip oldum. Tunus'ta tanıştığım, ve yeniden karşılaştığım ve projeye büyük destek sunan topluluk kurucularına çok teşekkür ederim. Bu şimdiye kadar heyecan verici bir yıl oldu ve I2P projesinin yapacak çok işi var. Yeni zorluklara uyacak hızla ölçeklenmesi gerektiğinden, lütfen zamanınızı bağışlamayı veya projeyi finanse etmeyi düşünün.

source: If you have an opportunity to, you can read the full report Measuring I2P Censorship at a Global Scale here https://www.usenix.org/conference/foci19/presentation/hoang
pt_br: Se tiver oportunidade, você pode ler o relatório completo Medindo I2P Censura em Escala Global aqui https://www.usenix.org/conference/foci19/presentation/hoang
tr: Olanağınız varsa, küresel ölçekte I2P sansürünün ölçülmesi raporunun tamamını şuradan okuyabilirsiniz: https://www.usenix.org/conference/foci19/presentation/hoang

source: Another great workshop in the measurements workshop was On the Importance of Encrypted-SNI (ESNI) to Censorship Circumvention https://www.usenix.org/conference/foci19/presentation/chai
pt_br: Outro ótimo workshop no workshop de medições foi Sobre a importância do Encrypted-SNI (ESNI) para contornar a censura https://www.usenix.org/conference/foci19/presentation/chai
tr: Ölçümler çalıştayındaki bir diğer harika toplantı ise Sansürden kaçınmak için şifrelenmiş SNI (ESNI) önemi üzerineydi: https://www.usenix.org/conference/foci19/presentation/chai

source: There are so many great workshops that I attended - anyone who would like too can access the program and related materials here: https://www.usenix.org/conference/foci19/workshop-program
pt_br: Há tantos workshops excelentes dos quais participei - qualquer pessoa que queira pode acessar o programa e materiais relacionados aqui: https://www.usenix.org/conference/foci19/workshop-program
tr: Pek çok harika atölyeye katıldım - İsteyen herkes programa ve ilgili materyallere şuradan erişebilir: https://www.usenix.org/conference/foci19/workshop-program

source: I will be attending Our Networks in Toronto next month https://ournetworks.ca/ - and so should you! The program can be viewed here https://ournetworks.ca/program/
pt_br: Eu estarei participando do Our Networks em Toronto no mês que vem https://ournetworks.ca/ - e você também deveria! O programa pode ser visto aqui https://ournetworks.ca/program/
tr: Önümüzdeki ay Toronto'daki Our Networks etkinliğine katılacağım https://ournetworks.ca/ - Siz de gelmelisiniz! Programı şuradan görebilirsiniz: https://ournetworks.ca/program/

source: Internet Freedom Festival Trip Report
pt_br: Relatório de viagem do Festival da Liberdade da Internet
tr: Internet Freedom Festival gezi notları

source: This was my first time attending IFF, and what a great experience for I2P this was! I met with human rights defenders, people who work on censorship metrics, and of course UX and security professionals.
pt_br: Esta foi minha primeira vez participando do IFF, e que ótima experiência para o I2P foi este ! Eu me encontrei com defensores dos direitos humanos, pessoas que trabalham com métricas de censura, e, claro, profissionais de UX e segurança.
tr: IFF etkinliğine ilk kez katıldım ve bu I2P için ne harika bir deneyimdi! İnsan hakları savunucularıyla, sansür ölçümleri üzerinde çalışan insanlarla ve tabii ki kullanıcı deneyimi ve güvenlik uzmanlarıyla tanıştım.

source: My goal was to connect with people to further support I2P’s UX overhaul, keeping in mind security and UX considerations for frontline workers. As it was pointed out to me, people see I2P as a very important and powerful resource to circumvent censorship and support safe communication, however the interface suffers from some usability concerns. People were happy with our initial steps to make first time users have a better experience, such as our set up wizard and bandwidth detection tool. I also received positive reviews on our changes to the website and /home icons. It was very encouraging to hear directly from the community that small changes we have made are in the right direction.
pt_br: Meu objetivo era conectar-me com as pessoas para dar mais suporte à reformulação da UX do I2P, tendo em mente considerações de segurança e UX para trabalhadores da linha de frente. Como foi apontado para mim, as pessoas veem o I2P como um recurso muito importante e poderoso para contornar a censura e dar suporte à comunicação segura, no entanto, a interface sofre de alguns problemas de usabilidade. As pessoas ficaram felizes com nossos passos iniciais para fazer com que os usuários iniciantes tenham uma experiência melhor, como nosso assistente de configuração e ferramenta de detecção de largura de banda. Também recebi avaliações positivas sobre nossas mudanças no site e nos ícones /home. Foi muito encorajador ouvir diretamente da comunidade que pequenas mudanças que fizemos estão na direção certa.
tr: Amacım, I2P kullanıcı deneyimi değişikliklerini daha fazla desteklemek için insanlarla bağlantı kurmak, ön saflardaki çalışanlar için güvenlik ve kullanıcı deneyimi konularını göz önünde bulundurmaktı. Bana belirtildiği gibi, insanlar I2P ağını sansürü aşmak ve güvenli iletişimi desteklemek için çok önemli ve güçlü bir kaynak olarak görüyor. Ancak arayüz bazı kullanılabilirlik endişelerinden muzdarip. İnsanlar, kurulum yardımcımız ve bant genişliği algılama aracımız gibi, yeni başlayan kullanıcılara daha iyi bir deneyim sağlamak için attığımız ilk adımlardan memnun kaldılar. Ayrıca sitede ve /home simgelerinde yaptığımız değişiklikler hakkında da olumlu eleştiriler aldım. Yaptığımız küçük değişikliklerin doğru yönde olduğunu doğrudan topluluktan duymak çok cesaret vericiydi.

source: Things like having configuration happen out of the box and not having to put people in the position where they need to rely on reading so much documentation or chasing documentation were discussed. Also, improved documentation for setting up outproxies and and site mirroring were requested and suggested. Please see Mikal’s very good instructions on setting up an I2P outproxy that came out of the suggestions this week — https://0xcc.re/howto-setup-an-i2p-outproxy/. Another suggestion was to make bug reporting easier.
pt_br: Coisas como ter a configuração pronta para uso e não ter que colocar pessoas na posição em que elas precisam confiar na leitura de tanta documentação ou perseguir documentação foram discutidas. Além disso, documentação aprimorada para configuração de outproxies e espelhamento de site foi solicitada e sugerida. Veja as instruções muito boas de Mikal sobre como configurar um outproxy I2P que saíram das sugestões desta semana — https://0xcc.re/howto-setup-an-i2p-outproxy/. Outra sugestão foi tornar o relato de bugs mais fácil.
tr: Yapılandırmanın kutudan çıktığı gibi olması, insanları çok fazla belge okumak veya belge peşinde koşmak zorunda bırakmamak gibi şeyler tartışıldı. Ayrıca, çıkış vekil sunucuları ve site yansı kurulumu için ayrıntılı belgeler istendi ve önerildi. Mikal bu haftaki önerilerden yola çıkarak bir I2P çıkış vekil sunucusu kurmak üzerine çok iyi yönergeler yazdı - https://0xcc.re/howto-setup-an-i2p-outproxy/. Başka bir öneri, hata bildirimini kolaylaştırmaktı.

source: To this point, I truly hope that the project will secure resources to continue the improvements to its usability that it requires to meet the growing demand for I2P services. It is humbling to to be working with such talented people and to be able to work together with our community during a time when people all over the globe need all of the privacy protecting resources we as people who develop, design and educate can offer.
pt_br: Até este ponto, espero sinceramente que o projeto garanta recursos para continuar as melhorias em sua usabilidade que ele requer para atender à crescente demanda por serviços I2P. É uma honra trabalhar com pessoas tão talentosas e poder trabalhar junto com nossa comunidade durante um momento em que pessoas em todo o mundo precisam de todos os recursos de proteção de privacidade que nós, como pessoas que desenvolvemos, projetamos e educamos, podemos oferecer.
tr: Bu noktaya kadar, projenin, artan I2P hizmetleri talebini karşılamak amacıyla gerek duyduğu kullanılabilirlik iyileştirmelerini sürdürmek için kaynakları güvence altına alacağını gerçekten umuyorum. Bu kadar yetenekli insanlarla çalışmak ve dünyanın her yerindeki insanların biz gelişen, tasarlayan ve eğiten insanlar olarak sunabileceğimiz tüm kişisel gizliliği koruyan kaynaklara gerek duyduğu bir dönemde topluluğumuzla birlikte çalışabilmek alçak gönüllü bir davranış.

source: RightsCon Trip Report
pt_br: Relatório de viagem da RightsCon
tr: RightsCon gezi notları

source: The messages from activists in Syria during the Access No\_! session on the first day were deeply moving and really drove home why I work in digital rights. We listened to the experiences of activists who are unable to travel due to lack of status, documentation and active conflict. For these people “the internet is the only passport (they) carry.” Human rights defenders spoke of the importance of digital training to keep people protected when they are communicating with family inside of the country, as well as with family and friends who have left. They had created digital clinics to show people how to use services securely, for instance, how to use features like Signal’s disappearing messages so that those messages could not be used against them when devices are searched at security check points. Continuing to pursue education was also very important, the internet being relied on to access resources.
pt_br: As mensagens de ativistas na Síria durante a sessão Access No\_! no primeiro dia foram profundamente comoventes e realmente me fizeram entender por que trabalho com direitos digitais . Ouvimos as experiências de ativistas que não conseguem viajar devido à falta de status, documentação e conflito ativo. Para essas pessoas “a internet é o único passaporte (que elas) carregam”. Defensores dos direitos humanos falaram sobre a importância do treinamento digital para manter as pessoas protegidas quando elas estão se comunicando com a família dentro do país, bem como com a família e amigos que partiram. Eles criaram clínicas digitais para mostrar às pessoas como usar serviços com segurança, por exemplo, como usar recursos como as mensagens que desaparecem do Signal para que essas mensagens não pudessem ser usadas contra elas quando os dispositivos fossem revistados em pontos de verificação de segurança. Continuar a buscar educação também era muito importante, a internet sendo usada para acessar recursos.
tr: İlk günkü Access No\_! oturumunda Suriye'deki aktivistlerden gelen iletiler derinden etkisiyle neden dijital haklar alanında çalıştığımı bana bir kez daha hatırlattı. İçinde bulundukları durum, belge eksikliği ve sürmekte olan çatışmalar nedeniyle seyahat edemeyen aktivistlerin deneyimlerini dinledik. Bu insanlar için "İnternet (onların) taşıdığı tek pasaporttur." İnsan hakları savunucuları, ülke içindeki aileleriyle ve aynı zamanda ülkeyi terk eden aileleri ve arkadaşlarıyla iletişim kurarken insanları korumak için dijital eğitimin öneminden bahsetti. İnsanlara hizmetleri güvenli bir şekilde nasıl kullanacaklarını, örneğin Signal üzerindeki kaybolan iletiler gibi özelliklerin nasıl kullanılacağını göstermek için dijital klinikler oluşturdular. Böylece güvenlik kontrol noktalarında aygıtlar arandığında bu iletilerin kendilerine karşı kullanılmaması sağlandı. Eğitimi sürdürmek de çok önemliydi, kaynaklara erişmek için İnternet ortamına güvenildi.

source: The following days we met with people who had both questions about I2P and suggestions for potential use cases. We also discussed overhauling the project documentation for threat models, improving guides for users with little technical background, and ensuring that these guides are easily translatable. I made a note that I should go through the proposals and connect then to human use cases and solutions. This will be part of the projects’ continued effort to improve its user guides and onboarding.
pt_br: Nos dias seguintes, encontramos pessoas que tinham tanto perguntas sobre o I2P quanto sugestões para potenciais casos de uso. Também discutimos a reformulação da documentação do projeto para modelos de ameaças, melhorando os guias para usuários com pouco conhecimento técnico e garantindo que esses guias sejam facilmente traduzíveis. Fiz uma anotação de que eu deveria analisar as propostas e conectá-las a casos de uso e soluções humanas. Isso fará parte do esforço contínuo do projeto para melhorar seus guias de usuário e de integração.
tr: Sonraki günlerde hem I2P hakkında soruları hem de potansiyel kullanım durumları için önerileri olan insanlarla tanıştık. Ayrıca, tehdit modelleri için proje belgelerini elden geçirmeyi, teknik bilgisi az olan kullanıcılar için rehberleri iyileştirmeyi ve bu rehberlerin kolayca başka dillere çevrilebilir olmasını sağlamayı tartıştık. Önerileri gözden geçirmem ve daha sonra insan kullanımı durumlarına ve çözümlerine bağlamam gerektiğini fark ettim. Bu yaklaşım, projelerin kullanıcı rehberlerini ve katılımını iyileştirmeye yönelik olarak sürdürdüğüm çabalarının bir parçası olacak.

source: The opportunity to meet face to face with people who are using I2P and have successfully used it to circumvent internet blockages was inspiring. As the project has began working on its own browser and is examining outproxy packaging, it needs as much feedback and testing as possible to create secure and frictionless experiences for people. Also, the I2P network needs more hosted content and mirrored sites in order to expand resources for its users.
pt_br: A oportunidade de conhecer pessoalmente pessoas que estão usando o I2P e que o usaram com sucesso para contornar bloqueios de internet foi inspiradora. Como o projeto começou a trabalhar em seu próprio navegador e está examinando o empacotamento outproxy , ele precisa de tanto feedback e testes quanto possível para criar experiências seguras e sem atrito para as pessoas. Além disso, a rede I2P precisa de mais conteúdo hospedado e sites espelhados para expandir recursos para seus usuários.
tr: I2P kullanan ve İnternet üzerindeki engelleri aşmak için bunu başarıyla kullanmış kişilerle yüz yüze görüşme fırsatı ilham vericiydi. Proje kendi tarayıcısı üzerinde çalışmaya başladığı ve çıkış vekil sunucusu paketlemesini incelediği için, insanlara güvenli ve sorunsuz deneyim sunmak için olabildiğince çok geri bildirim ve deneme yapılması gerekiyor. Ayrıca, I2P ağı, kullanıcılara sunuculacak kaynakları artırmak için daha fazla barındırılan içeriğe ve yansı sitelerine gerek duyuyor.

source: Our Networks Trip Report- idk
pt_br: Nosso Relatório de Viagem de Redes - não sei
tr: Our Networks gezi notları - idk

source: Our Networks Trip Report
pt_br: Nosso Relatório de Viagem de Redes
tr: Our Networks gezi notları

source: The weekend of September 20th I traveled to Toronto to meet with Sadie to take part in the Our Networks conference. The Our Networks conference encompasses a wide variety of topic including many peer-to-peer technologies with an eye toward their potential to make the world a better place.
pt_br: No fim de semana de 20 de setembro, viajei para Toronto para me encontrar com Sadie para participar da conferência Our Networks. A conferência Our Networks abrange uma ampla variedade de tópicos, incluindo muitas tecnologias peer-to-peer com um olho em direção ao seu potencial de tornar o mundo um lugar melhor.
tr: 20 Eylül hafta sonu, Our Networks konferansına katılmak için Sadie ile buluşmak üzere Toronto'ya gittim. Our Networks konferansı, dünyayı daha iyi bir yer yapma potansiyeli taşıyan birçok eşler arası teknolojinin sunulduğu çok çeşitli konuları kapsar.

source: The conference was fascinating, full of very smart people working on everything from physical mesh networks to the distributed web to, of course, anonymity. We got to talk to some great people from Tor, Protocol Labs, Parity Labs, the Dat Project, as well as a variety of artists and social scientists. Lots of fun too, and a great environment. Dat in particular presents some pretty cool opportunities for future co-operation I think.
pt_br: A conferência foi fascinante, cheia de pessoas muito inteligentes trabalhando em tudo de redes mesh físicas à web distribuída e, claro, anonimato. Nós conseguimos falar com algumas pessoas excelentes do Tor, Protocol Labs, Parity Labs, o Dat Project, assim como uma variedade de artistas e cientistas sociais. Muita diversão também, e um ótimo ambiente. O Dat em particular apresenta algumas oportunidades muito legais para cooperação futura, eu acho.
tr: Konferans büyüleyiciydi, fiziksel örgü ağlarından dağıtılmış ağlar ve tabii ki anonimlik konularına kadar hemen hemen her şey üzerinde çalışan çok akıllı insanlarla doluydu. Tor, Protocol Labs, Parity Labs, Dat Project ekiplerinin yanı sıra çeşitli sanatçılar ve sosyal bilimcilerden bazı harika insanlarla konuştuk. Hem çok eğlenceli hem de harika bir ortamdı. Özellikle Dat, bence gelecekteki işbirliği için oldukça güzel fırsatlar sunuyor.

source: I hadn't planned on giving a talk, but we were having so much fun that when we were asked, Sadie and I put something together and I gave a quick lightning talk about I2P and how it's design choices are relevant to Peer-to-Peer application development. The talk was recorded and when the video becomes available, I'll make sure to add it to this blog. Next year, I'll have some submissions for their Zine Library about I2P.
pt_br: Eu não tinha planejado dar uma palestra, mas estávamos nos divertindo tanto que quando fomos convidados, Sadie e eu montamos algo e eu dei uma rápida palestra relâmpago sobre I2P e como suas escolhas de design são relevantes para o desenvolvimento de aplicativos Peer-to-Peer . A palestra foi gravada e quando o vídeo estiver disponível, eu o adicionarei a este blog. No ano que vem, terei algumas submissões para a Zine Library deles sobre I2P.
tr: Bir konuşma yapmayı planlamamıştım, ama o kadar eğleniyorduk ki, bize sorulduğunda Sadie ve ben bir şeyler hazırladık ve I2P ve tasarım seçimlerinin eşler arası uygulama geliştirme ile ilgisi hakkında hızlı bir aydınlanma konuşması yaptım. Konuşma kaydedildi ve video hazır olduğunda bu bloga ekleyeceğimden emin olabilirsiniz. Gelecek yıl, Zine Library için I2P hakkında bazı sunumlarım olacak.

source: Besides that, I really enjoyed my time visiting Toronto, it was a great place to visit.
pt_br: Além disso, eu realmente aproveitei minha visita a Toronto, foi um ótimo lugar para visitar.
tr: Bunun yanında, Toronto'yu ziyaret ettiğim zamandan gerçekten keyif aldım, gezmek için harika bir yerdi.

source: 0.9.43 Release
pt_br: Lançamento 0.9.43
tr: 0.9.43 sürümü yayınlandı

source: 0.9.43 with bug fixes
pt_br: 0.9.43 com bugs corrigidos
tr: 0.9.43 sürümü bazı hata düzeltmeleri ile yayınlandı

source: In the 0.9.43 release, we continue work on stronger security and privacy features and performance improvements. Our implementation of the new leaseset specification (LS2) is now complete. We are beginning our implementation of stronger and faster end-to-end encryption (proposal 144) for a future release. Several IPv6 address detection issues have been fixed, and there of course are several other bug fixes.
pt_br: Na versão 0.9.43, nos continuamos trabalhando em fortes recursos de segurança, privacidade e melhorias de desempenho. Nossa implementação da nova especificação leaseset (LS2) está agora completa. Estamos começando a implementar uma criptografia ponto-a-ponto mais rápida, forte e segura (proposta 144) em uma revisão futura. Diversos problemas de detecção de endereços IPv6 foram solucionados, e nisso é claro há diversas outras correções de bugs.
tr: 0.9.43 sürümünde daha güçlü güvenlik ve gizlilik özellikleri üzerindeki çalışmalar sürdürüldü ve başarımda iyileştirmeler yapıldı. Uygulamayı yeni "Kiralama kümesi" (LS2) standartlarına uyumlu hale getirme çalışmaları tamamlandı. Gelecek sürümlere eklenecek daha güçlü ve daha hızlı uçtan uca şifreleme (144 numaralı öneri) uyarlaması üzerinde çalışma başlandı. Bazı IPv6 adres algılama sorunları ile bazı hatalar düzeltildi.

source: Console setup wizard improvements
pt_br: Melhorias no assistente de configuração do console
tr: Pano kurulum yardımcısı iyileştirmeleri

source: Tunnel wizard simplification
pt_br: Simplificação do assistente de túnel
tr: Tünel yardımcısı basitleştirildi

source: New I2CP BlindingInfo message for LS2
pt_br: Nova mensagem I2CP BlindingInfo para LS2
tr: LS2 için yeni I2CP BlindingInfo iletisi eklendi

source: New proxy page to enter encrypted leaseset credentials
pt_br: Nova página de proxy para inserir credenciais de leaseset criptografadas
tr: "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) kimlik bilgilerini yazmak için yeni vekil sunucu sayfası

source: Fix tunnel SSL wizard
pt_br: Assistente de correção de túnel SSL
tr: Tünel SSL yardımcısı düzeltildi

source: Fixes for SusiMail sent and drafts folder page
pt_br: Correções para a página de pasta de rascunhos e enviados do SusiMail
tr: SusiMail gönderilen ve taslaklar klasörü sayfasında düzeltmeler yapıldı

source: Detect IPv6 address changes
pt_br: Detectar alterações de endereço IPv6
tr: IPv6 adres değişikliklerinin algılanması sağlandı

source: Fix detection and handling of IPv6 firewalled
pt_br: Corrigir detecção e tratamento de firewall IPv6
tr: Güvenlik duvarı arkasından IPv6 algılaması ve işlenmesi düzeltildi

source: Fix manual reseed from URL
pt_br: Corrigir reseed manual a partir de URL
tr: Adresten yeniden tohumlama düzeltildi

source: i2ptunnel support for quoted custom options
pt_br: Suporte i2ptunnel para opções personalizadas citadas
tr: Alıntılanan özel seçenekler için i2ptunnel desteği eklendi

source: i2psnark now starts with reduced tunnel count then increases as necessary
pt_br: i2psnark agora inicia com contagem de túneis reduzida e aumenta conforme necessário
tr: i2psnark artık azaltılmış tünel sayısıyla başlıyor ve gerektiğinde artıyor

source: NTCP performance improvement
pt_br: Melhoria de desempenho NTCP
tr: NTCP başarımı iyileştirildi

source: Refactor and speed up tunnel AES processing
pt_br: Refatore e acelere o processamento AES do túnel
tr: Tünel AES işleme kodu elden geçirildi ve hızlandırıldı

source: Preliminary support for Servlet 3.0 webapps
pt_br: Suporte preliminar para webapps Servlet 3.0
tr: Servlet 3.0 internet uygulamaları için destek hazırlığı yapıldı

source: Standardize date/time formatting in console
pt_br: Padronizar formatação de data/hora no console
tr: Panoda tarih/saat biçimlendirmesi standartlaştırıldı

source: Highlighting Research
pt_br: Destacando Pesquisa
tr: Araştırmayı vurgulamak
