Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Files are available on the `download page`__.
pt_br: Os arquivos estão disponíveis na 'página de download'__.
tr: Dosyalar `indirme sayfasından`__ indirilebilir.

source: RELEASE DETAILS
pt_br: DETALHES DO LANÇAMENTO
tr: SÜRÜM BİLGİLERİ

source: Major Changes
pt_br: Maiores modificações
tr: Büyük değişiklikler

source: Bug Fixes
pt_br: Correção de falhas
tr: Hata düzeltmeleri

source: Other
pt_br: Outro
tr: Diğer

source: SHA256 Checksums:
pt_br: Somas de verificação SHA256:
tr: SHA256 sağlamaları:

source: Major changes
pt_br: Maiores alterações
tr: Büyük değişiklikler

source: Wrapper Update
pt_br: Atualização do encapsulador
tr: Wrapper Güncellemesi

source: Update Info
pt_br: Informativo de atualização
tr: Güncelleme bilgileri

source: Files are available on the `download page`_.
pt_br: Arquivos disponíveis na `página de downloads`_.
tr: Dosyalar `indirme sayfasından`_ indirilebilir.

source: `download page`
pt_br: `página de downloads`
tr: `indirme sayfası`

source: 0.9.2 Release
pt_br: Lançamento da versão 0.9.2
tr: 0.9.2 sürümü yayınlandı

source: 0.9.2 includes extensive low-level changes to improve the performance and efficiency of the router. We have updated our UPnP library, to hopefully make UPnP work for more people. I2PSnark now has DHT support, but it is not yet enabled by default, as we plan to do more testing during the upcoming 0.9.3 development cycle.
pt_br: O lançamento da versão 0.9.2 inclui extensas mudanças de baixo nível que melhoram o desempenho e a eficiência do roteador. Atualizamos nossa biblioteca UPnP para, esperançosamente, fazer o UPnP funcionar para um maior número de pessoas. O I2PSnark possui agora suporte a DHT, contudo não ainda configurado como padrão, uma vez que pretendemos realizar mais testes durante o ciclo de desenvolvimento da versão 0.9.3 por vir.
tr: 0.9.2 sürümü, yönelticinin başarımını ve verimliliğini artırmak için çok sayıda düşük düzeyli değişiklikler içeriyor. UPnP kitaplığını güncelledik. Böylece UPnP özelliğinden daha çok kişinin yararlanmasını umuyoruz. I2PSnark şu anda "Dağıtılmış karma tablosu" (DHT) desteğine sahip ancak 0.9.3 sürümünün geliştirme döngüsü sırasında daha fazla sınama yapmayı planladığımız için varsayılan olarak etkin değil.

source: As usual, there's also lots of bug fixes in this release, so updating is recommended.
pt_br: Como de costume, há uma porção de correções de falhas neste lançamento. Assim, é recomendado atualizar a versão do seu software I2P.
tr: Her zamanki gibi çok sayıda hata düzeltmesi yapıldığından sürümünüzü güncellemeniz önerilir.

source: SSU: Fix several problems in our UDP transport, to improve efficiency and reliability for connection setup. Also improve defenses against various types of bad input.
pt_br: SSU: Corrija vários problemas em nosso transporte UDP, para melhorar a eficiência e a confiabilidade da configuração da conexão. Também melhore as defesas contra vários tipos de entrada ruim.
tr: SSU: Bağlantı kurulumunda verimliliği ve güvenilirliği artırmak için UDP taşıyıcımızdaki birkaç sorun düzeltildi. Ayrıca çeşitli kötü giriş türlerine karşı savunma iyileştirildi.

source: UPnP: Updated our library to fix several issues, should work for more routers now
pt_br: UPnP: Nossa biblioteca foi atualizada para corrigir vários problemas. Por ora, deve funcionar para mais roteadores.
tr: UPnP: Birkaç sorunu çözmek için kitaplığımız güncellendi. Şimdi daha fazla yöneltici için çalışmalı

source: Transport: Improve performance in both our TCP and UDP transports, to benefit high-bandwidth routers
pt_br: Transporte: ganho de desempenho tanto no nosso transporte TCP quanto UDP, de modo a beneficiar roteadores com banda-larga de alta velocidade
tr: Taşıyıcı: Yüksek bant genişliğine sahip yönelticilerden yararlanmak için hem TCP hem de UDP taşıyıcılarımızda başarım iyileştirildi

source: Crypto: The thresholds and number of ElGamal/AES Session Tags delivered are now much more flexible, which should lessen protocol overhead and reduce stalls caused by dropped tags.
pt_br: Criptografia: Os limites e o número de tags de sessão ElGamal/AES entregues agora são muito mais flexíveis, o que deve diminuir a sobrecarga do protocolo e reduzir as paralisações causadas por tags descartadas.
tr: Şifreleme: Teslim edilen ElGamal/AES oturum etiketlerinin eşikleri ve sayısı artık çok daha esnek. Böylece iletişim kuralı yükü ve bırakılan etiketlerin neden olduğu duraklar azaldı.

source: I2PSnark: Add DHT support, not yet enabled by default, will do further testing and plan to enable by default in 0.9.3.
pt_br: I2PSnark: Adicionado suporte a DHT, não ainda estabelecido como padrão, que passará por testes e será estabelecido como padrão, conforme se planeja, no lançamento da versão 0.9.3.
tr: I2PSnark: Varsayılan olarak henüz etkinleştirilmemiş olan "Dağıtılmış karma tablosu" (DHT) desteği eklendi. Daha fazla sınama yapılacak. 0.9.3 sürümünde varsayılan olarak etkinleştirilmesi planlandı.

source: Fix various issues affecting memory usage and performance on high-bandwidth routers
pt_br: Corrige diversos problemas que afetavam o uso de memória e o desempenho em roteadores de banda-larga de alta capacidade
tr: Yüksek bant genişliğine sahip yönelticilerde bellek kullanımını ve başarımı etkileyen çeşitli sorunlar düzeltildi

source: Fix problems in UDP for routers using a reduced-MTU connection, e.g. a VPN
pt_br: Corrija problemas no UDP para roteadores que usam uma conexão de MTU reduzida, por exemplo, uma VPN
tr: VPN gibi azaltılmış MTU bağlantısı kullanan yönelticiler için UDP üzerindeki sorunlar düzeltildi

source: Fix i2psnark bug that prevented a completion announcement to the tracker
pt_br: Correção do bug i2psnark que impedia um anúncio de conclusão para o rastreador
tr: İzleyiciye tamamlanma duyurusunun yapılmasını engelleyen i2psnark hatası düzeltildi

source: Fix a lock contention problem in i2ptunnel
pt_br: Corrigir um problema de contenção de bloqueio no i2ptunnel
tr: i2ptunnel kilit çakışması sorunu düzeltildi

source: Fix some OSX installation issues
pt_br: Corrigidos alguns problemas da instalação no OSX
tr: Bazı OSX kurulum sorunları düzeltildi

source: Remove uses of direct byte buffers that may have been leaking
pt_br: Remova os usos de buffers de bytes diretos que podem estar vazando
tr: Sızıntı yapabilecek doğrudan bayt ara bellekleri kullanımdan kaldırıldı

source: Reduce overhead in network messages
pt_br: Reduz a sobrecarga nas mensagens de rede
tr: Ağ iletilerinin ek yükü azaltıldı

source: Add "universal" theme support
pt_br: Adicionar suporte a tema "universal"
tr: "Evrensel" tema desteği eklendi

source: Theme updates
pt_br: Atualizações de tema
tr: Tema güncellemeleri

source: Add a jbigi library for Raspberry Pi
pt_br: Adicionar uma biblioteca jbigi para Raspberry Pi
tr: Raspberry Pi için jbigi kitaplığı eklendi

source: New Scala unit test framework
pt_br: Nova estrutura de teste de unidade Scala
tr: Yeni Scala birim sınama çatısı

source: Translation updates for Czech, Dutch, German, and Greek
pt_br: Traduções atualizadas: alemão, grego, holandês e tcheco
tr: Çekce, Danimarkaca, Almanca ve Yunanca çevirileri güncellendi

source: Update wrapper to 3.5.15 (new installs and PPA only)
pt_br: Atualizar o encapsulador para 3.5.15 (apenas para novas instalações e PPA)
tr: Wrapper 3.5.15 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: Update GeoIP data (new installs and PPA only)
pt_br: Atualiza dados do GeoIP (apenas para novas instalações e PPA)
tr: GeoIP verileri güncellendi (yalnızca yeni kurulumlar ve PPA)

source: 0.9.3 Release
pt_br: Lançamento da versão 0.9.3
tr: 0.9.3 sürümü yayınlandı

source: 0.9.3 includes extensive low-level changes to the queueing of messages in the router. We implement the CoDel Active Queue Management (AQM) algorithm. We also unify the queueing and priority mechanisms in the transports to aid diagnosis and reduce network latency. Work continues on fixing UDP transport bugs and making UDP more resistant to attacks. There are more changes to improve the performance of the router and reduce its memory usage. Also, we enable i2psnark's DHT support, introduced last release, by default.
pt_br: 0.9.3 inclui extensas mudanças de baixo nível no enfileiramento de mensagens no roteador. Implementamos o algoritmo CoDel Active Queue Management (AQM). Também unificamos os mecanismos de enfileiramento e prioridade nos transportes para auxiliar no diagnóstico e reduzir a latência da rede. O trabalho continua na correção de bugs de transporte UDP e tornando o UDP mais resistente a ataques. Há mais mudanças para melhorar o desempenho do roteador e reduzir seu uso de memória. Além disso, habilitamos o suporte DHT do i2psnark, introduzido na última versão, por padrão.
tr: 0.9.3 sürümünde, yönelticideki iletilerin kuyruğa alınmasında kapsamlı düşük düzey değişiklikler bulunuyor. CoDel Active Queue Management (AQM) algoritması uygulandı. Ayrıca, tanılamaya yardımcı olmak ve ağ gecikmesini azaltmak için taşıyıcılardaki kuyruk ve öncelik yöntemleri birleştirildi. UDP taşıyıcı hatalarını düzeltme ve UDP bağlantısını saldırılara karşı daha dayanıklı hale getirme çalışmaları sürüyor. Yönelticinin başarımını artırmak ve bellek kullanımını azaltmak için pek çok değişiklik yapıldı. Ayrıca, son i2psnark sürümünde sunulan "Dağıtılmış karma tablosu" (DHT) desteği varsayılan olarak etkinleştirildi.

source: Active Queue Management
pt_br: Gerenciamento da fila de atividades
tr: Etkin Kuyruk Yönetimi

source: Priority queues
pt_br: Fila de prioridades
tr: Öncelik kuyrukları

source: I2PSnark DHT: Several bug fixes, enable by default.
pt_br: DHT I2PSnark: Vários bugs corrigidos, permitido por padrão.
tr: I2PSnark "Dağıtılmış karma tablosu" (DHT): Bazı hatalar ayıklandı, varsayılan olarak etkinleştirildi.

source: Several SSU fixes including memory leak, and better handling of routers behind firewalls that change UDP ports; additional defenses for malicious packets.
pt_br: Várias correções de SSU, incluindo vazamento de memória e melhor manuseio de roteadores atrás de firewalls que alteram as portas UDP; Defesas adicionais para pacotes maliciosos.
tr: Bellek sızıntısı ve UDP bağlantı noktalarını değiştiren güvenlik duvarlarının arkasındaki yönelticilerin daha iyi işlenmesi ile birlikte çeşitli SSU düzeltmeleri yapıldı. Kötü niyetli paketler için yeni savunmalar eklendi.

source: Fix piece selection (rarest-first) bugs in i2psnark
pt_br: Corrigir bugs de seleção de peças (mais raros primeiro) no i2psnark
tr: i2psnark üzerinde parça seçimi (en nadir ilk) hataları düzeltildi

source: Fix bug causing multiple browsers to open at startup
pt_br: Corrigido erro que causava a abertura de múltiplos navegadores ao inicializar
tr: Başlangıçta birden çok tarayıcının açılmasına neden olan hata düzeltildi

source: Improvements in caching
pt_br: Melhorias no caching
tr: Ön bellek geliştirildi

source: Several synchronization fixes and lock contention reduction
pt_br: Várias correções de sincronização e redução de contenção de bloqueio
tr: Birkaç eşitleme düzeltmesi ve kilit çakışması azaltıldı

source: Major reduction in SSU buffers memory use
pt_br: Maior redução no uso de buffers de memória para SSU
tr: SSU ara belleğinin bellek kullanımını büyük oranda azaltıldı

source: Fix streaming connection timeout back to 1 minute, was inadvertently changed to 5 minutes; set i2ptunnel server read timeout to 5 minutes, was unlimited
pt_br: Corrija o tempo limite da conexão de streaming de volta para 1 minuto, foi inadvertidamente alterado para 5 minutos; definir o tempo limite de leitura do servidor i2ptunnel para 5 minutos, era ilimitado
tr: Akış bağlantısı zaman aşımı 1 dakikaya geri alınarak düzeltildi. Yanlışlıkla 5 dakikaya değiştirilmişti. Sınırsız olan i2ptunnel sunucusu okuma zaman aşımı 5 dakika olarak ayarlandı

source: Improved defenses in i2ptunnel for "darkloris"
pt_br: Defesas aprimoradas no i2ptunnel para "darkloris"
tr: "darkloris" için i2ptunnel savunması geliştirildi

source: More validation at torrent creation in i2psnark
pt_br: Mais validação na criação de torrent em i2psnark
tr: i2psnark üzerinde torrent oluşturmak için daha fazla doğrulama eklendi

source: Several parameter changes in SSU to improve throughput
pt_br: Várias alterações de parâmetros no SSU para melhorar a taxa de transferência
tr: Çıkışı artırmak için SSU üzerinde birkaç parametre değiştirildi

source: New event log for major events including restarts; show multiple restart lines on graphs
pt_br: Novo registro de eventos para grandes eventos, incluindo reinicializações; mostrar várias linhas de reinicialização em gráficos
tr: Yeniden başlatma gibi önemli olaylar için yeni olay günlüğü eklendi. Grafiklerde birden çok yeniden başlatma çizgisinin görüntülenmesi sağlandı

source: Remove duplicate messages from logs
pt_br: Remover mensagens duplicadas dos registros
tr: Yinelenen iletiler günlüklerden kaldırıldı

source: Don't respond to blocked streaming connections with a reset, just drop
pt_br: Não responder conexões com fluxo bloqueado com um reinício, apenas descartá-las.
tr: Engellenen akış bağlantılarına sıfırlama ile yanıt verilmesi engellendi, yalnızca bağlantının kesilmesi sağlandı

source: Remove all uses of inefficient SimpleTimer
pt_br: Removidos todos os usos do ineficaz SimpleTimer
tr: Tüm verimsiz SimpleTimer kullanımlarını kaldırıldı

source: More checks for valid IPs and ports entered in console
pt_br: Mais verificações para IPs válidos e portas fornecidos no painel
tr: Panodan yazılan geçerli IP adresleri ve bağlantı noktaları için daha fazla denetim eklendi

source: Fix bug that wasted a lot of entropy
pt_br: Corrigida uma falha responsável por considerável perda de entropia
tr: Çok fazla entropi harcayan hata düzeltildi

source: Translation updates: Italian, Portuguese, Spanish, Swedish
pt_br: Traduções atualizadas: espanhol, italiano, português e sueco
tr: Çeviriler güncellendi: İtalyanca, Portekizce, İspanyolca, İsveççe

source: Add non-NIO configuration in jetty.xml, recommended for Java 5
pt_br: Adicionar configuração não NIO no jetty.xml, recomendada para Java 5
tr: Java 5 için önerilen jetty.xml dosyasına NIO olmayan yapılandırma eklendi

source: 0.9.4 Release
pt_br: Lançamento da versão 0.9.4
tr: 0.9.4 sürümü yayınlandı

source: 0.9.4 includes a fix for a network capacity bug, introduced in 0.9.2, that was reducing network performance and reliability. It also includes major changes in the in-network update system, and adds the capability to update via in-network torrents.
pt_br: 0.9.4 inclui um conserto para um defeito na capacidade da rede, introduzido na versão 0.9.2, que estava reduzindo o desempenho e confiança da rede. Também inclui maiores mudanças no sistema de atualização pela rede interna, e coloca a capacidade de atualizar através de torrentes dentro da rede.
tr: 0.9.4 sürümünde, 0.9.2 sürümünde sunulan ve ağ başarımı ilegüvenilirliğini azaltan bir ağ kapasitesi hatası düzeltildi. Ayrıca ağ içi güncelleme sisteminde büyük değişiklikler yapıldı ve ağ içi torrent kullanımıyla güncelleme yeteneği eklendi.

source: We fixed several bugs in the i2psnark DHT implementation that was introduced last release. For those of you using console or http proxy passwords, we converted to the more-secure digest method and improved the security for console forms.
pt_br: Corrigimos vários bugs na implementação do i2psnark DHT que foi introduzida na última versão. Para aqueles que usam senhas de console ou proxy http, convertemos para o método digest mais seguro e melhoramos a segurança para formulários de console.
tr: Önceki sürümde tanıtılan i2psnark "Dağıtılmış karma tablosu" (DHT) uygulamasındaki birkaç hata düzeltildi. Pano veya HTTP vekil sunucu parolaları kullananlarınız için daha güvenli özet yöntemine geçildi ve pano formlarının güvenliğini iyileştirildi.

source: For those of you already running development builds, your router should automatically update to 0.9.4-0 using the new in-network torrent facility. For those running 0.9.3-0, you will update normally using in-network HTTP, and we will have more information for you when we release 0.9.5.
pt_br: Para aqueles que já estão executando compilações de desenvolvimento, seu roteador deve atualizar automaticamente para 0.9.4-0 usando o novo recurso de torrent na rede. Para aqueles que estão executando 0.9.3-0, você atualizará normalmente usando HTTP na rede, e teremos mais informações para você quando lançarmos 0.9.5.
tr: Zaten geliştirme yapılarını çalıştıranlarınız için, yönelticiniz yeni ağ içi torrent özelliğini kullanarak otomatik olarak 0.9.4-0 sürümüne güncellenmelidir. 0.9.3-0 sürümünü kullananlar, ağ içi HTTP kullanarak normal şekilde güncelleme yapmalı. 0.9.5 sürümünü yayınladığımızda sizin için daha fazla bilgiye sahip olacağız.

source: Big rework of the update system; Preliminary support for updates via i2psnark
pt_br: Grande retrabalho no sistema de atualização; suporte preliminar para atualizações via i2psnark
tr: Güncelleme sistemi üzerinde büyük bir yenileme yapıldı. i2psnark aracılığıyla güncellemeler için ön destek hazırlandı

source: Add per-destination outbound priorities
pt_br: Adicionar prioridades de saída por destino
tr: Her hedef için gidiş öncelikleri eklendi

source: Fix major bug that reduced SSU connection limits which reduced tunnel build success rates
pt_br: Correção de um bug importante que reduzia os limites de conexão SSU, o que reduzia as taxas de sucesso de construção de túneis
tr: SSU bağlantı sınırlarını azaltarak tünel oluşturma başarı oranlarını düşüren büyük bir hata düzeltildi

source: Fix bug with external I2CP that prevented some external apps from working
pt_br: Correção de bug com I2CP externo que impedia que alguns aplicativos externos funcionassem
tr: Bazı dış uygulamaların çalışmasını engelleyen dış I2CP hatası düzeltildi

source: Fixed several bugs in i2psnark DHT
pt_br: Corrigidos vários bugs no i2psnark DHT
tr: i2psnark "Dağıtılmış karma tablosu" (DHT) üzerindeki birkaç hata düzeltildi

source: Fixed bug in i2psnark PEX that inflated peer counts
pt_br: Corrigido o bug no i2psnark PEX que inflava a contagem de pares
tr: i2psnark PEX üzerindeki eş sayısını şişiren hata düzeltildi

source: Handle dropped I2CP messages better
pt_br: Lidar melhor com mensagens I2CP descartadas
tr: kaybedilen I2CP iletilerinin daha iyi işlenmesi sağlandı

source: Reduce overhead of I2CP messages
pt_br: Redução de sobrecarga nas mensagens do I2CP
tr: I2CP iletilerinin ek yükü azaltıldı

source: Enforce max size in transport outbound message queues
pt_br: Impor o tamanho máximo em filas de mensagens de saída de transporte
tr: Gidiş taşıyıcısı ileti kuyrukları için en büyük boyut dayatıldı

source: Fixes for Windows eepget.bat (new installs and PPA only)
pt_br: Correções para eepget.bat no Windows (novas instalações e PPA apenas)
tr: Windows eepget.bat için düzeltmeler yapıldı (yalnızca yeni kurulumlar ve PPA)

source: Fix a bug that would drop messages of exactly 512 bytes in SSU
pt_br: Corrija um bug que descartaria mensagens de exatamente 512 bytes no SSU
tr: SSU üzerinde tam olarak 512 baytlık iletilerin kaybolmasına neden olan bir hata düzeltildi

source: More performance improvements, memory reduction, and object churn reduction
pt_br: Mais melhorias de desempenho, redução de memória e redução de rotatividade de objetos
tr: Başarım iyileştirmesi, bellek kullanımını azaltma ve nesne karmaşasını azaltma konularında iyileştirmeler yapıldı

source: Better detection of network disconnections
pt_br: Melhor detecção das desconexões de rede
tr: Ağ bağlantısı kesilmelerinin daha iyi algılanması sağlandı

source: Further improvements in the SSU transport
pt_br: Melhorias adicionais no transporte SSU
tr: SSU taşıyıcısında ek iyileştirmeler yapıldı

source: Add console password form
pt_br: Adicionada uma caixa de entrada de senha no painel
tr: Pano parolası formu eklendi

source: Convert http proxy and console from basic to digest authentication for added security
pt_br: Converta o proxy http e o console da autenticação básica para a autenticação digest para maior segurança
tr: Ek güvenlik için HTTP vekil sunucu ve panosu temel kimlik doğrulamasından özet kimlik doğrulamasına dönüştürüldü

source: Improved verification of console form submissions, using jsp sessions. Cookies may now be required on forms, except when the console password is enabled
pt_br: Verificação aprimorada de envios de formulários de console, usando sessões jsp. Os cookies agora podem ser necessários em formulários, exceto quando a senha do console está habilitada
tr: jsp oturumlarını kullanan pano formu gönderimlerinin doğrulanması iyileştirildi. Pano parolasının etkin olduğu durumlar dışında, formlarda çerezler gerekli olabilir.

source: Initial work on new interfaces to manage applications started via clients.config
pt_br: Trabalho inicial em novas interfaces para gerenciar aplicativos iniciados por meio de clients.config
tr: Client.config aracılığıyla başlatılan uygulamaları yönetmek için yeni arayüzler üzerine ilk çalışma yapıldı

source: Increase minimum peer port to 1024
pt_br: As portas dos participantes agora tem o mínimo de 1024
tr: En küçük eş bağlantı noktası 1024 değerine yükseltildi

source: Increase granularity of bandwidth limiter for smoother transmissions
pt_br: Aumentada a granularidade do limitador da transmissão de dados para transmissões mais suaves
tr: Daha sorunsuz taşıyıcılar için bant genişliği sınırlayıcısının ayrıntı düzeyi artırıldı

source: Translation updates: Chinese, French, German, Italian, Polish, Portuguese, Swedish, and Ukrainian
pt_br: Traduções atualizadas: alemão, chinês, francês, italiano, português, sueco e ucraniano
tr: Çeviriler güncellendi: Çince, Fransızca, Almanca, İtalyanca, Lehçe, Portekizce, İsveççe ve Ukraynaca

source: Update wrapper to 3.5.16 (new installs and PPA only)
pt_br: Atualizar o encapsulador para 3.5.16 (novas instalações e PPA apenas)
tr: Wrapper 3.5.16 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: New ARMv6 wrapper for Raspberry Pi
pt_br: Novo encapsulador ARMv6 para Raspberry Pi
tr: Raspberry Pi için yeni ARMv6 Wrapper eklendi

source: 0.9.5 Release
pt_br: Lançamento da versão 0.9.5
tr: 0.9.5 sürümü yayınlandı

source: 0.9.5 includes bug fixes and defenses for some issues and vulnerabilities that are being investigated by researchers at UCSB. We continue to work with them on additional improvements. This is a good opportunity to remind the community that while our network continues to grow rapidly, it is still relatively small. There may be multiple weaknesses or bugs that could compromise your anonymity. Help us grow the network by spreading the word and contributing where you can.
pt_br: 0.9.5 inclui correções de bugs e defesas para alguns problemas e vulnerabilidades que estão sendo investigados por pesquisadores da UCSB. Continuamos trabalhando com eles em melhorias adicionais. Esta é uma boa oportunidade para lembrar à comunidade que, embora nossa rede continue a crescer rapidamente, ela ainda é relativamente pequena. Pode haver várias fraquezas ou bugs que podem comprometer seu anonimato. Ajude-nos a expandir a rede espalhando a palavra e contribuindo onde puder.
tr: 0.9.5 sürümünde, UCSB araştırmacıları tarafından üzerinde çalışılan bazı sorunlar ve güvenlik açıkları için hata düzeltmeleri ile savunmalar bulunuyor. Ek iyileştirmeler için onlarla çalışmayı sürdürüyoruz. Bu durum, ağımızın hızla büyümeyi sürdürmesine rağmen hala nispeten küçük olduğunu topluluğumuza hatırlatmak için iyi bir fırsat. Anonimliğinizi tehlikeye atabilecek birden fazla zayıflık veya hata olabilir. Duyurarak ve yapabildiğiniz her şekilde katkıda bulunarak ağı büyütmemize yardımcı olun.
