Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: In this upgrade cycle, a random 1%(pc)s of routers, (plus all routers running a development build) will attempt to update via the experimental in-network bittorrent with i2psnark. If this doesn't work, it should fall back to standard in-network HTTP update.
pt_br: Neste ciclo de atualização, um 1%(pc)s aleatório de roteadores, (mais todos os roteadores executando uma compilação de desenvolvimento ) tentará atualizar via bittorrent experimental na rede com i2psnark. Se isso não funcionar, ele deve voltar para a atualização HTTP padrão na rede.
tr: Bu yükseltme döngüsünde, rastgele 1%(pc)s yöneltici (ve bir geliştirme yapımı ile çalışan tüm yönelticiler), i2psnark kullanarak bittorrent ile deneysel ağ içi güncelleme yapmaya çalışacak. Bu özellik bir nedenle işe yaramazsa, standart ağ içi HTTP güncelleme yöntemine geri dönülmesi beklenir.

source: Defenses and Bug Fixes
pt_br: Defesas e Correções de Falhas
tr: Savunmalar ve Ayıklanan Hatalar

source: Fix router bug causing lockup when using iMule
pt_br: Corrigir bug do roteador que causa travamento ao usar o iMule
tr: iMule kullanırken kilitlenmeye neden olan yöneltici hatası düzeltildi

source: Recognize, handle, reject duplicate tunnel IDs
pt_br: Reconhecer, manusear, rejeitar IDs de túneis duplicados
tr: Yinelenen tünel kimliklerini tanıma, işleme ve reddetme

source: Fix changing of the log file name
pt_br: Corrige a alteração do nome do arquivo de logs
tr: Günlük dosyası adının değiştirilmesi düzeltildi

source: Prevent hashcode attack in session tags
pt_br: Evitar ataque de hashcode em tags de sessão
tr: Oturum etiketlerinde karma kod saldırısı önlendi

source: Add build request throttler based on previous hop
pt_br: Adicionar acelerador de solicitação de compilação com base no salto anterior
tr: Önceki durağa göre yapım isteği kısıtlayıcı eklendi

source: Limit concurrent next-hop lookups
pt_br: Limitar pesquisas simultâneas de next-hop
tr: Eşzamanlı sonraki durak aramaları sınırlandı

source: Catch exceptions storing nonces in console
pt_br: Capturar exceções que armazenam nonces no console
tr: Panoda nonces kaydeden istisnalar yakalandı

source: Fix saving graph settings in console
pt_br: Corrigir salvar as configurações do gráfico no console
tr: Panoda çizelge ayarlarını kaydetme özelliği düzeltildi

source: Fix eepget generation of URLs when not proxied
pt_br: Corrigir a geração de URLs quando não são enviados por proxy
tr: Vekil sunucu kullanılmadığında adreslerin eepget oluşturması düzeltildi

source: Encrypt database lookup messages end-to-end when sent through exploratory tunnels
pt_br: Criptografar mensagens de pesquisa de banco de dados de ponta a ponta quando enviadas por meio de túneis exploratórios
tr: Keşif tünelleri aracılığıylagönderilen veri tabanı arama iletileri uçtan uca şifrelendi

source: Don't use multiple floodfills from the same /16 in a query
pt_br: Não use vários floodfills do mesmo /16 em uma consulta
tr: Bir sorguda, aynı /16 içinde birden fazla otomatik doldurma kullanılması engellendi

source: Randomize delay before verifying floodfill store
pt_br: Randomize o atraso antes de verificar o repositório de floodfill
tr: Otomatik doldurma deposu doğrulanmadan önce rastgele bir gecikme eklendi

source: Increase number of floodfills
pt_br: Aumentar o número de floodfills
tr: Otomatik doldurma sayısı arttırıldı

source: Improve support for mobile browsers
pt_br: Melhore o suporte para navegadores móveis
tr: Mobil tarayıcı desteği geliştirildi

source: Partial defenses for UCSB attacks
pt_br: Defesas parciais para ataques UCSB
tr: UCSB saldırıları için kısmi savunma geliştirildi

source: Add announce list support to i2psnark
pt_br: Adicionar suporte à lista de anúncios ao i2psnark
tr: i2psnark için duyuru listesi desteği eklendi

source: Jetty: upgrade Apache Tomcat to 6.0.36
pt_br: Jetty: atualizar Apache Tomcat para 6.0.36
tr: Jetty: Apache Tomcat 6.0.36 sürümüne güncellendi

source: Split router info files into multiple subdirectories
pt_br: Divida os arquivos de informações do roteador em vários subdiretórios
tr: Yöneltici bilgi dosyaları birden çok alt klasöre dağıtıldı

source: Add IP to hostname mapping option in SOCKS
pt_br: Adicionar IP às opções de mapeamento do nome de anfitrião em SOCKS
tr: SOCKS üzerinde sunucu adı eşleştirme seçeneğine IP adresi eklendi

source: Improve PRNG seeding
pt_br: Melhorar a semeadura de PRNG
tr: PRNG tohumlama iyileştirildi

source: Translation updates: French, German, Hungarian, Italian, Norwegian, Polish, Portuguese, Russian, Swedish
pt_br: Traduções atualizadas: alemão, francês, húngaro, italiano, norueguês, polonês, português, russo e sueco
tr: Çeviriler güncellendi: Fransızca, Almanca, Macarca, İtalyanca, Norveççe, Lehçe, Portekizce, Rusça, İsveççe

source: Update wrapper to 3.5.17 (new installs and PPA only)
pt_br: Atualizar o encapsulador para 3.5.17 (apenas para novas instalações e PPA)
tr: Wrapper 3.5.17 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: 0.9.6 Release
pt_br: Lançamento da versão 0.9.6
tr: 0.9.6 sürümü yayınlandı

source: 0.9.6 includes bug fixes and an update from Jetty 6.1.26 (2010-11-10) to Jetty 7.6.10 (2013-03-12). See below for important information on the Jetty update. The Jetty 7 series is actively maintained and we plan to stay current with it in future I2P releases.
pt_br: 0.9.6 inclui correções de bugs e uma atualização do Jetty 6.1.26 (2010-11-10) para o Jetty 7.6.10 (2013-03-12). Veja abaixo informações importantes sobre a atualização do Jetty. A série Jetty 7 é mantida ativamente e planejamos mantê-la atualizada em lançamentos futuros do I2P.
tr: 0.9.6, sürümünde hata düzeltmeleri ve Jetty 6.1.26 sürümünden (2010-11-10) Jetty 7.6.10 sürümüne (2013-03-12) güncelleme bulunuyor. Jetty güncellemesi ile ilgili önemli bilgiler için aşağıya bakın. Jetty 7 serisi etkin şekilde geliştiriliyor ve gelecekteki I2P sürümlerinde güncel sürümlerini kullanmayı planlıyoruz.

source: Most users will update via HTTP. Those running development builds will attempt to update via the experimental in-network bittorrent with i2psnark. We've fixed some bugs that will enable more users to update via torrent in the 0.9.7 update cycle.
pt_br: A maioria dos usuários atualizará via HTTP. Aqueles que estiverem executando builds de desenvolvimento tentarão atualizar via bittorrent experimental na rede com i2psnark. Corrigimos alguns bugs que permitirão que mais usuários atualizem via torrent no ciclo de atualização 0.9.7.
tr: Çoğu kullanıcı HTTP aracılığıyla güncelleme yapacaktır. Geliştirme sürümlerini çalıştıranlar, i2psnark ile deneysel ağ içi bittorrent ile güncelleme yapmaya çalışacak. 0.9.7 güncelleme döngüsünde daha fazla kullanıcının torrent üzerinden güncelleme yapmasını sağlayacak bazı hatalar düzeltildi.

source: Important fix for Windows Eepsites, first install 0.9.5 only
pt_br: Correção importante para Windows Eepsites, primeira instalação apenas 0.9.5
tr: Yalnızca en başta 0.9.5 sürümünü kuranlar için Windows eepsites ile ilgili önemli bir düzeltme yapıldı

source: If you first installed I2P with version 0.9.5, on Windows only, we recommend that you follow the following instructions to fix your eepsite location **before** you update to 0.9.6. Only original installations of 0.9.5-0 on Windows are affected by this issue. If your router version is 0.9.5-0-win1, you already have the fix and need not take any action.
pt_br: Se você instalou o I2P pela primeira vez com a versão 0.9.5, somente no Windows, recomendamos que você siga as instruções a seguir para corrigir a localização do seu eepsite **antes** de atualizar para a 0.9.6. Somente instalações originais da 0.9.5-0 no Windows são afetadas por esse problema. Se a versão do seu roteador for 0.9.5-0-win1, você já tem a correção e não precisa tomar nenhuma ação.
tr: I2P uygulamasını ilk olarak 0.9.5 sürümüyle kurduysanız, yalnızca Windows üzerinde, 0.9.6 sürümüne güncellemeden **önce** eepsite konumunuzu düzeltmek için aşağıdaki yönergeleri izlemenizi öneririz. Yalnızca Windows üzerindeki özgün 0.9.5-0 kurulumları bu sorundan etkilenir. Yöneltici sürümünüz 0.9.5-0-win1 ise, zaten düzeltilmiş sürümü kullandığınızdan herhangi bir işlem yapmanıza gerek yok.

source: See `this page`__ for instructions.
pt_br: Consulte 'esta página'__ para obter instruções.
tr: Yönergeler için `bu sayfaya`__ bakabilirsiniz.

source: Jetty 7 Migration Details
pt_br: Detalhes da migração do Jetty 7
tr: Jetty 7 Geçişinin Ayrıntıları

source: For most people, the update should just work. If you have multiple Jetty eepsites, OR have made changes to jetty.xml or other Jetty configuration files, including changing the port from 7658, you MUST take manual action AFTER updating.
pt_br: Para a maioria das pessoas, a atualização deve funcionar. Se você tiver vários eepsites Jetty, OU tiver feito alterações no jetty.xml ou em outros arquivos de configuração do Jetty, incluindo a alteração da porta de 7658, você DEVE tomar uma ação manual DEPOIS da atualização.
tr: Çoğu insan için güncelleme sorunsuz olmalıdır. Birden fazla Jetty eepsiteniz varsa VEYA jetty.xml veya diğer Jetty yapılandırma dosyalarında, 7658 bağlantı noktasında veya başka seçeneklerde değişiklik yaptıysanız, güncellemeden SONRA el ile işlem YAPMALISINIZ.

source: After update, the router will migrate your jetty.xml files to the new Jetty 7 format.
pt_br: Após a atualização, o roteador migrará seus arquivos jetty.xml para o novo formato Jetty 7.
tr: Güncellemeden sonra yöneltici, jetty.xml dosyalarınızı yeni Jetty 7 biçimine geçirecektir.

source: The migration resets the port to 7658. If you have more than one Jetty eepsite, OR your eepsite is NOT on port 7658, OR you have made other modifications to jetty.xml (for example changing the listen address from 127.0.0.1 to 0.0.0.0), you MUST edit the jetty.xml file for each eepsite to fix them up after updating, and restart again.
pt_br: A migração redefine a porta para 7658. Se você tiver mais de um eepsite Jetty, OU seu eepsite NÃO estiver na porta 7658, OU você tiver feito outras modificações no jetty.xml (por exemplo, alterando o endereço de escuta de 127.0.0.1 para 0.0.0.0), você DEVE editar o arquivo jetty.xml para cada eepsite para corrigi-los após a atualização e reiniciar novamente.
tr: Geçiş, bağlantı noktasını 7658 olarak sıfırlar. Birden fazla Jetty eepsiteniz varsa VEYA eepsiteniz 7658 numaralı bağlantı noktasını KULLANMIYORSA VEYA jetty.xml dosyasında başka değişiklikler yaptıysanız (dinleme adresini 127.0.0.1 yerine 0.0.0.0 yapmak gibi), güncelleme işleminden sonra bunları düzeltmek için her eepsitesinin jetty.xml dosyasını düzenlemeniz ve yeniden başlatmanız GEREKİR.

source: **The following files will be backed up with a &quot;.jetty6&quot; suffix and then migrated.** If you have made local changes, you may have to edit them manually and restart. See http://wiki.eclipse.org/Jetty for assistance in configuring Jetty 7.
pt_br: **Os seguintes arquivos serão copiados com um sufixo &quot;.jetty6&quot; e então migrados.** Se você fez alterações locais, talvez seja necessário editá-las manualmente e reiniciar. Consulte http://wiki.eclipse.org/Jetty para obter assistência na configuração do Jetty 7.
tr: **Aşağıdaki dosyalar bir &quot;.jetty6&quot; son eki ile yedeklendikten sonra geçirilecek.** Yerel değişiklikler yaptıysanız, bunları el ile düzenlemeniz ve yeniden başlatmanız gerekebilir. Jetty 7 yapılandırması konusunda yardım almak için http://wiki.Eclipse.org/Jetty adresine bakabilirsiniz.

source: Plugins
pt_br: Extensões
tr: Uygulama ekleri

source: Most plugins should work fine with Jetty 7.
pt_br: A maioria das extensões deve funcionar bem com Jetty 7.
tr: Çoğu uygulama eki, Jetty 7 ile sorunsuz çalışmalıdır.

source: The I2PControl and zzzot plugins must be updated. Your router should download and install the new versions shortly after starting 0.9.6.
pt_br: Os plugins I2PControl e zzzot devem ser atualizados. Seu roteador deve baixar e instalar as novas versões logo após iniciar a 0.9.6.
tr: I2PControl ve zzzot uygulama ekleri güncellenmelidir. 0.9.6 sürümünü başlattıktan kısa bir süre sonra yönelticinizin yeni sürümleri indirip kurması beklenir.

source: If a plugin does not work, please contact the maintainer for that plugin.
pt_br: Se um plugin não funcionar, entre em contato com o mantenedor desse plugin.
tr: Bir uygulama eki çalışmıyorsa, lütfen o uygulama ekinin geliştiricisi ile görüşün.

source: Several bugs with Windows installation (see above)
pt_br: Diversas falhas com a instalação no Windows (ver acima)
tr: Windows kurulumuyla ilgili birkaç hata (yukarıya bakın)

source: Fix default form action in i2ptunnel
pt_br: Corrigir ação de formulário padrão no i2ptunnel
tr: i2ptunnel üzerinde varsayılan form işlemi düzeltildi

source: Fix links on iframed console pages
pt_br: Corrigir links em páginas de console com iframe
tr: iframe pano sayfalarındaki bağlantılar düzeltildi

source: Better detection of 64-bit Windows to prevent crashes by systray
pt_br: Melhor detecção do Windows de 64 bits para evitar falhas pela bandeja do sistema
tr: Sistem çökmelerini önlemek için 64 bit Windows algılaması iyileştirildi

source: Fix bug preventing router update via torrent
pt_br: Corrigir bug que impede a atualização do roteador via torrent
tr: Torrent üzerinden yöneltici güncellemesini engelleyen hata düzeltildi

source: Several SSU fixes for NATs that change UDP ports
pt_br: Várias correções de SSU para NATs que alteram as portas UDP
tr: UDP bağlantı noktalarını değiştiren NAT dönüşümleri için birkaç SSU düzeltmesi yapıldı

source: Ignore unsupported IPs in RouterInfos when selecting an address (prep for IPv6)
pt_br: Ignorar IPs não suportados em Router Infos ao selecionar um endereço (preparação para IPv6)
tr: Bir adres seçerken "Yöneltici bilgileri" (RouterInfo) içinde desteklenmeyen IP adresleri yok sayıldı (IPv6 için hazırlık)

source: Ignore unused option bits in Database Lookup Message (prep for requesting encrypted response)
pt_br: Ignorar bits de opção não utilizados na mensagem de pesquisa de banco de dados (preparação para solicitar resposta criptografada)
tr: Veri tabanı arama iletisinde kullanılmayan seçenek bitleri yok sayıldı (şifrelenmiş yanıt istemeye hazırlık)

source: Fix HTTP proxy error response for malformed URIs
pt_br: Corrigir resposta de erro de proxy HTTP para URIs malformados
tr: Hatalı biçimlendirilmiş adresler için HTTP vekil sunucu hata yanıtı düzeltildi

source: Recognize UPnP devices without port forwarding capability
pt_br: Reconhecimento de dispositivos UPnP que não implementam redirecionamento de portas
tr: Bağlantı noktası iletme yeteneği olmayan UPnP aygıtlarının tanınması sağlandı

source: Jetty 7.6.10 (see above for migration information)
pt_br: Jetty 7.6.10 (veja acima as informações de migração)
tr: Jetty 7.6.10 (geçiş bilgileri için yukarıya bakın)

source: Limit page size in i2psnark
pt_br: Limita o tamanho de página no i2psnark
tr: i2psnark üzerinde sayfa boyutu sınırlandı

source: Add data directory and page size configuration to i2psnark
pt_br: Adicionar configuração de diretório de dados e tamanho de página ao i2psnark
tr: i2psnark üzerinde veri klasörü ve sayfa boyutu yapılandırması eklendi

source: Support multiple i2psnark instances
pt_br: Suporta várias instâncias i2psnark
tr: Birden çok i2psnark kopyası desteği eklendi

source: Piece size adjustments in i2psnark
pt_br: Ajustes de tamanho de peça no i2psnark
tr: i2psnark üzerinde parça boyutu ayarlamaları yapıldı

source: Add more graphing support for combined bandwidth graph
pt_br: Adicionar mais suporte gráfico para gráfico de largura de banda combinada
tr: Birleşik bant genişliği çizelgesi için daha fazla grafik desteği eklendi

source: Block b32.i2p supercookies
pt_br: Bloquear supercookies b32.i2p
tr: b32.i2p süper çerezleri engellendi

source: Allow stopping clients on /configclients
pt_br: Permite que os clientes sejam parados em /configclients
tr: /configclients üzerindeki istemcilerin durdurulmasına izin verildi

source: Check for nonce count replays in HTTP client
pt_br: Verifique se há repetições de contagem de nonce no cliente HTTP
tr: HTTP istemcisinde nonce sayısı yinelenmeleri denetlendi

source: Support SASL authentication in IRC proxy
pt_br: Suporte à autenticação SASL no proxy IRC
tr: IRC vekil sunucusunda SASL kimlik doğrulaması desteği eklendi

source: Several cleanups and minor fixes in the update manager
pt_br: Várias limpezas e pequenas correções no gerenciador de atualizações
tr: Güncelleme yöneticisinde birkaç temizlik ve küçük düzeltmeler yapıldı

source: Translation updates: German, Portuguese, Russian, Spanish, and Swedish
pt_br: Traduções atualizadas: alemão, espanhol, português, russo e sueco
tr: Çeviriler güncellendi: Almanca, Portekizce, Rusça, İspanyolca ve İsveççe

source: 0.9.7 Release
pt_br: Lançamento da versão 0.9.7
tr: 0.9.7 sürümü yayınlandı

source: 0.9.7 includes significant bug fixes and improvements.
pt_br: A versão 0.9.7 inclui correções de falhas e melhorias significativas.
tr: 0.9.7 sürümü önemli hata ayıklamaları ve geliştirmeler ile yayınlandı

source: For the first time, class 'N' routers (those with a minimumum of 128 KBytes/sec of shared bandwidth) will automatically become floodfill (previously it was only 'O' routers with 256 KBps). This will increase the floodfill population for additional resistance to certain attacks (see below). Floodfill routers don't consume much additional bandwidth, but they do tend to use additional memory and concurrent connections. If you do not wish your router to become floodfill, set the advanced configuration router.floodfillParticipant=false .
pt_br: Pela primeira vez, roteadores de classe 'N' (aqueles com um mínimo de 128 KBytes/seg de largura de banda compartilhada) se tornarão automaticamente floodfill (anteriormente eram apenas roteadores 'O' com 256 KBps). Isso aumentará a população de floodfill para resistência adicional a certos ataques (veja abaixo). Roteadores de floodfill não consomem muita largura de banda adicional, mas tendem a usar memória adicional e conexões simultâneas . Se você não deseja que seu roteador se torne floodfill, defina a configuração avançada router.floodfillParticipant=false .
tr: İlk kez, 'N' sınıfı yönelticiler (en az 128 KBayt/sn paylaşılan bant genişliği olanlar) otomatik olarak doldurulacak (önceden yalnızca 256 KBayt/sn 'O' sınıfı yönelticileriydi). Böylece, belirli saldırılara karşı ek direnç sağlamak için otomatik doldurma sayısı artmış olacak (aşağıya bakın). Otomatik doldurulan yönelticiler pek fazla ek bant genişliği tüketmezler, ancak ek bellek ve eşzamanlı bağlantı kullanma eğiliminde olurlar. Yönelticinizin otomatik doldurma amacıyla kullanılmasını istemiyorsanız, gelişmiş yapılandırma seçeneğini router.floodfillParticipant=false olarak ayarlayın.

source: As we think the last release fixed the experimental update-via-torrent bugs, 3%(pc)s of routers should update over in-network bittorrent this cycle.
pt_br: Como acreditamos que a última versão corrigiu os bugs experimentais de atualização via torrent, 3%(pc)s dos roteadores devem atualizar via bittorrent na rede neste ciclo.
tr: Güncel sürümün deneysel torrent ile güncelleme hatalarını düzelttiğini düşündüğümüzden, 3%(pc)s yöneltici bu döngüde ağ içi bittorrent üzerinden güncelleme yapmalıdır.

source: Plugin update checks, possibly broken for several releases, are fixed. Your plugins should once again auto-update after updating the router.
pt_br: Verificações de atualização de plugins, possivelmente quebradas para várias versões, foram corrigidas. Seus plugins devem novamente atualizar automaticamente após atualizar o roteador.
tr: Bazı sürümlerde bozulmuş olabilecek uygulama eki güncelleme denetimleri düzeltildi. Yönelticiyi güncelledikten sonra uygulama ekleriniz gene otomatik olarak güncellenmelidir.

source: We fixed a major streaming timer bug that contributed to frequent IRC disconnects.
pt_br: Corrigimos um grande bug do temporizador de streaming que contribuía para desconexões frequentes do IRC.
tr: Sık sık IRC bağlantılarının kesilmesine yol açan büyük bir akış zamanlayıcı hatası düzeltildi.

source: This release contains additional mitigations for the `"practical attacks" paper`__. However, we have a lot more work to do to resist Sybil attacks on the floodfills, and resist traffic analysis at the gateways and endpoints of exploratory tunnels. It's a good reminder for everybody that our network is still relatively small and vulnerable. We don't currently recommend any uses that would put anybody in serious jeopardy. We'll keep working to improve it... please keep working to spread the word. A bigger network is a better network.
pt_br: Esta versão contém mitigações adicionais para o artigo `"ataques práticos"`__. No entanto, temos muito mais trabalho a fazer para resistir aos ataques Sybil nos floodfills e resistir à análise de tráfego nos gateways e endpoints dos túneis exploratórios. É um bom lembrete para todos de que nossa rede ainda é relativamente pequena e vulnerável. Atualmente, não recomendamos nenhum uso que coloque alguém em sério risco. Continuaremos trabalhando para melhorá-lo... por favor, continuem trabalhando para espalhar a palavra. Uma rede maior é uma rede melhor.
tr: Bu sürümde, "pratik saldırılar" makalesinde'__ için ek zayıflatmalar bulunuyor. Bununla birlikte, otomatik doldurmaya yönelik Sybil saldırılarına karşı koymak ve keşif tünellerinin ağ geçitlerinde ve uç noktalarında yapılabilecek trafik incelemesini engellemek için daha yapacak çok işimiz var. Ağımızın hala nispeten küçük ve savunmasız olduğunu herkese hatırlatmak için iyi bir fırsat. Şu anda kimseyi ciddi tehlikeye atacak herhangi bir kullanım şeklini önermiyoruz. Bunu geliştirmek için çalışmayı sürdürebileceğiz... Lütfen çevrenize duyurmak için çalışmayı sürdürün. Daha büyük bir ağ daha iyi bir ağdır.

source: Anonymity Improvements
pt_br: Anonimato aperfeiçoado
tr: Anonimlik geliştirmeleri

source: End-to-end encryption of responses to leaseset lookups
pt_br: Criptografia de ponta a ponta de respostas a pesquisas de leaseset
tr: "Kiralama kümesi" (LeaseSet) aramalarına verilen yanıtlar uçtan uca şifrelendi

source: Expand floodfill pool by enabling class 'N' floodfills
pt_br: Expanda o pool de floodfill habilitando floodfills de classe 'N'
tr: 'N' sınıfı otomatik doldurma etkinleştirilerek otomatik doldurma havuzu genişletildi

source: Randomize padding inside encrypted SSU packets
pt_br: Randomizar preenchimento dentro de pacotes SSU criptografados
tr: Şifrelenmiş SSU paketlerinin içindeki dolgu rastgeleleştirildi

source: Preparation for better SSU protocol obfuscation
pt_br: Preparação para melhor ofuscação do protocolo SSU
tr: Daha iyi SSU iletişim kuralı gizlemesi için hazırlık yapıldı

source: Fix newer lease sets not getting stored or published
pt_br: Corrigir conjuntos de arrendamento mais recentes que não estão sendo armazenados ou publicados
tr: Depolanmayan veya yayınlanmayan yeni kiralama kümeleri düzeltildi

source: Fix classpath bug when used with 4-year-old installations, causing the console not to start
pt_br: Corrigir bug do classpath quando usado com instalações de 4 anos, fazendo com que o console não inicie
tr: 4 yaşındaki kurulumlarla kullanıldığında panonun başlamamasına neden olan sınıf yolu hatası düzeltildi

source: Fix addressbook database bug preventing update of the reverse index
pt_br: Corrigir bug do banco de dados do catálogo de endereços que impede a atualização do índice reverso
tr: Ters dizinin güncellenmesini engelleyen adres defteri veri tabanı hatası düzeltildi
