Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: 0.9.9 fixes a number of bugs in the netdb, streaming, and i2ptunnel, and starts work on a year-long plan to increase the strength of the cryptographic signing algorithms used in the router, and support multiple algorithms and key lengths simultaneously. Automatic update files will now be signed with 4096-bit RSA keys.
pt_br: 0.9.9 corrige uma série de bugs no netdb, streaming e i2ptunnel, e começa a trabalhar em um plano de um ano para aumentar a força dos algoritmos de assinatura criptográfica usados no roteador, e suportar múltiplos algoritmos e comprimentos de chave simultaneamente. Arquivos de atualização automática agora serão assinados com chaves RSA de 4096 bits.
tr: 0.9.9 sürümünde, "Ağ veri tabanı" (NetDB), akış ve i2ptunnel üzerindeki bir dizi hata düzeltildi. Ayrıca yönelticide kullanılan şifreleme imzalama algoritmalarının gücünü arttırarak aynı anda birden çok algoritmayı ve anahtar uzunluğunu desteklemek için yıllık plan üzerinde çalışılmaya başlandı. Otomatik güncelleme dosyaları artık 4096 bit RSA anahtarlarıyla imzalanacak.

source: We now support SSL between your router and your servers for security. See `this development thread`__ for more information.
pt_br: Agora oferecemos suporte a SSL entre seu roteador e seus servidores para segurança. Veja `este tópico de desenvolvimento`__ para mais informações.
tr: Artık güvenlik için yönelticiniz ve sunucularınız arasında SSL destekliyoruz. Ayrıntılı bilgi almak için `bu geliştirme konusuna`__ bakabilirsiniz.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release. Several members of the I2P team will be at 30C3 in Hamburg this year. Come say hello and ask for an I2P sticker. Thanks to everyone for their support this year.
pt_br: Como de costume, recomendamos que você atualize para esta versão. A melhor maneira de manter a segurança e ajudar a rede é executar a versão mais recente. Vários membros da equipe do I2P estarão no 30C3 em Hamburgo este ano. Venha dizer olá e peça um adesivo do I2P. Obrigado a todos pelo apoio este ano.
tr: Her zamanki gibi, bu sürüme güncellemeniz önerilir. Güvenliği sağlamanın ve ağa yardımcı olmanın en iyi yolu güncel sürümü çalıştırmaktır. I2P ekibinin birkaç üyesi bu yıl Hamburg'da 30C3 etkinliğinde olacak. Gelip merhaba deyin ve bir I2P çıkartması isteyin. Bu yılki destekleri için herkese teşekkürler.

source: Don't build client tunnels through zero-hop exploratory tunnels
pt_br: Não crie túneis de cliente por meio de túneis exploratórios de salto zero
tr: Sıfır duraklı keşif tünelleri aracılığıyla istemci tünelleri oluşturulması engellendi

source: New "su3" file support using stronger keys
pt_br: Novo suporte ao arquivo "su3" usando chaves mais fortes
tr: Daha güçlü anahtarlar kullanarak yeni "su3" dosya desteği sağlandı

source: Use su3 for updates
pt_br: Use su3 para atualizações
tr: Güncellemeler için su3 kullanıldı

source: Issues with losing data when closing streams
pt_br: Problemas com perda de dados ao fechar fluxos
tr: Akışlar kapatılırken oluşan veri kaybı sorunları düzeltildi

source: Fix various streaming connection limit issues
pt_br: Corrigir vários problemas de limite de conexão de streaming
tr: Çeşitli akış bağlantısı sınırlama sorunları düzeltildi

source: Issues with resource usage of closed connections
pt_br: Problemas com o uso de recursos de conexões fechadas
tr: Kapalı bağlantıların kaynak kullanımıyla ilgili sorunlar düzeltildi

source: Clean up timer threads in close-on-idle tunnels
pt_br: Limpar threads de timer em túneis fechados em modo ocioso
tr: Boşta kalan tünellerin zamanlayıcı iş parçacıkları temizlendi

source: Several other streaming fixes
pt_br: Várias outras correções de streaming
tr: Diğer birkaç akış düzeltmesi yapıldı

source: Reject more non-public IPv6 addresses
pt_br: Rejeitar mais endereços IPv6 não públicos
tr: Daha fazla herkese açık olmayan IPv6 adresi reddedildi

source: Fix IPv6 GeoIP
pt_br: Corrige o GeoIP para IPv6
tr: IPv6 GeoIP düzeltildi

source: Fix peer selection in first minutes after startup
pt_br: Corrigir seleção de pares nos primeiros minutos após a inicialização
tr: Başlangıçtan sonraki ilk dakikalarda eş seçimi düzeltildi

source: Several I2PTunnel bug fixes
pt_br: Várias correções de bugs do I2PTunnel
tr: Birkaç I2PTunnel hata düzeltmesi yapıldı

source: Fix major i2psnark DHT bug that prevented magnets from working well
pt_br: Corrigir o bug principal do i2psnark DHT que impedia que os ímãs funcionassem bem
tr: Magnet bağlantılarının iyi çalışmasını engelleyen büyük i2psnark "Dağıtılmış karma tablosu" (DHT) hatası düzeltildi

source: Fix client tunnels that fail due to name resolution failure at startup, particularly with b32 hostnames
pt_br: Corrigir túneis de cliente que falham devido a falha de resolução de nome na inicialização, especialmente com nomes de host b32
tr: Özellikle b32 sunucu adlarında, başlangıçta ad çözümleme hatası nedeniyle başarısız olan istemci tünelleri düzeltildi

source: Fix changing client i2ptunnel target list
pt_br: Corrigir alteração da lista de alvos do cliente i2ptunnel
tr: İstemci i2ptunnel hedef listesini değiştirme düzeltildi

source: Fix major bugs preventing reception of encrypted responses to leaseset lookups and verifies
pt_br: Corrigir os principais bugs que impedem o recebimento de respostas criptografadas para pesquisas e verificações de leaseset
tr: "Kiralama kümesi" (LeaseSet) aramaları ve doğrulamalarında şifrelenmiş yanıtların alınmasını önleyen büyük hatalar düzeltildi

source: Fix bad links on some i2psnark buttons in Opera and text-mode browsers
pt_br: Corrigir links inválidos em alguns botões i2psnark nos navegadores Opera e modo texto
tr: Opera ve metin kipli tarayıcılarda görülebilen i2psnark düğmelerindeki bozuk bağlantılar düzeltildi

source: Fix NPE in Susimail
pt_br: Corrigir NPE no Susimail
tr: Susimail üzerindeki NPE düzeltildi

source: Start work on supporting stronger signing keys in the router
pt_br: Comece a trabalhar no suporte de chaves de assinatura mais fortes no roteador
tr: Yönelticide daha güçlü imzalama anahtarlarının desteklenmesi için çalışmaya başlandı

source: Reduce thread usage for HTTP Server tunnels
pt_br: Reduzir o uso de threads para túneis do servidor HTTP
tr: HTTP sunucusu tünellerinin iş parçacığı kullanımı azaltıldı

source: Auto-stop update torrent after some time
pt_br: Parar atualização de torrent automaticamente após algum tempo
tr: Torrent güncellemesinin bir süre sonra otomatik olarak durdurulması sağlandı

source: Add ability to stop webapp via console
pt_br: Adicionar capacidade de parar webapp via console
tr: Pano üzerinden internet uygulaması durdurma yeteneği eklendi

source: New POST throttler in HTTP server tunnel
pt_br: Novo acelerador POST no túnel do servidor HTTP
tr: HTTP sunucu tüneline yeni POST kısıtlayıcı eklendi

source: Improve connection throttling
pt_br: Melhore a limitação da conexão
tr: Bağlantı kısıtlaması iyileştirildi

source: More work to reduce number of connections
pt_br: Mais trabalho para reduzir o número de conexões
tr: Bağlantı sayısını azaltmak için daha fazla çalışma yapıldı

source: Re-enable router info expiration job
pt_br: Reativar tarefa de expiração de informações do roteador
tr: Yöneltici bilgilerinin süresini sonlandıran iş yeniden etkinleştirildi

source: Extend router info expiration and other changes to reduce load on floodfills
pt_br: Estenda a expiração das informações do roteador e outras alterações para reduzir a carga em floodfills
tr: Otomatik doldurma yükünü azaltmak için yöneltici bilgilerinin sona erme süresi ve diğer değişiklikler uzatıldı

source: Support multiple servers through a single server tunnel
pt_br: Suporte a vários servidores por meio de um único túnel de servidor
tr: Tek bir sunucu tüneli üzerinden birden çok sunucunun desteklenmesi eklendi

source: Support specification of server port in i2ptunnel clients
pt_br: Especificação de suporte da porta do servidor em clientes i2ptunnel
tr: i2ptunnel istemcilerinde sunucu bağlantı noktası desteğinin teknik özellikleri belirlendi

source: Add support for SSL connections from i2ptunnel to external server
pt_br: Adicionar suporte para conexões SSL do i2ptunnel para servidor externo
tr: i2ptunnel üzerinden dış sunucuya SSL bağlantıları desteği eklendi

source: SSL and crypto code refactoring
pt_br: Retrabalho do código-fonte de criptografia e SSL
tr: SSL ve şifreleme kodu elden geçirildi

source: i2psnark storage code refactoring
pt_br: Refatoração de código de armazenamento i2psnark
tr: i2psnark depolama kodu elden geçirildi

source: New destination cache
pt_br: Novo cache de destino
tr: Yeni hedef ön belleği eklendi

source: Lots of code cleanup and resolution of findbugs warnings
pt_br: Muita limpeza de código e resolução de avisos de findbugs
tr: Çok sayıda kod temizlendi ve hata bulma uyarıları çözümlendi

source: New Japanese translation (partial)
pt_br: Nova tradução para o japonês (parcial)
tr: Japonca çevirisi eklendi (kısmen)

source: Translation updates: French, German, Italian, Romanian, Russian, Spanish, Swedish, and others
pt_br: Traduções atualizadas: alemão, espanhol, francês, italiano, romeno, russo, sueco e outros idiomas
tr: Çeviriler güncellendi: Fransızca, Almanca, İtalyanca, Rumence, Rusça, İspanyolca, İsveççe ve diğerleri

source: Wrapper 3.5.22 (new installs and PPA only)
pt_br: Encapsulador 3.5.22 (novas instalações e PPA apenas)
tr: Wrapper 3.5.22 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: ===================== Syndie 1.105b Release =====================
pt_br: =================================== Lançamento da versão 1.105b do Syndie ===================================
tr: ===================== Syndie 1.105b sürümü =====================

source: Update to HSQLDB 2.3.1
pt_br: Atualizar para HSQLDB 2.3.1
tr: HSQLDB 2.3.1 sürümüne güncellendi

source: This is the first stable release since February 2013. It is essentially the same as 1.104b-7-rc, with some translation updates.
pt_br: Esta é a primeira versão estável desde fevereiro de 2013. É essencialmente o mesmo que 1.104b-7-rc, com algumas atualizações de tradução.
tr: 2013 Şubat ayından bu yana yayınlanan ilk kararlı sürüm. Bazı çeviri güncellemeleri dışında 1.104b-7-rc ile aynıdır.

source: All binaries and source packages are at `syndie.de`_ and `syndie.i2p`_. Plugins are available at `plugins.i2p`_ and `stats.i2p`_.
pt_br: Todos os binários e pacotes de origem estão em `syndie.de`_ e `syndie.i2p`_. Os plugins estão disponíveis em `plugins.i2p`_ e `stats.i2p`_.
tr: Tüm binary dosyalar ve kaynak paketleri `syndie.de` ve `syndie.i2p`_ üzerindedir. Uygulama ekleri, `plugins.i2p`_ ve `stats.i2p`_ adreslerinde bulunabilir.

source: For those of you upgrading from 1.103b, you will find syndie startup and shutdown much faster due to the new version of HSQLDB.
pt_br: Para aqueles que estão atualizando da versão 1.103b, a inicialização e o desligamento do Syndie serão muito mais rápidos devido à nova versão do HSQLDB.
tr: 1.103b sürümünden yükseltenler için, yeni HSQLDB sürümü sayesinde, syndie başlatma ve kapatma işlemi çok daha hızlı yapılabilecek.

source: If you have a large database or an identity you wish to preserve, you may wish to back up your entire ~/.syndie directory before you start. The upgrade process does make its own backup, however you may find it easier to use your own backup if the upgrade fails.
pt_br: Se você tiver um banco de dados grande ou uma identidade que deseja preservar, talvez queira fazer um backup de todo o seu diretório ~/.syndie antes de começar. O processo de atualização faz seu próprio backup, no entanto, você pode achar mais fácil usar seu próprio backup se a atualização falhar.
tr: Korumak istediğiniz büyük bir veri tabanınız veya kimliğiniz varsa, başlamadan önce ~/.syndie klasörünü olduğu gibi yedeklemek isteyebilirsiniz. Yükseltme işlemi kendi yedeğini oluşturur, ancak yükseltme yapılamazsa kendi yedeğinizi kullanmanız daha kolay olabilir.

source: Upgrades from 1.103b may fail for some people due to database corruption due to bugs in the old HSQLDB. Unfortunately, we don't know how to fix it. Your alternatives are to start over with a clean database, or stay with 1.103b forever. Sorry about that.
pt_br: Atualizações da versão 1.103b podem falhar para algumas pessoas devido à corrupção do banco de dados devido a bugs no antigo HSQLDB. Infelizmente, não sabemos como consertar isso. Suas alternativas são começar do zero com um banco de dados limpo ou ficar com a versão 1.103b para sempre. Desculpe por isso.
tr: 1.103b sürümünden yükseltirken, bazı kullanıcılardaki eski HSQLDB hataları nedeniyle veri tabanı bozulabilir ve yükseltme yapılamayabilir. Ne yazık ki, bu sorunu nasıl düzelteceğimizi bilmiyoruz. Alternatifleriniz, temiz bir veri tabanıyla baştan başlamak veya sonsuza kadar 1.103b sürümünde kalmaktır. Bu durum için üzgünüz.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release.
pt_br: Como de costume, recomendamos que você atualize para esta versão. A melhor maneira de manter a segurança e ajudar a rede é executar a versão mais recente.
tr: Her zamanki gibi yeni sürüme güncellemeniz önerilir. Güvenliği korumanın ve ağa yardımcı olmanın en iyi yolu güncel sürümü kullanmaktır.

source: GUI Improvements and Fixes
pt_br: Melhorias na GUI e Correções
tr: Görsel kullanıcı arayüzü iyileştirmeleri ve düzeltmeler

source: Syndication
pt_br: Publicização
tr: Devretme

source: Database
pt_br: Banco de dados
tr: Veri tabanı

source: New translations
pt_br: Novas traduções
tr: Yeni çeviriler

source: Translation updates
pt_br: Traduções atualizadas
tr: Çeviri güncellemeleri

source: ============== 0.9.10 Release ==============
pt_br: ========================== Lançamento da versão 0.9.10 ==========================
tr: ===================== 0.9.10 sürümü yayınlandı =====================

source: 0.9.10 changes the mechanism for doing LeaseSet lookups, making it more difficult for an attacker to correlate a Destination with a Router.
pt_br: A versão 0.9.10 altera o mecanismo de realização de pesquisas de LeaseSet, tornando mais difícil para um invasor correlacionar um Destino com um Roteador.
tr: 0.9.10 sürümünde, "Kiralama kümesinde" (LeaseSet) arama yapma mekanizması değiştirilerek bir saldırganın, bir hedefi bir yöneltici ile ilişkilendirmesi zorlaştırıldı.

source: 0.9.10 changes the mechanism for doing LeaseSet lookups, making it more difficult for an attacker to correlate a Destination with a Router. It also fixes character encoding bugs in susimail, and includes lots of other bug fixes and translation updates. Most of you will update via torrent, using the new "su3" update format with stronger keys.
pt_br: 0.9.10 altera o mecanismo para fazer pesquisas LeaseSet, tornando mais difícil para um invasor correlacionar um Destino com um Roteador. Ele também corrige bugs de codificação de caracteres no susimail, e inclui muitas outras correções de bugs e atualizações de tradução. A maioria de vocês atualizará via torrent, usando o novo formato de atualização "su3" com chaves mais fortes.
tr: 0.9.10 sürümünde, "Kiralama kümesinde" (LeaseSet) arama yapma mekanizması değiştirilerek bir saldırganın, bir hedefi bir yöneltici ile ilişkilendirmesi zorlaştırıldı. Ayrıca susimail üzerinde düzeltilmiş karakter kodlama hataları ile birçok başka hata düzeltmesi ve çeviri güncellemeleri bulunuyor. Artık çoğu kullanıcı, daha güçlü anahtarlar kullanan yeni "su3" güncelleme biçimini kullanarak, torrent ile güncelleme yapacak.

source: We recently attended `30C3`__ and `Real World Crypto`__, making several new connections and formulating `big plans`__ for 2014. Thanks to those who supported our attendance with their `donations`__!
pt_br: Recentemente participamos do `30C3`__ e do `Real World Crypto`__, fazendo várias novas conexões e formulando `grandes planos`__ para 2014. Obrigado àqueles que apoiaram nossa participação com suas `doações`__!
tr: Kısa süre önce `30C3`__ ve `Real World Crypto`__ etkinliklerine katıldık. Birkaç yeni bağlantı kurduk ve 2014 için `büyük planlar`__ yaptık. `Bağışlarıyla`__ katılımımızı destekleyenlere teşekkürler!

source: Use client tunnels for LeaseSet lookups
pt_br: Use túneis de cliente para pesquisas LeaseSet
tr: "Kiralama kümesi" (LeaseSet) aramaları için istemci tünellerinin kullanılması sağlandı

source: Flood netdb stores to new location before midnight to prevent lookup fails after midnight
pt_br: Inundar os armazenamentos netdb em um novo local antes da meia-noite para evitar falhas de pesquisa após a meia-noite
tr: Gece yarısından sonra aramaların başarısız olmasını önlemek için "Ağ veri tabanı" (NetDB) depolarının gece yarısından önce yeni konuma taşınması sağlandı

source: Fix setting I2CP host/port in BOB
pt_br: Corrigir configuração de host/porta I2CP em BOB
tr: BOB üzerinde I2CP sunucu/bağlantı noktası ayarı düzeltildi

source: Fix several character encoding issues in susimail
pt_br: Corrigir vários problemas de codificação de caracteres no susimail
tr: Susimail üzerindeki birkaç karakter kodlama sorunu düzeltildi

source: Fix StandardServerSocket.close()
pt_br: Corrige StandardServerSocket.close()
tr: StandardServerSocket.close() düzeltildi

source: Fix exception in PrivateKeyFile
pt_br: Corrigir exceção em PrivateKeyFile
tr: PrivateKeyFile içindeki kural dışılık düzeltildi

source: Fixes in RouterInfo expiration task
pt_br: Correções na tarefa de expiração do RouterInfo
tr: "Yöneltici bilgileri" (RouterInfo) sona erme görevi düzeltildi

source: Tweaks to reduce number of peer connections
pt_br: Ajustes para reduzir o número de conexões de pares
tr: Eş bağlantı sayısını azaltmak için bazı değişiklikler yapıldı

source: Several threading fixes to reduce blocking in the timer queues
pt_br: Várias correções de encadeamento para reduzir o bloqueio nas filas do temporizador
tr: Zamanlayıcı kuyruklarında engellemeyi azaltmak için birkaç iş parçacığı düzeltildi

source: Disable streaming ping handling for clients
pt_br: Desabilitar o tratamento de ping de streaming para clientes
tr: İstemciler için akış ping işlemesi devre dışı bırakıldı

source: Use i2psnark's Kademlia library for the router netdb also
pt_br: Use a biblioteca Kademlia do i2psnark para o netdb do roteador também
tr: Yöneltici "Ağ veri tabanı" (NetDB) için ayrıca i2psnark Kademlia kitaplığı kullanıldı

source: Increase outbound exploratory default to 2 + 0-1 hops, part of gradual increase to 3 hops in/out
pt_br: Aumentar o padrão exploratório de saída para 2 + 0-1 saltos, parte do aumento gradual para 3 saltos de entrada/saída
tr: Giriş/çıkış için 3 durağa geçişin bir aşaması olarak, gidiş keşif varsayılanı 2 + 0-1 durak olarak arttırıldı

source: More findbugs fixes
pt_br: Mais correções de findbugs
tr: Bulunan hatalar düzeltildi

source: Streaming library refactoring
pt_br: Biblioteca de streamings refeita
tr: Akış kitaplığı kodu elden geçirildi

source: Support country-specific translations
pt_br: Suporte a traduções para idiomas com variantes nacionais
tr: Ülkeye özel çeviri desteği eklendi

source: New Brazilian Portuguese translation
pt_br: Tradução para mais um idioma: português brasileiro
tr: Brezilya Portekizcesi çevirisi eklendi

source: ============== 0.9.11 Release ==============
pt_br: ========================== Lançamento da versão 0.9.11 ==========================
tr: ===================== 0.9.11 sürümü yayınlandı =====================

source: 0.9.11 adds support for outproxy plugins, improves lease set lookup security, and reduces memory usage.
pt_br: A versão 0.9.11 adiciona suporte para plugins outproxy, melhora a segurança da pesquisa de conjuntos de arrendamento e reduz o uso de memória.
tr: 0.9.11 sürümünde, çıkış vekil sunucusu uygulama ekleri için destek, kiralama kümesi arama güvenliğinde iyileştirme ve azaltılmış bellek kullanımı gibi yenilikler bulunuyor.

source: 0.9.11 continues improving LeaseSet lookup and storage to prevent an attacker from correlating a Destination with a Router. It adds support for the %(orchid)s outproxy plugin which is available at %(url)s. There is a reduction in memory usage due to fixes in the transports. We have some I2CP protocol improvements that will provide better lookup facilities and authorization protection for external clients. Of course, there's also the usual collection of bug fixes. All users should update.
pt_br: 0.9.11 continua melhorando a pesquisa e o armazenamento do LeaseSet para evitar que um invasor correlacione um Destino com um Roteador. Ele adiciona suporte para o plugin outproxy %(orchid)s que está disponível em %(url)s. Há uma redução de no uso de memória devido a correções nos transportes. Temos algumas melhorias no protocolo I2CP que fornecerão melhores recursos de pesquisa e proteção de autorização para clientes externos. Claro, há também a coleção usual de correções de bugs. Todos os usuários devem atualizar.
tr: 0.9.11 sürümünde, bir saldırganın bir hedefi bir yöneltici ile ilişkilendirmesini önlemek için "Kiralama kümesi" (LeaseSet) arama ve depolamasındaki geliştirmeler sürdürülüyor. %(url)s adresinde bulunan %(orchid)s çıkış vekil sunucusu uygulama eki için destek eklendi. Taşıyıcılardaki düzeltmeler nedeniyle bellek kullanımında azalma sağlandı. Dış istemciler için daha iyi arama olanakları ve yetki koruması sağlayacak bazı I2CP iletişim kuralı geliştirmeleri yapıldı. Her zamanki gibi toplu hata düzeltmeleri de var. Tüm kullanıcılar bu sürüme güncellemelidir.

source: This may be the last release that works with Java 5, which is very old and unsupported. If you are using a Java 5 or 6 runtime, we strongly recommend that you upgrade to Java 7.
pt_br: Esta pode ser a última versão que funciona com Java 5, que é muito antigo e sem suporte. Se você estiver usando um runtime Java 5 ou 6, recomendamos fortemente que atualize para Java 7.
tr: Bu sürüm, artık çok eski olan ve desteklenmeyen Java 5 ile çalışan son sürüm olabilir. Java 5 veya 6 rumntime kullanıyorsanız, Java 7 sürümüne yükseltmeniz önemle önerilir.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release.
pt_br: Como de costume, recomendamos que você atualize para esse lançamento. A melhor maneira de manter a segurança e ajudar a rede é rodar a última versão lançada.
tr: Her zamanki gibi yeni sürüme güncellemeniz önerilir. Güvenliği korumanın ve ağa yardımcı olmanın en iyi yolu güncel sürümü kullanmaktır.

source: More leaseset handling improvements
pt_br: Mais melhorias no manuseio de leaseset
tr: "Kiralama kümesi" (LeaseSet) işleme üzerine daha fazla iyileştirme yapıldı

source: Fix NPE after client shutdown
pt_br: Corrigir NPE após desligamento do cliente
tr: İstemci kapatıldıktan sonra oluşan NPE düzeltildi

source: Fix wrapper log encoding on logs page
pt_br: Corrigir codificação de log do wrapper na página de logs
tr: Günlükler sayfasında sarmalayıcı günlük kodlaması düzeltildi

source: Streaming ping and I2Ping fixes
pt_br: Correções de ping de streaming e I2Ping
tr: Akış ping ve I2Ping düzeltmeleri yapıldı

source: Add support for Orchid plugin
pt_br: Adição de suporte a extensão Orchid
tr: Orchid uygulama eki desteği eklendi

source: Add HTTPS support to HTTP client proxy
pt_br: Adicionar suporte HTTPS ao proxy do cliente HTTP
tr: HTTP istemci vekil sunucusuna HTTPS desteği eklendi

source: New I2CP support for hostname lookups by external clients
pt_br: Novo suporte I2CP para pesquisas de nome de host por clientes externos
tr: Dış istemciler tarafından sunucu adı aramaları için yeni I2CP desteği sağlandı
