Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: * We met lots of people interested in our `Android app`__. We passed several ideas and bug reports back to str4d. We plan to make a big push to give the app some development love early in the year.
pt_br: * Conhecemos muitas pessoas interessadas em nosso `aplicativo Android`__. Passamos várias ideias e relatórios de bugs para str4d. Planejamos fazer um grande esforço para dar ao aplicativo um pouco de amor de desenvolvimento no começo do ano.
tr: * `Android uygulamamız`__ ile ilgilenen birçok insanla tanıştık. str4d birkaç fikir ve hata bildirimini aldık. Yıl başında uygulamayı geliştirmeye biraz şefkat göstermesi için büyük bir baskı yapmayı planlıyoruz.

source: * Regrettably, we didn't get to see too many talks at the Congress, as we were so busy meeting with people. We plan to catch up and `watch them online`__. As usual, Tor's "State of the Onion" talk was excellent, and Jacob's talk was great. We hear that the cryptography talks were good as well.
pt_br: * Infelizmente, não conseguimos ver muitas palestras no Congresso, pois estávamos muito ocupados nos encontrando com as pessoas. Planejamos nos encontrar e `assistir online`__. Como de costume, a palestra "State of the Onion" do Tor foi excelente, e a palestra do Jacob foi ótima. Ouvimos dizer que as palestras sobre criptografia também foram boas.
tr: * Kongrede ne yazık ki insanlarla tanışmakla meşgul olduğumuz için çok fazla konuşmayı izleyemedik. `Çevrimiçi izleyerek`__ gündemi yakalamayı planlıyoruz. Her zamanki gibi Tor "Onion Durumu" oturumu mükemmeldi ve Jacob harika konuştu. Şifreleme konuşmalarının da iyi olduğunu duyuyoruz.

source: ============== 0.9.18 Release ==============
pt_br: ============================= Lançamento da versão 0.9.18 =============================
tr: ===================== 0.9.18 sürümü yayınlandı =====================

source: 0.9.18 with performance improvements and bug fixes
pt_br: 0.9.18 com melhorias de desempenho e correções de bugs
tr: 0.9.18 sürümü başarım iyileştirmeleri ve hata düzeltmeleri ile yayınlandı

source: 0.9.18 contains several bug fixes and performance improvements. We have shortened the startup time, and reduced latency throughout our network protocols. We've increased the default connection limits for the fastest routers, and reduced the thread usage in i2ptunnel. UPnP fixes should improve handling of external device changes. CPU usage in high-bandwidth routers may be reduced thanks to some NTCP fixes.
pt_br: 0.9.18 contém várias correções de bugs e melhorias de desempenho. Reduzimos o tempo de inicialização e a latência em todos os nossos protocolos de rede. Aumentamos os limites de conexão padrão para os roteadores mais rápidos, e reduzimos o uso de threads no i2ptunnel. As correções de UPnP devem melhorar o tratamento de alterações de dispositivos externos. O uso da CPU em roteadores de alta largura de banda pode ser reduzido graças a algumas correções de NTCP.
tr: 0.9.18 sürümünde, çeşitli hata düzeltmeleri ve başarım iyileştirmeleri bulunuyor. Ağ iletişim kurallarının başlama süresi kısaltıldı ve gecikme azaltıldı. En hızlı yönelticiler için varsayılan bağlantı sınırları artırıldı, ve i2ptunnel üzerinde iş parçacıklarının kullanımı azaltıldı. UPnP düzeltmeleri, dış aygıt değişikliklerinin işlenmesi iyileşmiş olmalı. Bazı NTCP düzeltmeleri sayesinde yüksek bant genişliğine sahip yönelticilerde işlemci kullanımı azalmış olabilir.

source: Fix parsing of ECDSA address helper in HTTP client proxy
pt_br: Corrigir análise do auxiliar de endereço ECDSA no proxy do cliente HTTP
tr: HTTP istemci vekil sunucusunda ECDSA adres yardımcısının işlenmesi düzeltildi

source: Fix news last-modified processing which prevented notification of update
pt_br: Corrigir o processamento da última modificação de notícias que impedia a notificação de atualização
tr: Güncelleme bildirimini engelleyen haberlerin son değiştirilme zamanı işlenmesi düzeltildi

source: Improve handling of UPnP device changes
pt_br: Melhore o tratamento de alterações de dispositivos UPnP
tr: UPnP aygıt değişikliklerinin işlenmesi iyileştirildi

source: Don't hang at startup forever waiting for entropy
pt_br: Não fique parado na inicialização esperando a entropia para sempre
tr: Entropiyi sonsuza kadar beklemek için başlangıçta donma sorunu çözüldü

source: Possible fixes for high CPU usage in NTCP
pt_br: Possíveis correções para alto uso de CPU em NTCP
tr: NTCP üzerinde yüksek işlemci kullanımı için olası düzeltmeler yapıldı

source: Publish router info faster when address costs change
pt_br: Publique informações do roteador mais rapidamente quando os custos de endereço mudarem
tr: Adres maliyetleri değiştiğinde yöneltici bilgilerinin daha hızlı yayınlanması sağlandı

source: Start i2ptunnel 90s sooner
pt_br: Inicie o i2ptunnel 90s mais cedo
tr: i2ptunnel 90 saniye daha erken başlatıldı

source: Accept tunnels 10m sooner
pt_br: Aceitar túneis 10m mais cedo
tr: Tünellerin 10 dakika daha erken kabul edilmesi sağlandı

source: Increase exploratory tunnel quantity during initial exploration
pt_br: Aumentar a quantidade de túneis exploratórios durante a exploração inicial
tr: İlk keşif sırasında keşif tüneli sayısı artırıldı

source: Latency reductions in several places
pt_br: Reduções de latência em vários lugares
tr: Çeşitli yerlerde gecikmeler azaltıldı

source: Add startup browser configuration with advanced config routerconsole.browser
pt_br: Adicione a configuração do navegador de inicialização com a configuração avançada routerconsole.browser
tr: routerconsole.browser gelişmiş yapılandırma seçeneği ile başlangıç tarayıcı yapılandırması eklendi

source: Persistent leaseset keys to eliminate correlation with restart
pt_br: Chaves de leaseset persistentes para eliminar a correlação com a reinicialização
tr: Yeniden başlatma ile kaybolmasını önlemek için kalıcı "Kiralama kümesi" anahtarları eklendi

source: Faster unchoking of new peers in i2psnark
pt_br: Desbloqueio mais rápido de novos pares no i2psnark
tr: i2psnark üzerinde yeni eşlerin daha hızlı çözülmesi sağlandı

source: More aggressive throttling of lookups at floodfills
pt_br: Limitação mais agressiva de pesquisas em aterros sanitários
tr: Otomatik doldurmalarda aramaların daha saldırgan şekilde kısıtlanması sağlandı

source: Tunnel build request record refactoring
pt_br: Refatoração de registro de solicitação de construção de túnel
tr: Tünel oluşturma isteği kaydı kodu elden geçirildi

source: Reduce thread usage in i2ptunnel
pt_br: Reduzir o uso de threads no i2ptunnel
tr: i2ptunnel üzerinde iş parçacığı kullanımı azaltıldı

source: Add i2ptunnel server option for multihomed sites
pt_br: Adicionar opção de servidor i2ptunnel para sites multihomed
tr: Birden çok barındırması olan siteler için i2ptunnel sunucu seçeneği eklendi

source: Disallow some common I2P application ports as router ports
pt_br: Não permitir algumas portas de aplicativos I2P comuns como portas de roteador
tr: Yöneltici bağlantı noktaları olarak bazı yaygın I2P uygulama bağlantı noktalarına izin verildi

source: Increase connection limits for fast routers
pt_br: Aumente os limites de conexão para roteadores rápidos
tr: Hızlı yönelticiler için bağlantı sınırları artırıldı

source: Add Save-As button for SusiMail messages
pt_br: Adicionar botão Salvar como para mensagens SusiMail
tr: SusiMail iletileri için farklı kaydet düğmesi eklendi

source: Use 'hidden service' terminology in the console
pt_br: Use a terminologia de 'serviço oculto' no console
tr: Panoda 'gizli hizmet' kavramı kullanıldı

source: Encrypted netdb lookups for 32-bit x86
pt_br: Pesquisas netdb criptografadas para x86 de 32 bits
tr: 32 bit x86 için şifrelenmiş "Ağ veri tabanı" (NetDB) aramaları eklendi

source: ============== 0.9.19 Release ==============
pt_br: ============================= Lançamento da versão 0.9.19 =============================
tr: ===================== 0.9.19 sürümü yayınlandı =====================

source: 0.9.19 with performance improvements and bug fixes
pt_br: 0.9.19 com melhorias de desempenho e correções de bugs
tr: 0.9.19 sürümü başarım iyileştirmeleri ve hata düzeltmeleri ile yayınlandı

source: 0.9.19 has several fixes and improvements for floodfill performance. Many of you saw high CPU usage after 0.9.18 was released. This was caused by a combination of increased encryption usage, the big influx of Vuze users into the network, reduced floodfills due to tighter performance requirements, and some longstanding bugs. Things should be a lot better after most of the network has updated. As always, the best way to reduce CPU usage is to lower your bandwidth limits.
pt_br: 0.9.19 tem várias correções e melhorias para o desempenho do floodfill. Muitos de vocês viram alto uso da CPU após o lançamento do 0.9.18. Isso foi causado por uma combinação de aumento no uso de criptografia, o grande fluxo de usuários do Vuze na rede, floodfills reduzidos devido a requisitos de desempenho mais rígidos e alguns bugs de longa data. As coisas devem melhorar muito depois que a maior parte da rede for atualizada. Como sempre, a melhor maneira de reduzir o uso da CPU é diminuir seus limites de largura de banda.
tr: 0.9.19 sürümünde, otomatik doldurma başarımı için çeşitli düzeltmeler ve iyileştirmeler bulunuyor. 0.9.18 yayınlandıktan sonra çoğunuz işlemci kullanımının arttığını gördünüz. Bu durum, şifreleme kullanımının artması, Vuze kullanıcılarının ağa büyük girişi, daha sıkı başarım gereksinimleri nedeniyle azalan otomatik doldurmalar ve uzun süredir var olan bazı hataların bir araya gelmesinden kaynaklandı. Ağın çoğu güncellendikten sonra durumun çok daha iyi olmasını bekliyoruz. Her zaman olduğu gibi, işlemci kullanımını düşürmenin en iyi yolu bant genişliği sınırlarınızı azaltmaktır.

source: We've also added new ways to reseed manually, and to generate a reseed file you can easily share with others who need it. See the reseed configuration page in the router console for more information.
pt_br: Também adicionamos novas maneiras de repropagar manualmente e de gerar um arquivo de repropagação que você pode compartilhar facilmente com outras pessoas que precisam dele. Consulte a página de configuração de repropagação no console do roteador para obter mais informações.
tr: Ayrıca el ile yeniden tohumlamanın ve gerek duyan kişilerle kolayca paylaşılabilecek bir yeniden tohumlama dosyası oluşturmanın yeni yollarını eklendi. Ayrıntılı bilgi almak için yöneltici panosundaki yeniden tohumlama sayfasına bakabilirsiniz.

source: Floodfill performance improvements
pt_br: Melhorias no desempenho do Floodfill
tr: Otomatik doldurma başarımı iyileştirildi

source: Easier ways to reseed manually from a file or URL
pt_br: Maneiras mais fáceis de repropagar manualmente a partir de um arquivo ou URL
tr: Bir dosya veya adresten el ile yeniden tohumlamanın daha kolay yolları eklendi

source: New way to export reseed data for others
pt_br: Nova maneira de exportar dados de reseed para outros
tr: Başkaları için yeniden tohumlama verilerini dışa aktarmanın yeni yolu eklendi

source: Support for installing plugin from file
pt_br: Suporte para instalação de plugin a partir de arquivo
tr: Dosyadan uygulama eki kurma desteği eklendi

source: Fixes for high CPU usage in floodfills
pt_br: Correções para alto uso de CPU em floodfills
tr: Otomatik doldurmalarda yüksek işlemci kullanımı düzeltildi

source: i2ptunnel locking fixes
pt_br: Correções de bloqueio do i2ptunnel
tr: i2ptunnel kilitlenmeleri düzeltildi

source: Fixes for read timeout handling in streaming
pt_br: Correções para tratamento de tempo limite de leitura em streaming
tr: Akışta okuma zaman aşımının işlenmesi düzeltildi

source: Fix changing i2psnark data directory on Windows
pt_br: Corrigir alteração do diretório de dados i2psnark no Windows
tr: Windows üzerinde i2psnark veri klasörünün değiştirilmesi düzeltildi

source: Fix multiple SSL outproxies in HTTP client
pt_br: Corrigir vários outproxies SSL no cliente HTTP
tr: HTTP istemcisinde birden çok SSL çıkış vekil sunucusu olması düzeltildi

source: Update to UPnP library version 3.0
pt_br: Atualização para a versão 3.0 da biblioteca UPnP
tr: UPnP kitaplığı 3.0 sürümüne güncellendi

source: Improve tracking of floodfill lookup success
pt_br: Melhore o rastreamento do sucesso da pesquisa de floodfill
tr: Otomatik doldurma arama başarısının izlenmesi iyileştirildi

source: Direct router info lookups if connected to floodfill
pt_br: Pesquisas diretas de informações do roteador se conectado ao floodfill
tr: Otomatik doldurma bağlıysa doğrudan yöneltici bilgi aramaları eklendi

source: Auto-adjustment of i2psnark tunnel quantity
pt_br: Ajuste automático da quantidade de túneis i2psnark
tr: i2psnark tünel sayısının otomatik olarak ayarlanması sağlandı

source: Increase exploratory tunnel quantity when floodfill
pt_br: Aumentar a quantidade de túneis exploratórios quando houver aterro
tr: Otomatik doldurmada keşif tüneli sayısı artırıldı

source: Increase min and default bandwidth for i2psnark
pt_br: Aumentar a largura de banda mínima e padrão para i2psnark
tr: i2psnark için en düşük ve varsayılan bant genişliği artırıldı

source: Improved strategies for dropping jobs on high job lag to prevent overload
pt_br: Estratégias aprimoradas para descartar trabalhos com alto atraso para evitar sobrecarga
tr: Aşırı yüklenmeyi önlemek için yüksek görev gecikmesinde görevlerin bırakılması için stratejiler iyileştirildi

source: Drop tunnel build requests on high job lag
pt_br: Solte solicitações de construção de túnel em caso de alto atraso de trabalho
tr: Yüksek görev gecikmesinde tünel oluşturma isteklerinin bırakılması sağlandı

source: Increase allowed clock skew in I2CP
pt_br: Aumentar o desvio de clock permitido no I2CP
tr: Yüksek görev gecikmesinde tünel oluşturma isteklerinin bırakılması sağlandı

source: New HTTP error page when the server resets the connection
pt_br: Nova página de erro HTTP quando o servidor reinicia a conexão
tr: Sunucu bağlantıyı sıfırladığında görüntülenecek yeni HTTP hata sayfası eklendi

source: Require ECDSA support for floodfill
pt_br: Exigir suporte do ECDSA para aterro de inundação
tr: Otomatik doldurma için ECDSA desteği zorunlu kılındı

source: Republish router info faster when capabilities change
pt_br: Republique as informações do roteador mais rapidamente quando os recursos mudarem
tr: Yetenekler değiştiğinde yöneltici bilgilerinin daha hızlı yeniden yayınlanması sağlandı

source: Better feedback in console for reseed errors
pt_br: Melhor feedback no console para erros de reseed
tr: Yeniden tohumlama hataları için panoya daha iyi geri bildirim eklendi

source: ============== 0.9.20 Release ==============
pt_br: ============== Lançamento 0.9.20 ==============
tr: ====================== 0.9.20 sürümü yayınlandı ======================

source: 0.9.20 with performance improvements and bug fixes
pt_br: 0.9.20 com melhorias de desempenho e correções de bugs
tr: 0.9.20 sürümü başarım iyileştirmeleri ve hata düzeltmeleri ile yayınlandı

source: 0.9.20 contains many important bug fixes, and several changes to increase floodfill capacity in the network.
pt_br: A versão 0.9.20 contém muitas correções de bugs importantes e diversas alterações para aumentar a capacidade de floodfill na rede.
tr: 0.9.20 sürümünde, birçok önemli hata düzeltmesi ve ağdaki otomatik doldurma kapasitesini artıracak çeşitli değişiklikler bulunuyor.

source: Routers configured for 32-64 KB of shared bandwidth may now become floodfill, and routers configured for 512 KB or more of shared bandwidth will have higher connection limits. These changes may cause your router to use more resources. If the router becomes too busy, the best way to reduce usage is to lower the bandwidth settings in your console. If that doesn't help, you may now disable automatic floodfill on the advanced configuration page in the console.
pt_br: Roteadores configurados para 32-64 KB de largura de banda compartilhada agora podem se tornar floodfill, e roteadores configurados para 512 KB ou mais de largura de banda compartilhada terão limites de conexão mais altos. Essas alterações podem fazer com que seu roteador use mais recursos. Se o roteador ficar muito ocupado, a melhor maneira de reduzir o uso é diminuir as configurações de largura de banda no seu console. Se isso não ajudar, agora você pode desabilitar o floodfill automático na página de configuração avançada no console.
tr: 32-64 KB paylaşılan bant genişliği için yapılandırılmış yönelticiler artık otomatik doldurma yapabilir. 512 KB veya daha fazla paylaşılan bant genişliği için yapılandırılmış yönelticilerin bağlantı sınırları daha yüksek olacak. Bu değişiklikler yönelticinin daha fazla kaynak kullanmasına neden olabilir. Yöneltici çok meşgul olursa, kullanımı azaltmanın en iyi yolu panonuzdan bant genişliği ayarlarını düşürmektir. Bu işe yaramazsa, panoya yeni eklenmiş olan gelişmiş yapılandırma bölümünden otomatik doldurma özelliğini devre dışı bırakabilirsiniz.

source: We're hopeful that these changes will increase network capacity and performance, and reduce the congestion that's been affecting the network the last three months.
pt_br: Esperamos que essas mudanças aumentem a capacidade e o desempenho da rede, e reduzam o congestionamento que vem afetando a rede nos últimos três meses.
tr: Bu değişikliklerin ağ kapasitesi ve başarımını artırarak son üç aydır ağı etkileyen tıkanıklığı azaltacağını umuyoruz.

source: Finally, we're excited to announce our first-ever I2P meetup, in Toronto August 15-16. There will be lots of presentations and tutorials. All are welcome. For more information, see the `announcement`_.
pt_br: Por fim, estamos animados em anunciar nosso primeiro encontro I2P, em Toronto, de 15 a 16 de agosto. Haverá muitas apresentações e tutoriais. Todos são bem-vindos. Para mais informações, veja o `announcement`_.
tr: Son olarak, 15-16 Ağustos tarihlerinde Toronto'daki ilk I2P buluşmamızı duyurmaktan heyecan duyuyoruz. Çok sayıda sunum ve eğitim olacak. Hepinizi bekleriz. Ayrıntılı bilgi almak için `duyurular`_ bölümüne bakabilirsiniz.

source: Add support for address book export
pt_br: Adicionar suporte para exportação de catálogo de endereços
tr: Adres defterini dışa aktarma desteği eklendi

source: Add support for SSL in HTTP server tunnel
pt_br: Adicionar suporte para SSL no túnel do servidor HTTP
tr: HTTP sunucu tüneline SSL desteği eklendi

source: Allow class 'M' (64-128 KBps share bandwidth) to become floodfill
pt_br: Permitir que a classe 'M' (largura de banda compartilhada de 64-128 KBps) se torne floodfill
tr: 'M' sınıfının (64-128 KBps bant genişliği paylaşan) otomatik doldurma yapması sağlandı

source: Raise connection limits for new classes 'P' (512-2000 KBps share bandwidth) and 'X' (over 2000 KBps)
pt_br: Aumentar os limites de conexão para as novas classes 'P' (512-2000 KBps compartilham largura de banda) e 'X' (acima de 2000 KBps)
tr: Yeni 'P' (512-2000 KBps bant genişliği paylaşan) ve 'X' (2000 KBps üzerinde paylaşan) sınıfları için bağlantı sınırları yükseltildi

source: Add support for signed development builds
pt_br: Adicionar suporte para compilações de desenvolvimento assinadas
tr: İmzalanmış geliştirme yapıları için destek eklendi

source: Clock skew fixes
pt_br: Correções de distorção do relógio
tr: Saat sapması düzeltmeleri yapıldı

source: Fixes and configuration for when IPv4 is firewalled but IPv6 still works
pt_br: Correções e configurações para quando o IPv4 está protegido por firewall, mas o IPv6 ainda funciona
tr: IPv4 için güvenlik duvarı bulunan ancak IPv6 ile erişilebilen durumlar için düzeltmeler ve yapılandırma üzerinde çalışıldı

source: Locking fixes for i2ptunnel clients to prevent hangs at startup
pt_br: Correções de bloqueio para clientes i2ptunnel para evitar travamentos na inicialização
tr: Başlangıç kilitlenmelerini önlemek için i2ptunnel istemcilerinde kilitleme düzeltmeleri yapıldı

source: Verify hostnames when reseeding
pt_br: Verifique os nomes de host ao repropagar
tr: Yeniden tohumlama sırasında sunucu adlarının doğrulanması eklendi

source: Fix deletion of config files for deleted torrents in i2psnark
pt_br: Corrigir exclusão de arquivos de configuração para torrents excluídos no i2psnark
tr: i2psnark üzerinden silinen torrentler için yapılandırma dosyalarının silinmesi düzeltildi

source: Fix hangs fetching proxy.i2p local resources via Privoxy
pt_br: Corrigir travamentos ao buscar recursos locais proxy.i2p via Privoxy
tr: Privoxy aracılığıyla proxy.i2p yerel kaynakları alınırken kilitlenme sorunu düzeltildi

source: Fixes for duplicate shared clients
pt_br: Correções para clientes compartilhados duplicados
tr: Yinelenen paylaşılmış istemciler için düzeltmeler yapıldı

source: Fix for occasional page truncation in HTTP client
pt_br: Correção para truncamento ocasional de página no cliente HTTP
tr: HTTP istemcisinde ara sıra görülen sayfa budanması düzeltildi

source: Fixes for handling corrupted SSU packets
pt_br: Correções para lidar com pacotes SSU corrompidos
tr: Bozuk SSU paketlerinin işlenmesinde düzeltmeler yapıldı

source: Fix closing of SAM sessions when I2P session closes
pt_br: Corrigir o fechamento de sessões SAM quando a sessão I2P fecha
tr: I2P oturumu kapatıldığında SAM oturumlarının kapatılması düzeltildi

source: Fix bugs in handling streaming resets
pt_br: Corrigir bugs no tratamento de redefinições de streaming
tr: Akış sıfırlamalarının işlenmesindeki hatalar düzeltildi

source: Reduce NTCP threads
pt_br: Reduzir threads NTCP
tr: NTCP iş parçacıkları azaltıldı

source: Eliminate SimpleScheduler threads
pt_br: Elimine os threads do SimpleScheduler
tr: SimpleScheduler iş parçacıkları ortadan kaldırıldı

source: Add continent-based NTP servers as fallbacks for country-based ones
pt_br: Adicionar servidores NTP baseados em continentes como fallbacks para servidores baseados em países
tr: Ülkelerdeki NTP sunucularının yedeği olarak kıta sunucuları eklendi

source: Remove all default non-SSL reseed hosts
pt_br: Remover todos os hosts de reseed não SSL padrão
tr: Varsayılan olarak SSL kullanmayan yeniden tohumlanmış sunucuların tümü kaldırıldı

source: Disable fallback to non-su3 reseeding
pt_br: Desabilitar fallback para reseeding não su3
tr: Su3 olmayan yeniden tohumlamaya geri dönüş devre dışı bırakıldı

source: Several fixes in streaming for better "loopback" performance
pt_br: Várias correções no streaming para melhor desempenho de "loopback"
tr: Daha iyi "loopback" başarımı için akışta çeşitli düzeltmeler yapıldı

source: Reduce latency in i2ptunnel
pt_br: Reduzir latência no i2ptunnel
tr: i2ptunnel üzerinde gecikme azaltıldı

source: Add a larger Bloom filter for very high bandwidth and memory
pt_br: Adicione um filtro Bloom maior para largura de banda e memória muito altas
tr: Çok yüksek bant genişliği ve bellek için daha büyük bir Bloom süzgeci eklendi

source: Add Bloom filter warning when configured for high bandwidth but not enough memory
pt_br: Adicionar aviso de filtro Bloom quando configurado para alta largura de banda, mas sem memória suficiente
tr: Bloom süzgeci yüksek bant genişliği için yapılandırıldığında ancak yeterli bellek bulunmadığında bir uyarı eklendi

source: Reduce max netdb search depth to reduce floodfill load
pt_br: Reduza a profundidade máxima de pesquisa do netdb para reduzir a carga de floodfill
tr: Otomatik doldurma yükünü azaltmak için en fazla "Ağ veri tabanı" (NetDB) arama derinliğini azaltıldı

source: Improved header processing and error handling in i2ptunnel HTTP server
pt_br: Processamento de cabeçalho e tratamento de erros aprimorados no servidor HTTP i2ptunnel
tr: i2ptunnel HTTP sunucusunda üst bilgilerin ve hataların işlenmesi iyileştirildi
