Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: We became aware of I2P in early 2022 when talking to people in the Tor community, and liked what the project was doing. It seemed similar to Tor.
pt_br: Ficamos sabendo do I2P no início de 2022 quando conversamos com pessoas na comunidade Tor e gostamos do que o projeto estava fazendo. Parecia similar ao Tor.
tr: 2022 başlarında Tor topluluğundaki insanlarla konuşurken I2P projesinin farkına vardık ve yaptıklarını beğendik. Tor projesine benziyordu.

source: During our introduction to I2P and its capabilities, we saw the need for a reliable outproxy. We had really great support from people in the I2P community to create and start providing the outproxy service.
pt_br: Durante nossa introdução ao I2P e suas capacidades, vimos a necessidade de um outproxy confiável. Tivemos um suporte realmente ótimo de pessoas na comunidade I2P para criar e começar a fornecer o serviço outproxy.
tr: I2P ve yeteneklerine girişimiz sırasında güvenilir bir çıkış vekil sunucusuna gerek olduğunu gördük. Çıkış vekil sunucusu hizmetini kurmak ve işletmeye başlamak için I2P topluluğundaki insanlardan gerçekten büyük destek aldık.

source: I am always curious about first impressions and what resources we can provide or improve on for people who are getting started with I2P. What can you tell me about your experience and suggestions for onboarding?
pt_br: Estou sempre curioso sobre as primeiras impressões e quais recursos podemos fornecer ou melhorar para pessoas que estão começando com I2P. O que você pode me contar sobre sua experiência e sugestões para integração?
tr: Her zaman ilk izlenimleri ve I2P uygulamasını kullanmaya yeni başlayanlara hangi kaynakları sağlayabileceğimizi veya geliştirebileceğimizi merak etmiştim. Deneyimleriniz ve başlama önerileriniz hakkında bana neler söyleyebilirsiniz?

source: Make it easy to replicate or understand for people with limited IT knowledge or knowledge of I2P. Using the router, or even using email on I2P should be easy for everybody.
pt_br: Facilite a replicação ou o entendimento para pessoas com conhecimento limitado de TI ou conhecimento de I2P. Usar o roteador, ou mesmo usar e-mail em I2P deve ser fácil para todos.
tr: Sınırlı BT bilgisi veya I2P bilgisi olan kişiler için çoğaltmayı veya anlamayı kolaylaştırın. Yönelticiyi kullanmak, hatta I2P üzerinde e-posta kullanmak herkes için kolay bir iş olmalıdır.

source: Conclusion
pt_br: Conclusão
tr: Sonuç

source: The need for awareness about surveilling what should be private in our online lives is ongoing. Collecting any data should be consensual , and privacy should be implicit.
pt_br: A necessidade de conscientização sobre a vigilância do que deve ser privado em nossas vidas online é contínua. A coleta de quaisquer dados deve ser consensual, e a privacidade deve ser implícita.
tr: Çevrimiçi hayatımızda nelerin kişisel olması gerektiğini gözetme konusunda farkındalık gereksinimi sürüyor. Herhangi bir verinin toplanması rızaya dayalı olmalı ve kişisel gizlilik korunmalıdır.

source: Where we cannot trust that our traffic or communication will not be observed without consent, we thankfully have access to networks that will by-design anonymize traffic and hide our locations.
pt_br: Onde não podemos confiar que nosso tráfego ou comunicação não serão observados sem consentimento, felizmente temos acesso a redes que irão, por padrão, tornar o tráfego anônimo e ocultar nossas localizações.
tr: Neyse ki, trafiğimizin veya iletişimimizin rızamız olmadan gözlemlenmeyeceğine güvenemediğimiz durumlarda, tasarımı gereği trafiği anonimleştirecek ve konumlarımızı gizleyecek ağlara erişimimiz var.

source: Thank you to StormyCloud and everyone who provides outproxies or nodes for Tor and I2P so that people can access the internet more safely when they need to. I look forward to more people bridging the capabilities of these complementary networks to create a more robust privacy ecosystem for everyone.
pt_br: Obrigado à StormyCloud e a todos que fornecem outproxies ou nós para Tor e I2P para que as pessoas possam acessar a internet com mais segurança quando precisarem. Espero que mais pessoas conectem as capacidades de essas redes complementares para criar um ecossistema de privacidade mais robusto para todos.
tr: StormyCloud kuruluşuna ve insanların gerek duyduklarında internete daha güvenli bir şekilde erişebilmeleri için Tor ve I2P çıkış vekil sunucuları veya aktarıcıları sağlayan herkese teşekkür ederiz. Herkes için daha sağlam bir kişisel gizlilik ekosistemi oluşturmak amacıyla, bu tamamlayıcı ağların yetenekleri arasında köprü kuran daha fazla insanı sabırsızlıkla bekliyorum.

source: Learn more about StormyCloud Inc.’s services https://stormycloud.org/ and help support their work by making a donation https://stormycloud.org/donate/.
pt_br: Saiba mais sobre os serviços da StormyCloud Inc. https://stormycloud.org/ e ajude a apoiar seu trabalho fazendo uma doação https://stormycloud.org/donate/.
tr: StormyCloud Inc. kuruluşunun hizmetleri hakkında ayrıntılı bilgi almak için https://stormycloud.org/ sitesine bakabilirsiniz. https://stormycloud.org/donate/ adresinden bağış yaparak bu çalışmalara destek olabilirsiniz.

source: Windows Easy-Install Bundle 1.9.5 Release
pt_br: Lançamento do pacote Windows Easy-Install 1.9.5
tr: Windows kolay kurulum paketi 1.9.5 sürümü

source: Windows Easy-Install Bundle 1.9.5
pt_br: Pacote de instalação fácil do Windows 1.9.5
tr: Windows kolay kurulum paketi 1.9.5

source: Bug Fixing release for Windows 11 users
pt_br: Lançamento de correção de bugs para usuários do Windows 11
tr: Windows 11 kullanıcıları için hata düzeltme sürümü

source: This point release includes a bug fix in the included I2P router, which resolves a highly obscure bug where the context clock is out of sync with the clock in use by the File System, resulting in a router which is unable to read the current state of it's own NetDB. Although this bug has only been observed on Windows 11 so far, it is highly recommended that all users update to the new build.
pt_br: Este lançamento pontual inclui uma correção de bug no roteador I2P incluso, que resolve um bug altamente obscuro onde o relógio de contexto está fora de sincronia com o relógio em uso pelo Sistema de Arquivos, resultando em um roteador que não consegue ler o estado atual de seu próprio NetDB. Embora esse bug tenha sido observado apenas no Windows 11 até agora, é altamente recomendável que todos os usuários atualizem para a nova compilação.
tr: Bu sürüm, içindeki I2P yönelticisinde bağlam saatinin dosya sistemi tarafından kullanılan saat ile eşitlenmediği ve yönelticinin kendi ağ veri tabanının geçerli durumunu okuyamamasıyla sonuçlanan oldukça belirsiz bir hatayı düzeltir. Bu hata şimdiye kadar yalnızca Windows 11 üzerinde gözlemlenmiş olsa da, tüm kullanıcıların yeni yapıya güncellemesi önemle önerilir.

source: This release also features faster startup and times improved stability in the profile manager.
pt_br: Esta versão também apresenta inicialização mais rápida e estabilidade aprimorada no gerenciador de perfil .
tr: Bu sürüm ayrıca daha hızlı başlatma ve profil yöneticisinde geliştirilmiş kararlılık ve hız sunar.

source: ================================== A Reminder to be Safe as I2P Grows ==================================
pt_br: =================================== Um lembrete para estar seguro conforme o I2P cresce ===================================
tr: ============================================ I2P büyürken güvende kalmanız için bir hatırlatma ============================================

source: A Reminder to be Safe as I2P Grows
pt_br: Um lembrete para estar seguro à medida que o I2P cresce
tr: I2P büyürken güvende kalmanız için bir hatırlatma

source: It is an an exciting time for The Invisible Internet Project (I2P). We are completing our migration to modern cryptography across all of our transports, ( Java and C++), and we have recently gained a high-capacity and professional outproxy service, and there are more applications integrating I2P based functionality than ever. The network is poised to grow, so now is a good time to remind everyone to be smart and be safe when obtaining I2P and I2P-related software. We welcome new applications, implementations, and forks with new ideas, and the power of the network comes from its openness to participation by all I2P users. In fact, we don’t like to call you users, we like to use the word “Participants” because each of you helps the network, in your own way by contributing content, developing applications, or simply routing traffic and helping other participants find peers.
pt_br: É um momento emocionante para o The Invisible Internet Project (I2P). Estamos concluindo nossa migração para criptografia moderna em todos os nossos transportes (Java e C++), e recentemente ganhamos um serviço de outproxy profissional e de alta capacidade, e há mais aplicativos integrando funcionalidades baseadas em I2P do que nunca. A rede está pronta para crescer, então agora é um bom momento para lembrar a todos que sejam inteligentes e seguros ao obter software I2P e relacionado a I2P. Damos boas-vindas a novos aplicativos, implementações e bifurcações com novas ideias, e o poder da rede vem de sua abertura à participação de todos os usuários do I2P. Na verdade, não gostamos de chamá-los de usuários, gostamos de usar a palavra "Participantes" porque cada um de vocês ajuda a rede, à sua maneira, contribuindo com conteúdo, desenvolvendo aplicativos ou simplesmente roteando tráfego e ajudando outros participantes a encontrar pares.
tr: Invisible İnternet Projesi (I2P) için heyecan verici bir zaman. Tüm taşıyıcılarmızda (Java ve C++) modern şifrelemeye geçişimizi tamamlıyoruz ve yakın zamanda yüksek kapasiteli ve profesyonel bir çıkış vekil sunucusu hizmetine kavuştuk. I2P tabanlı işlevselliği her zamankinden daha fazla bütünleşik olarak kullanan bir çok uygulama var. Ağ büyümeye hazır. Bu nedenle şimdi herkese I2P uygulamasını ve I2P ile ilgili yazılımları kullanırken akıllı ve güvende olmalarını hatırlatmanın tam zamanı. Yeni uygulamaları, uyarlamaları ve yeni fikirler dallarını memnuniyetle karşılıyoruz ve ağın gücü, tüm I2P kullanıcılarının katılımına açık olmasından geliyor. Aslında, size kullanıcı demekten hoşlanmıyoruz, "Katılımcılar" sözcüğünü kullanmayı seviyoruz çünkü her biriniz içerik katkısında bulunarak, uygulamalar geliştirerek ya da yalnızca trafiği yönelterek ve diğer katılımcıların eşleri bulmasına yardımcı olarak ağa kendi yönteminizle katkıda bulunuyorsunuz.

source: You are the network, and we want you to be safe.
pt_br: Você é a rede e queremos que você esteja seguro.
tr: Ağı sizler oluşturuyorsunuz ve güvende olmanı istiyoruz.

source: We have become aware of attempts to impersonate I2P’s presence on the web and social media. To avoid offering momentum to these campaigns, we will not mention the actors affiliated with them, However, in order to help you recognize these campaigns should you encounter them in the wild, we are documenting their tactics:
pt_br: Tomamos conhecimento de tentativas de personificar a presença do I2P na web e nas mídias sociais. Para evitar dar força a essas campanhas, não mencionaremos os atores afiliados a elas. No entanto, para ajudar você a reconhecer essas campanhas caso as encontre na prática, estamos documentando suas táticas:
tr: İnternet ve sosyal ağlar üzerinde I2P projesini taklit etme girişimleri olduğunu farkettik. Bu kampanyalara ivme kazandırmaktan kaçınmak için, bunlarla bağlantılı aktörlerden bahsetmeyeceğiz, Ancak, vahşi doğada bu kampanyalarla karşılaşırsanız, tanımanıza yardımcı olmak için taktiklerini belgeliyoruz:

source: These campaigns have had the side-effect of “shadow-banning” some legitimate I2P-related discussion on Twitter and possibly other social media.
pt_br: Essas campanhas tiveram o efeito colateral de “banir” algumas discussões legítimas relacionadas ao I2P no Twitter e possivelmente em outras mídias sociais.
tr: Bu kampanyalar, Twitter ve diğer sosyal ağlar üzerinde I2P ile ilgili bazı meşru tartışmaları "gölge yasaklama" yan etkisine sahipti.

source: Our Sites
pt_br: Nossos Sites
tr: Sitelerimiz

source: We have official sites where people may obtain the I2P software safely:
pt_br: Temos sites oficiais onde as pessoas podem obter o software I2P com segurança:
tr: I2P uygulamasını güvenli bir şekilde edinebileceğiniz resmi sitelerimiz var:

source: Official Website - i2p.net
pt_br: Site oficial - i2p.net
tr: Resmi site - i2p.net

source: Official Website - geti2p.net
pt_br: Site oficial - geti2p.net
tr: Resmi site - geti2p.net

source: Official Gitlab - i2pgit.org
pt_br: Gitlab oficial - i2pgit.org
tr: Resmi GitLab - i2pgit.org

source: Official Debian Repository - deb.i2p2.de
pt_br: Repositório oficial do Debian - deb.i2p2.de
tr: Resmi Debian deposu - deb.i2p2.de

source: Official Debian Repository - deb.i2p2.no
pt_br: Repositório oficial do Debian - deb.i2p2.no
tr: Resmi Debian deposu - deb.i2p2.no

source: Official Forums - i2pforum.net
pt_br: Fóruns oficiais - i2pforum.net
tr: Resmi forumlar - i2pforum.net

source: Invisible Internet Project Forums, Blogs and Social Media
pt_br: Fóruns, blogs e mídias sociais do Invisible Internet Project
tr: Invisible Internet projesi forumları, günlükleri ve sosyal ağları

source: Hosted by the project
pt_br: Hospedado pelo projeto
tr: Proje tarafından barındırılan

source: I2P Forums
pt_br: Fóruns I2P
tr: I2P forumları

source: Hosted by Others
pt_br: Hospedado por outros
tr: Başkaları tarafından barındırılan

source: These services are hosted by third-parties, sometimes corporations, where we participate in order to provide a social media outreach presence to I2P users who choose to participate in them. We will never ask you to participate in these unless you already have an account with them, prior to interacting with us.
pt_br: Esses serviços são hospedados por terceiros, às vezes corporações, dos quais participamos para fornecer uma presença de alcance nas mídias sociais aos usuários do I2P que optarem por participar deles. Nunca pediremos que você participe deles, a menos que já tenha uma conta neles antes de interagir conosco.
tr: Bu hizmetler, katılmayı seçen I2P kullanıcılarına sosyal ağ üzerinde erişilecek bir yer sağlamak için katıldığımız üçüncü taraflar, bazen de şirketler tarafından barındırılmaktadır. Bizimle etkileşime geçmeden önce, onlarda zaten bir hesabınız yoksa, sizden bunlara katılmanızı asla istemeyiz.

source: Launchpad
pt_br: Plataforma de lançamento

source: Medium
pt_br: Média
tr: Ortam

source: Forks, Apps, and Third-Party Implementations are Not Evil.
pt_br: Forks, aplicativos e implementações de terceiros não são malignos.
tr: Kötü olmayan dallar, uygulamalar ve üçüncü taraf uygulamalar.

source: This post attempts to provide ways of vetting the source for obtaining the Java I2P package represented by the source code contained in https://i2pgit.org/i2p-hackers/i2p.i2p and https://github.com/i2p/i2p.i2p, and which is available for download from the web site https://geti2p.net/. It is not intended to pass judgement on third-party forks, downstream projects, embedders, packagers, people experimenting in laboratories, or people who just disagree with us. You are all valued members of our community who are trying to protect, and not compromise, the privacy of others. Since we are aware of attempts to impersonate I2P project community members, you may wish to review the download, verification, and installation procedures which you recommend to your users in order to document your official sources and known mirrors.
pt_br: Esta postagem tenta fornecer maneiras de verificar a fonte para obter o pacote Java I2P representado pelo código-fonte contido em https://i2pgit.org/i2p-hackers/i2p.i2p e https://github.com/i2p/i2p.i2p, e que está disponível para download no site https://geti2p.net/. Não pretendemos julgar bifurcações de terceiros, projetos downstream, incorporadores, empacotadores, pessoas que fazem experimentos em laboratórios ou pessoas que simplesmente discordam de nós. Todos vocês são membros valiosos da nossa comunidade que estão tentando proteger, e não comprometer, a privacidade dos outros. Como estamos cientes das tentativas de personificar membros da comunidade do projeto I2P, você pode querer revisar os procedimentos de download, verificação e instalação que você recomenda aos seus usuários para documentar suas fontes oficiais e espelhos conhecidos.
tr: Bu yazı, https://geti2p.net/ sitesinden indirilebilecek Java I2P paketinin incelenmesi için, https://i2pgit.org/i2p-hackers/i2p.i2p ve https://github.com/i2p/i2p.i2p üzerinde bulunan kaynak kodunun nasıl elde edilebileceğini anlatmayı amaçlar. Üçüncü taraf dallar, alt projeler, gömücüler, paketleyiciler, laboratuvarlarda deney yapan kişiler ya da bizimle aynı fikirde olmayan kişiler hakkında hüküm vermek amaçlanmamıştır. Hepiniz, başkalarının kişisel gizliliğini korumaya çalışan ve ödün vermeyen topluluğumuzun değerli üyelerisiniz. I2P proje topluluğu üyelerinin kimliğine bürünme girişimlerinin farkında olduğumuz için, resmi kaynaklarınızı ve bilinen yansılarımızı belgelemek için kullanıcılarınıza önerdiğiniz indirme, doğrulama ve kurulum yöntemlerini gözden geçirmek isteyebilirsiniz.

source: Authors Note: An earlier version of this blog post contained the TLS fingerprint of each of the services operated by the I2P Project. These were removed when a certificate renewal caused the fingerprints to become inaccurate.
pt_br: Nota do autor: Uma versão anterior desta postagem do blog continha a impressão digital TLS de cada um dos serviços operados pelo Projeto I2P. Elas foram removidas quando uma renovação de certificado fez com que as impressões digitais se tornassem imprecisas.
tr: Geliştiricilerin notu: Bu günlük yazısının önceki bir sürümünde, I2P projesi tarafından işletilen hizmetlerin her birinin TLS parmak izleri bulunuyordu. Bu parmak izleri, sertifika yenilemesi parmak izlerinin hatalı olmasına yol açtığından kaldırıldı.

source: ================================== Meet your Maintainer: DivaExchange ==================================
pt_br: =================================== Conheça seu mantenedor: DivaExchange ===================================
tr: ================================== Geliştiriciniz ile tanışın: DivaExchange ==================================

source: A conversation with DivaExchange
pt_br: Uma conversa com DivaExchange
tr: DivaExchange ile bir sohbet

source: *In this second installment of Meet Your Maintainer, I reached out to Konrad from DIVA.EXCHANGE to talk about DIVA’s research and services. DIVA.EXCHANGE is developing software with the goal of providing free banking technology for everyone. It is secure without a central infrastructure, and based on blockchain and I2P technology.*
pt_br: *Nesta segunda parte do Meet Your Maintainer, entrei em contato com Konrad da DIVA.EXCHANGE para falar sobre a pesquisa e os serviços da DIVA. A DIVA.EXCHANGE está desenvolvendo software com o objetivo de fornecer tecnologia bancária gratuita para todos. É seguro sem uma infraestrutura central e baseado em tecnologia blockchain e I2P.*
tr: *Geliştiriciniz ile tanışın dizisinin ikinci bölümünde, DIVA araştırmaları ve hizmetleri hakkında konuşmak için DIVA.EXCHANGE kuruluşundan Konrad'a ulaştım. DIVA.EXCHANGE, herkes için ücretsiz bankacılık teknolojisi sağlama hedefiyle yazılım geliştiriyor. Merkezi bir altyapı kullanmadığından güvenlidir ve blok zinciri ile I2P teknolojilerini kullanır.*

source: What got you interested in I2P?
pt_br: O que despertou seu interesse no I2P?
tr: I2P hakkında ilginizi çeken ne oldu?

source: About 10 years ago I had a presentation for “Technologieforum Zug” - a very local technology network for business guys. I was introducing I2P and Tor as overlay networks to them - to show them that other interesting things exist out there.
pt_br: Cerca de 10 anos atrás, fiz uma apresentação para o “Technologieforum Zug” - uma rede de tecnologia muito local para homens de negócios. Eu estava apresentando I2P e Tor como redes de sobreposição para eles - para mostrar a eles que outras coisas interessantes existem por aí.
tr: Yaklaşık 10 yıl önce iş adamları için çok yerel bir teknoloji ağı olan “Technologieforum Zug” etkinliğinde bir sunumum vardı. Onlara başka ilginç şeylerin de olduğunu göstermek için I2P ve Tor ağlarını tanıtıyordum.

source: I was always very much interested in cryptography related technology. In general I can say that my core interests were and still are: networks, freedom and privacy on both a technical and social level, interesting algos, like HashCash between 2000 and 2010, which was a very well working Proof-of-Work algo created at Universities in the UK in the late 90’s.
pt_br: Sempre me interessei muito por tecnologia relacionada à criptografia. Em geral, posso dizer que meus principais interesses eram e ainda são: redes, liberdade e privacidade tanto em nível técnico quanto social, algoritmos interessantes, como HashCash entre 2000 e 2010, que era um algoritmo de Prova de Trabalho muito funcional criado em universidades no Reino Unido no final dos anos 90.
tr: Şifreleme ile ilgili teknolojiye her zaman çok ilgi duymuşumdur. Genel olarak, temel ilgi alanlarımın şunlar olduğunu söyleyebilirim: Ağlar, hem teknik hem de sosyal düzeyde özgürlük ve kişisel gizlilik, 2000 ve 2010 yılları arasında HashCash gibi çok iyi çalışan bir algoritmayı yaratan 90'ların sonlarında İngiltere'deki üniversitelerde yapılan kanıtlama çalışmaları.

source: I2P fascinated me because it is really carefully done - from the architecture to the implementation in Java and C++. Personally I prefer de-coupled and small programs doing one thing. Hence I was pretty fascinated by the C++ version, I2Pd, which is lean, fast and without dependencies. It works very well for me.
pt_br: O I2P me fascinou porque é realmente feito com cuidado - da arquitetura à implementação em Java e C++. Pessoalmente, prefiro programas desacoplados e pequenos fazendo uma coisa. Por isso, fiquei bastante fascinado pela versão C++, I2Pd, que é enxuta, rápida e sem dependências. Funciona muito bem para mim.
tr: I2P beni, mimarisinden Java ve C++ üzerindeki uygulamaya kadar gerçekten dikkatli bir şekilde yapıldığı için büyüledi. Şahsen ben tek bir şey yapan ayrılmış ve küçük yazılımları yeğlerim. Bu nedenle, yalın, hızlı ve bağımlılık içermeyen C++ sürümü olan I2Pd uygulamasından oldukça etkilendim. Benim için çok iyi çalışıyor.

source: What are the qualities in its technical capacity that aligned with your own work or interests?
pt_br: Quais são as qualidades em sua capacidade técnica que se alinham com seu próprio trabalho ou interesses?
tr: Sunulan teknik kapasiteler olarak kendi işiniz veya ilgi alanlarınızla uyumlu nitelikleri neler?

source: I adore craftsmanship. That’s art. And I2P is modern craftsmanship. I2P creates values for end users values which can’t be bought: autonomy, liberty and serenity.
pt_br: Eu adoro artesanato. Isso é arte. E I2P é artesanato moderno. I2P cria valores para usuários finais, valores que não podem ser comprados: autonomia, liberdade e serenidade.
tr: El sanatlarına bayılırım. Sanat bu. Ve I2P modern bir el sanatıdır. I2P, son kullanıcılar için satın alınamayacak değerler yaratır: Özerklik, bağımsızlık ve huzur.
