Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: We've had some wonderful speakers, from both inside- and outside of our community. `David Dagon`_ talked to us about the way forward and how I2P could handle potential abuse. `Lance James`_ - the creator of our predecessor iip - said Hi and gave us his thoughts about how far I2P has come. `Nick Johnston`_ gave us a wonderful talk about why privacy matters and why you should care.
pt_br: Tivemos alguns palestrantes maravilhosos, tanto de dentro quanto de fora da nossa comunidade. `David Dagon`_ falou conosco sobre o caminho a seguir e como o I2P poderia lidar com possíveis abusos. `Lance James`_ - o criador do nosso predecessor iip - disse Olá e nos deu sua opinião sobre o quão longe o I2P chegou. `Nick Johnston`_ nos deu uma palestra maravilhosa sobre por que a privacidade é importante e por que você deve se importar.
tr: Topluluğumuzun hem içinden hem de dışından harika konuşmacılarımız oldu. "David Dagon" bizimle ileriye giden yol ve I2P'nin olası kötüye kullanımla nasıl başa çıkabileceği hakkında konuştu. Öncümüz olan IIP yaratıcısı `Lance James`_ Merhaba dedi ve bize I2P projesinin ne kadar ilerlediği hakkında düşüncelerini aktardı. `Nick Johnston`_ bize kişisel gizliliğin neden önemli olduğu ve neden ilgilenmeniz gerektiği hakkında harika bir konuşma yaptı.

source: I would also like to thank the speakers from our community. `psi`_, `@str4d`_ and `zzz`_ who all had wonderful talks. Improving our ability to inform people about I2P is something that is going to be important for us going forward.
pt_br: Gostaria também de agradecer aos palestrantes da nossa comunidade. `psi`_, `@str4d`_ e `zzz`_ que tiveram palestras maravilhosas. Melhorar nossa capacidade de informar as pessoas sobre I2P é algo que será importante para nós daqui para frente.
tr: Topluluğumuzdan konuşmacılara da teşekkür etmek istiyorum. `psi`_, `@str4d`_ ve `zzz`_ harika konuşmalar yaptı. İnsanları I2P hakkında bilgilendirme yeteneğimizi geliştirmek, ileriye dönük olarak bizim için önemli olacak bir şey.

source: I would like to thank `Sadie`_ and Siew for helping us out with marketing and graphics. Without you I2PCon would've been a very different event.
pt_br: Gostaria de agradecer a `Sadie`_ e Siew por nos ajudarem com marketing e gráficos. Sem vocês, o I2PCon teria sido um evento muito diferente.
tr: Tanıtım ve görseller konusunda bize yardımcı oldukları için `Sadie`_ ve Siew'e teşekkür etmek istiyorum. Siz olmasaydınız I2PCon çok farklı bir etkinlik olurdu.

source: I would like to thank `@chlorelium`_ and `Hacklab`_ for being the most wonderful of hosts.
pt_br: Gostaria de agradecer a `@chlorelium`_ e `Hacklab`_ por serem os anfitriões mais maravilhosos.
tr: `@chlorelium`_ ve `Hacklab`_ harika ev sahipleri oldular. Kendilerine teşekkür etmek istiyorum.

source: I would like to thank `@darknetj`_, P and `@hizeena`_ of `Toronto Crypto`_ for their help during the event.
pt_br: Gostaria de agradecer a `@darknetj`_, P e `@hizeena`_ do `Toronto Crypto`_ pela ajuda durante o evento.
tr: `Toronto Crypto`dan `@darknetj`_, P ve `@hizeena`_ etkinlik süresince yardımcı oldular. Çok teşekkürler.

source: I would like to thank `@z3r0fox`_ for doing a wonderful job with the AV and doing all of the post-production work for the videos of all the talks.
pt_br: Gostaria de agradecer a `@z3r0fox`_ por fazer um trabalho maravilhoso com o AV e por fazer todo o trabalho de pós-produção dos vídeos de todas as palestras.
tr: `@z3r0fox`_ ses ve görüntü sistemleri ile harika bir iş çıkardı ve tüm konuşmaların görüntülerini elden geçirerek art işlemleri yaptı. Çok teşekkürler.

source: I would like to thank `@killyourtv_i2p`_ for hosting a very popular crypto party station.
pt_br: Gostaria de agradecer a `@killyourtv_i2p`_ por hospedar uma estação de festa criptográfica muito popular.
tr: Çok popüler bir şifreleme partisi istasyonuna ev sahipliği yaptığı için `@killyourtv_i2p`_ teşekkürü haketti.

source: Thanks to our new favorite journalist `@robinlevinson`_, for showing an interest in our cause and educating yourself about the technologies involved.
pt_br: Agradecemos ao nosso novo jornalista favorito `@robinlevinson`_, por demonstrar interesse em nossa causa e se educar sobre as tecnologias envolvidas.
tr: Yeni favori gazetecimiz `@robinlevinson`_. Amacımıza ilgi gösterdiği ve ilgili teknolojiler hakkında kendinizi eğittiğiniz için teşekkür ederiz.

source: Thanks for all the pizza `@Panago_Pizza`_, it keept us going. You very much made this event better.
pt_br: Obrigado por todas as pizzas `@Panago_Pizza`_, elas nos fizeram continuar. Vocês tornaram esse evento muito melhor.
tr: Çalışmayı sürdürmemizi sağlayan tüm pizzalar için teşekkürler `@Panago_Pizza`_. Bu etkinliği çok daha iyi hale getirdiniz.

source: Finally I would like to thank everyone else who just showed up to the event and helped out in any way they could. ComradeNosebleed, LazyGravy, `cacapo`_, Xmz, ZeroRax, `echelon`_, it was most excellent to hang out with you.
pt_br: Por fim, gostaria de agradecer a todos que compareceram ao evento e ajudaram de alguma forma que puderam. ComradeNosebleed, LazyGravy, `cacapo`_, Xmz, ZeroRax, `echelon`_, foi excelente estar com vocês.
tr: Son olarak, etkinliğe gelen ve ellerinden geldiğince yardımcı olan herkese teşekkür etmek istiyorum. ComradeNosebleed, LazyGravy, `cacapo`, Xmz, ZeroRax, `echelon`_, sizinle takılmak çok güzeldi.

source: ============== 0.9.22 Release ==============
pt_br: ================= 0.9.22 Lançamento =================
tr: ====================== 0.9.22 sürümü yayınlandı ======================

source: 0.9.22 with bug fixes and start of Ed25519 migration
pt_br: 0.9.22 com correções de bugs e início da migração do Ed25519
tr: 0.9.22 sürümünde hata düzeltmeleri yapıldı ve Ed25519 geçişi başlatıldı

source: 0.9.22 contains fixes for i2psnark getting stuck before completion, and begins the migration of router infos to new, stronger Ed25519 signatures. To reduce network churn, your router will have only a small probability of converting to Ed25519 at each restart. When it does rekey, expect to see lower bandwidth usage for a couple of days as it reintegrates into the network with its new identity. If all goes well, we will accelerate the rekeying process in the next release.
pt_br: A versão 0.9.22 contém correções para o i2psnark ficando travado antes da finalização, e inicia a migração das informações de roteador para novas e mais fortes assinaturas Ed25519. Para reduzir a agitação na rede, seu roteador terá uma pequena probabilidade de converter para Ed25519 a cada reinício. Quando ele rechavear, espere ver uso de banda mais baixo por alguns dias enquanto ele se reintegra à rede com sua nova identidade. Se tudo ocorrer bem, nós aceleraremos o processo de rechaveamento no próximo lançamento.
tr: 0.9.22 sürümünde, tamamlanmadan önce takılmaya yol açan i2psnark sorunu çözüldü ve yöneltici bilgilerinin yeni ve daha güçlü Ed25519 imzalarına aktarılması sağlandı. Ağ kargaşası oluşturmamak için yönelticiniz her yeniden başlatılmada yalnızca küçük olasılıklı bir Ed25519 dönüşümü yapacak. Anahtar yeniden oluşturulduğunda, yeni kimlik ağ üzerine eklenene kadar bir kaç gün boyunca düşük bant genişliği kullanımı görebilirsiniz. Herşey yolunda giderse, sonraki sürümde yeniden anahtar oluşturma işlemini hızlandıracağız.

source: I2PCon Toronto was a big success! All the presentations and videos are listed on the `I2PCon page`__.
pt_br: O I2PCon Toronto foi um grande sucesso! Todas as apresentações e vídeos estão listados na `página do I2PCon`__.
tr: I2PCon Toronto toplantısı çok başarılıydı! Tüm sunum ve görüntülere `I2PCon sayfasından ulaşabilirsiniz`__.

source: Start migration to Ed25519 router info signatures
pt_br: Iniciar migração para assinaturas de informações do roteador Ed25519
tr: Ed25519 yöneltici bilgileri imzalarına geçiş başlatıldı

source: Convert i2psnark destinations to Ed25519 signatures
pt_br: Converter destinos i2psnark em assinaturas Ed25519
tr: i2psnark hedefleri Ed25519 imzalarına dönüştürüldü

source: Fix i2psnark getting stuck before download complete, and not deleting temp files
pt_br: Corrigir i2psnark travando antes do download ser concluído e não excluindo arquivos temporários
tr: İndirme tamamlanmadan önce i2psnark takılması ve geçici dosyaların silinmemesi sorunları düzeltildi

source: Fix starting of torrents added by copying torrent file to i2psnark directory
pt_br: Corrigir o início de torrents adicionado ao copiar o arquivo torrent para o diretório i2psnark
tr: Torrent dosyası i2psnark klasörüne kopyalanarak eklenen torrentlerin başlatılması düzeltildi

source: Fix UPnP 'content not allowed in trailing section' error
pt_br: Corrigir erro UPnP 'conteúdo não permitido na seção final'
tr: UPnP 'içeriğe son bölümde izin verilmiyor' hatası düzeltildi

source: Fix excluded SSL ciphers in console
pt_br: Corrigir cifras SSL excluídas no console
tr: Panoya katılmayan SSL şifreleyicileri düzeltildi

source: ================== Community Outreach ==================
pt_br: ================== Alcance da Comunidade ==================
tr: ================== Topluluk erişimi ==================

source: A start to more frequent community status reports.
pt_br: Um começo para relatórios de status da comunidade mais frequentes.
tr: Topluluk durumu bildirimlerinin daha sık yayınlanmasına başlandı.

source: Meta
pt_br: Objetivo
tr: Üst veri

source: Greetings! This is the first in a long series of blogs to help the community see what is happening in the I2P community. Since many awesome events are happening *inside* the network, we think it will be worthwhile to talk about some of activities here.
pt_br: Saudações! Este é o primeiro de uma longa série de blogs para ajudar a comunidade a ver o que está acontecendo na comunidade I2P. Como muitos eventos incríveis estão acontecendo *dentro* da rede, achamos que valerá a pena falar sobre algumas das atividades aqui.
tr: Merhaba! I2P topluluğunda neler olduğunun görülmesine yardımcı olacak uzun bir blog dizisinin ilkini yayınlıyoruz. Ağ *içinde* birçok harika olay gerçekleştiğinden, burada bazı etkinlikler hakkında konuşmanın faydalı olacağını düşünüyoruz.

source: A Call for Feedback
pt_br: Um chamado para feedback
tr: Geri Bildirim Çağrısı

source: Let's face it -- our console needs improvement. Our site could use an update as well. We are looking for feedback on how to improve the usability of I2P for new and existing users!
pt_br: Sejamos realistas: nosso console precisa de melhorias. Nosso site também precisa de uma atualização. Estamos buscando feedback sobre como melhorar a usabilidade do I2P para usuários novos e existentes!
tr: Kabul edelim -- panomuzun iyileştirilmesi gerekiyor. Sitemiz de güncellenebilir. Yeni ve var olan kullanıcılar için I2P kullanılabilirliğini nasıl geliştireceğimiz hakkında geri bildirim almak istiyoruz!

source: Any and all feedback is welcome. Please contact `@GetI2P`_, `@str4d`_, or `@YrB1rd`_. If you don't feel comfortable using Twitter, we are always available via the in-network IRC channel. You don't have to be a long time user. We want to hear from all sorts of people!
pt_br: Todo e qualquer feedback é bem-vindo. Entre em contato com `@GetI2P`_, `@str4d`_ ou `@YrB1rd`_. Se você não se sentir confortável usando o Twitter, estamos sempre disponíveis pelo canal IRC da rede. Você não precisa ser um usuário antigo. Queremos ouvir todos os tipos de pessoas!
tr: Her türlü geri bildirimi kabul ediyoruz. Lütfen `@GetI2P`_, `@str4d`_ veya `@YrB1rd`_ ile görüşün. Twitter kullanmakta kendinizi rahat hissetmiyorsanız, ağ içi IRC kanalı aracılığıyla bize her zaman ulaşabilirsiniz. Eski bir kullanıcı olmanıza gerek yok. Her tür kullanıcının fikrini almak istiyoruz!

source: Developer Meeting Synopsis
pt_br: Sinopse da reunião do desenvolvedor
tr: Geliştirici toplantısı özeti

source: On 03 November there was an I2P developer meeting (`log`_). This meeting focused on adding new links to the router console, preparation for CCC, finding a replacement for forum.i2p, and website improvements.
pt_br: Em 03 de novembro, houve uma reunião de desenvolvedores do I2P (`log`_). Esta reunião se concentrou na adição de novos links ao console do roteador, preparação para o CCC, busca de um substituto para o forum.i2p e melhorias no site.
tr: 03 Kasım tarihinde bir I2P geliştirici toplantısı (`günlük`_) vardı. Bu toplantı, yöneltici panosuna yeni bağlantılar eklemeye, CCC etkinliğine hazırlanmaya, forum.i2p için bir yedek bulmaya ve site iyileştirmelerine odaklandı.

source: The consensus was to not add dogecoindark.i2p. There are concerns about usability due to many images being included on the page. Exchanged.i2p is conditionally added, as long as the maintainer adds a disclaimer on the site. I2Pwiki.i2p (a backup of ugha.i2p, an older wiki) was accepted, as was lenta.i2p (a russian news site).
pt_br: O consenso foi não adicionar dogecoindark.i2p. Há preocupações sobre usabilidade devido a muitas imagens incluídas na página. Exchanged.i2p é adicionado condicionalmente, desde que o mantenedor adicione um aviso de isenção de responsabilidade no site. I2Pwiki.i2p (um backup de ugha.i2p, um wiki mais antigo) foi aceito, assim como lenta.i2p (um site de notícias russo).
tr: dogecoindark.i2p sitesinin eklenmemesinde fikir birliğine varıldı. Sayfada çok sayıda görselin yer alması nedeniyle kullanılabilirlik konusunda endişeler var. Sahibi siteye bir sorumluluk reddi bildirimi eklemesi şartıyla, Exchanged.i2p eklendi. I2Pwiki.i2p (daha eski bir wiki olan ugha.i2p yedeği) ve lenta.i2p (bir Rus haber sitesi) kabul edildi.

source: str4d proposed blocking off the \*.i2p.i2p namespace so they can be used for developer's services. He also suggested a more formalized technical proposal system, with more prominence on the main website.
pt_br: str4d propôs bloquear o namespace \*.i2p.i2p para que ele possa ser usado para serviços de desenvolvedores. Ele também sugeriu um sistema de proposta técnica mais formalizado, com mais destaque no site principal.
tr: str4d, geliştirici hizmetlerinde kullanılabilmesi için \*.i2p.i2p ad alanının engellenmesini önerdi. Ayrıca ana sitede daha fazla öne çıkan, daha düzenli bir teknik teklif sistemi önerdi.

source: The I2P Team is going to be in Hamburg, Germany for the 32nd Chaos Computer Congress. More details are to come on this, but we can promise there will be stickers.
pt_br: A equipe I2P estará em Hamburgo, Alemanha, para o 32º Chaos Computer Congress. Mais detalhes sobre isso ainda estão por vir, mas podemos prometer que haverá adesivos.
tr: I2P Ekibi, 32. Kaos Bilgisayar Kongresi için Almanya'nın Hamburg kentinde olacak. Bununla ilgili daha fazla ayrıntı vereceğiz, şimdilik çıkartmalar olacağına söz verebiliriz.

source: General Announcements
pt_br: Anúncios Gerais
tr: Genel Duyurular

source: Thank you to `TorontoCrypto`_ for hosting the newest I2P reseed server!
pt_br: Obrigado ao `TorontoCrypto`_ por hospedar o mais novo servidor de reseed I2P!
tr: En yeni I2P yeniden tohumlama sunucusuna ev sahipliği yaptığı için `TorontoCrypto`_ grubuna teşekkür ederiz!

source: Translation deadline Thursday, 12 November, translators please update. All translations are done via `Transifex`_ .
pt_br: Prazo de tradução: quinta-feira, 12 de novembro, tradutores, por favor, atualizem. Todas as traduções são feitas via `Transifex`_ .
tr: Çeviriler için son tarih 12 Kasım Perşembe. Lütfen çevirileri güncelleyin. Tüm çeviriler `Transifex`_ üzerinden yapılır.

source: ============== 0.9.23 Release ==============
pt_br: ================= 0.9.23 Lançamento =================
tr: ====================== 0.9.23 sürümü yayınlandı ======================

source: 0.9.23 contains a variety of bug fixes, and some minor improvements in I2PSnark
pt_br: 0.9.23 contém uma variedade de correções de bugs, e algumas pequenas melhorias no I2PSnark
tr: 0.9.23 sürümü çeşitli hata düzeltmeleri ve I2PSnark geliştirmeleri ile yayınlandı

source: Hello I2P! This is the first release signed by me (str4d), after 49 releases signed by zzz. This is an important test of our redundancy for all things, including people.
pt_br: Olá, I2P! Este é o primeiro lançamento assinado por mim (str4d), depois de 49 lançamentos assinados pelo zzz. Esse é um teste importante da nossa redundância para todas as coisas, incluindo pessoas.
tr: Merhaba I2P! Bu sürüm zzz tarafından imzalanan 49 sürümden sonra benim tarafımdan imzalanan (str4d) ilk sürüm. İnsanlar dahil, yedekli çalışmamızı gösteren önemli bir sınav.

source: Housekeeping
pt_br: Limpeza
tr: Temizlik

source: My signing key has been in router updates for over two years (since 0.9.9), so if you are on a recent version of I2P this update should be just as easy as every other update. However, if you are running an older version than 0.9.9, you will first need to manually update to a recent version. Update files for recent versions `can be downloaded here`__, and instructions on how to manually update `are provided here`__. Once you have manually updated, your router will then find and download the 0.9.23 update as usual.
pt_br: Minha chave de assinatura está nas atualizações do roteador há mais de dois anos (desde 0.9.9), então se você estiver em uma versão recente do I2P, esta atualização deve ser tão fácil quanto qualquer outra atualização. No entanto, se você estiver executando uma versão mais antiga que 0.9.9, você primeiro precisará atualizar manualmente para uma versão recente. Arquivos de atualização para versões recentes `podem ser baixados aqui`__, e instruções sobre como atualizar manualmente `são fornecidas aqui`__. Depois de atualizar manualmente, seu roteador encontrará e baixará a atualização 0.9.23 como de costume.
tr: İmza anahtarım iki yıldan uzun zamandır yöneltici güncellemelerinde bulunuyordu (0.9.9 sürümünden sonra). Son I2P sürümlerinden birini kullanıyorsanız güncelleme işlemi diğer güncellemeler kadar kolay olur. 0.9.9 öncesindeki bir sürümü kullanıyorsanız önce daha yeni bir sürüme el ile güncellemeniz gerekir. Son sürümlerin dosyaları `buradan indirilebilir`__ el ile güncelleme hakkındaki bilgiler için ise `buraya bakabilirsiniz`__. El ile güncelleme işlemini tamamladığınızda, yöneltici 0.9.23 sürümünü bulup indirebilir.

source: If you installed I2P via a package manager, you are not affected by the change, and can update as usual.
pt_br: Se você instalou o I2P através de um gerenciador de pacotes, você não é afetado pela alteração e pode atualizar como de costume.
tr: I2P uygulamasını paket yöneticisi ile kurduysanız, değişikliklerden etkinlenmeyecek ve normal şekilde güncelleme yapabileceksiniz.

source: Update details ==============
pt_br: Detalhes da atualização =====================
tr: Güncelleme ayrıntıları ===================

source: The migration of RouterInfos to new, stronger Ed25519 signatures is going well, with at least half of the network already estimated to have rekeyed. This release accelerates the rekeying process. To reduce network churn, your router will have a small probability of converting to Ed25519 at each restart. When it does rekey, expect to see lower bandwidth usage for a couple of days as it reintegrates into the network with its new identity.
pt_br: A migração de informações de roteador para novas e mais fortes assinaturas Ed25519 está indo bem, com pelo menos metade da rede já estimada a ter rechaveado. Esse lançamento acelera o processo de rechaveamento. Para reduzir a agitação na rede, seu roteador terá uma pequena probabilidade de converter para Ed25519 a cada reinício. Quando ele rechavear, espere ver uso de banda reduzido por alguns dias enquanto ele se reintegra à rede com sua nova identidade.
tr: "Yöneltici bilgileri" (RouterInfo) için yeni ve daha güçlü Ed25519 imzalarına geçme işlemi iyi gidiyor. Ağın en az yarısındaki anahtarların değiştiği öngörülüyor. Bu sürümde anahtar değiştirme işlemi hızlandırıldı. Ağda karışıklık yaratmamak için yönelticiniz her yeniden başlatmada az sayıda Ed25519 değişimi yapıyor. Anahtar değişimi yapıldığında, yeni kimliğin ağ ile bütünleşeceği ilk bir kaç gün bant genişliği kullanımınız daha düşük olabilir.

source: Note that this will be the last release to support Java 6. Please update to Java 7 or 8 as soon as possible. We are already working to make I2P compatible with the upcoming Java 9, and some of that work is in this release.
pt_br: Note que essa será a última versão a suportar Java 6. Por favor, atualize para o Java 7 ou 8 o mais breve possível. Nós já estamos trabalhando em tornar a I2P compatível com o futuro Java 9, e um pouco desse trabalho está nesse lançamento.
tr: Bu sürüm Java 6 destekleyen son sürümdür. En kısa sürede Java 7 ya da 8 sürümüne yükseltmeyi unutmayın. I2P uygulamasını yakında yayınlanacak Java 9 ile uyumlu olacak şekilde geliştirmeye başladık ve bazı değişiklikler bu sürümde yapıldı bile.

source: We have also made some minor improvements in I2PSnark, and added a new page in the routerconsole for viewing older news items.
pt_br: Também fizemos algumas pequenas melhorias no I2PSnark e adicionamos uma nova página noconsole do roteador para visualizar notícias mais antigas.
tr: Ayrıca I2PSnark üzerinde bazı küçük geliştirmeler yaparak, yöneltici panosuna eski haber ögelerinin görüntülenebileceği yeni bir sayfa ekledik.

source: Accelerate transition to Ed25519
pt_br: Acelerar a transição para Ed25519
tr: Ed25519 geçişi hızlandırıldı

source: Fix some bugs soft restarting after a large clock shift (e.g. resume) (but more to do)
pt_br: Corrigir alguns bugs de reinicialização suave após uma grande mudança de relógio (por exemplo, retomar) (mas há mais a fazer)
tr: Büyük bir saat sapmasından sonra (sürdürme gibi) yumuşak yeniden başlatmayla ilgili bazı hatalar düzeltildi (ancak daha yapılacak çok şey var)

source: Fix streaming retransmission timers that were dying, and related timer bugs
pt_br: Corrigir temporizadores de retransmissão de streaming que estavam morrendo e bugs de temporizador relacionados
tr: Ölmekte olan akış yeniden aktarım zamanlayıcıları ve ilgili zamanlayıcı hataları düzeltildi

source: Fix streaming connections rejected while tunnel is opening
pt_br: Corrigir conexões de streaming rejeitadas enquanto o túnel está abrindo
tr: Tünel açılırken reddedilen akış bağlantıları düzeltildi

source: Fix rare i2psnark and UPnP deadlocks
pt_br: Corrigir deadlocks raros de i2psnark e UPnP
tr: Nadir görülen i2psnark ve UPnP kilitlenmeleri düzeltildi

source: Fix lifetime participating bandwidth display in console
pt_br: Corrigir exibição de largura de banda participante vitalícia no console
tr: Panoda ömür boyu katılımcı bant genişliği görünümü düzeltildi

source: Increase default outbound exploratory tunnel length to 3
pt_br: Aumentar o comprimento padrão do túnel exploratório de saída para 3
tr: Varsayılan gidiş keşif tüneli uzunluğu 3 olarak artırıldı

source: Use max of 2 not-failing peers in exploratory tunnels to improve build success
pt_br: Use no máximo 2 pares que não falhem em túneis exploratórios para melhorar o sucesso da construção
tr: Yapım başarısını artırmak için keşif tünellerinde en fazla 2 başarısız olmayan eş kullanıldı

source: Add support for hostnames prefixed with "www."
pt_br: Adicione suporte para nomes de host prefixados com "www".
tr: "www" ön eki kullanan sunucu adları için destek eklendi.

source: Store news feed items separately on disk, show on new /news page, limit display on home page to 2
pt_br: Armazene os itens do feed de notícias separadamente no disco, mostre na nova página /news, limite a exibição na página inicial para 2
tr: Yenilikler / haberler sayfasında gösterilen haber akışı ögelerinin diskte ayrı ayrı saklanması sağlandı. Ana sayfada görüntülenecek öge sayısı 2 olarak sınırlandı
