Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Configuration page for router family
pt_br: Página de configuração para família de roteadores
tr: Yöneltici ailesi için yapılandırma sayfası

source: Custom icons for plugins
pt_br: Ícones personalizados para plugins
tr: Uygulama ekleri için özel simgeler

source: Internal implementation of self-signed certificate generation
pt_br: Implementação interna de geração de certificado autoassinado
tr: İçeride kendinden imzalı sertifika üretimi sağlandı

source: Add i2ptunnel http server options to block by referer or user-agent
pt_br: Adicionar opções do servidor http i2ptunnel para bloquear por referenciador ou agente do usuário
tr: Yönlendiren veya kullanıcı uygulamasına göre engellemek için i2ptunnel http sunucu seçenekleri eklendi

source: IRC server tunnel default fix to help reliability
pt_br: Correção padrão do túnel do servidor IRC para ajudar na confiabilidade
tr: Güvenilirliğe yardımcı olmak için IRC sunucu tüneli varsayılanı düzeltildi

source: Don't wait until a lease expires to switch to a new on
pt_br: Não espere até que o contrato de locação expire para mudar para um novo
tr: Yeni bir açık konuma geçmek için bir kira süresinin dolmasının beklenmemesi sağlandı

source: Preliminary support for certificate revocations
pt_br: Suporte preliminar para revogações de certificados
tr: Sertifikaların geçersiz kılınması için ön hazırlık yapıldı

source: Preliminary support for storing EdDSA and ElGamal keys in keystores
pt_br: Suporte preliminar para armazenar chaves EdDSA e ElGamal em keystores
tr: Anahtar depolarında EdDSA ve ElGamal anahtarlarının depolanması için ön hazırlık yapıldı

source: More efficient signing and verification with EdDSA
pt_br: Assinatura e verificação mais eficientes com EdDSA
tr: EdDSA ile imzalama ve doğrulama verimliliği artırıldı

source: Increase default connection limits
pt_br: Aumentar os limites de conexão padrão
tr: Varsayılan bağlantı sınırları artırıldı

source: Increase default inbound bandwidth
pt_br: Aumentar a largura de banda de entrada padrão
tr: Varsayılan geliş bant genişliği artırıldı

source: Increase max files per torrent in i2psnark
pt_br: Aumentar o máximo de arquivos por torrent no i2psnark
tr: i2psnark üzerinde her torrent için en fazla dosya sayısı artırıldı

source: Add more sanity checks to detect bad system clock
pt_br: Adicione mais verificações de integridade para detectar relógio de sistema ruim
tr: Hatalı sistem saatini algılamak için daha fazla sağlık denetimi eklendi

source: Improve news styling in console
pt_br: Melhore o estilo das notícias no console
tr: Panoda haber biçemi iyileştirildi

source: Improve certificate blacklist implementation
pt_br: Melhore a implementação da lista negra de certificados
tr: Sertifika kara listesi uygulaması iyileştirildi

source: Faster disconnect after publishing router info to floodfill
pt_br: Desconexão mais rápida após publicar informações do roteador para floodfill
tr: Otomatik doldurma için yöneltici bilgilerinin yayınlandıktan sonra bağlantının daha hızlı kesilmesi sağlandı

source: Smooth out the dropping of idle SSU sessions
pt_br: Suavize a queda de sessões SSU ociosas
tr: Boşta kalan SSU oturumlarının kesilmesi yumuşatıldı

source: Add X-Content-Type-Options headers in console
pt_br: Adicionar cabeçalhos X-Content-Type-Options no console
tr: Panoya X-Content-Type-Options üst bilgileri eklendi

source: We are pleased to announce that this summer, I2P will be embarking on a development program aimed at improving the privacy software ecosystem for both developers and users.
pt_br: Temos o prazer de anunciar que, neste verão, a I2P embarcará em um programa de desenvolvimento com o objetivo de melhorar o ecossistema de software de privacidade para desenvolvedores e usuários.
tr: Bu yaz hem geliştiriciler hem de kullanıcılar için I2P kişisel gizlilik yazılımı ekosistemini iyileştirmeyi amaçlayan bir geliştirme programına başlayacağımızı duyurmaktan mutluluk duyuyoruz.

source: Over the last few years, the need for users to be in control of their own data has become increasingly apparent. Some excellent progress had been made in this regard with the rise of messaging apps like Signal_, and file storage systems like Tahoe-LAFS_. The ongoing work of `Let's Encrypt`_ to bring HTTPS to the whole world is steadily gaining traction.
pt_br: Nos últimos anos, a necessidade de os usuários terem controle sobre seus próprios dados tornou-se cada vez mais aparente. Algum progresso excelente foi feito nesse aspecto com o surgimento de aplicativos de mensagens como Signal_ e sistemas de armazenamento de arquivos como Tahoe-LAFS_. O trabalho contínuo do `Let's Encrypt`_ para levar HTTPS para o mundo inteiro está ganhando força constantemente.
tr: Son birkaç yılda, kullanıcıların kendi verilerini denetleme gereksinimi giderek daha belirgin hale geldi. Signal_ gibi mesajlaşma uygulamalarının ve Tahoe-LAFS_ gibi dosya depolama sistemlerinin yükselişiyle bu konuda bazı mükemmel ilerlemeler kaydedildi. TÜm dünyada HTTPS kullanılmasını sağlamak için sürdürülen `Let's Encrypt`_ çalışması giderek yaygınlaşıyor.

source: But building privacy and anonymity into applications is not trivial. Much of the software people use every day was not designed to be privacy-preserving, and the tools developers have available are generally not easy to work with. The recently-published OnionScan_ survey gives some insight into just how easy it is for even technical users to mis-configure their services, completely undermining their intentions.
pt_br: Mas construir privacidade e anonimato em aplicativos não é trivial. Grande parte do software que as pessoas usam todos os dias não foi projetado para preservar a privacidade, e as ferramentas que os desenvolvedores têm disponíveis geralmente não são fáceis de trabalhar. A pesquisa OnionScan_ publicada recentemente dá uma ideia de quão fácil é até mesmo para usuários técnicos configurarem mal seus serviços, minando completamente suas intenções.
tr: Ancak uygulamalara kişisel gizlilik ve anonimlik eklemek önemsiz değildir. İnsanların her gün kullandığı yazılımların çoğu kişisel gizliliği koruyacak şekilde tasarlanmamıştır ve kullanılabilecek araç geliştiricileri ile çalışmak genellikle kolay değildir. Yakın zamanda yayınlanan OnionScan_ anketi, teknik kullanıcıların bile hizmetlerini yanlış yapılandırmalarının ne kadar kolay olduğu hakkında bir fikir veriyor ve amaçlarını tamamen baltalıyor.

source: Helping developers help their users ===================================
pt_br: Ajudando desenvolvedores a ajudar seus usuários =====================================
tr: Geliştiricilerin kullanıcılara yardım etmelerine yardım etmek ===================================================

source: We are pleased to announce that this summer, I2P will be embarking on a development program aimed at improving the privacy software ecosystem. Our goal is to make life easier both for developers wanting to leverage I2P in their applications, and for users trying to configure and run their apps through I2P.
pt_br: Temos o prazer de anunciar que neste verão, o I2P embarcará em um programa de desenvolvimento com o objetivo de melhorar o ecossistema de software de privacidade. Nosso objetivo é tornar a vida mais fácil tanto para desenvolvedores que desejam alavancar o I2P em seus aplicativos, quanto para usuários que tentam configurar e executar seus aplicativos por meio do I2P.
tr: Bu yaz, I2P kişisel gizlilik yazılımı ekosistemini iyileştirmeyi amaçlayan bir geliştirme programına başlayacağımızı duyurmaktan mutluluk duyuyoruz. Amacımız, hem uygulamalarında I2P kullanmak isteyen geliştiriciler, hem de uygulamalarını I2P aracılığıyla yapılandırmaya ve çalıştırmaya çalışan kullanıcılar için hayatı kolaylaştırmaktır.

source: We will be focusing our time this summer into three complementary areas:
pt_br: Concentraremos nosso tempo neste verão em três áreas complementares:
tr: Bu yaz zamanımızı üç tamamlayıcı alana odaklayacağız:

source: June: APIs ----------
pt_br: Junho: APIs ----------
tr: Haziran: API uygulamaları ----------

source: In June, we will be updating the various libraries that exist for interfacing with I2P. We have made significant progress this year on extending our SAM_ API with additional features, such as support for datagrams and ports. We plan to make these features easily accessible in our C++ and Python libraries.
pt_br: Em junho, atualizaremos as várias bibliotecas que existem para interfacear com I2P. Fizemos um progresso significativo este ano na extensão de nossa API SAM_ com recursos adicionais, como suporte para datagramas e portas. Planejamos tornar esses recursos facilmente acessíveis em nossas bibliotecas C++ e Python.
tr: Haziran ayında, I2P ile arayüz oluşturmak için var olan çeşitli kitaplıkları güncelleyeceğiz. SAM_ API uygulamamızı veri şeması ve bağlantı noktası desteği gibi ek özelliklerle genişletme konusunda bu yıl önemli ilerleme kaydettik. Bu özellikleri C++ ve Python kitaplıklarımızda kolayca erişilebilir hale getirmeyi planlıyoruz.

source: We will also soon be making it much easier for Java and Android developers to add I2P support to their applications. Stay tuned!
pt_br: Em breve, também tornaremos muito mais fácil para desenvolvedores Java e Android adicionar suporte I2P aos seus aplicativos. Fique ligado!
tr: Ayrıca yakında Java ve Android geliştiricilerinin uygulamalarına I2P desteği eklemesini çok daha kolay hale getireceğiz. Bizi izlemeyi sürdürün!

source: July: Apps ----------
pt_br: Julho: Apps ----------
tr: Temmuz: Uygulamalar ----------

source: In July we will be working with applications that have expressed interest in adding support for I2P. There are some really neat ideas being developed in the privacy space right now, and we want to help their communities leverage over a decade of research and development on peer-to-peer anonymity. Extending these applications to work natively over I2P is a good step forward for usability, and in the process will improve how these applications think about and handle user information.
pt_br: Em julho, trabalharemos com aplicativos que demonstraram interesse em adicionar suporte para I2P. Há algumas ideias realmente legais sendo desenvolvidas no espaço de privacidade agora, e queremos ajudar suas comunidades a alavancar mais de uma década de pesquisa e desenvolvimento em anonimato peer-to-peer. Estender esses aplicativos para funcionar nativamente sobre I2P é um bom passo à frente para a usabilidade, e no processo melhorará como esses aplicativos pensam e lidam com as informações do usuário .
tr: Temmuz ayında, I2P desteği eklemekle ilgilendiklerini dile getiren uygulamalarla çalışacağız. Şu anda kişisel gizlilik alanında geliştirilmekte olan gerçekten güzel fikirler var ve topluluklarının eşler arası anonimlik üzerine on yılı aşkın araştırma ve geliştirmeden yararlanmasına yardımcı olmak istiyoruz. Bu uygulamaları yerel olarak I2P üzerinden çalışacak şekilde genişletmek, kullanılabilirlik için ileriye doğru atılmış iyi bir adımdır ve bu süreçte bu uygulamaların kullanıcı bilgileri üzerine düşünme ve işleme biçimini iyileştirecektir.

source: August: Plugins ---------------
pt_br: Agosto: Plugins ---------------
tr: Ağustos: Uygulama ekleri ---------------

source: Finally, in August we will turn out attention to the apps we bundle inside I2P, and the wider array of plugins. Some of these are due for some love, to make them more user-friendly - as well as fix any outstanding bugs! We hope that longtime I2P supporters will enjoy the outcome of this work.
pt_br: Finalmente, em agosto, voltaremos nossa atenção para os aplicativos que agrupamos dentro do I2P, e a gama mais ampla de plugins. Alguns deles merecem um pouco de amor, para torná-los mais amigáveis ao usuário - assim como corrigir quaisquer bugs pendentes! Esperamos que apoiadores de longa data do I2P apreciem o resultado deste trabalho.
tr: Son olarak, Ağustos ayında, I2P ile paketlediğimiz uygulamalara ve daha geniş uygulama eki yelpazesine dikkat çekeceğiz. Bunlardan bazıları biraz sevgi için, onları daha kullanıcı dostu hale getirmek için - ve ayrıca sıradışı hataları düzeltmek için! Eski I2P destekçilerinin bu çalışmanın sonucundan keyif alacağını umuyoruz.

source: Take part in Summer Dev! ========================
pt_br: Participe do Summer Dev! =========================
tr: Geliştirme yazına katılın! ========================

source: We have many more ideas for things we'd like to get done in these areas. If you're interested in hacking on privacy and anonymity software, designing usable websites or interfaces, or writing guides for users: come and chat with us on IRC or Twitter! We are always happy to "see" new "faces" in our community, both inside and outside I2P. We'll be sending I2P stickers out to all new contributors taking part (or possibly other pending I2P goodies)!
pt_br: Temos muito mais ideias para coisas que gostaríamos de fazer nessas áreas. Se você estiver interessado em hackear software de privacidade e anonimato, projetar sites ou interfaces utilizáveis, ou escrever guias para usuários: venha conversar conosco no IRC ou Twitter! Estamos sempre felizes em "ver" novos "rostos" em nossa comunidade, tanto dentro quanto fora do I2P. Enviaremos adesivos do I2P para todos os novos contribuidores que participarem (ou possivelmente outros brindes pendentes do I2P)!
tr: Bu alanlarda yapmak istediğimiz şeyler için daha birçok fikrimiz var. Kişisel gizlilik ve anonimlik yazılımlarını hacklemek, kullanılabilir siteler veya arayüzler tasarlamak veya kullanıcılar için bir rehber yazmakla ilgileniyorsanız: gelin ve bizimle IRC veya Twitter üzerinde sohbet edin! Topluluğumuzda I2P içinden ve dışından yeni "yüzler" görmekten her zaman mutlu oluyoruz. Tüm yeni katılımcılara I2P çıkartmaları (veya bekleyen diğer I2P hediyelerinden) göndereceğiz!

source: Likewise, if you are an application developer who wants a hand with integrating I2P, or even just to chat about the concepts or details: get in touch! If you want to get involved in our July Apps month, contact `@GetI2P`_, `@i2p`_ or `@str4d`_ on Twitter. You can also find us in #i2p-dev on OFTC or FreeNode.
pt_br: Da mesma forma, se você é um desenvolvedor de aplicativos que quer uma mão na integração do I2P, ou mesmo apenas para conversar sobre os conceitos ou detalhes: entre em contato! Se você quiser se envolver no nosso mês de aplicativos de julho, entre em contato com `@GetI2P`_, `@i2p`_ ou `@str4d`_ no Twitter. Você também pode nos encontrar em #i2p-dev no OFTC ou FreeNode.
tr: Aynı şekilde, I2P uygulamasını bütünleştirmek isteyen bir uygulama geliştiricisiyseniz, hatta yalnızca kavramlar veya ayrıntılar hakkında sohbet etmek istiyorsanız: bizimle görüşün! Temmuz Uygulamalar ayına katılmak istiyorsanız, Twitter üzerinden `@GetI2P`_, `@i2p`_ veya `@str4d`_ ile iletişime geçin. Ayrıca bizi OFTC veya FreeNode üzerinde #i2p-dev kanalında bulabilirsiniz.

source: We'll be posting here as we go, but you can also follow our progress, and share your own ideas and work, with the hashtag `#I2PSummer`_ on Twitter. Bring on the summer!
pt_br: Postaremos aqui conforme formos, mas você também pode acompanhar nosso progresso e compartilhar suas próprias ideias e trabalho, com a hashtag `#I2PSummer`_ no Twitter. Que venha o verão!
tr: İlerledikçe burada paylaşacağız, ancak ilerlememizi izleyebilir ve Twitter üzerinde `#I2PSummer`_ etiketiyle kendi fikirlerinizi ve çalışmalarınızı paylaşabilirsiniz. Artık yaz gelsin!

source: ============== 0.9.26 Release ==============
pt_br: ============== Lançamento 0.9.26 ==============
tr: ====================== 0.9.26 sürümü yayınlandı ======================

source: 0.9.26 contains crypto updates, Debian packaging improvements, and bug fixes
pt_br: 0.9.26 contém atualizações de criptografia, melhorias no empacotamento Debian e correções de bugs
tr: 0.9.26 sürümü şifreleme güncellemeleri, Debian paketi geliştirmeleri ve hata düzeltmeleri ile yayınlandı.

source: I2P is now a proposed site on Stack Exchange! Please `commit to using it`__ so the beta phase can begin.
pt_br: O I2P agora é um site proposto no Stack Exchange! Por favor, `comprometa-se a usá-lo`__ para que a fase beta possa começar.
tr: I2P artık Stack Exchange üzerinde önerilen bir site! Beta aşamasının başlayabilmesi için lütfen `kullanmaya söz verin`__.

source: 0.9.26 contains a major upgrade to our native crypto library, a new addressbook subscription protocol with signatures, and major improvements to the Debian/Ubuntu packaging.
pt_br: 0.9.26 contém uma grande atualização para a nossa biblioteca de criptografia nativa, um novo protocolo de assinatura de catálogo de endereços com assinaturas e grandes melhorias para o pacote Debian / Ubuntu.
tr: 0.9.26 sürümünde doğal şifreleme kitaplığında büyük bir güncelleme, yeni bir imzalar ile adres defteri aboneliği iletişim kuralı ve Debian/Ubuntu paketleri için büyük gelişmeler var.

source: For crypto, we have upgraded to GMP 6.0.0, and added support for newer processors, which will speed up crypto operations considerably. Also, we are now using constant-time GMP functions to prevent side-channel attacks. For caution, the GMP changes are enabled for new installs and Debian/Ubuntu builds only; we will include them for in-net updates in the 0.9.27 release.
pt_br: Para criptografia, nós atualizamos para o GMP 6.0.0, e adicionamos suporte para novos processadores, o que acelerará as operações de criptografia consideravelmente. Ainda, nós agora estamos usando funções GMP de tempo constante para prevenir ataques de canal lateral. Por precaução, as mudanças de GMP estão habilitadas somente para novas instalações e construções Debian/Ubuntu; nós as incluiremos para atualizações em rede no lançamento da versão 0.9.27.
tr: Şifreleme GMP 6.0.0 sürümüne yükseltildi ve şifreleme hızını önemli ölçüde arttıran daha yeni işlemleci destekleri de eklendi. Ayrıca artık yan kanal saldırılarını engellemek için sabit zamanlı GMP işlevleri kullanılıyor. Not: GMP değişiklikleri yalnızca yeni kurulumlar ve Debian/Ubuntu yapımları için etkin. Ağ güncellemelerine ise 0.9.27 sürümünde eklenecek.

source: For Debian/Ubuntu builds, we have added dependencies on several packages, including Jetty 8 and geoip, and removed the equivalent bundled code.
pt_br: Para compilações Debian/Ubuntu, adicionamos dependências em vários pacotes, incluindo Jetty 8 e geoip, e removemos o código empacotado equivalente.
tr: Debian/Ubuntu yapımları için Jetty 8 ve Geoip gibi bazı paket bağımlılıkları eklendi ve eşdeğer kodlar kaldırıldı.

source: There's a collection of bug fixes also, including a fix for a timer bug that caused instability and performance degradations over time.
pt_br: Há também uma coleção de correções de bugs, incluindo uma correção para um bug do temporizador que causava instabilidade e degradação de desempenho ao longo do tempo.
tr: Ayrıca, zaman içinde kararsızlığa ve başarım düşmesine neden olan bir zamanlayıcı hatası düzeltmesi ile birlikte bir dizi hata düzeltmesi yapıldı.

source: GMP 6.0.0 and jbigi/jcpuid native libraries, enabling significant speedups on newer architectures, and constant-time crypto operations (new installs and Debian/Ubuntu builds only, will include in the updates in the next release, 0.9.27)
pt_br: Bibliotecas nativas GMP 6.0.0 e jbigi/jcpuid, permitindo acelerações significativas em arquiteturas mais recentes e operações de criptografia em tempo constante (somente novas instalações e compilações Debian/Ubuntu, serão incluídas nas atualizações da próxima versão, 0.9.27)
tr: GMP 6.0.0 ve jbigi/jcpuid yerel kitaplıkları, daha yeni mimarilerde ve sabit zamanlı şifreleme işlemlerinde önemli hızlanmalar sağlar (yalnızca yeni kurulumlar ve Debian/Ubuntu derlemeleri, gelecek 0.9.27 sürümünde güncellemeler bulunacak)

source: Addressbook subscription protocol, enabling signed addressbook updates
pt_br: Protocolo de assinatura do catálogo de endereços, permitindo atualizações assinadas do catálogo de endereços
tr: Adres defteri abonelik iletişim kuralı, imzalı adres defteri güncellemeleri etkinleştirildi

source: Generate signed authentication strings for subscriptions in i2ptunnel
pt_br: Gerar strings de autenticação assinadas para assinaturas no i2ptunnel
tr: i2ptunnel üzerindeki abonelikler için imzalı kimlik doğrulama dizeleri oluşturuldu

source: Enhance hosts blockfile format to allow for multiple destinations per entry
pt_br: Melhore o formato do arquivo de bloco de hosts para permitir vários destinos por entrada
tr: Sunucu engelleme dosyası biçimi her kayıt için birden çok hedefe izin veren biçime dönüştürüldü

source: Use system GeoIP database when available
pt_br: Use o banco de dados GeoIP do sistema quando disponível
tr: Uygun olduğunda sistem GeoIP veri tabanının kullanılması sağlandı

source: Remove systray4j.jar from non-Windows installers and Debian/Ubuntu packages
pt_br: Remover systray4j.jar de instaladores não Windows e pacotes Debian/Ubuntu
tr: systray4j.jar dosyası Windows olmayan kuruculardan ve Debian/Ubuntu paketlerinden kaldırıldı

source: Remove multiple external libraries from Debian/Ubuntu builds, and add dependencies on: geoip-database, gettext-base, libgetopt-java, libjetty8-java, libservlet3.0-java, glassfish-javaee
pt_br: Remova várias bibliotecas externas de compilações Debian/Ubuntu e adicione dependências em: geoip-database, gettext-base, libgetopt-java, libjetty8-java, libservlet3.0-java, glassfish-javaee
tr: Debian/Ubuntu derlemelerinden birden çok dış kitaplık kaldırıldı ve şu bağımlılıklar eklendi: geoip-database, gettext-base, libgetopt-java, libjetty8-java, libservlet3.0-java, glassfish-javaee

source: Store CRLs received in the news feed, to distribute key revocations when necessary
pt_br: Armazene CRLs recebidas no feed de notícias para distribuir revogações de chaves quando necessário
tr: Gerektiğinde anahtar iptallerini dağıtmak için haber akışında alınan sertifka geri çekme listeleri kaydedildi

source: Enhancements to the desktopgui system tray feature, to be enabled by default in next release
pt_br: Melhorias no recurso da bandeja do sistema desktopgui, que serão habilitadas por padrão na próxima versão
tr: Bir sonraki sürümde varsayılan olarak etkinleştirilecek olan Desktopgui sistem tepsisi özelliğinde geliştirmeler yapıldı

source: Wrapper 3.5.29 (new non-Windows installs only)
pt_br: Wrapper 3.5.29 (somente novas instalações que não sejam Windows)
tr: Wrapper 3.5.29 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: Fix periodic timers not firing after a backwards OS clock shift, which caused widespread instability and gradual deterioration
pt_br: Corrigir temporizadores periódicos que não disparavam após uma mudança de relógio do sistema operacional para trás, o que causava instabilidade generalizada e deterioração gradual
tr: Yaygın kararsızlığa ve kademeli bozulmaya neden olan, geriye dönük bir işletim sistemi saat sapmasından sonra periyodik zamanlayıcıların çalışmaması sorunu düzeltildi

source: Fix wrapper on FreeBSD 10 (new installs only, see ticket #1118 for manual fix)
pt_br: Corrigir wrapper no FreeBSD 10 (somente novas instalações, veja o ticket #1118 para correção manual)
tr: FreeBSD 10 üzerinde Wrapper düzeltildi (yalnızca yeni kurulumlar, el ile düzeltmek için 1118 numaralı destek kaydına bakın)

source: Fix NPE on hostname lookup failure in SOCKS 4a
pt_br: Corrigir NPE na falha de pesquisa de nome de host no SOCKS 4a
tr: SOCKS 4a üzerinde sunucu adı arama hatasındaki NPE düzeltildi

source: Fix setting JAVA_HOME on Mac OS X (new installs only, see ticket #1783 for manual fix)
pt_br: Corrigir a configuração JAVA_HOME no Mac OS X (somente novas instalações, consulte o tíquete nº 1783 para correção manual)
tr: Mac OS X üzerinde JAVA_HOME ayarı düzeltildi (yalnızca yeni kurulumlar, el ile düzeltmek için 1783 numaralı destek kaydına bakın)
