Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: An HTTP tunnel is the tunnel type that is optimized for hosting HTTP services. It has filtering and rate-limiting features enabled that are tailored specifically to that purpose. A standard tunnel may work as well, but if you select a atandard tunnel you'll need to take care of those security features yourself. A more in-depth dive into the HTTP Tunnel configuration is available in the next tutorial.
pt_br: Um túnel HTTP é o tipo de túnel otimizado para hospedar serviços HTTP. Ele tem recursos de filtragem e limitação de taxa habilitados que são adaptados especificamente para esse propósito. Um túnel padrão também pode funcionar, mas se você selecionar um túnel padrão, precisará cuidar desses recursos de segurança você mesmo. Um mergulho mais aprofundado na configuração do Túnel HTTP está disponível no próximo tutorial.
tr: HTTP tüneli, HTTP hizmetlerini barındırmak için ayarlanmış bir tünel türüdür. Özel olarak bu amaca göre uyarlanmış süzme ve hız sınırlama özellikleri vardır. Standart bir tünel de işe yarayabilir, ancak standart bir tünel seçerseniz bu güvenlik özelliklerini kendiniz almalısınız. Bir sonraki eğitimde HTTP tüneli yapılandırmasına daha derinlemesine inebilirsiniz.

source: Step Four: Give it a name and a description
pt_br: Etapa quatro: dê um nome e uma descrição
tr: Dördüncü adım: Bir ad ve açıklama yazın

source: For your own benefit and ability to remeber and distinguish the what you are using the tunnel for, give it a good nickname and description. If you need to come back and do more management later, then this is how you will identify the tunnel in the hidden services manager.
pt_br: Para seu próprio benefício e capacidade de lembrar e distinguir o que você está usando o túnel, dê a ele um bom apelido e descrição. Se você precisar voltar e fazer mais gerenciamento depois, então é assim que você identificará o túnel no gerenciador de serviços ocultos.
tr: Kendinize ne için kullandığınızı hatırlatmak ve ayırt etmek için tünele iyi bir takma ad ve açıklama yazın. Daha sonra geri dönüp başka işlemler yapmanız gerekirse, gizli hizmetler yöneticisinde tüneli bu şekilde tanıyabilirsiniz.

source: Step Five: Configure the Host and Port
pt_br: Etapa cinco: configurar o host e a porta
tr: Beşinci adım: Sunucuyu ve bağlantı noktasını yapılandırın

source: In this step, you point the web server at the TCP port where your web server is listening. Since most web servers listen on port 80 or port 8080, the example shows that. If you use alternate ports or virtual machines or containers to isolate your web services, you may need to adjust the host, port, or both.
pt_br: Nesta etapa, você aponta o servidor web para a porta TCP onde seu servidor web está escutando. Como a maioria dos servidores web escuta na porta 80 ou na porta 8080, o exemplo mostra isso. Se você usar portas alternativas ou máquinas virtuais ou contêineres para isolar seus serviços web, pode ser necessário ajustar o host, a porta ou ambos.
tr: Bu adımda, site sunucusunu, site sunucunuzun dinlediği TCP bağlantı noktasına yönlendirmelisiniz. Çoğu site sunucusu 80 veya 8080 numaralı bağlantı noktalarını dinlediğinden, örnekte bu kullanıldı. İnternet hizmetlerinizi yalıtmak için alternatif bağlantı noktaları veya sanal makineler veya kapsayıcılar kullanıyorsanız, sunucuyu, bağlantı noktasını veya her ikisini birden ayarlamanız gerekebilir.

source: Step Six: Decide whether to start it automatically
pt_br: Etapa seis: decida se deseja iniciá-lo automaticamente
tr: Altıncı adım: Otomatik olarak başlatılıp başlatılmayacağını seçin

source: I cannot think of a way to elaborate on this step.
pt_br: Não consigo pensar em uma maneira de elaborar essa etapa.
tr: Bu adımla ilgili verilecek bir ayrıntı düşünemiyorum.

source: Step Seven: Review your settings
pt_br: Sétimo passo: revise suas configurações
tr: Yedinci adım: Ayarlarınızı gözden geçirin

source: Finally, take a look at the settings you have selected. If you approve, save them. If you did not choose to start the tunnel automatically, go to the hidden services manager and start it manually when you wish to make your service available.
pt_br: Por fim, dê uma olhada nas configurações que você selecionou. Se você aprovar, salve-as . Se você não escolheu iniciar o túnel automaticamente, vá para o gerenciador de serviços ocultos e inicie-o manualmente quando desejar tornar seu serviço disponível.
tr: Son olarak, seçtiğiniz ayarlara bir göz atın. Tamamsa kaydedin. Tüneli otomatik olarak başlatmayı seçmediyseniz, gizli hizmetler yöneticisine gidin ve hizmetinizi kullanılabilir hale getirmek istediğinizde el ile başlatın.

source: Appendix: HTTP Server Customization Options
pt_br: Apêndice: Opções de personalização do servidor HTTP
tr: Ek: HTTP Sunucusu Özelleştirme Seçenekleri

source: I2P provides a detailed panel for configuring the http server tunnel in custom ways. I'll finish this tutorial by walking through all of them. Eventually.
pt_br: O I2P fornece um painel detalhado para configurar o túnel do servidor http de maneiras personalizadas. Vou terminar este tutorial percorrendo todas elas. Eventualmente.
tr: I2P, http sunucu tünelini özel yöntemlerle yapılandırmak için ayrıntılı bir pano sunar. Bu eğitimi bunlara değinerek bitireceğim.

source: Offering an I2P Mirror
pt_br: Oferecendo um espelho I2P
tr: I2P Yansısı Sunmak

source: How to offer your existing Web Site as an I2P eepSite
pt_br: Como oferecer seu site existente como um eepSite I2P
tr: Var olan sitenizi I2P eepSitesi olarak sunmak

source: This blog post is intended as a general guide to running a mirror of a clear-net service as an eepSite. It elaborates on the previous blog post about basic I2PTunnel tunnels.
pt_br: Este post de blog pretende ser um guia geral para executar um espelho de um serviço de rede limpa como um eepSite. Ele elabora o post de blog anterior sobre túneis básicos I2PTunnel.
tr: Bu blog yazısı, herkese açık bir İnternet hizmetinin yansısını eepSite olarak çalıştırmak için genel bir rehber olarak düşünüldü. Temel I2PTunnel tünelleri hakkında önceki blog yazısının ayrıntılarına giriyor.

source: Unfortunately, it's probably impossible to *completely* cover all possible cases of making an existing web site available as an eepSite, there's simply too diverse an array of server-side software, not to mention the in-practice peculiarities of any particular deployment of software. Instead, I'm going to try and convey, as specifically as possible, the general process preparing a service for deployment to the eepWeb or other hidden services.
pt_br: Infelizmente, é provavelmente impossível cobrir *completamente* todos os casos possíveis de tornar um site existente disponível como um eepSite, há simplesmente uma gama muito diversa de software do lado do servidor, sem mencionar as peculiaridades na prática de qualquer implantação específica de software. Em vez disso, vou tentar transmitir, da forma mais específica possível, o processo geral de preparação de um serviço para implantação no eepWeb ou outros serviços ocultos.
tr: Ne yazık ki, var olan bir siteyi bir eepSite olarak sunmanın tüm olası biçimlerini *tamamen* kapsamak olanaksız. Sunucu tarafında çok çeşitli yazılımlar var ve herhangi bir her yazılımın kurulumunda olabilecek farklılıklardan bahsetmeye gerek bile yok, Bunun yerine, bir hizmeti eepWeb veya diğer gizli hizmetlere dağıtmak için genel hazırlanma sürecini olabildiğince belirli olarak anlatmayı deneyeceğim.

source: Much of this guide will be treating the reader as a conversational participant, in particular If I really mean it I will address the reader directly(i.e. using "you" instead of "one") and I'll frequently head sections with questions I think the reader might be asking. This is, after all, a "process" that an administrator must consider themselves "involved" in just like hosting any other service.
pt_br: Grande parte deste guia tratará o leitor como um participante de conversação, em particular. Se eu realmente quiser dizer isso, me dirigirei ao leitor diretamente (ou seja, usando "você" em vez de "um") e frequentemente encabeçarei as seções com perguntas que acho que o leitor pode estar fazendo. Afinal, este é um "processo" no qual um administrador deve se considerar "envolvido" assim como hospedar qualquer outro serviço.
tr: Bu rehberin çoğu okuyucuyu sohbete katılan biri olarak ele alacak. Özellikle gerçekten ciddiysem okuyucuya doğrudan hitap edeceğim ("bir" yerine "siz" kullanarak) ve bölümlere sık sık düşündüğüm soruları okuyucu soruyormuş gibi başlayacağım. Ne de olsa bu durum, bir yöneticinin, diğer herhangi bir hizmeti barındırırken olduğu gibi, kendisinin "katılması" gereken bir "süreç".

source: DISCLAIMERS:
pt_br: ISENÇÕES:
tr: SORUMLULUK REDDİ:

source: While it would be wonderful, it's probably impossible for me to put specific instructions for every single kind of software that one might use to host web sites. As such, this tutorial requires some assumptions on the part of the writer and some critical thinking and common sense on the part of the reader. To be clear, **I have assumed that the person following this tutorial is** **already operating a clear-web service linkable to a real identity or** **organization** and thus is simply offering anonymous access and not anonymizing themselves.
pt_br: Embora fosse maravilhoso, é provavelmente impossível para mim colocar instruções específicas para cada tipo de software que alguém pode usar para hospedar sites . Como tal, este tutorial requer algumas suposições por parte do escritor e algum pensamento crítico e bom senso por parte do leitor. Para ser claro, **presumi que a pessoa que segue este tutorial está** **já operando um serviço de web transparente vinculável a uma identidade real ou** **organização** e, portanto, está simplesmente oferecendo acesso anônimo e não se anonimizando.
tr: Harika olsa da, siteleri barındırmak için kullanılabilecek her tür yazılım için özel yönergeler vermem olanaksız. Bu nedenle, bu eğitim, yazar tarafından bazı varsayımlar yapılarak, okuyucu tarafında eleştirel düşünmenin ve sağduyunun bulunduğu düşünülerek yazıldı. Açık olmak gerekirse, **Bu eğitimi izleyen kişinin**-**zaten gerçek bir kimliğe veya** **kuruluşa bağlanabilen açık bir internet hizmeti işlettiği ve dolayısıyla yalnızca anonim erişim sunmak istediği ve kendisini anonimleştirmekle ilgilenmediği düşünülüyor.

source: Thus, **it makes no attempt whatsoever to anonymize** a connection from one server to another. If you want to run a new, un-linkable hidden service that makes server-to-server connections, additional steps will be required and will be covered in another tutorial.
pt_br: Portanto, **ele não faz nenhuma tentativa de tornar anônima** uma conexão de um servidor para outro. Se você quiser executar um novo serviço oculto não vinculável que faz conexões de servidor para servidor, etapas adicionais serão necessárias e serão abordadas em outro tutorial.
tr: Bu nedenle, bir sunucudan diğerine olan bir bağlantıyı **anonimleştirmek** için herhangi bir işlem yapılmayacak. Sunucudan sunucuya bağlantılar kuran yeni, bağlantı kurulamayan gizli bir hizmet çalıştırmak istiyorsanız, ek işlemler yapmanız gerekir ve bunlar başka bir eğitimde anlatılacak.

source: That said: If you can be sure that a *brand new service* which is *not* *available to the clear-web* will never make a server-to-server connection and will not leak server metadata in responses to clients, then services configured in this way will be anonymous.
pt_br: Dito isso: se você puder ter certeza de que um *novo serviço* que *não* está *disponível para a web limpa* nunca fará uma conexão de servidor para servidor e não vazará metadados do servidor em respostas aos clientes, então os serviços configurados dessa forma serão anônimos.
tr: Bununla birlikte: Herkese açık İnternet üzerinde *kullanılamayan* *yepyeni bir hizmetin* hiçbir zaman sunucudan sunucuya bağlantı kurmayacağından ve istemcilere verilen yanıtlarda sunucu üst verilerini sızdırmayacağından emin olabilirseniz, bu şekilde yapılandırılmış hizmetler anonim olacaktır.

source: Process One: Prepare your Server
pt_br: Processo Um: Prepare seu Servidor
tr: Birinci işlem: Sunucunuzu hazırlayın

source: Step one: Determine what software you are running
pt_br: Etapa 1: determine qual software você está executando
tr: Birinci adım: Hangi yazılımı çalıştırdığınızı belirleyin

source: In practice, your web service probably uses a number of things to enhance it's reliability and security. These things could be proxies, reverse proxies, containers, tunnels, Intrusion Detection Systems, rate-limiters, load balancers, among many other things. When you get started, you should go through your deployment and determine which software you are using, and what you are using it for.
pt_br: Na prática, seu serviço web provavelmente usa uma série de coisas para melhorar sua confiabilidade e segurança. Essas coisas podem ser proxies, proxies reversos, contêineres, túneis, sistemas de detecção de intrusão, limitadores de taxa, balanceadores de carga, entre muitas outras coisas. Quando você começar, você deve passar por sua implantação e determinar qual software você está usando e para que você o está usando .
tr: Uygulamada, internet hizmetinizde güvenilirliği ve güvenliği artırmak için bir çok şey kullanılıyor olabilir. Bunlar, vekil sunucular, ters vekil sunucular, kapsayıcılar, tüneller, saldırı algılama sistemleri, hız sınırlayıcılar, yük dengeleyiciler gibi şeyler olabilir. Başladığınızda, dağıtımınızı gözden geçirmeli ve hangi yazılımı ve ne için kullanacağınızı belirlemelisiniz.

source: As you examine your software, ask yourself these questions
pt_br: Ao examinar seu software, pergunte a si mesmo estas perguntas
tr: Yazılımınızı incelerken kendinize şu soruları sorun

source: These questions should help you evaluate what parts of your software stack are relevant to your I2P eepSite.
pt_br: Essas perguntas devem ajudar você a avaliar quais partes do seu conjunto de software são relevantes para seu I2P eepSite.
tr: Bu sorular, yazılım yığınınızın hangi bölümlerinin I2P eepSite ilgili olduğunu değerlendirmenize yardımcı olacak.

source: Does this software work based on IP addresses?
pt_br: Este software funciona com base em endereços IP?
tr: Bu yazılım IP adresleri ile çalışıyor mu?

source: If you are using software which alters the behavior of traffic based on the IP address of the sender, these things will probably not work with I2P, or may work in complicated or unexpected ways. This is because the address will usually be the localhost, or at least the host where your I2P router is running. Software which sometimes does things based on IP addresses could be Fail2Ban, iptables, and similar applications.
pt_br: Se você estiver usando um software que altera o comportamento do tráfego com base no endereço IP do remetente, essas coisas provavelmente não funcionarão com I2P, ou podem funcionar de maneiras complicadas ou inesperadas. Isso ocorre porque o endereço geralmente será o host local, ou pelo menos o host onde seu roteador I2P está sendo executado. O software que às vezes faz coisas com base em endereços IP pode ser Fail2Ban, iptables, e aplicativos semelhantes.
tr: Göndericinin IP adresine bağlı olarak trafiğin davranışını değiştiren bir yazılım kullanıyorsanız, bunlar büyük olasılıkla I2P ile çalışmayacak ya da karmaşık veya beklenmedik şekillerde çalışacaktır. Bunun nedeni, adresin genellikle yerel sunucu veya en azından I2P yönelticinizin çalıştığı sunucu olmasıdır. IP adreslerine dayalı işler yapan yazılımlar Fail2Ban, iptables gibi uygulamalar olabilir.

source: Does this software work by "Tagging" traffic with additional metadata?
pt_br: Este software funciona "marcando" o tráfego com metadados adicionais?
tr: Bu yazılım, trafiği ek üst verilerle "Etiketleyerek" çalışır mı?

source: Some software may be configured to add information to the traffic it handles. Obviously, if this information is identifying it should not be part of the chain of services that is exposed to the I2P network.
pt_br: Alguns softwares podem ser configurados para adicionar informações ao tráfego que manipulam. Obviamente, se essas informações forem de identificação, elas não devem fazer parte da cadeia de serviços que é exposta à rede I2P.
tr: Bazı yazılımlar, yönettiği trafiğe bilgi eklemek için yapılandırılabilir. Açıkçası, bu bilgi tanımlayıcı ise, I2P ağını kullanan hizmetler zincirinin bir parçası olmamalıdır.

source: Does this software work by communicating with a remote resource? What triggers this behavior?
pt_br: Este software funciona comunicando-se com um recurso remoto? O que desencadeia esse comportamento?
tr: Bu yazılım çalışırken uzak bir kaynakla iletişim kuruyor mu? Bu davranışı ne tetikliyor?

source: Some software may also draw from remote resources, to find up-to-date rules and block lists which can be used to prevent attacks. Some of these might be useful as part of the service that is exposed to I2P, but you should make sure that the rules are applicable and that a rules update cannot be triggered as a result of a normal client request. This would create a server-to-server communication which could reveal the timing of an I2P communication to a third party.
pt_br: Alguns softwares também podem extrair recursos remotos para encontrar regras atualizadas e listas de bloqueio que podem ser usadas para evitar ataques. Alguns deles podem ser úteis como parte do serviço que é exposto ao I2P, mas você deve se certificar de que as regras sejam aplicáveis e que uma atualização de regras não possa ser acionada como resultado de uma solicitação normal do cliente. Isso criaria uma comunicação de servidor para servidor que poderia revelar o momento de uma comunicação I2P para um terceiro.
tr: Bazı yazılımlar, saldırıları önlemek için kullanılabilecek güncel kuralları ve engelleme listelerini bulmak için uzak kaynaklardan da faydalanabilir. Bunlardan bazıları, I2P ağını kullanan hizmetin bir parçası olarak faydalı olabilir. Ancak kuralların uygulanabilir olduğundan ve normal bir istemci isteği sonucunda bir kural güncellemesinin tetiklenemeyeceğinden emin olmalısınız. Bu durum, üçüncü bir tarafla bir I2P iletişiminin kurulma zamanını ortaya çıkarmak için kullanılabilecek bir sunucudan sunucuya iletişim oluşturacaktır.

source: Step two: Determine which port to Forward to I2P and Optionally locate your TLS certificate
pt_br: Etapa dois: determine qual porta encaminhar para I2P e, opcionalmente, localize seu certificado TLS
tr: İkinci adım: Hangi bağlantı noktasının I2P ağına iletileceğini belirleyin ve isteğinize bağlı olarak TLS sertifikanızı ayarlayın

source: Now you've gathered all the information that you will require to forward your service to I2P. Once you've selected the point at which you would like to make your site available to I2P, you will need to note the port you wish to foward. In simple scenarios, this will probably just be port 80 or port 8080. In more sophisticated scenarios, this might be a reverse proxy or something like that. Make a note of the port.
pt_br: Agora você reuniu todas as informações que precisará para encaminhar seu serviço para o I2P. Depois de selecionar o ponto em que gostaria de tornar seu site disponível para o I2P, você precisará anotar a porta que deseja encaminhar. Em cenários simples, provavelmente será apenas a porta 80 ou a porta 8080. Em cenários mais sofisticados, pode ser um proxy reverso ou algo assim. Anote a porta.
tr: Artık hizmetinizi I2P ağına iletmek için gerek duyacağınız tüm bilgileri topladınız. Sitenizi I2P için kullanılabilir hale getirmek istediğiniz noktayı seçtikten sonra iletmek istediğiniz bağlantı noktasını not etmelisiniz. Basit senaryolarda, bu yalnızca 80 veya 8080 numaralı bağlantı noktası olacaktır. Daha karmaşık senaryolarda, bu bir ters vekil sunucu veya bunun gibi bir şey olabilir. Bağlantı noktasını not edin.

source: Establishing a Common Identity for both the Clearnet and your eepSite
pt_br: Estabelecendo uma identidade comum para o Clearnet e seu eepSite
tr: Hem herkese açık İnternet hem de eepSite için ortak kimlik oluşturmak

source: Should you be a non-anonymous organization that wishes to provide enhanced privacy to your users by providing a hidden service, you may wish to establish a common identity between versions of your site. However, since we can't add `.i2p domains to clearnet TLS certificates </IDENTITY/tls.html>`__, we have to do this in another way. To do this, **even if you are forwarding the HTTP port** **and not HTTPS**, make a note of the location of your TLS certificate for use in the final step.
pt_br: Caso você seja uma organização não anônima que deseja fornecer privacidade aprimorada de para seus usuários fornecendo um serviço oculto, você pode desejar estabelecer uma identidade comum entre as versões do seu site. No entanto, como não podemos adicionar domínios `.i2p aos certificados TLS clearnet </IDENTITY/tls.html>`__, temos que fazer isso de outra maneira. Para fazer isso, **mesmo se você estiver encaminhando a porta HTTP** **e não HTTPS**, anote a localização do seu certificado TLS para uso na etapa final.
tr: Gizli bir hizmet sunarak kullanıcılarınıza gelişmiş gizlilik sağlamak isteyen anonim olmayan bir kuruluşsanız, sitenizin sürümleri arasında ortak bir kimlik oluşturmak isteyebilirsiniz. Ancak herkese açık İnternet `TLS sertifikalarına .i2p etki alanları ekleyemediğimiz </IDENTITY/tls.html>`__ için bunu başka bir şekilde yapmamız gerekiyor. Bunun için, **HTTPS değil** **HTTP bağlantı noktasını iletiyor olsanız bile**, son adımda kullanmak üzere TLS sertifikanızın konumunu not edin.

source: Process Two: Forward your service to an eepSite
pt_br: Processo dois: encaminhe seu serviço para um eepSite
tr: İkinci işlem: Hizmetinizi bir eepSite hizmetine iletin

source: Congratulations! You've completed the most difficult part. From here on, the decisions you must make, and the consequences that they will have, are much more straightforward and easy to enumerate. Such is the beauty of a cryptographically secure network layer like I2P!
pt_br: Parabéns! Você concluiu a parte mais difícil. Daqui em diante, as decisões que você deve tomar, e as consequências que elas terão, são muito mais diretas e fáceis de enumerar. Essa é a beleza de uma camada de rede criptograficamente segura como a I2P!
tr: Tebrikler! En zor kısmı tamamladınız. Bundan sonra, vermeniz gereken kararlar ve bunların doğuracağı sonuçlar çok daha basit ve hesaplanması kolay. I2P gibi şifrelenmiş güvenli bir ağ katmanının güzelliği budur!

source: Step three: Generate your .i2p Tunnels and Addresses
pt_br: Etapa três: gere seus túneis e endereços .i2p
tr: Üçüncü adım: .i2p tünellerinizi ve adreslerinizi oluşturun
