Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Implementation for sending Meta LS2 to floodfills (proposal 123)
pt_br: Implementação para envio de Meta LS2 para aterros (proposta 123)
tr: Üst veri LS2 otomatik doldurmaya gönderildi (123 numaralı öneri)

source: Wrapper 3.5.39 (new installs only)
pt_br: Wrapper 3.5.39 (somente novas instalações)
tr: Wrapper 3.5.39 sürümüne güncellendi (yalnızca yeni kurulumlar)

source: Add wrapper for arm7 and aarch64 (new installs only)
pt_br: Adicionar wrapper para arm7 e aarch64 (somente novas instalações)
tr: Arm7 ve aarch64 için Wrapper eklendi (yalnızca yeni kurulumlar)

source: Fixes for transitioning out of hidden mode
pt_br: Correções para a transição do modo oculto
tr: Gizli kipten geçiş için düzeltmeler yapıldı

source: Fix i2psnark writing config files at shutdown
pt_br: Corrigir i2psnark escrevendo arquivos de configuração no desligamento
tr: Kapatma sırasında i2psnark yapılandırma dosyalarına yazma düzeltildi

source: Fix netdb ready after initial reseed
pt_br: Corrigir netdb pronto após nova semente inicial
tr: İlk yeniden tohumlama işleminden sonra "Ağ veri tabanı" (NetDB) hazır hale getirildi

source: Fix delivery of acks for a database store message
pt_br: Corrigir entrega de acks para uma mensagem de armazenamento de banco de dados
tr: Bir veri tabanı kaydetme iletisi için onay teslimi düzeltildi

source: Fix delivery of large messages in SSU
pt_br: Corrigir entrega de mensagens grandes em SSU
tr: SSU büyük ileti teslimi düzeltildi

source: Fix console install for IzPack 5
pt_br: Corrigir instalação do console para IzPack 5
tr: IzPack 5 için pano kurulumu düzeltildi

source: Fixes for webapps in Jetty eepsite
pt_br: Correções para webapps no Jetty eepsite
tr: Jetty eepsitesindeki internet uygulamaları düzeltildi

source: New console logos and icons
pt_br: Novos logotipos e ícones do console
tr: Yeni pano logoları ve simgeler

source: Update hidden mode country list
pt_br: Atualizar lista de países do modo oculto
tr: Gizli kip ülke listesi güncellendi

source: Limit UPnP lease duration
pt_br: Limitar a duração do lease UPnP
tr: UPnP kiralama süresi sınırlandı

source: Faster netdb startup
pt_br: Inicialização mais rápida do netdb
tr: "Ağ veri tabanının" (NetDB) daha hızlı başlatılması sağlandı

source: Startup improvements for Android
pt_br: Melhorias de inicialização para Android
tr: Andorid için başlatma iyileştirildi

source: New X25519 code for LS2 per-client authentication (proposal 123) and upcoming new encryption (proposal 144)
pt_br: Novo código X25519 para autenticação LS2 por cliente (proposta 123) e nova criptografia futura (proposta 144)
tr: İstemci başına LS2 kimlik doğrulaması için yeni X25519 kodu (123 numaralı öneri) ve yakında yayınlanacak yeni şifreleme (144 numaralı öneri)

source: Sybil tool enhancements and bug fixes
pt_br: Melhorias na ferramenta Sybil e correções de bugs
tr: Sybil aracında geliştirmeler ve hata düzeltmeleri yapıldı

source: Start first geoIP lookup sooner
pt_br: Inicie a primeira pesquisa geoIP mais cedo
tr: İlk GeoIP aramasının daha erken başlatılması sağlandı

source: Speeding up your I2P network
pt_br: Acelerando sua rede I2P
tr: I2P ağınızı hızlandırmak

source: *This post is adapted directly from material originally created for mhatta's* `medium blog <https://medium.com/@mhatta/speeding-up-your-i2p-network-c08ec9de225d>`__\ *.* *He deserves the credit for the OP. It has been updated in certain places where* *it refers to old versions of I2P as current and has undergone some light* *editing. -idk*
pt_br: *Este post é adaptado diretamente do material criado originalmente para o blog do mhatta* `medium <https://medium.com/@mhatta/speeding-up-your-i2p-network-c08ec9de225d>`__\ *.* *Ele merece o crédito pelo OP. Ele foi atualizado em certos lugares onde* *ele se refere a versões antigas do I2P como atuais e passou por alguma luz* *edição. -idk*
tr: *Bu yazı doğrudan mhatta tarafından yazılmış * `medium blogu <https://medium.com/@mhatta/speeding-up-your-i2p-network-c08ec9de225d>`__\ * yazısından uyarlanmıştır.* OP için emeklerine teşekkürü hak ediyor. Eski I2P sürümlerini güncel olarak ifade ettiği* *bazı yerler güncellendi ve hafif* *düzeltmeler yapıldı. -idk*

source: Right after it starts up, I2P is often seen as a little bit slow. It's true, and we all know why, by nature, `garlic routing <https://en.wikipedia.org/wiki/Garlic_routing>`__ adds overhead to the familiar experience of using the internet so that you can have privacy, but this means that for many or most I2P services, your data will need to go through 12 hops by default.
pt_br: Logo após iniciar, o I2P é frequentemente visto como um pouco lento. É verdade, e todos nós sabemos por que, por natureza, o roteamento `garlic <https://en.wikipedia.org/wiki/Garlic_routing>`__ adiciona sobrecarga à experiência familiar de usar a internet para que você possa ter privacidade, mas isso significa que para muitos ou a maioria dos serviços I2P, seus dados precisarão passar por 12 saltos por padrão.
tr: Başladıktan hemen sonra, I2P genellikle biraz yavaş olarak görülür. Bu doğrudur ve doğası gereği `garlic yöneltme <https://en.wikipedia.org/wiki/Garlic_routing>`__ kişisel gizliliği korumak için bilinen İnternet kullanma deneyimine ek yük getirir. Ancak bu durum, birçok I2P hizmeti için verilerinizin varsayılan olarak 12 duraktan geçmesi gerektiği anlamına gelir.

source: Also, unlike Tor, I2P was primarily designed as a closed network. You can easily access `eepsites <https://medium.com/@mhatta/how-to-set-up-untraceable-websites-eepsites-on-i2p-1fe26069271d>`__ or other resources inside I2P, but you are not supposed to access `clearnet <https://en.wikipedia.org/wiki/Clearnet_(networking)>`__ websites through I2P. There exist a few I2P “outproxies” similar to `Tor <https://en.wikipedia.org/wiki/Tor_(anonymity_network)>`__\ ’s exit nodes to access clearnet, but most of them are very slow to use as going to the clearnet is effectively *another* hop in the already 6 hops in, six hops out connection.
pt_br: Além disso, diferentemente do Tor, o I2P foi projetado principalmente como uma rede fechada. Você pode acessar facilmente `eepsites <https://medium.com/@mhatta/how-to-set-up-untraceable-websites-eepsites-on-i2p-1fe26069271d>`__ ou outros recursos dentro do I2P, mas você não deve acessar sites `clearnet <https://en.wikipedia.org/wiki/Clearnet_(networking)>`__ através do I2P. Existem alguns “outproxies” I2P semelhantes aos nós de saída do `Tor <https://en.wikipedia.org/wiki/Tor_(anonymity_network)>`__\ para acessar o clearnet, mas a maioria deles é muito lenta de usar, pois ir para o clearnet é efetivamente *outro* salto na conexão já de 6 saltos de entrada e seis saltos de saída.
tr: Ayrıca, Tor ağından farklı olarak I2P, öncelikle kapalı bir ağ olarak tasarlanmıştır. `eepsites <https://medium.com/@mhatta/how-to-set up-untraceable-websites-eepsites-on-i2p-1fe26069271d>`__ veya I2P içindeki diğer kaynaklara kolayca erişebilirsiniz. Ancak I2P aracılığıyla `herkese açık İnternet <https://en.wikipedia.org/wiki/Clearnet_(networking)>`__ üzerindeki sitelere erişemezsiniz. Herkese açık internet sitelerine erişmek için `Tor <https://en.wikipedia.org/wiki/Tor_(anonymity_network)>`__ ağına benzer birkaç I2P "çıkış vekil sunucusu" vardır. Ancak bunların çoğunun kullanımı çok yavaştır. Herkese açık İnternet sitelerine erişmek için *ek* 6 giriş ve 6 çıkış durağından geçilmesi gerekir.

source: Until a few versions ago, this problem was even harder to deal with because many I2P router users were having difficulties configuring the bandwidth settings for their routers. If everyone who can takes the time to adjust their bandwidth settings properly, they will improve not only your connection but also the I2P network as a whole.
pt_br: Até algumas versões atrás, esse problema era ainda mais difícil de lidar porque muitos usuários de roteadores I2P estavam tendo dificuldades para configurar as configurações de largura de banda para seus roteadores. Se todos que puderem reservar um tempo para ajustar suas configurações de largura de banda corretamente, eles melhorarão não apenas sua conexão, mas também a rede I2P como um todo.
tr: Birkaç sürüm öncesine kadar bu sorunla başa çıkmak daha da zordu. Çünkü birçok I2P yöneltici kullanıcısı yönelticileri için bant genişliği ayarlarını yapılandırmakta güçlük çekiyordu. Bant genişliği ayarlarını düzgün bir şekilde yapılandırmaya zaman ayırabilen herkes, yalnızca bağlantınızı değil, aynı zamanda bir bütün olarak I2P ağını da iyileştirecektir.

source: Adjusting bandwidth limits
pt_br: Ajustando limites de largura de banda
tr: Bant genişliği sınırlarını ayarlamak

source: Since I2P is a peer-to-peer network, you have to share some of your network bandwidth with other peers. You see choose how much in “I2P Bandwidth Configuration” (“Configure Bandwidth” button in the “Applications and Configuration” section of I2P Router Console, or http://localhost:7657/config).
pt_br: Como o I2P é uma rede peer-to-peer, você tem que compartilhar parte da sua rede largura de banda com outros peers. Você pode escolher quanto em “I2P Bandwidth Configuration” (botão “Configure Bandwidth” na seção “Applications and Configuration” do I2P Router Console, ou http://localhost:7657/config).
tr: I2P eşler arası bir ağ olduğundan, ağ bant genişliğinizin bir kısmını diğer eşler ile paylaşmanız gerekir. “I2P bant genişliği yapılandırması” bölümünde (I2P yöneltici panosunun “Uygulamalar ve yapılandırma” bölümündeki “Bant genişliğini yapılandır” düğmesi veya http://localhost:7657/config adresinden) ne kadar olduğunu görebilirsiniz.

source: If you see a shared bandwidth limit of 48 KBps, which is very low, then you may not have adjusted your shared bandwidth from the default. As the original author of the material this blog post is adapted from noted, I2P has a default shared bandwidth limit that is very low until the user adjusts it to avoid causing issues with the user's connection.
pt_br: Se você vir um limite de largura de banda compartilhada de 48 KBps, que é muito baixo, então você pode não ter ajustado sua largura de banda compartilhada do padrão. Como o autor original do material do qual esta postagem do blog foi adaptada observou, o I2P tem um limite de largura de banda compartilhada padrão que é muito baixo até que o usuário o ajuste para evitar causar problemas com a conexão do usuário.
tr: Çok düşük olan 48 KBps değerinde bir paylaşılan bant genişliği sınırı görüyorsanız, paylaşılan bant genişliğinizi varsayılan değerlerden ayarlamamış olabilirsiniz. Bu blog yazısının belirtilenden uyarlandığı materyalin özgün yazarı olarak, varsayılan I2P paylaşılan bant genişliği sınırı vardır ve bu sınır, kullanıcının bağlantısında sorunlara neden olmamak için kullanıcı tarafından ayarlanana kadar çok düşüktür.

source: However, since many users may not know exactly which bandwidth settings to adjust, the `I2P 0.9.38 release <https://geti2p.net/en/download>`__ introduced a New Install Wizard. It contains a Bandwidth Test, which automatically detects (thanks to M-Lab’s `NDT <https://www.measurementlab.net/tests/ndt/>`__) and adjusts I2P’s bandwidth settings accordingly.
pt_br: No entanto, como muitos usuários podem não saber exatamente quais configurações de largura de banda ajustar, a versão `I2P 0.9.38 <https://geti2p.net/en/download>`__ introduziu um Assistente de Nova Instalação. Ele contém um Teste de Largura de Banda, que detecta automaticamente (graças ao `NDT <https://www.measurementlab.net/tests/ndt/>`__ do M-Lab) e ajusta as configurações de largura de banda do I2P de acordo.
tr: Ancak, birçok kullanıcı bant genişliği ayarlarının tam olarak nasıl yapılandırılacağını bilemeyebileceğinden, `I2P 0.9.38 sürümünde <https://geti2p.net/en/download>`__ yeni kurulum yardımcısı sunuldu. (M-Lab'ın `NDT <https://www.measurementlab.net/tests/ndt/>`__ sayesinde) bant genişliğini otomatik olarak algılayan ve I2P ayarlarını buna göre yapılandıran bir bant genişliği sınaması bulunuyor.

source: If you want to re-run the wizard, for instance following a change in your service provider or bcause you installed I2P before version 0.9.38, you can re-launch it from the 'Setup' link on the 'Help & FAQ' page, or simply access the wizard directly at http://localhost:7657/welcome
pt_br: Se você quiser executar o assistente novamente, por exemplo, após uma alteração no seu provedor de serviços ou porque você instalou o I2P antes da versão 0.9.38, você pode reiniciá-lo no link 'Configuração' na página 'Ajuda & FAQ' ou simplesmente acessar o assistente diretamente em http://localhost:7657/welcome
tr: Hizmet sağlayıcınızda bir değişik yaptıysanız ya da I2P kurulumunu 0.9.38 sürümünden önce yüklediyseniz, yardımcıyı 'Yardım ve SSS' bölümündeki 'Kurulum' bağlantısından ya da http://localhost:7657/welcome adresinden yeniden başlatabilirsiniz.

source: Using the Wizard is straightforward, simply keep clicking “Next”. Sometimes M-Lab’s chosen measurement servers are down and the test fails. In such case, click “Previous” (do not use your web browser’s “back” button), then try it again.
pt_br: Usar o Wizard é direto, basta continuar clicando em “Next”. Às vezes, os servidores de medição escolhidos pelo M-Lab estão inativos e o teste falha. Nesse caso, clique em “Anterior” (não use o botão “voltar” do seu navegador da web) e, em seguida, tente novamente.
tr: Yardımcıyı kullanmak basittir, "İleri" üzerine tıklamanız yeterlidir. Bazen seçilen M-Lab ölçüm sunucuları çalışmıyor ve deneme başarısız oluyor. Böyle bir durumda, “Önceki” üzerine tıklayın (tarayıcınızın “geri” düğmesini kullanmayın), ardından yeniden deneyin.

source: Running I2P continuously
pt_br: Executando I2P continuamente
tr: I2P uygulamasını sürekli çalıştırmak

source: Even after adjusted the bandwidth, your connection might still be slow As I said, I2P is a P2P network. It will take some time for your I2P router to be discovered by other peers and integrated into the I2P network. If your router not up long enough to become well integrated, or if you shut down un-gracefully too often, the network will remain fairly slow. On the other hand, the longer you run your I2P router continuously, the faster and more stable your connection becomes, and more of your bandwidth share will be used in the network.
pt_br: Mesmo depois de ajustar a largura de banda, sua conexão ainda pode ficar lenta. Como eu disse, I2P é uma rede P2P. Levará algum tempo para que seu roteador I2P seja descoberto por outros pares e integrado à rede I2P. Se seu roteador não ficar ativo o suficiente para se tornar bem integrado, ou se você desligar de forma desajeitada com muita frequência, a rede permanecerá bastante lenta. Por outro lado, quanto mais você executar seu roteador I2P continuamente, mais rápida e estável sua conexão se tornará, e mais de sua parcela de largura de banda será usada na rede.
tr: Bant genişliği ayarlandıktan sonra bile bağlantınız hala yavaş olabilir Dediğim gibi I2P bir P2P ağıdır. I2P yönelticinizin diğer eşler tarafından keşfedilmesi ve I2P ağıyla bütünleşmesi biraz zaman alır. Yönelticiniz iyi bir şekilde bütünleşecek kadar uzun süredir çalışmıyorsa veya çok sık uygun olmayan şekilde kapanıyorsa, ağ oldukça yavaş kalır. Öte yandan, I2P yönlendiricinizi sürekli olarak ne kadar uzun süre çalıştırırsanız, bağlantınız o kadar hızlı ve kararlı hale gelir ve bant genişliği paylaşımınız ağda daha fazla kullanılır.

source: However, many people might not be able to stay your I2P router up. In such case, you can still run the I2P router on a remote server such as VPS, then use SSH port forwarding.
pt_br: No entanto, muitas pessoas podem não conseguir manter seu roteador I2P ativo. Nesse caso , você ainda pode executar o roteador I2P em um servidor remoto, como VPS, e então usar o encaminhamento de porta SSH .
tr: Ancak, birçok kişi I2P yönelticinizi ayakta tutamayabilir. Bu durumda, I2P yönelticiyi VPS gibi uzak bir sunucuda çalıştırabilir ve ardından SSH bağlantı noktası iletmeyi kullanabilirsiniz.

source: 0.9.42 Release
pt_br: Lançamento 0.9.42
tr: 0.9.42 sürümü yayınlandı

source: 0.9.42 with bug fixes
pt_br: 0.9.42 com bugs corrigidos
tr: 0.9.42 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.42 continues the work to make I2P faster and more reliable. It includes several changes to speed up our UDP transport. We have split up the configuration files to enable future work for more modular packaging. We continue work to implement new proposals for faster and more secure encryption. There are, of course, a lot of bug fixes also.
pt_br: 0.9.42 continua com o trabalho de tornar a I2P mais rápida e viável. Isso inclui diversas mudanças para acelerar o nosso transporte UDP. Nós dividimos os arquivos de configuração para permitir um empacotamento mais modular em futuros trabalhos. Nos continuamos com o trabalho de implementar novas propostas para criptografias mais rápidas e seguras. E há, é claro, diversas correções de bugs.
tr: 0.9.42 sürümünde I2P platformunu daha hızlı ve daha sağlam kılma üzerine çalışıldı. UDP taşıyıcısını hızlandıracak bir kaç değişiklik yapıldı. Gelecekte daha modüler bir paket oluşturmak için yapılandırma dosyaları ayrıldı. Daha hızlı ve güvenli şifreleme için yeni fikirler üzerinde çalışma sürdürüldü. Ayrıca çok sayıda hata düzeltmesi yapıldı.

source: Console: Split up help page, tag text for translation
pt_br: Console: Dividir página de ajuda, marcar texto para tradução
tr: Pano: Yardım sayfasını ayrıldı, metin çeviri için etiketlendi

source: Console: Hide NetDB RI and LS tabs
pt_br: Console: Ocultar as guias NetDB RI e LS
tr: Pano: "Ağ veri tabanı" (NetDB) RI ve LS sekmeleri gizlendi

source: Debian: Update files for Buster
pt_br: Debian: Atualizar arquivos para Buster
tr: Debian: Dosyalar Buster için güncellendi

source: i2psnark: Add last-activity to details page
pt_br: i2psnark: Adicionar last-activity à página de detalhes
tr: i2psnark: Ayrıntılar sayfasına son işlemler eklendi

source: i2ptunnel: Split i2ptunnel.config into individual files per-tunnel
pt_br: i2ptunnel: Dividir i2ptunnel.config em arquivos individuais por túnel
tr: i2ptunnel: i2ptunnel.config dosyası her tünel için ayrı dosyalara ayrıldı

source: JBigI: GMP 6.1.2 (Linux 64-bit only)
pt_br: JBigI: GMP 6.1.2 (somente Linux 64 bits)
tr: JBigI: GMP 6.1.2 (yalnızca Linux 64 bit)

source: NetDB: Choose alternate gateway for store replies to reduce connections
pt_br: NetDB: Escolha um gateway alternativo para armazenar respostas para reduzir conexões
tr: "Ağ veri tabanı" (NetDB): Bağlantıları azaltmak amacıyla yanıtları tutmak için alternatif ağ geçidi seçildi

source: Router: Split clients.config into individual files per-client
pt_br: Roteador: Dividir clients.config em arquivos individuais por cliente
tr: Yöneltici: Client.config dosyası her istemci için ayrı dosyalara ayrıldı

source: SSU: performance improvements
pt_br: SSU: melhorias de desempenho
tr: SSU: başarım iyileştirmeleri yapıldı

source: Transports: Cross-network prevention (proposal 147)
pt_br: Transportes: Prevenção inter-rede (proposta 147)
tr: Taşıyıcılar: Ağlar arası geçiş engellendi (147 numaralı öneri)

source: i2psnark: Autostart fixes
pt_br: i2psnark: Correções de inicialização automática
tr: i2psnark: Otomatik başlatma düzeltildi

source: i2psnark: Dup. data checks
pt_br: i2psnark: Verificações de dados duvidosas
tr: i2psnark: Çift veri denetimi eklendi

source: i2ptunnel: Failsafe timeouts
pt_br: i2ptunnel: Tempos limite à prova de falhas
tr: i2ptunnel: Başarısızlık zaman aşımları eklendi

source: NetDB: Fix NPE on store of encrypted LS2
pt_br: NetDB: Corrigir NPE no armazenamento de LS2 criptografado
tr: "Ağ veri tabanı" (NetDB): Şifrelenmiş LS2 deposunda NPE düzeltildi

source: Router: Fix Bloom filter false positives
pt_br: Roteador: Corrigir falsos positivos do filtro Bloom
tr: Yöneltici: Hatalı Bloom süzgeci yakalanmaları düzeltildi

source: Initial support for encryption types
pt_br: Suporte inicial para tipos de criptografia
tr: Şifreleme türleri için destek hazırlığı yapıldı

source: Support for new LS2 bit for blinding (proposal 123)
pt_br: Suporte para novo bit LS2 para cegamento (proposta 123)
tr: Körleme için yeni LS2 bit desteği eklendi (123 numaralı öneri)

source: Def Con Trip Report- zzz
pt_br: Relatório de viagem da Def Con - zzz
tr: Def Con gezi notları - zzz

source: Def Con Trip Report
pt_br: Relatório de viagem da Def Con
tr: Def Con gezi notları

source: idk and I attended DEFCON 27 and presented two workshops on I2P for application developers, with support from mhatta and Alex. I gave the workshop at Monero Village and idk gave the one at Crypto/Privacy Village. Here, I will summarize the Monero Village workshop, and a Tor talk by Roger Dingledine. idk will post a trip report covering his workshop.
pt_br: idk e eu participamos do DEFCON 27 e apresentamos dois workshops sobre I2P para desenvolvedores de aplicativos , com o apoio de mhatta e Alex. Eu dei o workshop no Monero Village e idk dei o do Crypto/Privacy Village. Aqui, vou resumir o workshop do Monero Village e uma palestra do Tor por Roger Dingledine. idk postará um relatório de viagem cobrindo seu workshop.
tr: idk ve ben DEFCON 27 etkinliğine katıldık. mhatta ve Alex ile uygulama geliştiricileri için I2P üzerine iki atölye çalışması yaptık. Çalıştayı Monero köyünde yaptım. idk ise Crypto/Privacy köyünde yaptı. Burada Monero köyü atölyesini ve Roger Dingledine tarafından yapılan Tor konuşmasını özetleyeceğim. idk, kendi atölyesiyle ilgili gezi notlarını ayrıca yayınlayacak.

source: We had about 8 attendees for the Monero Village workshop, entitled "I2P for Cryptocurrency Developers". We planned to discuss the particular networking needs for each application and work through the various i2ptunnel and SAM options available. However, all attendees were relatively unfamiliar with I2P, so we pivoted and gave an overview of I2P. As none of the attendees had a laptop with them, we helped several of them install I2P on their Android phone and walked through some of the features of the app. For all users, the app appeared to reseed and build tunnels fairly quickly.
pt_br: Tivemos cerca de 8 participantes no workshop Monero Village, intitulado "I2P para desenvolvedores de criptomoedas". Planejamos discutir as necessidades específicas de rede para cada aplicativo e trabalhar nas várias opções de i2ptunnel e SAM disponíveis. No entanto, todos os participantes estavam relativamente pouco familiarizados com o I2P, então mudamos e demos uma visão geral do I2P. Como nenhum dos participantes tinha um laptop com eles, ajudamos vários deles a instalar o I2P em seus telefones Android e percorremos alguns dos recursos do aplicativo. Para todos os usuários, o aplicativo pareceu repropagar e construir túneis bem rápido.
tr: "Kripto para birimi geliştiricileri için I2P" başlıklı Monero köyü çalıştayında 8 ,kadar katılımcımız vardı. Her uygulama için belirli ağ gereksinimlerini tartışmayı ve var olan çeşitli i2ptunnel ve SAM seçenekleriyle çalışmayı planladık. Ancak, tüm katılımcılar I2P ağına aşina değildi, bu yüzden genel bir I2P bilgilendirmesi de yaptık. Katılımcıların hiçbirinin yanlarında dizüstü bilgisayarı olmadığı için, birçoğunun Android telefonlarına I2P yüklemesine yardımcı olduk ve uygulamanın bazı özelliklerini inceledik. Uygulama tüm kullanıcılarda, tünelleri oldukça hızlı bir şekilde yeniden tohumlayıp oluşturdu.
