Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: I2P-Zero and Dependency-Free I2P Installation
pt_br: Instalação I2P-Zero e I2P sem dependências
tr: I2P-Zero ve Bağımlılığı Olmayan I2P Kurulumu

source: The first very successful effort at building a dependency-free I2P Package was I2P-Zero, which was created by the Monero project originally for use with the Monero cryptocurrency. This project got us very excited because of it's success in creating a general-purpose I2P router which could easily packaged with an I2P application. Especially on Reddit, many people express their preference for the simplicity of setting up an I2P-Zero router.
pt_br: O primeiro esforço muito bem-sucedido na construção de um pacote I2P livre de dependências foi o I2P-Zero, que foi criado pelo projeto Monero originalmente para uso com a criptomoeda Monero. Este projeto nos deixou muito animados por causa de seu sucesso na criação de um roteador I2P de uso geral que poderia ser facilmente empacotado com um aplicativo I2P. Especialmente no Reddit, muitas pessoas expressam sua preferência pela simplicidade de configurar um roteador I2P-Zero.
tr: Bağımlılığı olmayan bir I2P paketi oluşturmaya yönelik ilk başarılı çaba, Monero projesi tarafından özgün olarak Monero kripto para birimi ile kullanılmak üzere oluşturulan I2P-Zero idi. Bu proje, bir I2P uygulamasıyla kolayca paketlenebilen genel amaçlı bir I2P yöneltici oluşturma başarısı nedeniyle bizi çok heyecanlandırdı. Özellikle Reddit üzerinde birçok kişi, bir I2P-Zero yönelticisi kurmanın basitliği konusundaki düşüncelerini paylaşıyor.

source: This really proved to us that a dependency-free I2P Package which was easy to install was possible using modern Java tools, but I2P-Zero's use case was a little bit different than ours. It is best for embedded apps that need an I2P router that they can easily control using it's convenient control port on port "8051". Our next step would be to adapt the technology to the general-purpose I2P Application.
pt_br: Isso realmente nos provou que um Pacote I2P livre de dependências que fosse fácil de instalar era possível usando ferramentas Java modernas, mas o caso de uso do I2P-Zero era um pouco diferente do nosso. É melhor para aplicativos embarcados que precisam de um roteador I2P que eles podem controlar facilmente usando sua porta de controle conveniente na porta "8051". Nosso próximo passo seria adaptar a tecnologia ao Aplicativo I2P de propósito geral .
tr: Bu bize, modern Java araçlarını kullanarak kurulumu kolay, bağımlılığı olmayan bir I2P paketinin gerçekten hazırlanabileceğini kanıtladı. Ancak I2P-Zero kullanım durumu bizimkinden biraz farklıydı ve "8051" numaralı denetim bağlantı noktası ile kolayca denetlenebilecek bir I2P yönelticisine gerek duyan gömülü uygulamalar için en iyi seçenekti. Bir sonraki adımımız, genel amaçlı I2P uygulamasına teknolojiyi uyarlamak olacak.

source: OSX Application Security Changes affect I2P IzPack Installer
pt_br: Alterações na segurança do aplicativo OSX afetam o instalador I2P IzPack
tr: macOS Uygulama Güvenliği Değişiklikleri I2P IzPack Kuruyucu Etkiler

source: The issue became more pressing in recent versions of Mac OSX, where it is no longer straightforward to use the "Classic" installer which comes in the .jar format. This is because the application is not "Notarized" by Apple authorities and it is deemed a security risk. **However**, Jpackage can produce a .dmg file, which can be notarized by Apple authorities, conveniently solving our problem.
pt_br: O problema se tornou mais urgente nas versões recentes do Mac OSX, onde não é mais simples usar o instalador "Classic" que vem no formato .jar . Isso ocorre porque o aplicativo não é "autenticado" pelas autoridades da Apple e é considerado um risco à segurança. **No entanto**, o Jpackage pode produzir um arquivo .dmg, que pode ser autenticado pelas autoridades da Apple, resolvendo convenientemente nosso problema.
tr: Bu sorun, .jar biçiminde gelen "Klasik" kurucuyu kullanmanın artık kolay olmadığı son macOS sürümlerinde daha acil hale geldi. Bunun nedeni, uygulamanın Apple otoriteleri tarafından "Noter tasdikli" olmaması ve güvenlik riski olarak görülmesidir. **Ancak**, JPackage, Apple otoriteleri tarafından noter tasdikli bir .dmg dosyası üretebilir ve böylece sorunumuz kolayca çözülebilir.

source: The new I2P .dmg installer, created by Zlatinb, makes I2P easier to install on OSX than ever, no longer requiring users to install Java themselves and using standard OSX installation tools in their prescribed ways. The new .dmg installer makes setting up I2P on Mac OSX easier than it's ever been.
pt_br: O novo instalador .dmg do I2P, criado por Zlatinb, torna o I2P mais fácil de instalar no OSX do que nunca, não exigindo mais que os usuários instalem o Java eles mesmos e usando ferramentas de instalação padrão do OSX em suas formas prescritas. O novo instalador .dmg torna a configuração do I2P no Mac OSX mais fácil do que nunca.
tr: Zlatinb tarafından oluşturulan yeni I2P .dmg kurucusu, I2P uygulamasının macOS üzerine kurulmasını her zamankinden daha kolay hale getiriyor, artık kullanıcıların Java kurması ve standart macOS kurulum araçlarını belirtilen şekillerde kullanması gerekmiyor. Yeni .dmg kurucu, macOS üzerinde I2P kurulumunu hiç olmadığı kadar kolay hale getiriyor.

source: The I2P of the future is Easy to Install
pt_br: O I2P do futuro é fácil de instalar
tr: Gelecekte I2P Kurulumu Kolay Olacak

source: One of the things I hear from users the most is that if I2P wants adoption, it needs to be easy to use for people. Many of them want a "Tor Browser Like" user experience, to quote or paraphrase many familiar Redditors. Installation should not require complicated and error-prone "post-installation" steps. Many new users are not prepared to deal with their browser configuration in a thorough and complete way. To address this problem, we created the I2P Profile Bundle which configured Firefox so that it would automatically "Just Work" for I2P. As it's developed, it's added security features and improved integration with I2P itself. In it's latest version, it **also** bundles a complete, Jpackage powered I2P Router. The I2P Firefox Profile is now a fully-fledged distribution of I2P for Windows, with the only remaining dependency being Firefox itself. This should provide an unprecedented level of convenience for I2P users on Windows.
pt_br: Uma das coisas que mais ouço dos usuários é que se o I2P quer adoção, ele precisa ser fácil de usar para as pessoas. Muitos deles querem uma experiência de usuário "como o navegador Tor" , para citar ou parafrasear muitos Redditors familiares. A instalação não deve exigir etapas "pós-instalação" complicadas e propensas a erros. Muitos novos usuários não estão preparados para lidar com a configuração do navegador de forma completa e completa. Para resolver esse problema, criamos o I2P Profile Bundle que configurou o Firefox para que ele automaticamente "Simplesmente Funcionasse" para o I2P. Conforme ele é desenvolvido, ele adiciona recursos de segurança e melhora a integração com o próprio I2P. Em sua versão mais recente, ele **também** inclui um roteador I2P completo, alimentado pelo Jpackage . O I2P Firefox Profile agora é uma distribuição completa do I2P para Windows, com a única dependência restante sendo o próprio Firefox. Isso deve fornecer um nível de conveniência sem precedentes para usuários do I2P no Windows.
tr: Kullanıcılardan en çok duyduğum şeylerden biri, I2P uygulamasının benimsenmesi için kullanımının kolay olması gerektiği. Birçoğu, birçok tanıdık Reddit yazarından alıntı yapmak veya başka sözcüklerle ifade etmek için "Tor Browser benzeri" bir kullanıcı deneyimi istiyor. Kurulum sürecinde, karmaşık ve hataya açık olan "kurulum sonrası" adımlar gerekmemeli. Birçok yeni kullanıcı, tarayıcı yapılandırmalarıyla kapsamlı ve eksiksiz bir şekilde ilgilenmeye hazır değil. Bu sorunu çözmek için, I2P için "basitçe çalışan" ve otomatik olarak kurulan bir Firefox I2P profili yapılandırma paketi oluşturduk. Geliştirildikçe, güvenlik özellikleri ve I2P ile geliştirilmiş bütünleştirmeler eklendi. Son sürümünde, **ayrıca** eksiksiz, JPackage destekli bir I2P yönelticisi bulunuyor. I2P Firefox profili artık Windows için tam özellikli bir I2P dağıtımıdır ve geriye kalan tek bağımlılık Firefox uygulamasıdır. Bu yaklaşımın, Windows I2P kullanıcıları için eşsiz bir kolaylık sağlayacağını umuyoruz.

source: Bitcoin Core adds support for I2P!
pt_br: Bitcoin Core adiciona suporte para I2P!
tr: Bitcoin Core I2P desteği ekliyor!

source: A new use case and a signal of growing acceptance
pt_br: Um novo caso de uso e um sinal de aceitação crescente
tr: Yeni bir kullanım durumu ve artan kabullenmenin bir işareti

source: An event months in the making, Bitcoin Core has added official support for I2P! Bitcoin-over-I2P nodes can interact fully with the rest of the Bitcoin nodes, using the help of nodes that operate within both I2P and the clearnet, making them first-class participants in the Bitcoin network. It's exciting to see large communities like Bitcoin taking notice of the advantages I2P can bring to them providing privacy and reachability to people all over the world.
pt_br: Um evento que levou meses para acontecer, o Bitcoin Core adicionou suporte oficial para I2P! Os nós Bitcoin-over-I2P podem interagir totalmente com o resto dos nós Bitcoin, usando a ajuda de nós que operam dentro do I2P e da clearnet, tornando-os participantes de primeira classe na rede Bitcoin. É emocionante ver grandes comunidades como o Bitcoin tomando conhecimento das vantagens que o I2P pode trazer para eles, fornecendo privacidade e acessibilidade para pessoas em todo o mundo.
tr: Aylar süren bir etkinlik olan Bitcoin Core, I2P için resmi destek ekledi! I2P düğümleri üzerinden Bitcoin, hem I2P hem de herkese açık İnternet içinde çalışan düğümlerin yardımıyla diğer Bitcoin düğümleriyle tam olarak etkileşime girebilir ve onları Bitcoin ağında birinci sınıf katılımcılar haline getirir. Bitcoin gibi büyük toplulukların, I2P ağının tüm dünyadaki insanlara kişisel gizlilik ve erişilebilirlik sağlayarak getirebileceği avantajları fark ettiğini görmek heyecan verici.

source: How it Works
pt_br: Como funciona
tr: Nasıl çalışıyor

source: I2P support is automatic, via the SAM API. This is also exciting news, because it highlights some of the things I2P is singularly good at, like empowering application developers to build I2P connections programmatically and conveniently. Bitcoin-over-I2P users can use I2P with no manual configuration by enabling the SAM API and running Bitcoin with I2P enabled.
pt_br: O suporte I2P é automático, via API SAM. Esta também é uma notícia empolgante, porque destaca algumas das coisas em que o I2P é singularmente bom, como capacitar desenvolvedores de aplicativos a construir conexões I2P programaticamente e convenientemente. Usuários de Bitcoin sobre I2P podem usar I2P sem configuração manual habilitando a API SAM e executando Bitcoin com I2P habilitado.
tr: I2P desteği, SAM API aracılığıyla otomatik olarak sağlanır. Bu da heyecan verici bir haber, çünkü uygulama geliştiricilerin programlı ve rahat bir şekilde I2P bağlantıları kurmalarını sağlamak gibi I2P uygulamasının tek başına iyi olduğu bazı şeyleri vurguluyor. I2P üzerinden Bitcoin kullanıcıları, SAM API yazılımını etkinleştirerek ve Bitcoin için I2P etkinleştirerek, el ile yapılandırmadan I2P uygulamasını kullanabilir.

source: Configuring your I2P Router
pt_br: Configurando seu roteador I2P
tr: I2P Yönelticinizi Yapılandırmak

source: In order to set up an I2P Router to provide anonymous connectivity to bitcoin, the SAM API needs to be enabled. In Java I2P, you should go to `http://127.0.0.1:7657/configclients <http://127.0.0.1:7657/configclients>`_. and start the SAM Application Bridge with the "Start" button. You may also want to enable the SAM Application Bridge by default by checking the "Run at Startup" box and clicking "Save Client Configuration."
pt_br: Para configurar um roteador I2P para fornecer conectividade anônima ao bitcoin, a API SAM precisa ser habilitada. No Java I2P, você deve ir para `http://127.0.0.1:7657/configclients <http://127.0.0.1:7657/configclients>`_. e iniciar o SAM Application Bridge com o botão "Start". Você também pode querer habilitar o SAM Application Bridge por padrão marcando a caixa "Run at Startup" e clicando em "Save Client Configuration".
tr: Bitcoin ile anonim bağlantı kuracak bir I2P yönelticisi kurmak için SAM API yazılımının etkinleştirilmesi gerekir. Java I2P üzerinde, `http://127.0.0.1:7657/configclients <http://127.0.0.1:7657/configclients>`_ adresine gidin. "Başlat" düğmesiyle SAM uygulama köprüsünü başlatın. Ayrıca "Başlangıçta çalıştır" seçeneğini işaretleyip "İstemci yapılandırmasını kaydet" üzerine tıklayarak SAM uygulama köprüsünü varsayılan olarak çalışacak şekilde etkinleştirmek isteyebilirsiniz.

source: On i2pd, the SAM API is normally enabled by default, but if it isn't, you should set:: sam.enabled=true in your i2pd.conf file.
pt_br: No i2pd, a API SAM normalmente é habilitada por padrão, mas se não estiver, você deve set:: sam.enabled=true no seu arquivo i2pd.conf.
tr: i2pd üzerinde, SAM API normalde varsayılan olarak etkindir. Ancak etkin değilse, i2pd.conf dosyanızda:: sam.enabled=true ayarını yapın.

source: Configuring your Bitcoin Node for Anonymity and Connectivity
pt_br: Configurando seu nó Bitcoin para anonimato e conectividade
tr: Bitcoin Düğümünüzü Anonimlik ve Bağlantı için Yapılandırmak

source: Getting Bitcoin itself launched in an anonymous mode still requires editing some configuration files in the Bitcoin Data Directory, which is %APPDATA%\Bitcoin on Windows, ~/.bitcoin on Linux, and ~/Library/Application Support/Bitcoin/ on Mac OSX. It also requires at least version 22.0.0 for I2P support to be present.
pt_br: Para iniciar o Bitcoin em modo anônimo, ainda é necessário editar alguns arquivos de configuração no Diretório de Dados do Bitcoin, que é %APPDATA%\Bitcoin no Windows, ~/.bitcoin no Linux e ~/Library/Application Support/Bitcoin/ no Mac OSX. Também é necessário pelo menos a versão 22.0.0 para que o suporte I2P esteja presente.
tr: Bitcoin uygulamasının anonim kipte başlatılması için, Windows üzerinde %APPDATA%\Bitcoin, Linux üzerinde ~/.bitcoin ve macOS üzerinde ~/Library/Application Support/Bitcoin/ veri klasöründeki bazı yapılandırma dosyalarının düzenlenmesi gerekir. Ayrıca, I2P desteğinin sağlanması için en az 22.0.0 sürümünün kullanılması gerekir.

source: After following these instructions, you should have a private Bitcoin node which uses I2P for I2P connections, and Tor for .onion and clearnet connections, so that all your connections are anonymous. For convenience, Windows users should open their Bitcoin Data Directory by opening the start menu and searching for "Run." Inside the run prompt, type "%APPDATA%\Bitcoin" and press enter.
pt_br: Após seguir essas instruções, você deve ter um nó Bitcoin privado que usa I2P para conexões I2P e Tor para conexões .onion e clearnet , para que todas as suas conexões sejam anônimas. Para sua conveniência, usuários do Windows devem abrir seu Bitcoin Data Directory abrindo o menu iniciar e procurando por "Executar". Dentro do prompt de execução, digite "%APPDATA%\Bitcoin" e pressione enter.
tr: Bu yönergeleri uyguladıktan sonra, tüm bağlantılarınızın anonim olması için I2P bağlantıları için I2P, .onion ve herkese açık İnternet bağlantıları için Tor kullanan özel bir Bitcoin düğümünüz olmalıdır. Kolaylık sağlamak için Windows kullanıcıları, başlat menüsünü açıp "Çalıştır" bölümünden Bitcoin veri klasörlerini açmalıdır. Çalıştırılacak komut olarak "%APPDATA%\Bitcoin" yazıp enter tuşuna basın.

source: In that directory create a file called "i2p.conf." On Windows, you should make sure that you've add quotes around the file when you save it, in order to prevent Windows from adding a default file extension to the file. The file should contain the following I2P-Related Bitcoin configuration options:: i2psam=127.0.0.1:7656 i2pacceptincoming=true onlynet=i2p Next, you should create another file called "tor.conf." The file should contain the following Tor related configuration options:: proxy=127.0.0.1:9050 onion=127.0.0.1:9050 onlynet=tor Finally, you'll need to "include" these configuration options in your Bitcoin configuration file, called "bitcoin.conf" in the Data Directory. Add these two lines to your bitcoin.conf file:: includeconf=i2p.conf includeconf=tor.conf Now your Bitcoin node is configured to only use anonymous connections. In order to enable direct connections to remote nodes, remove the lines beginning in:: onlynet= You can do this if you do not require your Bitcoin node to be anonymous, and it helps anonymous users connect to the rest of the Bitcoin network.
pt_br: Nesse diretório, crie um arquivo chamado "i2p.conf". No Windows, você deve certificar-se de que adicionou aspas ao redor do arquivo ao salvá-lo, para impedir que o Windows adicione uma extensão de arquivo padrão ao arquivo. O arquivo deve conter as seguintes opções de configuração do Bitcoin relacionadas ao I2P:: i2psam=127.0.0.1:7656 i2pacceptincoming=true onlynet=i2p Em seguida, você deve criar outro arquivo chamado "tor.conf". O arquivo deve conter as seguintes opções de configuração relacionadas ao Tor:: proxy=127.0.0.1:9050 onion=127.0.0.1:9050 onlynet=tor Finalmente, você precisará "incluir" essas opções de configuração no seu arquivo de configuração Bitcoin , chamado "bitcoin.conf" no Diretório de Dados. Adicione essas duas linhas ao seu arquivo bitcoin.conf:: includeconf=i2p.conf includeconf=tor.conf Agora seu nó Bitcoin está configurado para usar apenas conexões anônimas. Para habilitar conexões diretas com nós remotos, remova as linhas que começam em:: onlynet= Você pode fazer isso se não quiser que seu nó Bitcoin seja anônimo e ajudar usuários anônimos a se conectarem ao restante da rede Bitcoin.
tr: Bu klasörde "i2p.conf" adında bir dosya oluşturun. Windows üzerinde, dosyaya Windows tarafından varsayılan bir uzantı eklemesini önlemek için, dosyayı kaydederken adını tırnak içine aldığınızdan emin olun. Dosyada, aşağıdaki I2P ile ilgili Bitcoin yapılandırma seçeneklerini bulunmalıdır: i2psam=127.0.0.1:7656 i2pacceptincoming=true onlynet=i2p Ardından, "tor.conf" adında başka bir dosya oluşturun. Dosyada, Tor ile ilgili aşağıdaki yapılandırma seçenekleri bulunmalıdır: proxy=127.0.0.1:9050 onion=127.0.0.1:9050 onlynet=tor Son olarak, veri klasöründe "bitcoin.conf" adı verilen Bitcoin yapılandırma dosyanıza yapılandırma seçeneklerini "eklemeniz" gerekir. Şu iki satırı bitcoin.conf dosyanıza ekleyin:: includeconf=i2p.conf includeconf=tor.conf Artık Bitcoin düğümünüz yalnızca anonim bağlantıları kullanacak şekilde yapılandırıldı. Uzak düğümlere doğrudan bağlantıları etkinleştirmek için şununla başlayan satırları kaldırın: onlynet= Bitcoin düğümünüzün anonim olmasını istemiyorsanız bu işlemi yapabilirsiniz. Böylece anonim kullanıcılar Bitcoin ağının geri kalanına bağlanabilir.

source: I2P Jpackages get their First Update
pt_br: I2P Jpackages recebem sua primeira atualização
tr: I2P JPackage ilk güncellemesini aldı

source: New, easier-to-install packages reach a new milestone
pt_br: Novos pacotes mais fáceis de instalar atingem um novo marco
tr: Yeni, kurulumu daha kolay paketler ile yeni bir dönüm noktasına ulaştık

source: A few months ago we released new packages which we hoped would help with onboarding new people to the I2P network by making the installation and configuration of I2P easier for more people. We removed dozens of steps from the installation process by switching from an external JVM to a Jpackage, built standard packages for target operating systems, and signed them in a way the operating system would recognize to keep the user secure. Since then, the jpackage routers have reached a new milestone, they are about to recieve their first incremental updates. These updates will replace the JDK 16 jpackage with an updated JDK 17 jpackage and provide fixes for some small bugs which we caught after the release.
pt_br: Alguns meses atrás, lançamos novos pacotes que esperávamos que ajudassem a integrar novas pessoas na rede I2P, facilitando a instalação e a configuração do I2P para mais pessoas. Removemos dezenas de etapas do processo de instalação, alternando de uma JVM externa para um Jpackage, construímos pacotes padrão para sistemas operacionais de destino e os assinamos de uma forma que o sistema operacional reconheceria para manter o usuário seguro. Desde então, os roteadores jpackage atingiram um novo marco, eles estão prestes a receber suas primeiras atualizações incrementais. Essas atualizações substituirão o JDK 16 jpackage por um JDK 17 jpackage atualizado e fornecerão correções para alguns pequenos bugs que detectamos após o lançamento.
tr: Birkaç ay önce, daha fazla insan için I2P kurulumunu ve yapılandırmasını kolaylaştırarak yeni kişilerin I2P ağına katılmasına yardımcı olacağını umduğumuz yeni paketler yayınladık. Bir dış JVM üzerinden JPackage yapısına geçerek kurulum sürecinden onlarca adımı kaldırdık, hedef işletim sistemleri için standart paketler oluşturduk ve kullanıcıyı güvende tutmak için bu paketleri işletim sisteminin tanıyacağı şekilde imzaladık. O zamandan beri, JPackage yönelticileri yeni bir dönüm noktasına ulaştı ve ilk artımlı güncellemelerini almak üzereler. Bu güncellemeler, JPackage içeriğini JDK 16 yerine JDK 17 ile güncelleyecek ve paketi yayınlandıktan sonra yakaladığımız bazı küçük hataların düzeltilmesini sağlayacak.

source: Updates common to Mac OS and Windows
pt_br: Atualizações comuns para Mac OS e Windows
tr: macOS ve Windows için ortak güncellemeler

source: All jpackaged I2P installers recieve the following updates: * Update the jpackaged I2P router to 1.5.1 which is built with JDK 17 Please update as soon as possible.
pt_br: Todos os instaladores I2P jpackaged recebem as seguintes atualizações: * Atualize o roteador I2P jpackaged para 1.5.1, que é criado com o JDK 17 Atualize o mais rápido possível.
tr: JPackage ile paketlenmiş tüm I2P kurucuları şu güncellemeleri alır: * JPackage ile paketlenmiş I2P yönelticisini JDK 17 ile oluşturulmuş 1.5.1 sürümüne günceller Lütfen en kısa sürede güncelleyin.

source: I2P Windows Jpackage Updates
pt_br: Atualizações do I2P Windows Jpackage
tr: I2P Windows JPackage Güncellemeleri

source: Windows only packages recieve the following updates: * Updates I2P in Private Browsing, NoScript browser extensions * Begins to phase out HTTPS everywhere on new Firefox releases * Updates launcher script to `fix post NSIS launch issue on some architectures <https://i2pgit.org/i2p-hackers/i2p.firefox/-/issues/9>`_ For a full list of changes see the `changelog.txt in i2p.firefox <https://i2pgit.org/i2p-hackers/i2p.firefox/>`_
pt_br: Pacotes somente para Windows recebem as seguintes atualizações: * Atualiza I2P em Navegação Privada, extensões de navegador NoScript * Começa a eliminar HTTPS em todos os lugares em novas versões do Firefox * Atualiza script do inicializador para `corrigir problema de inicialização pós-NSIS em algumas arquiteturas <https://i2pgit.org/i2p-hackers/i2p.firefox/-/issues/9>`_ Para uma lista completa de alterações, consulte `changelog.txt em i2p.firefox <https://i2pgit.org/i2p-hackers/i2p.firefox/>`_
tr: Yalnızca Windows paketlerinde şu güncellemeler bulunur: * I2P, Gizli gezinme ve NoScript tarayıcı eklentileri güncellenir * Yeni Firefox sürümlerinde HTTPS Everywhere uzantısını aşamalı olarak kaldırır * Başlatıcı betiğini `bazı mimarilerde NSIS başlatma sonrası sorunu düzeltmesi <https://i2pgit.org/i2p-hackers/i2p.firefox/-/issues/9>` için günceller. Değişikliklerin tam listesi için `i2p.firefox <https://i2pgit.org/i2p-hackers/i2p.firefox/> adresindeki changelog.txt dosyasına bakabilirsiniz`_
