Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Better error handling and user feedback when HTTP client tunnel is disabled
pt_br: Melhor tratamento de erros e feedback do usuário quando o túnel do cliente HTTP está desabilitado
tr: HTTP istemci tüneli devre dışı bırakıldığında hata işleme ve kullanıcı geri bildirimi iyileştirildi

source: More changes to improve floodfill capacity
pt_br: Mais mudanças para melhorar a capacidade de enchimento
tr: Otomatik doldurma kapasitesini iyileştirmek için daha fazla değişiklik yapıldı

source: New configuration for forcing IPv4 (only) to firewalled on /confignet
pt_br: Nova configuração para forçar IPv4 (somente) a firewalls em /confignet
tr: Güvenlik duvarı arkasında /confignet üzerinde IPv4 (yalnızca) dayatmak için yeni yapılandırma eklendi

source: New configuration for floodfill on /configadvanced
pt_br: Nova configuração para enchimento em /configadvanced
tr: /configadvanced üzerinde otomatik doldurma için yeni yapılandırma eklendi

source: Show separate IPv4 and IPv6 status in summary bar when appropriate
pt_br: Mostrar status IPv4 e IPv6 separados na barra de resumo quando apropriado
tr: Kullanılabildiğinde özet çubuğunda IPv4 ve IPv6 durumlarının ayrı ayrı görüntülenmesi sağlandı

source: Better handling of corrupt SSU packets
pt_br: Melhor manuseio de pacotes SSU corrompidos
tr: Bozuk SSU paketlerinin işlenmesi iyileştirildi

source: Toronto Meetup
pt_br: Encontro em Toronto
tr: Toronto buluşması

source: I2P Meetup in Toronto on August 15-16
pt_br: I2P Meetup em Toronto de 15 a 16 de agosto
tr: 15-16 Ağustos Toronto I2P buluşması

source: The I2P team is proud to announce that we are going to host a meetup in Toronto on August 15-16. A number of members of our community will be attending and are going to host talks, workshops and discussions about and relating to I2P. This event is not just for I2P people though, it's meant for everyone.
pt_br: A equipe I2P tem o orgulho de anunciar que sediaremos um encontro em Toronto nos dias 15 e 16 de agosto. Vários membros da nossa comunidade estarão presentes e realizarão palestras, workshops e discussões sobre e relacionados à I2P. Este evento não é apenas para pessoas I2P, é destinado a todos.
tr: I2P ekibi olarak, 15-16 Ağustos tarihlerinde Toronto'da bir buluşma düzenleyeceğimizi duyurmaktan gurur duyuyoruz. Etkinliğe topluluğumuzun birkaç üyesi katılacak ve I2P ile ilgili görüşmelere, çalıştaylara ve tartışmalara ev sahipliği yapacak. Bu etkinlik sadece I2P kullanıcıları için değil, herkes içindir.

source: If you're curious about I2P, interested in privacy/cryptography/anonymity or just want to come by and talk to us, please do. This is an event for everyone. If you're not familiar with any of these topics, come by anyway and we'll show you how I2P works and what you can do with it. The event is entirely free, you don't need to sign up or register.
pt_br: Se você está curioso sobre I2P, interessado em privacidade / criptografia / anonimato ou apenas quer vir e falar conosco, por favor, faça. Este é um evento para todos. Se você não está familiarizado com nenhum desses tópicos, venha de qualquer maneira e mostraremos como o I2P funciona e o que você pode fazer com ele. O evento é totalmente gratuito, você não precisa se inscrever ou se inscrever.
tr: I2P projesini merak ediyorsanız, gizlilik/şifreleme/anonimlik konuları ile ilgileniyorsanız veya yalnızca gelip bizimle konuşmak istiyorsanız, lütfen bunu yapın. Bu etkinlik herkese açıktır. Bu konulardan herhangi birine aşina değilseniz, yine de gelin ve size I2P uygulamasının nasıl çalıştığını ve onunla neler yapabileceğinizi gösterelim. Etkinlik tamamen ücretsizdir, önceden bildirmenize veya kayıt olmanıza gerek yoktur.

source: The meetup couldn't have been arranged without our friends at `Toronto Crypto <https://torontocrypto.org/>`_ which have been helping us organize the event, and our friends at `Hacklab <https://hacklab.to/>`_ which are providing us with a very nice space.
pt_br: O encontro não poderia ter sido organizado sem nossos amigos do 'Toronto Crypto <https://torontocrypto.org/>'_ que têm nos ajudado a organizar o evento, e nossos amigos do 'Hacklab <https://hacklab.to/>'_ que estão nos proporcionando um espaço muito agradável.
tr: Bu buluşmayı, etkinliği düzenlememize yardımcı olan `Toronto Crypto <https://torontocrypto.org/>`_ ve bize güzel bir yer sağlayan `Hacklab <https://hacklab.to/>`_ gruplarındaki arkadaşlarımız olmadan gerçekleştiremezdik.

source: If you have any questions, feel free to contact us on `@geti2p`_.
pt_br: Se você tiver alguma dúvida, não hesite em contactar-nos em '@geti2p'_.
tr: Herhangi bir sorunuz varsa, `@geti2p`_ adresinden bize yazmaya çekinmeyin.

source: Details
pt_br: Detalhes
tr: Ayrıntılar

source: Location
pt_br: Localização
tr: Konum

source: `Hacklab <https://hacklab.to/>`_ at 1266 Queen Street West, Toronto.
pt_br: `Hacklab <https://hacklab.to/>`_ em 1266 Queen Street West, Toronto.

source: Day 1, August 15 - 3PM
pt_br: Dia 1, 15 de agosto - 15h
tr: 1. gün, 15 Ağustos - 3PM

source: The focus will be on an introduction to topics surrounding I2P, privacy and anonymity online. People of all backgrounds and knowledge levels are welcome to attend.
pt_br: O foco será uma introdução a tópicos envolvendo I2P, privacidade e anonimato online. Pessoas de todas as origens e níveis de conhecimento são bem-vindas.
tr: Odak noktası, I2P, gizlilik ve çevrimiçi anonimlik ile ilgili konulara giriş olacak. Tüm geçmiş ve bilgi düzeyindeki kişiler katılabilir.

source: I2P Presentation
pt_br: I2P - Apresentação
tr: I2P Sunumu

source: Crypto party introduction
pt_br: Introdução à festa de criptografia
tr: Şifreleme partisi tanıtımı

source: Crypto party
pt_br: Festa criptográfica
tr: Şifreleme partisi

source: The crypto party will contain a number of stations where privacy/anonymity software will be demoed. The goal is to provide people with the tools they need to communicate securely.
pt_br: A festa criptográfica conterá uma série de estações onde software de privacidade/anonimato será demonstrado. O objetivo é fornecer às pessoas as ferramentas de que precisam para se comunicar com segurança.
tr: Şifreleme partisinde, gizlilik/anonimlik yazılımının tanıtılacağı bir dizi istasyon olacak. Amaç, insanlara güvenli bir şekilde iletişim kurmak için gerek duydukları araçları sağlamaktır.

source: `Vuze/I2P`_ - Downloading torrents anonymously
pt_br: `Vuze/I2P`_ - Baixando torrents anonimamente
tr: `Vuze/I2P`_ - Anonim kalarak torrent indirmek

source: `Veracrypt`_ - Encrypt your data
pt_br: `Veracrypt`_ - Criptografe seus dados
tr: `Veracrypt`_ - Verilerinizi şifreleyin

source: `I2PBote`_ - Anonymous decentralized email
pt_br: `I2PBote`_ - E-mail descentralizado anônimo
tr: `I2PBote`_ - Anonim merkezi olmayan e-posta

source: Your station idea here
pt_br: Sua ideia de estação aqui
tr: İstasyon fikrinizi yazın

source: We're currently looking for help staffing the stations. If you want to help out, you can! Bring a monitor/laptop and run a station. The station could be any of the ones listed above, or any other privacy/anonymity related one you would like to run. Please contact us at `@geti2p`_ if you're interested.
pt_br: No momento, estamos procurando ajuda para compor as estações. Se você quiser ajudar, você pode! Traga um monitor/laptop e administre uma estação. A estação pode ser qualquer uma das listadas acima, ou qualquer outra relacionada à privacidade/anonimato que você queira administrar. Entre em contato conosco em `@geti2p`_ se estiver interessado.
tr: Şu anda istasyonlara ekip sağlamak için yardım arıyoruz. Yardım etmek isterseniz, yapabilirsiniz! Bir monitör/dizüstü bilgisayar getirerek bir istasyon kurabilirsiniz. İstasyon, yukarıda listelenmiş konulardan herhangi birinde veya gizlilik/anonimlikle ilgili çalıştırmak istediğiniz başka bir konuda olabilir. Yardımcı olmakla ilgileniyorsanız lütfen bizimle `@geti2p`_ adresinden görüşün.

source: Day 2, August 16 - 1PM
pt_br: Dia 2, 16 de agosto - 13h
tr: 2. gün, 16 Ağustos - 1PM

source: The focus will be on in-depth topics surrounding I2P, the roadmap and development. Anyone is welcome to attend, but the content will be somewhat technical.
pt_br: O foco será em tópicos aprofundados em torno do I2P, o roteiro e o desenvolvimento. Qualquer um é bem-vindo para participar, mas o conteúdo será um tanto técnico.
tr: Odak noktası, I2P, yol haritası ve geliştirme ile ilgili derinlemesine konular işlenecek. Herkes katılabilir, ancak içerik biraz teknik olacak.

source: I2P Technical presentation
pt_br: I2P - Apresentação Técnica
tr: I2P teknik sunumu

source: Technical discussion
pt_br: Discussão técnica
tr: Teknik tartışma

source: I2P App Dev Into
pt_br: I2P App Dev em
tr: I2P uygulama geliştirme tanıtımı

source: I2PD presentation
pt_br: I2PD - Apresentação
tr: I2PD sunumu

source: I2P on Android
pt_br: I2P no Android
tr: Android için I2P

source: I2PCon will be in Toronto on August 15-16.
pt_br: O I2PCon estará em Toronto nos dias 15 e 16 de agosto.
tr: I2PCon 15-16 Ağustos tarihlerinde Toronto'da yapılacak

source: I2PCon is the first event of its kind. It has two short term goals. Where the first one is to provide the general public with an event where knowledge about privacy and privacy concerns can be obtained. The second goal is to further the I2P project and its community. This will take the shape of technical discussions about cryptography, anonymity and I2P centric topics.
pt_br: O I2PCon é o primeiro evento desse tipo. Ele tem dois objetivos de curto prazo. Onde o primeiro é fornecer ao público em geral um evento onde conhecimento sobre privacidade e preocupações com privacidade podem ser obtidos. O segundo objetivo é promover o projeto I2P e sua comunidade. Isso tomará a forma de discussões técnicas sobre criptografia, anonimato e tópicos centrados no I2P.
tr: I2PCon, kendi türündeki ilk etkinliktir. İki kısa vadeli hedefi var. Birincisi, kamuoyuna kişisel güvenlik ve kişisel güvenlik endişeleri hakkında bilgi edinilebileceği bir etkinlik sağlamak. İkincisi, I2P projesini ve topluluğunu geliştirmek. Şifreleme, anonimlik ve I2P merkezli konular hakkında teknik tartışmalar şeklini alacak.

source: There is a larger and more long-term goal of this event, and it is to build a commnutiy of privacy-conscious individuals. By connecting people who recognize the importance of privacy, we would like to provide a forum where this community can grow.
pt_br: Há um objetivo maior e de longo prazo neste evento, que é construir uma comunidade de indivíduos preocupados com a privacidade. Ao conectar pessoas que reconhecem a importância da privacidade, gostaríamos de fornecer um fórum onde esta comunidade possa crescer.
tr: Bu etkinliğin kişisel gizlilik bilincine sahip bireylerden oluşan bir topluluk oluşturmak gibi daha büyük ve daha uzun vadeli bir amacı var. Kişisel gizliliğin öneminin farkında olan insanları bir araya getirerek, bu topluluğun büyüyebileceği bir forum sağlamak istiyoruz.

source: The idea for this event was first spawned by our wonderful friends at `Toronto Crypto`_. The venue and everything relating to it is provided by `Hacklab`_. Without either of them this event would not have been possible, so thank you both.
pt_br: A ideia para este evento foi gerada primeiramente por nossos maravilhosos amigos da `Toronto Crypto`_. O local e tudo relacionado a ele é fornecido pela `Hacklab`_. Sem nenhum deles este evento não teria sido possível, então obrigado a ambos.
tr: Bu etkinliğin fikri `Toronto Crypto`_ grubunda harika arkadaşlarımızdan çıktı. Mekan ve ilgili her şey `Hacklab`_ tarafından sağlanıyor. İkisinin desteği olmadan bu etkinliği gerçekleştiremezdik. İkisine de teşekkür ederiz.

source: Cost
pt_br: Custo
tr: Maliyet

source: I2PCon is entirely free to attend! We ask you to register `here`__, to give us an estimate of how many people will be attending. No identifying information has to be given in order to register, but if you have any concerns, please let us know.
pt_br: A participação no I2PCon é totalmente gratuita! Pedimos que você se registre `aqui`__, para nos dar uma estimativa de quantas pessoas estarão presentes. Nenhuma informação de identificação precisa ser dada para se registrar, mas se você tiver alguma preocupação, por favor nos avise .
tr: I2PCon etkinliğine katılım tamamen ücretsizdir! Kaç kişinin katılacağını öngörebilmek için `buradan`__ kaydolmanızı rica ediyoruz. Kayıt olmak için hiçbir kimlik bilgisi vermeniz gerekmiyor, ancak herhangi bir endişeniz varsa lütfen bize iletin.

source: `Hacklab`_ at 1266 Queen Street West, Unit #6, Toronto.
pt_br: `Hacklab`_ em 1266 Queen Street West, Unidade #6, Toronto.

source: Venue
pt_br: Local
tr: Mekan

source: Power and WiFi access will be provided by `Hacklab`_.
pt_br: Energia e acesso WiFi serão fornecidos pelo `Hacklab`_.
tr: Enerji ve Wi-Fi erişimi `Hacklab`_ tarafından sağlanacak.

source: Schedule
pt_br: Agendar
tr: Takvim

source: Day 1, August 15
pt_br: Dia 1, 15 de agosto
tr: 1. gün, 15 Ağustos

source: Day 2, August 16
pt_br: Dia 2, 16 de agosto
tr: 2. gün, 16 Ağustos

source: I'm confused and would like some answers
pt_br: Estou confuso e gostaria de algumas respostas
tr: Kafam karıştı ve bazı cevaplar istiyorum

source: ============== 0.9.21 Release ==============
pt_br: ================= 0.9.21 Lançamento =================
tr: ===================== 0.9.21 sürümü yayınlandı =====================

source: 0.9.21 with performance improvements and bug fixes
pt_br: 0.9.21 com melhorias de desempenho e correções de bugs
tr: 0.9.21 sürümü başarım iyileştirmeleri ve hata düzeltmeleri ile yayınlandı

source: 0.9.21 contains several changes to add capacity to the network, increase the efficiency of the floodfills, and use bandwidth more effectively. We have migrated the shared clients tunnels to ECDSA signatures and added a DSA fallback using the new "multisession" capability for those sites that don't support ECDSA.
pt_br: A versão 0.9.21 contém diversas modificações que adicionam capacidade a rede, aumentam a eficiência das inundações, e usam a banda de maneira mais eficiente. Nós migramos os túneis clientes compartilhados para assinaturas ECDSA e acrescentamos um plano B usando a nova capacidade "multisessão" para aqueles sites que não suportam ECDSA.
tr: 0.9.21 sürümü ağ kapasitesini arttıran çeşitli değişiklikler, otomatik doldurma (floodfill) etkinliğini arttıran ve bant genişliğini daha etkin kullanan özellikler ile yayınlandı. Paylaşılan istemci tünellerini ECDSA imzaları ile birleştirdik ve ECDSA desteklemeyen siteler için yeni "bir kaç oturum" yeteneğini değerlendiren DSA kullanılmasını sağladık.

source: The speakers and the schedule of the I2PCon in Toronto 2015 have been announced. Have a look on the `I2PCon page`_ for details. Reserve your seat on `Eventbrite`_.
pt_br: Os palestrantes e a programação do I2PCon em Toronto 2015 foram anunciados. Dê uma olhada na `página do I2PCon`_ para mais detalhes. Reserve seu lugar no `Eventbrite`_.
tr: Toronto 2015 etkinliğindeki I2PCon konuşmacıları ve programı açıklandı. Ayrıntılar için `I2PCon sayfasına`_ bakabilirsiniz. `Eventbrite`_ üzerinden yerinizi ayırtın.

source: Add multisession support for dual-signature crypto on the same tunnels
pt_br: Adicione suporte multissessão para criptografia de assinatura dupla nos mesmos túneis
tr: Aynı tünellerde çift imzalı şifreleme için çoklu oturum desteği eklendi

source: Use multisession for shared clients
pt_br: Use multissessão para clientes compartilhados
tr: Paylaşılan istemciler için çoklu oturum kullanımı eklendi

source: Increase default outbound bandwidth limit to 60 KBps
pt_br: Aumentar o limite de largura de banda de saída padrão para 60 KBps
tr: Varsayılan gidiş bant genişliği sınırı 60 KBps olarak yükseltildi

source: Increase default maximum participating tunnels
pt_br: Aumentar o número máximo padrão de túneis participantes
tr: Varsayılan en fazla katılımcı tüneli sayısı artırıldı

source: Floodfills will send database store acks directly if connected, for efficiency
pt_br: Os floodfills enviarão confirmações de armazenamento de banco de dados diretamente se estiverem conectados, para maior eficiência
tr: Verimliliği artırmak için bağlantı kurulmuş ise otomatik doldurmaların doğrudan veri tabanı deposu onayları göndermesi sağlandı

source: Set TCP keepalive on I2CP and SAM sockets
pt_br: Definir TCP keepalive em soquetes I2CP e SAM
tr: I2CP ve SAM soketlerinde TCP canlı tutma komutları ayarlandı

source: More efficient decompression in HTTP proxy, use less threads
pt_br: Descompressão mais eficiente no proxy HTTP, use menos threads
tr: HTTP vekil sunucusunda daha verimli sıkıştırma ile daha az iş parçacığı kullanılması sağlandı

source: Add support for fast extensions in i2psnark
pt_br: Adicionar suporte para extensões rápidas no i2psnark
tr: i2psnark üzerinde hızlı eklenti desteği eklendi

source: i2psnark only autostarts torrents that were running previously
pt_br: O i2psnark só inicia automaticamente torrents que estavam em execução anteriormente
tr: i2psnark tarafından yalnızca daha önce çalışmakta olan torrentlerin otomatik olarak başlatılması sağlandı

source: Add support for translated console news
pt_br: Adicionar suporte para notícias traduzidas do console
tr: Pano haberleri için çeviri desteği eklendi

source: SSU fixes to compete better with NTCP for bandwidth when limited
pt_br: Correções SSU para competir melhor com NTCP por largura de banda quando limitada
tr: Bant genişliği sınırlı olduğunda için NTCP ile daha iyi denge sağlamak için SSU düzeltmeleri yapıldı

source: Fixes to prevent SSU stalls
pt_br: Correções para evitar paradas do SSU
tr: SSU takılmalarını önleyecek düzeltmeler yapıldı

source: Wait for outbound tunnels before sending first leaseset to client, to prevent dropping first message
pt_br: Aguarde os túneis de saída antes de enviar o primeiro leaseset ao cliente, para evitar a perda da primeira mensagem
tr: İlk iletinin kaybolmasını önlemek için istemciye ilk "Kiralama kümesi" (LeaseSet) gönderilmeden önce gidiş tünellerinin beklenmesi sağlandı

source: Clean up resources correctly when SAM stops
pt_br: Limpe os recursos corretamente quando o SAM parar
tr: SAM durduğunda kaynakların doğru şekilde temizlenmesi sağlandı

source: Better error handling and notification when HTTP proxy is not running
pt_br: Melhor tratamento de erros e notificação quando o proxy HTTP não está em execução
tr: HTTP vekil sunucusu çalışmıyorken hataların daha iyi işlenmesi ve bildirim görüntülenmesi sağlandı

source: More i2ptunnel fixes at startup and shutdown of tunnels
pt_br: Mais correções do i2ptunnel na inicialização e desligamento de túneis
tr: Tünellerin açılması ve kapatılması ile ilgili daha fazla i2ptunnel düzeltmesi yapıldı

source: Fix total_size in i2psnark metadata message
pt_br: Corrigir total_size na mensagem de metadados i2psnark
tr: i2psnark üst veri iletisindeki total_size düzeltildi

source: Restore dates in console news headers
pt_br: Restaurar datas nos cabeçalhos de notícias do console
tr: Pano haber başlıklarındaki tarihler geri yüklendi

source: Several I2CP fixes
pt_br: Várias correções de I2CP
tr: Bazı I2CP düzeltmeleri yapıldı

source: Use same session for naming lookups in I2PSocketEepGet
pt_br: Use a mesma sessão para nomear pesquisas em I2PSocketEepGet
tr: I2PSocketEepGet üzerinde aramaları adlandırmak için aynı oturumun kullanılması sağlandı

source: Increase max bandwidth to 16 MBps, add larger Bloom filter
pt_br: Aumente a largura de banda máxima para 16 MBps, adicione um filtro Bloom maior
tr: En fazla bant genişliği 16 MBps olarak artırıldı, daha büyük bir Bloom süzgeci eklendi

source: New floodfills will send their info to nearby floodfills to speed integration
pt_br: Novos aterros enviarão suas informações para aterros próximos para acelerar a integração
tr: Yeni otomatik doldurmalar, bütünleştirmeyi hızlandırmak için bilgilerini yakındaki otomatik doldurmalara gönderecek

source: ============================ I2PCon: Mission Accomplished ============================
pt_br: ============================= I2PCon: Missão Cumprida =============================
tr: ============================ I2PCon: Görev tamamlandı ============================

source: I2PCon: Mission Accomplished
pt_br: I2PCon: Missão Cumprida
tr: I2PCon: Görev Tamamlandı

source: I2PCon has been a giant success. For us, the I2P contributors, it represents a leap forward in terms of what we're capable of pulling off as a community, how we communicate the usecases of I2P and reach out to privacy conscious individuals. By arranging this event, we've also grown our community. People who've previously only lurked on our irc channels, or run our software or possibly hadn't even heard of I2P are now a part of our comminuty. This event has been our first active step towards building a large and inclusive community, and as such it's been great success.
pt_br: O I2PCon tem sido um sucesso gigante. Para nós, os colaboradores do I2P, ele representa um salto em termos do que somos capazes de realizar como uma comunidade, como nós comunicamos os casos de uso do I2P e alcançamos indivíduos preocupados com a privacidade. Ao organizar este evento, também aumentamos nossa comunidade. Pessoas que antes apenas espreitavam nossos canais de IRC, ou executavam nosso software ou possivelmente nem tinham ouvido falar do I2P agora fazem parte da nossa comunidade. Este evento foi nosso primeiro passo ativo para construir uma comunidade grande e inclusiva e, como tal, tem sido um grande sucesso.
tr: I2PCon dev bir başarı elde etti. I2P projesine katkıda bulunan bizler için, bir topluluk olarak neler başarabileceğimizi, I2P kullanım alanlarını nasıl duyurduğumuzu ve kişisel gizlilik bilincine sahip bireylere nasıl ulaştığımızı gösteren bir sıçrama oldu. Bu etkinliği düzenleyerek topluluğumuzu da büyütmüş olduk. Daha önce yalnızca irc kanallarımızda bekleyen veya yazılımımızı kullanmış ya da muhtemelen I2P projesini duymamış olan kişiler topluluğumuzun bir parçası oldu. Bu etkinlik, büyük ve kapsayıcı bir topluluk oluşturma yönünde ilk adımımız oldu ve büyük bir başarı sağladı.

source: Minutiae ======== On day 2 we had two short discussion sessions. A more general discussion and a roadmapping discussion. The minutiae can be found here: `I2P Roadmap session minutiae`_ and `I2P Discussion session minutiae`_.
pt_br: Minúcias ======== No dia 2, tivemos duas sessões curtas de discussão. Uma discussão mais geral e uma discussão sobre o roteiro. As minúcias podem ser encontradas aqui: `I2P Roadmap session minutiae`_ e `I2P Discussion session minutiae`_.
tr: Notlar ======== 2. gün iki kısa tartışma oturumu vardı. Daha genel bir tartışma ve yol haritası tartışması. Notları şurada bulabilirsiniz: `I2P yol haritası oturumu notları`_ ve `I2P tartışma oturumu notları`_.

source: Photos ======
pt_br: Fotografias ==========
tr: Fotoğraflar ======

source: The learn how to setup I2P crypto party station
pt_br: Aprenda a configurar a estação de criptografia I2P party
tr: I2P şifreleme partisi istasyonunu nasıl kuracağınızı öğrenin

source: The learn how use I2P and Vuze party station
pt_br: Aprenda a usar a estação de festa I2P e Vuze
tr: I2P ve Vuze parti istasyonunu nasıl kullanacağınızı öğrenin

source: David Dagons wonderful talk
pt_br: A palestra maravilhosa de David Dagon
tr: David Dagons tarafından yapılan harika konuşma

source: Thanks ======
pt_br: Agradecimentos ===============
tr: Teşekkürler ======
