Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Stricter I2CP authorization enforcement of external clients (incompatible change)
pt_br: Aplicação mais rigorosa de autorização I2CP para clientes externos (alteração incompatível)
tr: Dış istemciler için daha sıkı I2CP kimlik doğrulaması uygulandı (uyumsuz değişiklik)

source: Increase default inbound exploratory tunnel length variance
pt_br: Aumentar a variação do comprimento do túnel exploratório de entrada padrão
tr: Varsayılan geliş keşif tüneli uzunluk değişimi artırıldı

source: Big reduction in memory usage by transports
pt_br: Grande redução no uso de memória por transportes
tr: Taşıyıcılar tarafından kullanılan bellekte büyük azalma sağlandı

source: All in-net updates via torrent
pt_br: Todas as atualizações na rede via torrent
tr: Tüm ağ içi güncellemelerin Torrent üzerinden yapılması sağlandı

source: ========================= Malware at i2pbrowser.net =========================
pt_br: ============================ Malware no site i2pbrowser.net ============================
tr: =================================== i2pbrowser.net sitesinde zararlı yazılım ===================================

source: The site i2pbrowser.net is a fake I2P website mirror serving up malware for Windows.
pt_br: O site i2pbrowser.net é um espelho fake do website da I2P que distribui malware para Windows.
tr: i2pbrowser.net sitesi, Windows için kötü amaçlı yazılım yayınlayan sahte bir I2P sitesi kopyasıdır.

source: We have recently been made aware of the existence of i2pbrowser.net. This website copies our homepage and download page, and attempts to trick users into downloading Windows malware.
pt_br: Ficamos recentemente surpresos com a existência do site i2pbrowser.net. Este website copia a nossa homepage e página de download e tenta ludibriar os usuários para baixar um malware para Windows.
tr: i2pbrowser.net sitesinin varlığından geçenlerde haberdar olduk. Bu site ana sayfamızı ve indirme sayfamızı kopyalamış ve kullanıcıları kötü amaçlı Windows yazılımlarını indirmeleri için kandırmaya çalışıyor.

source: There are several indicators that point to i2pbrowser.net being a malware site:
pt_br: Há inúmeros indicativos de que o site i2pbrowser.net seja fonte de malware:
tr: i2pbrowser.net sitesinin kötü amaçlı bir site olduğunu gösteren birkaç belirti bulunuyor:

source: The domain was registered on February 10th, 2014.
pt_br: O domínio foi registrado em 10 de fevereiro de 2014.
tr: Etki alanı 10 Şubat 2014 tarihinde kayıt edilmiş.

source: The download URLs for Windows, Mac OSX, Linux, Android etc. all link to the same .exe file.
pt_br: Todas os URLs de download, para Windows, Mac OSZ, Linux, Android etc., lincam para o mesmo arquivo .exe
tr: Windows, Mac OSX, Linux, Android vb. için indirme adreslerinin tümü aynı .exe dosyasını getiriyor.

source: The .exe is only 741 KB; the official Windows installer for I2P is 13 MB.
pt_br: O .exe tem apenas 741 KB; o instalador oficial do Windows para o I2P tem 13 MB.
tr: .exe dosyasının boyutu 741 KB. Resmi I2P Windows kurulum dosyasının boyutu 13 MB.

source: We have not examined the malware ourselves, but it does not appear to be very sophisticated; it is not integrated into or bundled with the I2P software. Information security expert `Lance James`__ posted `a tweet`__ labelling it as "a standard dark comet rat".
pt_br: Nós mesmos não examinamos o malware, mas ele não parece ser muito sofisticado; ele não é integrado ou empacotado com o software I2P. O especialista em segurança da informação `Lance James`__ postou `um tweet`__ rotulando-o como "um rato cometa escuro padrão".
tr: Kötü amaçlı yazılımı incelemedik, ancak çok karmaşık görünmüyor. I2P yazılımıyla bütünleştirilmemiş veya birlikte verilmemiştir. Bilgi güvenliği uzmanı "Lance James"__, "standart bir kara kuyruklu yıldız faresi" olarak belirlediği bir "tweet" yayınladı.

source: Spread the word. The only official download locations for I2P are linked on our `download page`__. All I2P download packages are GPG-signed by the `release signing key`__.
pt_br: Espalhe a palavra. Os únicos locais oficiais de download para I2P estão vinculados em nossa `página de download`__. Todos os pacotes de download I2P são assinados por GPG pela `chave de assinatura de lançamento`__.
tr: Bu bilgiyi duyurun. resmi I2P indirmeleri yalnızca `indirme sayfamızda`__ bulunur. Tüm I2P indirme paketleri, `sürüm imzalama anahtarı`__ ile GPG imzalıdır.

source: ================================================================ Search Engine DuckDuckGo Awards Invisible Internet Project $5000 ================================================================
pt_br: ======================================================================== Buscador DuckDuckGo premia o Projeto Internet Invisível com doação de $5000 ========================================================================
tr: ================================================== DuckDuckGo Ödülleri Invisible Internet Project $5000 ==================================================

source: Search engine DuckDuckGo donates $5000 to the Invisible Internet Project (I2P) in their open source donation program.
pt_br: O mecanismo de busca DuckDuckGo doa US$ 5.000 para o Invisible Internet Project (I2P) em seu programa de doação de código aberto.
tr: Arama motoru DuckDuckGo, açık kaynaklı bağış programı kapsamında Invisible Internet Project (I2P) için 5000 dolar bağışladı.

source: **Somewhere, NH** -- Internet search company `DuckDuckGo`__ `donates`__ $5000 to the `Invisible Internet Project`__ (I2P) as part of their yearly open-source donation program. The award was granted on the basis of `nominations`__ by members of the public on the DuckDuckGo community portal. With an emphasis on privacy, DuckDuckGo provides a search engine which does not track its users or store personal data. I2P is an anonymous network intended to protect individuals from dragnet surveillance regularly performed by ISPs and governments.
pt_br: **Em algum lugar, NH** -- A empresa de busca na Internet `DuckDuckGo`__ `doa`__ $ 5.000 para o `Invisible Internet Project`__ (I2P) como parte de seu programa anual de doações de código aberto . O prêmio foi concedido com base em `indicações`__ por membros do público no portal da comunidade DuckDuckGo. Com ênfase na privacidade, a DuckDuckGo fornece um mecanismo de busca que não rastreia seus usuários nem armazena dados pessoais. A I2P é uma rede anônima destinada a proteger indivíduos da vigilância de arrasto realizada regularmente por ISPs e governos.
tr: **Biryer, NH** -- İnternet arama şirketi `DuckDuckGo`__, yıllık açık kaynak bağış programlarının bir parçası olarak `Invisible Internet Project`__ (I2P) için 5000 $ `bağış yaptı`__. Ödül, DuckDuckGo topluluk sitesinde halkın üyeleri tarafından seçilen `adaylıklara`__ göre verildi. Gizliliğe önem veren DuckDuckGo, kullanıcılarını izlemeyen veya kişisel verileri depolamayan bir arama motoru sağlar. I2P, bireyleri İnternet hizmeti sağlayıcıları ve hükümetler tarafından düzenli olarak gerçekleştirilen ağ gözetiminden korumayı amaçlayan anonim bir ağdır.

source: This marks the single largest donation ever received by I2P and reflects a growing interest in privacy and security by the Internet community. The funding will help I2P to reach more users, expand development, and audit the code. It will also enable I2P developers to attend conferences, such as the `Real-World Cryptography`__ conference in New York City, where the developers met and collaborated with cryptography experts pursuant to I2P's goals of providing anonymity to the public.
pt_br: Isso marca a maior doação já recebida pelo I2P e reflete um crescente interesse em privacidade e segurança pela comunidade da Internet. O financiamento ajudará o I2P a alcançar mais usuários, expandir o desenvolvimento e auditar o código. Ele também permitirá que os desenvolvedores do I2P participem de conferências, como a conferência `Criptografia do Mundo Real`__ na cidade de Nova York, onde os desenvolvedores se encontraram e colaboraram com especialistas em criptografia, de acordo com os objetivos do I2P de fornecer anonimato ao público.
tr: Bu tutar, I2P tarafından şimdiye kadar alınan en büyük bağış oldu. Ayrıca İnternet topluluğunun gizlilik ve güvenliğe artan ilgisini de gösteriyor. Mali destek, I2P projesinin daha fazla kullanıcıya ulaşmasına, geliştirmeyi arttırmasına ve kodu denetlemesine yardımcı olacak. Ayrıca, I2P geliştiricilerinin, I2P projesinin halka anonimlik sağlama hedefleri doğrultusunda, geliştiriciler ile şifreleme uzmanlarının buluşup iş birliği yaptığı New York City `Gerçek Dünyada Şifreleme`__ konferansı gibi etkinliklere katılmalarını sağlayacak.

source: I2P thanks Gabriel Weinberg and DuckDuckGo for the generous donation, and the I2P community for its support in the `nominations`__.
pt_br: O projeto I2P agradece a Gabriel Weinberg e DuckDuckGo pela doação generosa, e a comunidade I2P pelo suporte que ofereceram nas `nomeações`_.
tr: I2P olarak, cömert bağışları için Gabriel Weinberg ve DuckDuckGo kuruluşu ile `adaylıklar`__ için destek veren I2P topluluğuna teşekkür ediyoruz.

source: For more information about I2P, visit `our web site`__ or follow us `on Twitter`__.
pt_br: Para mais informações sobre o I2P, visite `nosso site`__ ou siga-nos `no Twitter`__.
tr: I2P hakkında ayrıntılı bilgi almak için `sitemizi`__ ziyaret edin veya `Twitter`__ üzerinde bizi takip edin.

source: ============== 0.9.12 Release ==============
pt_br: ========================== Lançamento da versão 0.9.12 ==========================
tr: ===================== 0.9.12 sürümü yayınlandı =====================

source: 0.9.12 adds support for ECDSA and updates to Jetty 8
pt_br: 0.9.12 adiciona suporte para ECDSA e atualizações para Jetty 8
tr: 0.9.12 sürümü, ECDSA desteği ve Jetty 8 güncellemesi ile yayınlandı

source: I2P now requires Java 6 or higher. We strongly recommend that you upgrade to Java 7. If you are still using Java 5, you must upgrade your Java before installing I2P 0.9.12.
pt_br: O I2P agora requer Java 6 ou superior. Recomendamos fortemente que você atualize para o Java 7. Se você ainda estiver usando o Java 5, deverá atualizar seu Java antes de instalar o I2P 0.9.12.
tr: I2P için artık Java 6 veya üzeri gerekiyor. Java 7 sürümüne yükseltmenizi şiddetle öneririz. Hala Java 5 kullanıyorsanız, I2P 0.9.12 sürümünü kurmadan önce Java sürümünüzü yükseltmeniz gerekir.

source: 0.9.12 adds preliminary support for ECDSA-signed Destinations. It contains several fixes for the handling of Delivery Status Messages (acknowledgements) and those messages are now end-to-end encrypted for increased security.
pt_br: 0.9.12 adiciona suporte preliminar para destinos assinados pelo ECDSA. Ele contém várias correções para o tratamento de mensagens de status de entrega (reconhecimentos) e essas mensagens agora são criptografadas de ponta a ponta para maior segurança.
tr: 0.9.12 sürümünde, ECDSA imzalı hedefler için ön destek eklendi. Teslim durumu iletilerinin (onaylar) işlenmesi için çeşitli düzeltmeler yapıldı. Artık bu iletiler daha fazla güvenlik sağlamak için uçtan uca şifreleniyor.

source: We have upgraded to Jetty 8. Jetty 8 is almost identical to Jetty 7, so there are no complex configuration file conversions as there have been in past Jetty upgrades. No manual changes should be necessary.
pt_br: Fizemos o upgrade para o Jetty 8. O Jetty 8 é quase idêntico ao Jetty 7, então não há conversões complexas de arquivos de configuração como houve nas atualizações anteriores do Jetty. Nenhuma alteração manual deve ser necessária.
tr: Jetty 8 sürümüne yükseltildi. Jetty 8, Jetty 7 ile hemen hemen aynıdır. Bu nedenle geçmiş Jetty yükseltmelerinde olduğu gibi karmaşık yapılandırma dosyası dönüşümleri gerekmez. El ile yapılması gereken herhangi bir değişiklik olmamalıdır.

source: In early March, Internet search company `DuckDuckGo`__ `donated`__ $5000 to the `Invisible Internet Project` (I2P) as part of their yearly open-source donation program. The award was granted on the basis of `nominations`__ by members of the public on the DuckDuckGo community portal.
pt_br: No início de março, a empresa de busca na Internet `DuckDuckGo`__ `doou`__ $5000 para o `Invisible Internet Project` (I2P) como parte de seu programa anual de doações de código aberto . O prêmio foi concedido com base em `indicações`__ por membros do público no portal da comunidade DuckDuckGo.
tr: Mart ayının başlarında, İnternet arama şirketi `DuckDuckGo`__, yıllık açık kaynak bağış programlarının bir parçası olarak `Invisible Internet Project` (I2P) için 5000 $ `bağış yaptı`__. Ödül, DuckDuckGo topluluk sitesinde halkın üyeleri tarafından belirlenen `adaylıklara`__ göre verildi.

source: I2P thanks Gabriel Weinberg and DuckDuckGo for the generous donation, and the I2P community for its support in the nominations.
pt_br: O I2P agradece a Gabriel Weinberg e DuckDuckGo pela generosa doação, e à comunidade I2P pelo apoio nas indicações.
tr: I2P olarak, cömert bağışları için Gabriel Weinberg ve DuckDuckGo kuruluşu ile `adaylıklar`__ için destek veren I2P topluluğuna teşekkür ediyoruz.

source: Encrypt Delivery Status Messages
pt_br: Criptografar mensagens de status de entrega
tr: Taşıyıcı durumu iletileri şifrelendi

source: Add preliminary support for ECDSA-signed Destinations
pt_br: Adicionar suporte preliminar para destinos assinados pela ECDSA
tr: ECDSA imzalı hedefler desteklemek için ön hazırlık yapıldı

source: Add check for replayed NTCP session requests
pt_br: Adicionar verificação para solicitações de sessão NTCP repetidas
tr: Yeniden oynatılan NTCP oturum istekleri için denetim eklendi

source: Add throttling and blocking checks to streaming ping processing
pt_br: Adicionar verificações de limitação e bloqueio ao processamento de ping de streaming
tr: Akış ping işlemine kısma ve engelleme denetimleri eklendi

source: Fix RouterInfo exchange in NTCP
pt_br: Corrigir troca de RouterInfo em NTCP
tr: NTCP üzerinde "Yöneltici bilgileri" (RouterInfo) alış verişi düzeltildi

source: Extend timeout for Delivery Status Messages
pt_br: Estender o tempo limite para mensagens de status de entrega
tr: Taşıyıcı durumu iletileri için zaman aşımı uzatıldı

source: Drop streaming messages from recently closed connections
pt_br: Soltar mensagens de streaming de conexões fechadas recentemente
tr: Yakın zamanda kapatılmış bağlantılardaki akış iletileri silindi

source: Fix restarts on Raspberry Pi
pt_br: Corrige a reinicialização no Raspberry Pi
tr: Raspberry Pi üzerindeki yeniden başlatmalar düzeltildi

source: Restore profileOrganizer.sameCountryBonus advanced config
pt_br: Restaurar profileOrganizer.sameCountryBonus configuração avançada
tr: profileOrganizer.sameCountryBonus gelişmiş yapılandırma seçeneği geri yüklendi

source: Fix for jwebcache and i2phex
pt_br: Correção para jwebcache e i2phex
tr: jwebcache ve i2phex düzeltmeleri yapıldı

source: Jetty 8.1.14.v20131031; Java 6 now required
pt_br: Jetty 8.1.14.v20131031; Java 6 agora necessário
tr: Artık Jetty 8.1.14.v20131031 ve Java 6 gerekiyor

source: Reduce target connection count again to reduce tunnel reject rate further
pt_br: Reduza a contagem de conexões de destino novamente para reduzir ainda mais a taxa de rejeição do túnel
tr: Tünel reddetme oranını daha da azaltmak için hedef bağlantı sayısını yeniden azaltıldı

source: Add rate limit for outbound connections at tunnel endpoints
pt_br: Adicionar limite de taxa para conexões de saída em pontos de extremidade do túnel
tr: Tünel uç noktalarıne gidiş bağlantıları için hız sınırı eklendi

source: Add optional inproxy blocking in i2ptunnel
pt_br: Adicionar bloqueio inproxy opcional no i2ptunnel
tr: i2ptunnel üzerinde isteğe bağlı giriş vekil sunucusu engellemesi eklendi

source: Use SSU session key for relay request/response when available
pt_br: Use a chave de sessão SSU para solicitação/resposta de retransmissão quando disponível
tr: Varsa aktarıcı isteği/yanıtı için SSU oturum anahtarının kullanılması sağlandı

source: Include HTTP POST data in SYN packet
pt_br: Incluir dados HTTP POST no pacote SYN
tr: SYN paketine HTTP POST verileri katıldı

source: Add getopt library for better argument processing
pt_br: Adicione a biblioteca getopt para melhor processamento de argumentos
tr: Daha iyi argüman işleme için getopt kitaplığı eklendi

source: More removal of Jetty dependencies
pt_br: Mais remoção de dependências do Jetty
tr: Daha fazla Jetty bağımlılığı kaldırıldı

source: Remove MD5 code, use Java libraries instead
pt_br: Remova o código MD5 e use bibliotecas Java em vez disso
tr: MD5 kodu kaldırıldı ve yerine Java kitaplıkları kullanıldı

source: Change the default addressbook subscription URL
pt_br: Alterar a URL de assinatura do catálogo de endereços padrão
tr: Varsayılan adres defteri abonelik adresi değiştirildi

source: ============== 0.9.13 Release ==============
pt_br: ========================== Lançamento da versão 0.9.13 ==========================
tr: ===================== 0.9.13 sürümü yayınlandı =====================

source: 0.9.13 with SusiMail improvements and fixes for firewalled routers
pt_br: 0.9.13 com melhorias no SusiMail e correções para rotadores protegidos por firewall
tr: 0.9.13 sürümü SusiMail geliştirmeleri ve güvenlik duvarı arkasındaki yönelticiler için düzeltmeler ile yayınlandı

source: 0.9.13 includes fixes for firewalled routers, netdb lookup improvements, and a big SusiMail update. Of course, there's also the usual collection of bug fixes and translation updates.
pt_br: 0.9.13 inclui correções para roteadores com firewall, melhorias na pesquisa netdb e uma grande atualização do SusiMail. Claro, há também a coleção usual de correções de bugs e atualizações de tradução.
tr: 0.9.13 sürümünde, güvenlik duvar arkasındaki yönelticiler için düzeltmeler, "Ağ veri tabanı" (NetDB) araması iyileştirmeleri ve büyük bir SusiMail güncellemesi bulunuyor. Her zamanki gibi hata düzeltmeleri ve çeviri güncellemeleri de var.

source: zzz has updated his GPG keys, and the release files are signed with his new keys. His new key fingerprint is:
pt_br: zzz atualizou suas chaves GPG, e os arquivos de lançamento são assinados com suas novas chaves. Sua nova impressão digital de chave é:
tr: zzz, GPG anahtarlarını güncelledi ve sürüm dosyalarını yeni anahtarlarıyla imzaladı. Yeni anahtarının parmak izi:

source: Many UI improvements
pt_br: Inúmeras melhorias na interface de usuário
tr: Kullanıcı arayüzünde bir çok iyileştirme yapıldı

source: Implement local storage of messages
pt_br: Implementa o armazenamento local de mensagens
tr: İletilerin yerel olarak depolanması sağlandı

source: Add offline mode
pt_br: Acrescenta o modo offline
tr: Çevrimdışı kip eklendi

source: Messages now deleted on server after download
pt_br: As mensagens agora são excluídas do servidor após o download
tr: İletiler artık indirildikten sonra sunucudan siliniyor

source: Several backend POP3 and SMTP speedups and fixes
pt_br: Várias correções e acelerações de POP3 e SMTP de backend
tr: Arka uçta birkaç POP3 ve SMTP hızlandırması ve düzeltmesi yapıldı

source: NetDB lookup fixes
pt_br: Correções de pesquisa do NetDB
tr: "Ağ veri tabanı" (NetDB) aramaları düzeltildi

source: Fix transition from not-firewalled to firewalled
pt_br: Corrige a transição de não-protegido por firewall para protegido por firewall
tr: Güvenlik duvarı arkasında olmayandan, güvenlik duvarlı arkasındakilere dönüşüm düzeltildi

source: Fix plugin uninstall on Windows
pt_br: Corrigir desinstalação de plugin no Windows
tr: Windows üzerinde uygulama eki kaldırma düzeltildi

source: SSU locking fixes
pt_br: Correções de bloqueio SSU
tr: SSU kilitlenmeleri düzeltildi

source: Fix rapid republishing of SSU addresses
pt_br: Corrigir a republicação rápida de endereços SSU
tr: SSU adreslerinin hızlı yeniden yayınlanması düzeltildi

source: IRC client exception fixes
pt_br: Correções de exceções do cliente IRC
tr: IRC istemci istisnası düzeltildi

source: Fix changing HTTP outproxy configuration without restarting tunnel
pt_br: Corrigir alteração da configuração de proxy HTTP sem reiniciar o túnel
tr: Tüneli yeniden başlatmadan HTTP çıkış vekil sunucusu yapılandırmasının değiştirilmesi düzeltildi

source: New i2ptunnel server option for unique local address per-client
pt_br: Nova opção de servidor i2ptunnel para endereço local exclusivo por cliente
tr: Her istemcinin benzersiz bir yerel adres kullanmasını sağlayan yeni i2ptunnel sunucu seçeneği eklendi

source: Warn in i2ptunnel on duplicate client ports
pt_br: Avisar no i2ptunnel sobre portas de cliente duplicadas
tr: Yinelenen istemci bağlantı noktaları için i2ptunnel uyarısı eklendi

source: Update HTTP User-Agent to match TBB
pt_br: Atualizar HTTP User-Agent para corresponder ao TBB
tr: HTTP kullanıcı uygulaması TBB ile eşleşecek şekilde güncellendi

source: Extend SSU establishment retransmission timer
pt_br: Estender o temporizador de retransmissão do estabelecimento SSU
tr: SSU kuruluş yeniden aktarım zamanlayıcısı uzatıldı

source: Use constant-time method for HMAC verification
pt_br: Use o método de tempo constante para verificação HMAC
tr: HMAC doğrulaması için sabit zaman yöntemi kullanıldı

source: New translation: Slovak
pt_br: Nova tradução: Eslovaco
tr: Slovakça çevirisi eklendi

source: ============== 0.9.14 Release ==============
pt_br: ============================= Lançamento da versão 0.9.14 =============================
tr: ===================== 0.9.14 sürümü yayınlandı =====================

source: 0.9.14 includes critical security fixes
pt_br: 0.9.14 inclui correções críticas de segurança
tr: 0.9.14 sürümü kritik güvenlik düzeltmeleri ile yayınlandı

source: 0.9.14 includes critical fixes for XSS and remote execution vulnerabilities reported by Exodus Intelligence. As an added precaution, we have disabled several advanced configuration features in the router console, including installation of new plugins. We plan to re-enable these in a future release after additional review.
pt_br: 0.9.14 inclui correções críticas para vulnerabilidades de XSS e execução remota relatadas pela Exodus Intelligence. Como precaução adicional, desabilitamos vários recursos de configuração avançada no console do roteador, incluindo a instalação de novos plugins. Planejamos reabilitá-los em uma versão futura após uma revisão adicional.
tr: 0.9.14 sürümünde, Exodus Intelligence tarafından bildirilen XSS ve uzaktan yürütme güvenlik açıkları için kritik düzeltmeler bulunuyor. Ek bir önlem olarak, yöneltici panosunda yeni uygulama eklerinin kurulumu ile birkaç gelişmiş yapılandırma özelliğini devre dışı bıraktık. Bu özellikleri, ek incelemeden sonra gelecekteki bir sürümde yeniden etkinleştirmeyi planlıyoruz.

source: Due to I2P library changes, I2P-Bote users must upgrade their plugin to version 0.2.10 to work with I2P 0.9.14. Your router should update the plugin automatically after the router restarts.
pt_br: Devido a alterações na biblioteca I2P, os usuários do I2P-Bote devem atualizar seu plugin para a versão 0.2.10 para funcionar com o I2P 0.9.14. Seu roteador deve atualizar o plugin automaticamente após a reinicialização.
tr: I2P kitaplığı değişiklikleri nedeniyle, I2P-Bote kullanıcıları, I2P 0.9.14 sürümü ile çalışmak için uygulama ekini 0.2.10 sürümüne yükseltmelidir. Yönelticiniz, yeniden başlatıldıktan sonra uygulama ekini otomatik olarak güncellemelidir.
