Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Router: Auto-floodfill now class N minimum
pt_br: Roteador: Preenchimento automático agora classe N mínima
tr: Yöneltici: Otomatik tamamlamanın en az N sınıfında yapılması sağlandı

source: Router: Checks for key certificates in destinations (proposal 145)
pt_br: Roteador: Verifica certificados de chave em destinos (proposta 145)
tr: Yöneltici: Hedeflerdeki anahtar sertifikalarının denetlenmesi sağlandı (145 numaralı öneri)

source: Router: Enforce minimum version for tunnel peers
pt_br: Roteador: Aplicar versão mínima para pares de túnel
tr: Yöneltici: Tünel eşleri için en düşük sürüm dayatıldı

source: SusiDNS: Support adding Base 32 addresses
pt_br: SusiDNS: Suporte para adicionar endereços Base 32
tr: SusiDNS: Base 32 adreslerinin eklenmesi sağlandı

source: Help your Friends Join I2P by Sharing Reseed Bundles
pt_br: Ajude seus amigos a se juntarem ao I2P compartilhando pacotes de reseed
tr: Arkadaşlarınızı I2P ağına katmak için yeniden tohumlama paketleri paylaşın

source: Create, exchange, and use reseed bundles
pt_br: Crie, troque e use pacotes de reseed
tr: Yeniden tohumlanmış paketler oluşturun, alıp verin ve kullanın

source: Most new I2P routers join the network by bootstrapping with the help of a reseed service. However, reseed services are centralized and comparatively easy to block, considering the emphasis on de-centralized and un-blockable connections in the rest of the I2P network. If a new I2P router finds itself unable to bootstrap, it may be a possible to use an existing I2P router to generate a working “Reseed bundle” and bootstrap without the need of a reseed service.
pt_br: A maioria dos novos roteadores I2P se juntam à rede por bootstrapping com a ajuda de um serviço de reseed. No entanto, os serviços de reseed são centralizados e comparativamente fáceis de bloquear, considerando a ênfase em conexões descentralizadas e não bloqueáveis no resto da rede I2P. Se um novo roteador I2P não conseguir fazer bootstrap, pode ser possível usar um roteador I2P existente para gerar um “pacote de reseed” funcional e bootstrap sem a necessidade de um serviço de reseed.
tr: Çoğu yeni I2P yönelticisi, yeniden başlatma hizmeti yardımıyla ön yükleme yaparak ağa katılır. Bununla birlikte, I2P ağının geri kalanında merkezi olmayan ve engellenemez bağlantılara yapılan vurgu göz önüne alındığında, yeniden tohumlama hizmetleri merkezileştirilmiştir ve nispeten kolay bir şekilde engellenebilir. Yeni bir I2P yönelticisi kendini ön yükleyemiyorsa, çalışan bir "Yeniden tohumlama paketi" oluşturmak ve yeniden başlatma hizmetine gerek duymadan ön yükleme yapmak için var olan bir I2P yönelticisi kullanılabilir.

source: It is possible for a user with a working I2P connection to help a blocked router join the network by generating a reseed file and passing it to them via a secret or non-blocked channel. In fact, in many circumstances, an I2P router that is already connected will not be affected by reseed blocking at all, so **having working I2P routers around means that existing I2P routers can help new I2P routers by providing them with a hidden way of bootstrapping**.
pt_br: É possível para um usuário com uma conexão I2P funcional ajudar um roteador bloqueado a se juntar à rede gerando um arquivo de reseed e passando para eles por meio de um canal secreto ou não bloqueado. Na verdade, em muitas circunstâncias, um roteador I2P que já está conectado não será afetado pelo bloqueio de reseed, então **ter roteadores I2P funcionais por perto significa que roteadores I2P existentes podem ajudar novos roteadores I2P fornecendo a eles uma maneira oculta de bootstrapping**.
tr: Çalışan bir I2P bağlantısına sahip bir kullanıcı, engellenmiş bir yönelticinin yeniden tohumlama dosyasını oluşturarak ve gizli veya engellenmemiş bir kanal aracılığıyla kendisine ileterek ağa katılmasına yardımcı olabilir. Aslında, birçok durumda, zaten bağlı olan bir I2P yöneltici, yeniden tohumlama engellemesinden etkilenmez. Bu nedenle **etrafta çalışan I2P yönelticilerinin olması, var olan I2P yönelticilerinin, onlara gizli bir yol sağlayarak yeni I2P yönelticilerinin ön yüklenmesine yardımcı olabileceği anlamına gelir**.

source: Generating a Reseed Bundle
pt_br: Gerando um pacote de reseed
tr: Yeniden Tohumlama Paketi Oluşturmak

source: To create a reseed bundle for others to use, go to the `Reseed configuration page <http://127.0.0.1:7657/configreseed>`__. You will see a section that looks like this. Click the button indicated by the red circle. |Create a Reseed Zip|
pt_br: Para criar um pacote de reseed para outros usarem, vá para a página de configuração `Reseed <http://127.0.0.1:7657/configreseed>`__. Você verá uma seção que se parece com esta. Clique no botão indicado pelo círculo vermelho. |Criar um Reseed Zip|
tr: Başkalarının kullanması amacıyla yeniden tohumlama paketi oluşturmak için, `Yeniden tohumlama yapılandırma sayfasına <http://127.0.0.1:7657/configreseed>`__ bakabilirsiniz. Buna benzeyen bir bölüm göreceksiniz. Kırmızı daire ile gösterilen düğmeye tıklayın. |Yeniden tohumlama zip dosyası oluşturun|

source: Now that you’ve clicked the button, a zip will be generated containing enough information to bootstrap a new I2P router. Download it and transfer it to the computer with the new, un-bootstrapped I2P router. |Downloads a Reseed Zip|
pt_br: Agora que você clicou no botão, um zip será gerado contendo informações suficientes para inicializar um novo roteador I2P. Baixe e transfira para o computador com o novo roteador I2P não inicializado. |Baixa um Reseed Zip|
tr: Düğmeye tıkladığınızda, yeni bir I2P yönelticisini ön yüklemek için yeterli bilgiyi içeren bir zip dosyası oluşturulur. Bu dosyayı indirin ve yeni, ön yüklemesiz I2P yönlendirici ile bilgisayara aktarın. |Yeniden tohumlama zip dosyasını indir|

source: Performing a Reseed from File
pt_br: Executando uma nova semente a partir do arquivo
tr: Dosyadan Yeniden Tohumlamak

source: Obtain an i2preseed.zip file from a friend with an I2P router that is already running, or from a trusted source somewhere on the internet, and visit the `Reseed Configuration page <http://127.0.0.1:7657/configreseed>`__. Click the button that says “Select zip or su3 file” and navigate to that file. |Select a Reseed Zip|
pt_br: Obtenha um arquivo i2preseed.zip de um amigo com um roteador I2P que já esteja em execução, ou de uma fonte confiável em algum lugar na internet, e visite a página `Reseed Configuration <http://127.0.0.1:7657/configreseed>`__. Clique no botão que diz “Selecionar arquivo zip ou su3” e navegue até esse arquivo. |Selecione um Reseed Zip|
tr: Halihazırda çalışan bir I2P yönelticisi olan bir arkadaşınızdan veya İnternet üzerindeki güvenilir bir kaynaktan bir i2preseed.zip dosyası alın ve `Yeniden tohumlama yapılandırma sayfası <http://127.0.0.1:7657/configreseed>`__ adresine gidin. “Zip veya su3 dosyası seç” yazan düğmeye tıklayın ve aldığınız dosyayı belirtin. |Yeniden Tohumlama zip dosyası seçin|

source: When you’ve selected your reseed file, click the “Reseed from File” button. |Reseed from a Zip File|. You’re done! Your router will now bootstrap using the zip file, and you will be ready to join the I2P network.
pt_br: Quando você tiver selecionado seu arquivo de reseed, clique no botão “Reseed from File” . |Reseed from a Zip File|. Pronto! Seu roteador agora inicializará usando o arquivo zip, e você estará pronto para se juntar à rede I2P .
tr: Yeniden tohumlama dosyanızı seçtiğinizde, “Dosyadan yeniden tohumla” düğmesine tıklayın. |Zip dosyasından yeniden tohumla|. Tamamdır! Yönelticiniz zip dosyasını kullanarak ön yükleme yapacak ve I2P ağına katılmaya hazır olacaksınız.

source: 0.9.47 Release
pt_br: Lançamento 0.9.47
tr: 0.9.47 sürümü yayınlandı

source: 0.9.47 enables new ECIES Encryption
pt_br: 0.9.47 habilita nova criptografia ECIES
tr: 0.9.47 sürümü yeni ECIES şifrelemesi ile yayınlandı

source: 0.9.47 enables our new end-to-end encryption protocol (proposal 144) by default for some services. The Sybil analysis and blocking tool is now enabled by default.
pt_br: A versão 0.9.47 habilita nosso novo protocolo de criptografia de ponta a ponta (proposta 144) por padrão para alguns serviços. A ferramenta de análise e bloqueio Sybil agora está habilitada por padrão.
tr: 0.9.47 sürümünde bazı hizmetler için varsayılan olarak yeni uçtan uca şifreleme iletişim kuralı (144 numaralı öneri) kullanılıyor. Artık Sybil inceleme ve engelleme aracı varsayılan olarak etkin.

source: Java 8 or higher is now required. Debian packages for Wheezy and Stretch, and for Ubuntu Trusty and Precise, are no longer supported. Users on those platforms should upgrade so you may continue to receive I2P updates.
pt_br: Java 8 ou superior agora é necessário. Os pacotes Debian para Wheezy e Stretch, e para Ubuntu Trusty e Precise, não são mais suportados. Os usuários nessas plataformas devem atualizar para que você possa continuar a receber atualizações I2P.
tr: Bu sürüm için Java 8 ve üzerindeki sürümler gereklidir. Wheezy ve Stretch Debian paketleri ile Precise and Trusty Ubuntu paketleri artık desteklenmiyor. Bu platformları kullanan kullanıcıların gelecekteki I2P güncellemelerini alabilmesi için sürümlerini yükseltmesi gerekiyor.

source: Java 8 now required
pt_br: Java 8 agora é necessário
tr: Artık Java 8 gerekli

source: ECIES-X25519-AEAD-Ratchet encryption enabled for i2psnark, shared clients, HTTP proxy, and new tunnels
pt_br: Criptografia ECIES-X25519-AEAD-Ratchet habilitada para i2psnark, clientes compartilhados, proxy HTTP e novos túneis
tr: i2psnark, paylaşılan istemciler, HTTP vekil sunucu ve yeni tüneller için ECIES-X25519-AEAD-Ratchet şifrelemesi etkinleştirildi

source: Increase streaming MTU for ECIES connections
pt_br: Aumentar MTU de streaming para conexões ECIES
tr: ECIES bağlantıları için akış MTU değeri artırıldı

source: Enable Sybil analysis and blocking tool by default
pt_br: Habilitar a ferramenta de análise e bloqueio Sybil por padrão
tr: Sybil incelemesi ve engelleme aracı varsayılan olarak etkinleştirildi

source: Hidden Services Manager: Fix missing server tunnel length configuration
pt_br: Hidden Services Manager: Corrigir configuração de comprimento de túnel de servidor ausente
tr: Gizli hizmet yöneticisi: Eksik sunucu tüneli uzunluğu yapılandırması düzeltildi

source: Hidden Services Manager: Fix missing server throttle configuration
pt_br: Gerenciador de serviços ocultos: Corrigir configuração de limitação de servidor ausente
tr: Gizli hizmet yöneticisi: Eksik sunucu sınırlama yapılandırması düzeltildi

source: i2psnark: Fix javascript confirmation for delete buttons
pt_br: i2psnark: Corrigir confirmação de javascript para botões de exclusão
tr: i2psnark: Silme düğmeleri için JavaScript onayı düzeltildi

source: UPnP: More fixes for changing interfaces and devices
pt_br: UPnP: Mais correções para alterar interfaces e dispositivos
tr: UPnP: Arayüzleri ve aygıtları değiştirmek için ek düzeltmeler yapıldı

source: Fix DoH handling of Cloudflare responses
pt_br: Corrigir o tratamento DoH das respostas do Cloudflare
tr: Cloudflare yanıtlarının DoH işlemesi düzeltildi

source: Fix blinded/encrypted leaseset creation
pt_br: Corrigir criação de leaseset criptografada/cega
tr: Kör/"Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) oluşturulması düzeltildi

source: Fix persistent leaseset keys
pt_br: Corrigir chaves de leaseset persistentes
tr: Kalıcı "Kiralama kümesi" (LeaseSet) anahtarları düzeltildi

source: Sign Windows dlls
pt_br: Assinar dlls do Windows
tr: Windows dll dosyaları imzalandı

source: Faster gzip uncompression for level 0
pt_br: Descompressão gzip mais rápida para nível 0
tr: 0. düzey için daha hızlı gzip sıkıştırması sağlandı

source: i2psnark: Increase max pipeline
pt_br: i2psnark: Aumentar pipeline máximo
tr: i2psnark: En fazla pipeline değeri artırıldı

source: 0.9.48 Release
pt_br: Lançamento 0.9.48
tr: 0.9.48 sürümü yayınlandı

source: 0.9.48 with performance enhancements
pt_br: 0.9.48 com melhorias de desempenho
tr: 0.9.48 sürümü başarım iyileştirmeleri ile yayınlandı

source: 0.9.48 enables our new end-to-end encryption protocol (proposal 144) for most services. We have added preliminary support for new tunnel build message encryption (proposal 152). There are significant performance improvements throughout the router.
pt_br: 0.9.48 permite nosso novo protocolo de criptografia de ponta-a-ponta (proposta 144) para a maioria dos serviços. Adicionamos suporte preliminar para a criptografia de novas mensagens de construção de túnel (proposta 152). Há melhorias significativas de desempenho em todo o roteador.
tr: 0.9.48 sürümünde, çoğu hizmet için yeni uçtan uca şifreleme iletişim kuralı (144 numaralı öneri) kullanılıyor. Yeni tünel oluşturma ileti şifrelemesinin ön desteği eklendi (152 numaralı öneri). Yöneltici genelinde önemli başarım iyileştirmeleri yapıldı.

source: Packages for Ubuntu Xenial (16.04 LTS) are no longer supported. Users on that platform should upgrade so you may continue to receive I2P updates.
pt_br: Pacotes para Ubuntu Xenial (16.04 LTS) não são mais suportados. Os usuários nessa plataforma devem atualizar para que você possa continuar a receber atualizações I2P.
tr: Ubuntu Xenial (16.04 LTS) paketleri artık desteklenmiyor. Bu platformu kullanan kullanıcıların gelecekteki I2P güncellemelerini alabilmesi için sürümlerini yükseltmesi gerekiyor.

source: Avoid old DSA-SHA1 routers for lookups, stores, and tunnel peers
pt_br: Evite roteadores DSA-SHA1 antigos para pesquisas, armazenamentos e pares de túneis
tr: Aramalar, depolar ve tünel eşleri için eski DSA-SHA1 yönelticilerinden kaçınılması sağlandı

source: Block same-country connections when in hidden mode
pt_br: Bloquear conexões do mesmo país quando estiver no modo oculto
tr: Gizli kipteyken aynı ülkeden yapılan bağlantılar engellendi

source: BOB: Add deprecation warning
pt_br: BOB: Adicionar aviso de descontinuação
tr: BOB: Kullanımdan kaldırma uyarısı eklendi

source: Build: Drop support for Xenial; ant 1.9.8 or higher required to build
pt_br: Build: Abandone o suporte para Xenial; ant 1.9.8 ou superior necessário para construir
tr: Yapım: Xenial desteği kaldırıldı. Derleme için ant 1.9.8 veya üzeri gerekir

source: i2ptunnel: Enable dual-key encryption for most tunnel types
pt_br: i2ptunnel: Habilita criptografia de chave dupla para a maioria dos tipos de túnel
tr: i2ptunnel: Çoğu tünel türü için çift anahtarlı şifreleme etkinleştirildi

source: JBigI: Add library for Linux aarch64, zen, and zen2
pt_br: JBigI: Adicionar biblioteca para Linux aarch64, zen e zen2
tr: JBigI: Linux aarch64, zen ve zen2 kitaplıkları eklendi

source: Preliminary support for ECIES-X25519 routers (proposals 152 and 156)
pt_br: Suporte preliminar para roteadores ECIES-X25519 (propostas 152 e 156)
tr: ECIES-X25519 yönelticileri için hazırlık yapıldı (152 ve 156 numaralı öneriler)

source: Ratchet: Efficiency improvements and memory reduction
pt_br: Ratchet: Melhorias de eficiência e redução de memória
tr: Ratchet: Verimlilik iyileştirmeleri ve bellek azaltma

source: SSU: Randomize intro key
pt_br: SSU: Randomizar tecla de introdução
tr: SSU: Tanıtım anahtarı rastgele yapıldı

source: SSU performance improvements
pt_br: Melhorias no desempenho do SSU
tr: SSU: Başarım iyileştirmeleri yapıldı

source: System tray: Enable by default for Linux KDE and LXDE
pt_br: Bandeja do sistema: Habilitar por padrão para Linux KDE e LXDE
tr: Sistem tepsisi: Linux KDE ve LXDE için varsayılan olarak etkinleştirildi

source: Build: Set release property for better runtime compatibility
pt_br: Build: Defina a propriedade release para melhor compatibilidade de tempo de execução
tr: Yapım: Daha iyi runtime uyumluluğu için sürüm özelliği ayarlandı

source: Console: Fix Jetty not starting on Java 11.0.9.1
pt_br: Console: Corrigir Jetty não iniciando no Java 11.0.9.1
tr: Panı: Java 11.0.9.1 üzerinde Jetty başlamamasını düzeltildi

source: i2psnark: Limit size of embedded video
pt_br: i2psnark: Limitar tamanho do vídeo incorporado
tr: i2psnark: Gömülü videonun boyutu sınırlandı

source: Improved IPv6 address validation
pt_br: Validação de endereço IPv6 aprimorada
tr: Geliştirilmiş IPv6 adresi doğrulaması sağlandı

source: Installer: Disable pack200 to support Java 14+
pt_br: Instalador: Desabilite o pack200 para oferecer suporte ao Java 14+
tr: Kurucu: Java 14+ üzerini desteklemek için pack200 devre dışı bırakıldı

source: Installer: Add missing linux armv7 and aarch64 wrapper binaries
pt_br: Instalador: Adicionar binários wrapper Linux armv7 e aarch64 ausentes
tr: Kurucu: Eksik linux armv7 ve aarch64 Wrapper binary dosyaları eklendi

source: i2ptunnel: Filter server response headers when not compressing
pt_br: i2ptunnel: Filtrar cabeçalhos de resposta do servidor quando não estiver compactando
tr: i2ptunnel: Sıkıştırma yapılmadığında sunucu yanıt üst bilgilerinin süzülmesi sağlandı

source: NTCP2: Fix sending termination message on idle timeout
pt_br: NTCP2: Corrigir o envio de mensagem de término em tempo limite ocioso
tr: NTCP2: Boşta kalma zaman aşımında sonlandırma iletisinin gönderilmesi düzeltildi

source: Streaming: Fix handling of tag options
pt_br: Streaming: Corrigir o tratamento das opções de tags
tr: Akış: Etiket seçeneklerinin işlenmesi düzeltildi

source: Build: Reproducible build fix
pt_br: Build: correção de build reproduzível
tr: Yapım: Yinelenebilir yapım düzeltmesi

source: Core: Refactoring of data structures to reduce memory usage
pt_br: Núcleo: Refatoração de estruturas de dados para reduzir o uso de memória
tr: Çekirdek: Bellek kullanımını azaltmak için veri yapıları kodu elden geçirildi

source: Crypto: Cache HMAC256 instances
pt_br: Criptografia: Cache de instâncias HMAC256
tr: Şifreleme: HMAC256 örnekleri ön belleğe alındı

source: i2psnark: Hide BEP 48 padding directory in UI
pt_br: i2psnark: Ocultar diretório de preenchimento BEP 48 na IU
tr: i2psnark: Kullanıcı arabiriminde BEP 48 dolgu dizini gizlendi

source: i2psnark: Checks for unsupported v2 torrents
pt_br: i2psnark: Verifica se há torrents v2 não suportados
tr: i2psnark: Desteklenmeyen v2 torrentlerinin denetlenmesi sağlandı

source: i2psnark: Remove old opentrackers
pt_br: i2psnark: Remover opentrackers antigos
tr: i2psnark: Eski opentracker kayıtları kaldırıldı

source: i2ptunnel: Improved support for offline keys
pt_br: i2ptunnel: Suporte aprimorado para chaves offline
tr: i2ptunnel: Çevrimdışı anahtar desteği geliştirildi

source: NetDB: Increase minimum floodfill version for leaseset lookups
pt_br: NetDB: Aumentar a versão mínima de floodfill para pesquisas de leaseset
tr: "Ağ veri tabanı" (NetDB): "Kiralama kümesi" (LeaseSet) aramaları için en az otomatik doldurma sürümü artırıldı

source: NTCP: Set nodelay on sockets
pt_br: NTCP: Definir nodelay em sockets
tr: NTCP: Soketlerde nodelay ayarlandı

source: Proxy: Remove old jump servers
pt_br: Proxy: Remover servidores de salto antigos
tr: Vekil sunucu: Eski durak sunucuları kaldırıldı

source: Ratchet: Rotate keys faster
pt_br: Catraca: Gire as chaves mais rápido
tr: Ratchet: Anahtarların daha hızlı döndürülmesi sağlandı

source: Wrapper 3.5.44 (new installs only)
pt_br: Wrapper 3.5.44 (somente novas instalações)
tr: Wrapper 3.5.44 sürümüne güncellendi (yalnızca yeni kurulumlar)

source: New partial translations for Kurdish, Turkmen, Argentinian Spanish
pt_br: Novas traduções parciais para curdo, turcomano e espanhol argentino
tr: Kürtçe, Türkmence, Arjantin İspanyolcası çevirileri eklendi (kısmen)

source: Hello Git, Goodbye Monotone
pt_br: Olá Git, adeus Monotone
tr: Merhaba Git, hoşçakal Monotone

source: Hello git, goodbye mtn
pt_br: Olá git, adeus mtn
tr: Merhaba Git, hoşçakal MTN

source: The I2P Git Migration is nearly concluded
pt_br: A migração do I2P Git está quase concluída
tr: I2P Git geçişi neredeyse tamamlandı

source: For over a decade, I2P has relied on the venerable Monotone service to support its version control needs, but during the past few years, most of the world has moved on to the now-universal Git version control system. In that same time, the I2P Network has become faster and more reliable, and accessible workarounds to Git's non-resumability have been developed.
pt_br: Por mais de uma década, o I2P tem contado com o venerável serviço Monotone para dar suporte a suas necessidades de controle de versão, mas durante os últimos anos, a maior parte do mundo migrou para o agora universal sistema de controle de versão Git. Nesse mesmo tempo, a I2P Network se tornou mais rápida e confiável, e soluções alternativas acessíveis para a não capacidade de retomada do Git foram desenvolvidas.
tr: On yıldan fazla bir süredir I2P, sürüm denetimi gereksinimlerini desteklemek için saygıdeğer Monotone hizmetine güveniyordu. Ancak son birkaç yılda dünyanın çoğu, artık evrensel Git sürüm denetimi sistemine geçti. Aynı zamanda, I2P ağı daha hızlı ve daha güvenilir hale geldi ve Git sürdürülemezliği için erişilebilir çözümler geliştirildi.

source: Today marks a significant occasion for I2P, as we switched off the old mtn i2p.i2p branch, and moved the development of the core Java I2P libraries from Monotone to Git officially.
pt_br: Hoje marca uma ocasião significativa para o I2P, pois desligamos a antiga ramificação mtn i2p.i2p e movemos o desenvolvimento das principais bibliotecas Java I2P do Monotone para o Git oficialmente.
tr: Bugün I2P için önemli bir dönüm noktası. Eski mtn i2p.i2p dalını kapattık ve temel Java I2P kitaplıklarının geliştirilmesini resmi olarak Monotone üzerinden Git üzerine taşıdık.

source: While our use of mtn has been questioned in the past, and it's not always been a popular choice, I'd like to take this moment, as perhaps the very last project to use Monotone to thank the Monotone developers, current and former, wherever they are, for the software they created.
pt_br: Embora nosso uso do mtn tenha sido questionado no passado, e nem sempre tenha sido uma escolha popular, gostaria de aproveitar este momento, como talvez o último projeto a usar o Monotone, para agradecer aos desenvolvedores do Monotone, atuais e antigos, onde quer que estejam, pelo software que criaram.
tr: Bu anı, geçmişte mtn kullanımımız sorgulanırken ve her zaman beğenilen bir seçim olmasa da, Monotone kullanan belki de en son proje olarak, var olan ve eski Monotone geliştiricilerine, nerede olurlarsa olsunlar onlara ve yarattıkları yazılıma teşekkür etmek için değerlendirmek istedim.

source: GPG Signing
pt_br: Assinatura GPG
tr: GPG İmzalama

source: Checkins to the I2P Project repositories require you to configure GPG signing for your git commits, including Merge Requests and Pull Requests. Please configure your git client for GPG signing before you fork i2p.i2p and check anything in.
pt_br: Os check-ins nos repositórios do Projeto I2P exigem que você configure a assinatura GPG para seus commits git, incluindo Merge Requests e Pull Requests. Por favor, configure seu cliente git para assinatura GPG antes de bifurcar i2p.i2p e fazer check-in de qualquer coisa.
tr: I2P Projesi depolarına yapılan gönderimler, birleştirme istekleri ve çekme istekleri gibi Git gönderimleriniz için GPG imzalamasını yapılandırmanız gerekir. Lütfen i2p.i2p projesini dallandırmadan ve herhangi bir şey göndermeden önce Git istemcinizi GPG imzalama için yapılandırın.

source: Official Repositories and Gitlab/Github Syncing
pt_br: Repositórios oficiais e sincronização Gitlab/Github
tr: Resmi Depolar ve GitLab/GitHub Eşitlemesi
