Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: We spoke at length with Christian Grothoff of `GNUnet`__. He has moved himself and the project from TU Munich to `Inria`__ in France. He has a large number of `open positions`__. This is a great opportunity to get paid to work on open source anonymity tools, we encourage everybody to contact him about it.
pt_br: Conversamos longamente com Christian Grothoff do `GNUnet`__. Ele se mudou e o projeto da TU Munich para `Inria`__ na França. Ele tem um grande número de `posições abertas`__. Esta é uma ótima oportunidade de ser pago para trabalhar em ferramentas de anonimato de código aberto , encorajamos todos a contatá-lo sobre isso.
tr: `GNUnet`__' kuruluşundan Christian Grothoff ile uzun uzadıya konuştuk. Kendisini ve projesini TU Münih üzerinden Fransa'daki `Inria`__ üzerine taşıdı. Projesinde çok sayıda `açık pozisyon`__ var. Açık kaynaklı anonimlik araçları üzerinde ücret karşılığı çalışmak için harika bir fırsat olduğunu düşünüyoruz ve herkesin bu konuda kendisiyle görüşmesini öneriyoruz.

source: The prospect of an invigorated GNUnet with a large amount of new funding is quite interesting. We discussed more ways to work together. In early 2014, we worked hard to understand the GnuNet DNS replacement, but we were unable to figure out a good fit for it in I2P. One of his new ideas is a distributed, anonymous statistics gathering subsystem, for detecting problems or attacks on the network. We'd definitely be interested in that.
pt_br: A perspectiva de um GNUnet revigorado com uma grande quantidade de novos financiamentos é bastante interessante. Discutimos mais maneiras de trabalhar juntos. No início de 2014, nós trabalhamos duro para entender a substituição do DNS do GnuNet, mas não conseguimos descobrir um bom ajuste para ele no I2P. Uma de suas novas ideias é um subsistema de coleta de estatísticas anônimas e distribuídas, para detectar problemas ou ataques na rede. Definitivamente estaríamos interessados nisso.
tr: Büyük miktarda yeni fonla canlanmış bir GNUnet beklentisi oldukça ilginç. İşbirliği yapma yollarını tartıştık. 2014 yılının başlarında, GnuNet DNS değişimini anlamak için çok çalıştık, ancak I2P üzerinde buna uygun bir çözüm bulamadık. Yeni fikirlerinden biri, ağdaki sorunları veya saldırıları algılamak için dağıtılmış, anonim bir istatistik toplama alt sistemidir. Bununla kesinlikle ilgilenirdik.

source: We also discussed the `Special-Use Domain Names of Peer-to-Peer Systems draft`__. A new, greatly simplified version 3 was posted in December. The prospects for approval remain unclear. The best way to monitor or participate in the discussion is via the `IETF DNSOP WG mailing list`__. We will attempt to do so on our side, and also give Hellekin a new point-of-contact for this topic.
pt_br: Também discutimos o `rascunho de Nomes de Domínio de Uso Especial de Sistemas Peer-to-Peer`__. Uma nova versão 3, bastante simplificada, foi publicada em dezembro. As perspectivas para aprovação de permanecem obscuras. A melhor maneira de monitorar ou participar da discussão de é por meio da `lista de discussão IETF DNSOP WG`__. Tentaremos fazer isso de do nosso lado e também daremos a Hellekin um novo ponto de contato para este tópico.
tr: Ayrıca `Eşler Arası Sistemlerin Özel Kullanım Etki Alanı Adları taslağını`__ tartıştık. Aralık ayında büyük ölçüde basitleştirilmiş 3. sürüm yayınlandı. Onay beklentileri belirsizliğini koruyor. Tartışmayı izlemenin veya katılmanın en iyi yolu `IETF DNSOP WG e-posta listesidir`__. Bunu kendi tarafımızda yapmaya çalışacağız ve ayrıca Hellekin'e bu konu için yeni bir iletişim noktası vereceğiz.

source: We apologized to Christian for not being organized enough to have a talk at his `We Fix The Net assembly`__. One of our biggest failures as a project is our seeming inability to submit talks at conferences. We'll have to do better in the new year.
pt_br: Pedimos desculpas a Christian por não estarmos organizados o suficiente para dar uma palestra em sua assembleia `We Fix The Net`__. Uma das nossas maiores falhas como projeto é nossa aparente incapacidade de enviar palestras em conferências. Teremos que fazer melhor no ano novo.
tr: Christian'dan `We Fix The Net Assembly`__ oturumunda konuşacak kadar organize olamadığımız için özür diledik. Bir proje olarak en büyük başarısızlıklarımızdan biri, konferanslarda konuşma yapamamak gibi görünüyor. Yeni yılda daha iyisini yapmak zorundayız.

source: Iain Learmonth, a Debian participant, stopped by. He wants to put I2P in with other anonymity tools into this new Debian "superpackage" of some sort, and would love to get I2P into Debian in 2015. He claims the process is now easy, just `follow the instructions`__. We said that's funny, we've been `stuck in the process for over 7 years`__.
pt_br: Iain Learmonth, um participante do Debian, passou por aqui. Ele quer colocar o I2P com outras ferramentas de anonimato neste novo "superpacote" do Debian de algum tipo, e adoraria colocar o I2P no Debian em 2015. Ele afirma que o processo agora é fácil, apenas `siga as instruções`__. Nós dissemos que isso é engraçado, estamos `presos no processo há mais de 7 anos`__.
tr: Bir Debian katılımcısı olan Iain Learmonth uğradı. diğer anonimlik araçlarıyla birlikte I2P uygulamasını bu yeni Debian "süper paketine" bir şekilde yerleştirmeyi ve 2015 yılında Debian ile sunmayı çok istiyor. Sürecin artık kolaylaştığını ve `yönergeleri izlemekten`__ ibaret olduğunu iddia ediyor. Bunu komik buluyoruz, `7 yılı aşkın zamandır sürecin içinde sıkışıp kaldık`__.

source: He said, well, try the new process, it works great, should be no problem at all if your package is in good shape. The people in Debian that run this process are eager volunteers who want nothing more than to get more packages in. We said our package is indeed in fantastic shape, and we would try out the new process as soon as possible. If all this is true, we will be in the next Debian release in late 2015. This would be very very cool.
pt_br: Ele disse, bem, tente o novo processo, ele funciona muito bem, não deve ser problema algum se seu pacote estiver em boas condições. As pessoas no Debian que executam esse processo são voluntários ansiosos que querem nada mais do que obter mais pacotes. Dissemos que nosso pacote está realmente em forma fantástica, e que tentaríamos o novo processo o mais possível. Se tudo isso for verdade, estaremos no próximo lançamento do Debian em final de 2015. Isso seria muito, muito legal.
tr: Yeni sürecin harika çalıştığını ve denememizi, paketimiz iyi durumdaysa hiç sorun olmayacağını, Debian üzerinde bu süreci yürüten kişilerin, yeni paketleri içeri almaya aç gönüllüler olduğunu söyledi. Paketimizin gerçekten harika durumda olduğunu ve en kısa zamanda yeni süreci deneyeceğimizi söyledik. Tüm bunlar doğruysa, 2015 yılının sonlarında bir sonraki Debian sürümünde olacağız. Bu çok çok harika olurdu.

source: We had a nice discussion with BitingBird of Tails. They are very happy with our rapid response to the `vulnerability disclosure`__ last summer, resulting in our `0.9.14 release`__. Our vulnerability was initially blamed on Tails, and they took `great offense`__ to that and the lack of private notification. We thanked them for taking the heat and fighting back.
pt_br: Tivemos uma boa discussão com o BitingBird do Tails. Eles estão muito felizes com nossa resposta rápida à `divulgação de vulnerabilidade`__ no verão passado, resultando em nosso `lançamento 0.9.14`__. Nossa vulnerabilidade foi inicialmente atribuída ao Tails, e eles ficaram `muito ofendidos`__ com isso e com a falta de notificação privada. Agradecemos a eles por assumirem a responsabilidade e revidarem.
tr: Tails projesinden BitingBird ile güzel bir tartışma yaptık. Geçen yaz yaşanan `güvenlik açığı duyurusuna`__ verdiğimiz hızlı yanıttan ve sonucunda yayınlanan `0.9.14 sürümümünden`'__ çok memnunlar. Güvenlik açığımız başlangıçta Tails uygulamasıyla ilişkilendirildi. Bu durumdan ve bildirimin gizlice yapılmamasından dolayı, `büyük saldırı`__ aldılar. Ateş altında kalıp karşılık verdikleri için onlara teşekkür ettik.

source: BitingBird also handles support, and she tells us the number one issue is how long I2P takes to start up and be useful for browsing I2P sites. Her standard answer is "wait ten more minutes" and that seems to be effective. I2P is particularly slow to startup on Tails since it does not persist peer data by default. It would be nice to change that, but there's also things we can do on the I2P side to make things start faster. Expect some improvement in our 0.9.18 release.
pt_br: BitingBird também cuida do suporte, e ela nos diz que o problema número um é quanto tempo o I2P leva para iniciar e ser útil para navegar em sites I2P. Sua resposta padrão é "espere mais dez minutos" e isso parece ser eficaz. O I2P é particularmente lento para iniciar no Tails, pois não persiste os dados dos pares por padrão. Seria bom mudar isso, mas também há coisas que podemos fazer no lado do I2P para fazer as coisas iniciarem mais rápido. Espere alguma melhoria em nossa versão 0.9.18 .
tr: BitingBird ayrıca destek işlemlerini de yaptığından, en çok sorulan sorunun I2P uygulamasının başlatılması ve I2P sitelerinde gezinebilmesi için ne kadar zaman gerektiği olduğunu söyledi . Standart yanıtının "on dakika daha bekle" olduğunun ve bunun işe yaradığını düşünüyor. I2P, varsayılan olarak eş verilerini kalıcı olarak depolamadığından, özellikle Tails üzerinden başlatıldığında yavaş oluyor. Bunu değiştirmek güzel olurdu, ancak daha hızlı başlamasını sağlamak için I2P tarafında yapabileceğimiz şeyler de var. 0.9.18 sürümünde biraz iyileşme bekliyoruz.

source: Longtime friend of I2P Bernhard Fischer of `OnionCat`__ stopped by. The upcoming Tor Hidden Services changes mean that their keys will no longer fit into a portion of an IPv6 address, and he was working on a solution. We reminded him that this has always been the case for I2P (with "GarliCat"), that it's not a new problem. He pointed us to `a presentation`__ of his proposal. It involves storing an extra record in the hidden service directory (equivalent of a leaseset I2P's network database). It wasn't completely clear how this would work, or if we would consider it abuse of the netDb. We'll follow up with him as he gets further.
pt_br: O amigo de longa data do I2P Bernhard Fischer do `OnionCat`__ passou por aqui. As próximas mudanças nos Serviços Ocultos do Tor significam que suas chaves não caberão mais em uma porção de um endereço IPv6, e ele estava trabalhando em uma solução. Nós o lembramos que esse sempre foi o caso para o I2P (com "GarliCat"), que não é um problema novo. Ele nos apontou para `apresentação`__ de sua proposta. Ela envolve armazenar um registro extra no diretório de serviço oculto (equivalente a um leaseset do banco de dados de rede do I2P). Não estava completamente claro como isso funcionaria, ou se consideraríamos abuso do netDb. Vamos acompanhá-lo conforme ele for avançando.
tr: Uzun zamandır bir I2P dostu olan `OnionCat`__ Bernhard Fischer uğradı. Yakında yapılacak Tor gizli hizmetleri değişiklikleri, Tor anahtarlarının artık bir IPv6 adresinin bir kısmına sığmayacağı ve bir çözüm üzerinde çalıştığı anlamına geliyor. Ona bunun I2P ("GarliCat" ile) için her zaman böyle olduğunu, bunun yeni bir sorun olmadığını hatırlattık. Bize önerisinin `sunumundan`__ bahsetti. Gizli hizmet klasöründe fazladan bir kayıt eklemeyi düşünüyor (bir I2P "Kiralama kümesi" (LeaseSet) "Ağ veri tabanı" (NetDB) eşdeğeri). Bunun nasıl çalışacağı veya ağ veri tabanının kötüye kullanılması olarak kabul edilip edilmeyeceği tam olarak açık değildi. İlerledikçe onu izleyeceğiz.

source: New users ---------
pt_br: Novos usuários ---------
tr: Yeni kullanıcılar ---------

source: We spent hours and hours explaining I2P to people stopping by our table. Some had heard of I2P before, some had not; everybody had heard of Tor and had at least a vague idea of what hidden services are. As usual, introducing people to I2P was a struggle. By the end of the Congress, we became convinced that a part of the problem was a difference in terminology. Back 12 years ago, when I2P and Tor were both getting started, we each came up with terms for the various parts of our systems. Today, the Tor terminology such as "hidden service" is well-understood and commonplace. The I2P terminology such as "eepsite" is neither. We agreed to review our documentation, router console, and other places for opportunities to simplify it and use common terms.
pt_br: Passamos horas e horas explicando I2P para as pessoas que paravam em nossa mesa. Alguns já tinham ouvido falar de I2P antes, outros não; todos já tinham ouvido falar de Tor e tinham pelo menos uma vaga ideia do que são serviços ocultos. Como de costume, apresentar as pessoas ao I2P foi uma luta. No final do Congresso, nos convencemos de que uma parte do problema era uma diferença na terminologia. Há 12 anos, quando I2P e Tor estavam começando, cada um de nós criou termos para as várias partes de nossos sistemas. Hoje, a terminologia Tor, como "serviço oculto", é bem compreendida e comum. A terminologia I2P, como "eepsite", não é nenhuma das duas. Concordamos em revisar nossa documentação, console do roteador e outros lugares para oportunidades de simplificá-los e usar termos comuns.
tr: Masamıza uğrayan insanlara I2P projesini anlatmak için saatler harcadık. Bazıları daha önce I2P projesini duymuştu, bazıları da duymamıştı. Ama herkes Tor projesini duymuştu ve gizli hizmetlerin ne olduğu hakkında belirsiz de olsa bir fikri vardı. Her zamanki gibi insanları I2P ile tanıştırmak bir mücadeleydi. Kongrenin sonunda, sorunun bir kısmının terminolojideki farklılık olduğuna ikna olduk. 12 yıl önce, hem I2P hem de Tor başladığında, her birimiz sistemlerimizin çeşitli bölümleri için kavramlar ürettik. Bugün, "gizli hizmet" gibi bir Tor kavramı iyi anlaşılmış ve yaygın olarak kullanılıyor. "Eepsite" gibi bir I2P kavramı ise böyle değil. Yöneltici panomuz ve diğer yerlerde basitleştirme ve ortak kavramları kullanma fırsatlarını görmek için belgelerimizi gözden geçireceğiz.

source: I2P project topics ------------------
pt_br: Tópicos do projeto I2P ------------------
tr: I2P projesi konuları ------------------

source: * *Spending money:* We discussed several ways to effectively use our resources in 2015, including more hardware for testing and development. Also, we plan to increase reimbursement levels for conference attendees.
pt_br: * *Gastando dinheiro:* Discutimos várias maneiras de usar nossos recursos de forma eficaz em 2015, incluindo mais hardware para testes e desenvolvimento. Além disso, planejamos aumentar os níveis de reembolso para os participantes da conferência.
tr: * *Para harcamak:* Deneme ve geliştirme için daha fazla donanım ile birlikte, 2015 yılında kaynaklarımızı etkin bir şekilde kullanmanın çeşitli yollarını tartıştık. Ayrıca, konferans katılımcıları için geri ödeme düzeylerini artırmayı planlıyoruz.

source: * *Toronto meetup:* CCC is such a productive time for us, and it seems that a second meetup in the year would be quite helpful. We have proposed it for August 2015 in Toronto, Canada, in conjunction with `Toronto Crypto`__. It would include developer meetings together with presentations and tutorials, all open to the public. We are attempting to gauge interest and research possible venues. If you are considering attending, please let us know by `tweeting @i2p`__ or posting `on the dev forum thread`__.
pt_br: * *Toronto meetup:* O CCC é um momento muito produtivo para nós, e parece que um segundo meetup no ano seria bem útil. Nós o propusemos para agosto de 2015 em Toronto, Canadá, em conjunto com `Toronto Crypto`__. Incluiria reuniões de desenvolvedores junto com apresentações e tutoriais, todos abertos ao público. Estamos tentando avaliar o interesse e pesquisar possíveis locais. Se você estiver pensando em participar, por favor nos avise `tweetando @i2p`__ ou postando `no tópico do fórum dev`__.
tr: * *Toronto buluşması:* CCC bizim için çok verimli bir dönem ve görünüşe göre yıl içinde ikinci bir buluşma oldukça faydalı olacak. Ağustos 2015 için Toronto, Kanada'da 'Toronto Crypto'__ ile birlikte olmamız önerildi. Tamamı halka açık olan sunumlar ve eğitimlerle birlikte geliştirici toplantıları yapılacak. İlgiyi ölçmeye ve olası yerleri araştırmaya çalışıyoruz. Katılmayı düşünüyorsanız, lütfen `@i2p etiketiyle tweet göndererek`__ veya `dev forum konusuna`__ yazarak bize iletin.

source: * We discussed Meeh's workload and the state of the various services he is running. We made some plans to reduce his load and have some other people help out.
pt_br: * Discutimos a carga de trabalho de Meeh e o estado dos vários serviços que ele está executando. Fizemos alguns planos para reduzir sua carga e ter outras pessoas ajudando.
tr: * Meeh üzerindeki iş yükünü ve yürüttüğü çeşitli hizmetlerin durumunu tartıştık. Yükünü azaltmak ve diğer insanların yardım etmesini sağlamak için bazı planlar yaptık.

source: * We reviewed our critieria for placing links to `i2pd`__ on our download page. We agreed that the only remaining item is to have a nice page on the `Privacy Solutions web site`__ or elsewhere with binary packages for Windows, Linux, and Mac, and source packages. It's not clear who is responsible for building the packages and where the "official" version is. Once there's an established process for building and signing packages and an official place to put them, we're ready to link to it. If it is not feasible to host it on the Privacy Solutions website, we will discuss alternatives with orignal, including possible migration to our download servers.
pt_br: * Revisamos nossos critérios para colocar links para `i2pd`__ em nossa página de download. Concordamos que o único item restante é ter uma página legal no `site da Privacy Solutions`__ ou em outro lugar com pacotes binários para Windows, Linux e Mac, e pacotes de origem. Não está claro quem é responsável por construir os pacotes e onde está a versão "oficial". Uma vez que haja um processo estabelecido para construir e assinar pacotes e um lugar oficial para colocá-los, estamos prontos para criar um link para ele. Se não for viável hospedá-lo no site da Privacy Solutions, discutiremos alternativas com a orignal, incluindo possível migração para nossos servidores de download.
tr: * İndirme sayfamıza `i2pd`__ bağlantılarını yerleştirmek için kriterlerimizi gözden geçirdik. Yapılabilecek tek şeyin `Privacy Solutions sitesinde`__ veya Windows, Linux ve Mac için binary paketler ve kaynak paketler içeren başka bir yerde güzel bir sayfaya sahip olmak olduğu konusunda anlaştık. Paketleri oluşturmaktan kimin sorumlu olduğu ve "resmi" sürümün nerede olduğu belli değil. Paketleri oluşturmak ve imzalamak için bir süreç belirlendiğinde ve bunları koymak için resmi bir yer sağladığımızda, bağlantılar vermeye hazır olacağız. Privacy Solutions sitesinde barındırmak mantıklı olmayacaksa, özgün durum ile indirme sunucularımıza geçme olasılığı gibi alternatifleri tartışacağız.

source: * Lots of people coming by the table asked if we had a non-Java version. It was great to finally answer "yes" and we're eager to get the word out and get more users, testers, and developers on it.
pt_br: * Muitas pessoas que passaram pela mesa perguntaram se tínhamos uma versão não Java. Foi ótimo finalmente responder "sim" e estamos ansiosos para divulgar e conseguir mais usuários, testadores e desenvolvedores.
tr: * Masaya gelen birçok kişi Java kullanmayan bir sürüm olup olmadığını sordu. Sonunda "evet" yanıtını vermek harikaydı. Daha fazla kullanıcıyı, denemeciyi ve geliştiriciyi bu konuda bilgilendirmek için sabırsızlanıyoruz.

source: * `Vuze`__ continues to make good progress on their I2P integration. We look forward to working with them in the new year on a managed rollout to more users.
pt_br: * `Vuze`__ continua a fazer um bom progresso em sua integração I2P. Estamos ansiosos para trabalhar com eles no ano novo em uma implementação gerenciada para mais usuários.
tr: * `Vuze`__ I2P bütünleştirmesinde iyi bir ilerleme kaydediyor. Yeni yılda daha fazla kullanıcıya dağıtılmasını sağlamak için birlikte çalışmayı dört gözle bekliyoruz.

source: * We discussed the state of Meeh's and Sindu's reseed servers. They made several improvements while at the congress and are investigating migration to `Matt Drollette's Go implementation`__. The security and reliability of our reseed servers is vital to new users and network operation. `User 'backup'`__ is doing a great job monitoring and managing the pool of reseed servers.
pt_br: * Discutimos o estado dos servidores de reseed de Meeh e Sindu. Eles fizeram várias melhorias enquanto estavam no congresso e estão investigando a migração para a `implementação Go de Matt Drollette`__. A segurança e a confiabilidade dos nossos servidores de reseed são vitais para novos usuários e operação de rede. ``Backup' do usuário`__ está fazendo um ótimo trabalho monitorando e gerenciando o pool de servidores de reseed.
tr: * Meeh ve Sindu tarafından işletilen yeniden tohumlama sunucularının durumunu tartıştık. Kongredeyken çeşitli iyileştirmeler yaptılar ve `Matt Drollette tarafından geliştirilmiş Go uygulamasına`__ geçişi araştırıyorlar. Yeniden tohumlama sunucularımızın güvenliği ve güvenilirliği, yeni kullanıcılar ve ağın çalışması için hayati önem taşır. `Kullanıcı 'yedekleme'`__, yeniden tohumlama sunucuları havuzunu izlemek ve yönetmek için harika bir iş çıkarıyor.

source: * We agreed to purchase a second root server for development, testing, and services. Echelon will be adminstering it. Contact him if you would like a VM.
pt_br: * Concordamos em comprar um segundo servidor raiz para desenvolvimento, testes e serviços. Echelon o administrará. Entre em contato com ele se quiser uma VM.
tr: * Geliştirme, deneme ve hizmetler için ikinci bir kök sunucu satın almayı kabul ettik. Sunucuyu Echelon yönetecek. Bir sanal makine istiyorsanız, onunla görüşün.

source: * We reiterated that we have funds available to purchase test hardware, especially for Windows and Mac. Talk to echelon for details.
pt_br: * Reiteramos que temos fundos disponíveis para comprar hardware de teste, especialmente para Windows e Mac. Fale com a echelon para obter detalhes.
tr: * Özellikle Windows ve Mac deneme donanımları satın almak için yeterli paramız olduğunu yineledik. Ayrıntılar için Echelon ile konuşun.

source: * We met with Welterde about the state of his services including his `open tracker`__. These services are not being adequately maintained and will soon become inaccessible due to crypto changes if they are not upgraded. He committed to upgrading them soon.
pt_br: * Nós nos encontramos com Welterde sobre o estado de seus serviços, incluindo seu `rastreador aberto`__. Esses serviços não estão sendo mantidos adequadamente e logo ficarão inacessíveis devido a mudanças de criptografia se não forem atualizados. Ele se comprometeu a atualizá-los em breve.
tr: * Welterde ile `açık izleyici`__ ve diğer hizmetlerinin durumu hakkında görüştük. Bu hizmetler yeterince korunmuyor ve yükseltilmezlerse şifreleme değişiklikleri nedeniyle yakında erişilemez olacaklar. Yakında onları yükselteceğine söz verdi.
