Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: It wasn’t apparent at the time, but the project was in trouble.
pt_br: Não ficou claro na época, mas o projeto estava com problemas.
tr: O zaman belli değildi, ama projenin başı dertteydi.

source: jrandom had almost stopped working on the core I2P router and applications. Even the new Syndie, which he had declared as far more important than I2P itself, languished. After regular releases through March 2007, his next Syndie release, 1.100a, was August 25, 2007. All I2P releases were required to be signed by jrandom’s key, and he built and signed his last release, 0.6.1.30, on October 7, 2007.
pt_br: jrandom quase parou de trabalhar no roteador I2P principal e nos aplicativos . Até mesmo o novo Syndie, que ele havia declarado muito mais importante do que o próprio I2P, definhou. Após lançamentos regulares até março de 2007, seu próximo lançamento Syndie, 1.100a, foi em 25 de agosto de 2007. Todos os lançamentos I2P eram obrigados a ser assinados pela chave de jrandom, e ele construiu e assinou seu último lançamento, 0.6.1.30, em 7 de outubro de 2007.
tr: jrandom, çekirdek I2P yönelticisi ve uygulamaları üzerinde çalışmayı neredeyse bırakmıştı. I2P uygulamasından çok daha önemli olduğunu söylediği yeni Syndie bile zayıfladı. 2007 Mart ayına kadar yayınladığı düzenli sürümlerden sonra, bir sonraki Syndie sürümü olan 1.100a, 25 Ağustos 2007 tarihinde yayınlandı. Tüm I2P sürümlerinin jrandom anahtarı ile imzalanması gerekiyordu. Yayınladığı son 0.6.1.30 sürümünü 7 Ekim 2007 tarihinde oluşturdu ve imzaladı.

source: In November 2007, disaster struck. Complication and zzz received a cryptic message from jrandom, that he would have to take time off from both Syndie and I2P development for a year or more. He expected that he would still be available to sign releases, but was willing to pass the release signing key to somebody else. Complication and zzz immediately replied with a request for the release key and other credentials, such as access to the website, mailing list, CVS administration, and others. Unfortunately, they never heard from jrandom again.
pt_br: Em novembro de 2007, o desastre aconteceu. Complication e zzz receberam uma mensagem enigmática de jrandom, dizendo que ele teria que tirar uma folga do desenvolvimento do Syndie e do I2P por um ano ou mais. Ele esperava que ainda estivesse disponível para assinar releases, mas estava disposto a passar a chave de assinatura de release para outra pessoa. Complication e zzz imediatamente responderam com uma solicitação da chave de release e outras credenciais, como acesso ao site, lista de discussão, administração do CVS e outros. Infelizmente, eles nunca mais ouviram falar de jrandom.
tr: 2007 Kasım ayında bir felaket oldu. Complication ve zzz, jrandom tarafından gönderilmiş şifreli bir ileti aldı. jrandom hem Syndie hem de I2P geliştirmesinden bir yıl veya daha uzun süre ayrılması gerektiğini yazıyordu. Hala yayınları imzalamak için uygun olacağını umuyordu. Ancak yayın imzalama anahtarını başka birine vermeye istekliydi. Complication ve zzz, hemen yayın anahtarı ve siteye erişim, e-posta listesi, CVS yönetimi ve diğer konular için kimlik bilgilerini istediler. Ancak ne yazık ki, jrandom bir daha yanıt vermedi.

source: Late 2007 and early 2008, they awaited jrandom’s response, and wondered what to do next. However, all of the project infrastructure remained active, so it didn’t seem to be an immediate crisis. They knew, however, that without the release key or website access, they would have to sign with new keys, host the files on a new website, and require everybody to manually update since their keys wouldn’t be recognized.
pt_br: No final de 2007 e início de 2008, eles aguardaram a resposta do jrandom e se perguntaram o que fazer em seguida. No entanto, toda a infraestrutura do projeto permaneceu ativa, então não pareceu ser uma crise imediata. Eles sabiam, no entanto, que sem a chave de lançamento ou acesso ao site, eles teriam que assinar com novas chaves, hospedar os arquivos em um novo site e exigir que todos atualizassem manualmente, já que suas chaves não seriam reconhecidas.
tr: 2007 yılının sonlarıyla 2008 yılının başlarında jrandom tarafından gelecek yanıtı beklediler ve bundan sonra ne yapacaklarını merak ettiler. Ancak, tüm proje altyapısı etkin olduğundan durum acil bir kriz gibi görünmüyordu. Bununla birlikte, yayın anahtarı veya siteye erişim olmadan yayınları yeni anahtarlarla imzalamaları, dosyaları yeni bir sitede barındırmaları ve kendi anahtarları tanınmayacağı için herkesin el ile güncelleme yapması gerekeceğini biliyorlardı.

source: The second stage of the disaster happened on January 13, 2008. The hosting company for almost all `i2p.net <http://i2p.net>`__ servers suffered a power outage, and they did not fully return to service. Only jrandom had the credentials required to restore service. In addition, the centralized CVS source control appeared to be down, so five years of source control history appeared to be lost. Luckily, the CVS server was up, only the name server for it was down. The full contents of the CVS archive was quickly downloaded.
pt_br: O segundo estágio do desastre aconteceu em 13 de janeiro de 2008. A empresa de hospedagem para quase todos os servidores `i2p.net <http://i2p.net>`__ sofreu uma queda de energia e não retornou totalmente ao serviço. Apenas jrandom tinha as credenciais necessárias para restaurar o serviço. Além disso, o controle de origem centralizado do CVS parecia estar inativo, então cinco anos de histórico de controle de origem pareciam perdidos. Felizmente, o servidor CVS estava ativo, apenas o servidor de nomes para ele estava inativo. O conteúdo completo do arquivo CVS foi baixado rapidamente.
tr: Felaketin ikinci aşaması 13 Ocak 2008 tarihinde gerçekleşti. Hemen hemen tüm `i2p.net <http://i2p.net>`__ sunucularının bulunduğu barındırma hizmeti sağlayıcı elektrik kesintisi yaşadı ve hizmet vermeye tam olarak dönemediler. Hizmeti geri yüklemek için gereken kimlik bilgilerine yalnızca jrandom sahipti. Ek olarak, merkezi CVS kaynak denetimi çalışmıyor gibi görünüyordu, bu nedenle beş yıllık kaynak denetimi geçmişi kaybolmuş gibi görünüyordu. Neyse ki, CVS sunucusu açıktı, yalnızca ilgili ad sunucusu kapalıydı. CVS arşivinin tüm içeriği hızlı bir şekilde indirildi.

source: Complication, welterde, and zzz quickly made a number of decisions to get the project back up and running. Welterde started a new website at `i2p2.de <http://i2p2.de>`__. I2P needed to move to a decentralized source code control system. They tested bazaar and that did not work well over I2P. Git was just getting started. jrandom had used monotone for Syndie and liked its security properties, and it worked well over I2P, so it was selected.
pt_br: Complication, welterde e zzz rapidamente tomaram uma série de decisões para colocar o projeto de volta em funcionamento. Welterde iniciou um novo site em `i2p2.de <http://i2p2.de>`__. O I2P precisava migrar para um sistema de controle de código-fonte descentralizado . Eles testaram o bazaar e isso não funcionou bem no I2P. O Git estava apenas começando. jrandom tinha usado o monotone para o Syndie e gostou de suas propriedades de segurança, e funcionou bem no I2P, então foi selecionado.
tr: Complication, welterde ve zzz, projeyi yeniden çalışır duruma getirmek için hızla bir dizi karar aldı. Welterde, `i2p2.de <http://i2p2.de>`__ adresinde yeni bir site açtı. I2P kodlarının merkezi olmayan bir kaynak kodu denetimi sistemine geçmesi gerekiyordu. Bazaar uygulamasına baktılar ancak bu I2P üzerinde pek işe yaramadı. Git daha yeni başlıyordu. jrandom, Syndie için monotone kullanmıştı ve güvenlik özelliklerini beğenmişti. I2P için iyi görünüyordu ve ona karar verildi.

source: Several people set up new services. The next release, 0.6.1.31, was signed by Complication and required a manual upgrade. It was released on February 10, 2008.
pt_br: Várias pessoas configuraram novos serviços. O próximo lançamento, 0.6.1.31, foi assinado pela Complication e exigiu uma atualização manual. Foi lançado em 10 de fevereiro de 2008.
tr: Birkaç kişi yeni hizmetler kurdu. Bir sonraki 0.6.1.31.sürümü, Complication tarafından imzalandı ve el ile yükseltilmesi gerekti. 10 Şubat 2008 tarihinde yayınlandı.

source: The project realized that even though it claimed to be totally decentralized, it actually depended on a number of centralized resources, above all, on jrandom. Work was done throughout 2008 to decentralize the project, and distribute roles to a number of people. Additionally, it was realized that development had essentially stalled in 2007, because jrandom had stopped working on it, but had not delegated to other developers. Nobody had an overall understanding of the code base.
pt_br: O projeto percebeu que, embora alegasse ser totalmente descentralizado, na verdade dependia de uma série de recursos centralizados, acima de tudo, no jrandom. O trabalho foi feito ao longo de 2008 para descentralizar o projeto e distribuir funções para várias pessoas. Além disso, percebeu-se que o desenvolvimento havia essencialmente parado em 2007, porque o jrandom havia parado de trabalhar nele, mas não havia delegado a outros desenvolvedores. Ninguém tinha uma compreensão geral da base de código.
tr: Proje, tümüyle merkezi olmadığını iddia etse de, aslında bir dizi merkezi kaynak, özellikle de jrandom ile bağımlılığını fark etti. 2008 yılı boyunca, projeyi merkezden uzaklaştırmak ve rolleri birkaç kişiye dağıtmak için çalışmalar yapıldı. Ek olarak, jrandom tarafından geliştirmenin 2007 yılında bırakıldığı, ancak diğer geliştiricilere yetki vermediği anlaşıldı. Hiç kimsenin kod tabanı hakkında genel bir kavrayışı yıoktu.

source: Complication continued to sign the releases through mid-2009, but his contributions declined as he focused on activism and other projects. Starting with release 0.7.6 on July 31, 2009, zzz would sign the next 49 releases.
pt_br: Complication continuou assinando os lançamentos até meados de 2009, mas suas contribuições de diminuíram à medida que ele se concentrava no ativismo e outros projetos. Começando com o lançamento 0.7.6 em 31 de julho de 2009, zzz assinaria os próximos 49 lançamentos.
tr: Complication, 2009 ylı ortasına kadar yayınları imzalamayı sürdürdü. Ancak aktivizm ve diğer projelere odaklandığı için katkıları azaldı. 31 Temmuz 2009 tarihinde yayınlanan 0.7.6 sürümünden başlayarak, sonraki 49 sürümü zzz imzalayacaktı.

source: In December 2008, zzz attended his first CCC, 25C3 in Berlin, and met other I2P project team members for the first time, including hottuna and welterde. The experience was overwhelming, and also humbling, as he struggled to explain I2P to others or answer even basic questions about its design and use of cryptography.
pt_br: Em dezembro de 2008, zzz participou de seu primeiro CCC, 25C3 em Berlim, e conheceu outros membros da equipe do projeto I2P pela primeira vez, incluindo hottuna e welterde. A experiência foi avassaladora e também humilhante, pois ele se esforçou para explicar o I2P para outros ou responder até mesmo perguntas básicas sobre seu design e uso de criptografia.
tr: 2008 Aralık ayında zzz, Berlin'de kendisinin ilk CCC olan 25C3 etkinliğine katıldı ve hottuna ve welterde gibi I2P proje ekibinin diğer üyeleriyle ilk kez bir araya geldi. I2P ağını başkalarına açıklamakta veya tasarım ve şifreleme kullanımıyla ilgili temel soruları bile yanıtlamakta zorlanırken, yaşadığı deneyim ezici ancak aynı zamanda alçakgönüllüydü.

source: By mid-2009, zzz had come to understand the code base much better. Far from being complete or perfect, it was filled with problems and scalability issues. In 2009 the project experienced more network growth due to its anonymizing properties as well as its circumvention abilities. Participants appeared who were beginning to adopt the network for reasons like censorship and clearnet issues like blocking of popular services. For development gains, in-net auto updates became available for the software.
pt_br: Até meados de 2009, zzz havia compreendido muito melhor a base de código. Longe de ser completa ou perfeita, estava cheia de problemas e questões de escalabilidade. Em 2009, o projeto experimentou um maior crescimento de rede devido às suas propriedades de anonimização, assim como suas habilidades de circunvenção. Participantes começaram a aparecer que adotavam a rede por razões como censura e problemas da clearnet como bloqueio de serviços populares. Para ganhos de desenvolvimento, atualizações automáticas em rede se tornaram disponíveis para o software.
tr: 2009 yılının ortalarında, zzz kod tabanını çok daha iyi anlamaya başlamıştı. Eksiksiz veya mükemmel olmaktan uzaktı ve sorunlar ve ölçeklenebilirlik konularıyla doluydu. 2009 yılında anonimleştirme özellikleri ve atlatma yetenekleri nedeniyle proje daha büyük bir ağ genişlemesi yaşadı. Sansür ve beğenilen hizmetlerin engellenmesi gibi herkese açık İnternet sorunları daha çok katılımcının ağı benimsemeye başlamasına neden oldu. Geliştirme kazanımları olarak, yazılımın ağ içinden otomatik olarak güncellenebilmesi sağlandı.

source: July 2010 zzz briefly presented I2P at the end of Adrian Hong’s presentation at HOPE XXXX. Adrian talked about how tech has helped expose human rights violations, and the need for defensive tools for activists. He urged that we all be ambassadors for all tech, stay on top of new tech, and keep the barrier low and educate people about how to use the tool we create.
pt_br: Julho de 2010 zzz apresentou brevemente o I2P no final da apresentação de Adrian Hong na HOPE XXXX. Adrian falou sobre como a tecnologia ajudou a expor violações de direitos humanos e a necessidade de ferramentas defensivas para ativistas. Ele pediu que todos nós sejamos embaixadores de toda a tecnologia, fiquemos por dentro das novas tecnologias, mantenhamos a barreira baixa e eduquemos as pessoas sobre como usar a ferramenta que criamos.
tr: 2010 Temmuz ayında zzz, HOPE XXXX etkinliğindeki Adrian Hong sunumunun sonunda kısa bir I2P sunumu yaptı. Adrian, teknolojinin insan hakları ihlallerini ortaya çıkarmaya nasıl yardımcı olduğundan ve aktivistler için savunma araçlarına duyulan gereksinimden bahsetti. Hepimizi tüm teknolojinin elçileri olmaya, yeni teknolojinin zirvesinde kalmaya, engelleri düşük tutmaya ve yarattığımız aracın nasıl kullanılacağı konusunda insanları eğitmeye çağırdı.

source: He also talked about how we need many options for people to use, and asked how do we make it easier to support human rights, freedom of expression?
pt_br: Ele também falou sobre como precisamos de muitas opções para as pessoas usarem e perguntou como podemos facilitar o apoio aos direitos humanos e à liberdade de expressão?
tr: İnsanların kullanması için olabildiğince çok seçeneğe duyduğumuz gereksinimden de bahsetti ve insan haklarını, ifade özgürlüğünü desteklemeyi nasıl kolaylaştırabileceğimizi sordu.

source: At the end of the talk, zzz was invited on stage to introduce I2P and give an overview of what the project was about. The same weekend, it was pointed out that the I2P documentation was not in great shape.
pt_br: No final da palestra, zzz foi convidado a subir no palco para apresentar o I2P e dar uma visão geral do que era o projeto. No mesmo fim de semana, foi apontado que a documentação do I2P não estava em ótima forma.
tr: Konuşmanın sonunda zzz, I2P projesini tanıtmak ve projenin ne hakkında olduğu hakkında genel bir bakış sunmak üzere sahneye çağrıldı. Aynı hafta sonu, I2P belgelerinin çok iyi durumda olmadığına dikkat çekildi.

source: In Fall 2010, zzz declared a moratorium on I2P development until the website documentation was complete and accurate. It took 3 months to get it done.
pt_br: No outono de 2010, a zzz declarou uma moratória no desenvolvimento do I2P até que a documentação do site estivesse completa e precisa. Levou 3 meses para terminar.
tr: 2010 sonbaharında, zzz, site belgeleri tam ve doğru olana kadar I2P geliştirme çalışmaları için moratoryum ilan etti. Bunları tamamlamak 3 ay sürdü.

source: Beginning in 2010, until COVID restrictions were put in place, zzz, ech, hottuna, and other I2P contributors have attended CCC ( Chaos Communications Congress) every year. Over the years, meeh, Zab, Sadie, LazyGravy, KYTV, IDK and others have made the trip to Germany to share tables with other projects and celebrate the end of a year of releases. The project looks forward to one day being able to meet up again and have an in-person yearly roadmap meeting.
pt_br: Começando em 2010, até que as restrições da COVID fossem colocadas em prática, zzz, ech, hottuna e outros colaboradores do I2P participaram do CCC (Chaos Communications Congress) todos os anos. Ao longo dos anos, meeh, Zab, Sadie, LazyGravy, KYTV, IDK e outros fizeram a viagem para a Alemanha para compartilhar mesas com outros projetos e celebrar o fim de um ano de lançamentos. O projeto espera um dia poder se reunir novamente e ter uma reunião anual presencial do roteiro.
tr: 2010 yılından başlayarak, COVID kısıtlamaları getirilene kadar, zzz, ech, hottuna ve diğer I2P katılımcıları her yıl CCC (Kaos İletişim Kongresi) etkinliğine katıldı. Yıllar içinde meeh, Zab, Sadie, LazyGravy, KYTV, IDK ve diğerleri, diğer projelerle tabloları paylaşmak ve bir yayın yılının sonunu kutlamak için Almanya'ya yolculuk yaptı. Proje ekibi, bir gün yeniden bir araya gelmeyi ve yüz yüze yıllık yol haritası toplantısı yapmayı dört gözle bekliyor.

source: Anoncoin, a digital cryptocurrency that focuses on privacy and anonymity for its users was created in 2013. It was the first coin that provided built-in support for I2P, as well as Tor that makes it impossible to determine the IP address of the user. The developers, including meeh, also ran organizations like Privacy Solutions, and provided infrastructure support to the I2P network by running services like outproxies and reseed servers.
pt_br: Anoncoin, uma criptomoeda digital que foca em privacidade e anonimato para seus usuários foi criada em 2013. Foi a primeira moeda que forneceu suporte integrado para I2P, assim como Tor que torna impossível determinar o endereço IP do usuário. Os desenvolvedores, incluindo meeh, também administraram organizações como Privacy Solutions, e forneceram infraestrutura suporte para a rede I2P executando serviços como outproxies e servidores de reseed.
tr: Kullanıcıları için kişisel gizliliğe ve anonimliğe odaklanan sayısal bir kripto para birimi olan Anoncoin, 2013 yılında oluşturuldu. Kullanıcının IP adresinin belirlenmesini olanaksız kılan Tor ağının yanında I2P için yerleşik destek sağlayan ilk para birimiydi. Meeh ile birlikte geliştiriciler, Privacy Solutions gibi organizasyonları da yönetti ve çıkış vekil sunucuları ile yeniden tohumlama sunucuları gibi hizmetleri çalıştırarak I2P ağına altyapı desteği sağladı.

source: I2PBote development started to take off again in 2014 when str4d began contributing to the project. Bote is a server-less email client — it stores email in a `distributed hash table <http://en.wikipedia.org/wiki/Distributed_hash_table>`__. Email is “automatically encrypted and digitally signed, which ensures no one but the intended recipient can read the email, and third parties cannot forge them.” ( https://i2pbote.xyz/). The project has existed since 2009.
pt_br: O desenvolvimento do I2PBote começou a decolar novamente em 2014, quando str4d começou a contribuir para o projeto. Bote é um cliente de e-mail sem servidor — ele armazena e-mails em uma tabela `hash distribuída <http://en.wikipedia.org/wiki/Distributed_hash_table>`__. O e-mail é “automaticamente criptografado e assinado digitalmente, o que garante que ninguém além do destinatário pretendido possa ler o e-mail, e terceiros não podem falsificá-lo.” ( https://i2pbote.xyz/). O projeto existe desde 2009.
tr: I2PBote geliştirmesi, 2014 yılında str4d projeye katkıda bulunmaya başladıktan sonra yeniden hızlanmaya başladı. Bote, sunucusuz bir e-posta istemcisidir — e-postayı bir `Dağıtılmış karma tablosunda (DHT) <http://en.wikipedia.org/wiki/Distributed_hash_table>`__ tutar. E-posta "otomatik olarak şifrelenir ve sayısal olarak imzalanır, bu da hedeflenen alıcı dışında hiç kimsenin e-postayı okuyamasını ve üçüncü tarafların taklit edememesini sağlar." (https://i2pbote.xyz/). Proje 2009 yılından beri vardı.

source: At Real World Crypto that year, zzz, psi and str4d began to talk about and review the plan to update I2P’s cryptography. The same year, the project was awarded a $5k donation from Duck Duck Go. Lavabit, SecureDrop, RiseUp and Mailpile also received donations for supporting better trust and privacy online.
pt_br: Na Real World Crypto daquele ano, zzz, psi e str4d começaram a falar sobre e revisar o plano para atualizar a criptografia do I2P. No mesmo ano, o projeto recebeu uma doação de US$ 5 mil da Duck Duck Go. Lavabit, SecureDrop, RiseUp e Mailpile também receberam doações para apoiar melhor confiança e privacidade online.
tr: O yıl Real World Crypto etkinliğinde zzz, psi ve str4d, I2P şifrelemesini güncelleme hakkında plan yapmaya ve çalışmaya başladı. Aynı yıl, projeye Duck Duck Go tarafından 5 bin dolarlık bağış yapıldı. Ayrıca çevrimiçi güvenlik ve kişisel gizliliği desteklemek için Lavabit, SecureDrop, RiseUp ve Mailpile gibi kuruluşlardan da bağış aldı.

source: By late 2014 most new signing crypto was complete, including ECDSA and EdDSA. New destination crypto was available; but new router info crypto needed to wait a year for the network to upgrade sufficiently.
pt_br: No final de 2014, a maioria das novas assinaturas de criptografia estavam completas, incluindo ECDSA e EdDSA. Nova criptografia de destino estava disponível; mas a nova criptografia de informações do roteador precisou esperar um ano para que a rede fosse atualizada o suficiente.
tr: 2014 yılının sonlarında, ECDSA ve EdDSA ile birlikte çoğu yeni olan imza şifrelemesi tamamlandı. Yeni hedef şifrelemesi vardı. Ancak yeni yöneltici bilgi şifrelemesinin, ağın yeterince yükseltilmesi için bir yıl beklemesi gerekiyordu.

source: During the early part of 2015, zzz posted to Twitter that it would be great to have a mini conference for I2P. In Spring, it was decided that I2PCon would take place that August over the course of a weekend.
pt_br: No início de 2015, zzz postou no Twitter que seria ótimo ter uma mini conferência para o I2P. Na primavera, foi decidido que o I2PCon aconteceria em agosto, ao longo de um fim de semana.
tr: 2015 yılının başlarında, zzz Twitter üzerinden I2P için bir mini konferans düzenlemenin harika olacağını duyurdu. İlkbaharda, I2PCon etkinliğinin o yıl Ağustos ayında bir hafta sonu boyunca yapılmasına karar verildi.
