Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: **SessionRequest** message is made of a public x25519 Alice key (32 bytes), a block of data encrypted with AEAD/Chacha20/Poly1305 (16 bytes), a hash (16 bytes) and some random data in the end (padding). Padding length is defined in the encrypted block of data. Encrypted block also contains length of the second part of the **SessionConfirmed** message. A block of data is encrypted and signed with a key derived from Alice's ephemeral key and Bob's static key. Initial ck value for MixKey function is set to SHA256 (Noise_XKaesobfse+hs2+hs3_25519_ChaChaPoly_SHA256).
pt_br: A mensagem **SessionRequest** é feita de uma chave pública x25519 Alice (32 bytes), um bloco de dados criptografado com AEAD/Chacha20/Poly1305 (16 bytes), um hash (16 bytes) e alguns dados aleatórios no final (preenchimento). O comprimento do preenchimento é definido no bloco de dados criptografado. O bloco criptografado também contém o comprimento de a segunda parte da mensagem **SessionConfirmed**. Um bloco de dados é criptografado e assinado com uma chave derivada da chave efêmera de Alice e da chave estática de Bob. O valor ck inicial para a função MixKey é definido como SHA256 (Noise_XKaesobfse+hs2+hs3_25519_ChaChaPoly_SHA256).
tr: **SessionRequest** iletisi, genel bir x25519 Alice anahtarından (32 bayt), AEAD/Chacha20/Poly1305 (16 bayt) ile şifrelenmiş bir veri bloğundan, bir karma (16 bayt) ve sonunda bazı rastgele verilerden (dolgu) oluşur ). Doldurma uzunluğu, şifrelenmiş veri bloğunda tanımlanır. Şifrelemiş blok ayrıca **SessionConfirmed** iletisinin ikinci bölümünün uzunluğunu da içerir. Bir veri bloğu, Alice`in geçici anahtarından ve Bob`un durağan anahtarından türetilen bir anahtarla şifrelenir ve imzalanır. MixKey işlevi için başlangıç ck değeri SHA256 olarak ayarlanır (Noise_XKaesobfse+hs2+hs3_25519_ChaChaPoly_SHA256).

source: Since 32 bytes of public x25519 key can be detected by DPI, it is encrypted with AES-256-CBC algorithm using hash of Bob's address as a key and "i" parameter from RouterInfo as an initialization vector (IV).
pt_br: Como 32 bytes da chave pública x25519 podem ser detectados pelo DPI, eles são criptografados com o algoritmo AES-256-CBC usando o hash do endereço de Bob como chave e o parâmetro "i" do RouterInfo como um vetor de inicialização (IV).
tr: Herkese açık 32 bayt x25519 anahtarı "Derin paket denetimi" (DPI) tarafından algılanabildiğinden, bunu engellemek için anahtar olarak Bob`un adresinin karması ve "Başlatma vektörü" (IV) olarak "Yöneltici bilgileri" (RouterInfo) "i" parametresi kullanılarak AES-256 CBC algoritması ile şifrelenir.

source: **SessionCreated** message has the same structure as **SessionRequest**, except the key is computed based on ephemeral keys of both sides. IV generated after encrypting/decrypting public key from **SessionRequest** message is used as IV for encrypting/decrypting ephemeral public key.
pt_br: A mensagem **SessionCreated** tem a mesma estrutura que **SessionRequest**, exceto que a chave é computada com base em chaves efêmeras de ambos os lados. O IV gerado após criptografar/descriptografar a chave pública da mensagem **SessionRequest** é usado como IV para criptografar/descriptografar a chave pública efêmera.
tr: **SessionCreated** iletisi, anahtarın her iki tarafın geçici anahtarlarına göre hesaplanması dışında **SessionRequest** ile aynı yapıya sahiptir. **SessionRequest** iletisinden herkese açık anahtarın şifrelenmesi/şifresinin çözülmesinden sonra oluşturulan başlatma vektörü, geçici herkese açık anahtarı şifrelemek/şifresini çözmek için başlatma vektörü olarak kullanılır.

source: **SessionConfirmed** message has 2 parts: public static key and Alice's RouterInfo. The difference from previous messages is that ephemeral public key is encrypted with AEAD/Chaha20/Poly1305 using the same key as **SessionCreated**. It leads to increasing first part of the message from 32 to 48 bytes. The second part is also encrypted with AEAD/Chaha20/Poly1305, but using a new key, computed from Bob's ephemeral key and Alice's static key. RouterInfo part can also be appended with random data padding, but it is not required, since RouterInfo usually has various length.
pt_br: A mensagem **SessionConfirmed** tem 2 partes: chave estática pública e RouterInfo de Alice. A diferença das mensagens anteriores é que a chave pública efêmera é criptografada com AEAD/Chaha20/Poly1305 usando a mesma chave que **SessionCreated**. Isso leva ao aumento da primeira parte da mensagem de 32 para 48 bytes. A segunda parte também é criptografada com AEAD/Chaha20/Poly1305, mas usando uma nova chave , computada a partir da chave efêmera de Bob e da chave estática de Alice. A parte do RouterInfo também pode ser anexada com preenchimento de dados aleatórios, mas não é necessário, pois RouterInfo geralmente tem vários comprimentos.
tr: **SessionConfirmed** iletisi 2 parçadan oluşur: Herkese açık durağan anahtar ve Alice`in "Yöneltici bilgileri" (RouterInfo). Önceki iletilerden farkı, kısa ömürlü herkese açık anahtarın **SessionCreated** ile aynı anahtar kullanılarak AEAD/Chaha20/Poly1305 ile şifrelenmesidir. İletinin ilk parçasının 32 yerine 48 bayt olmasına yol açar. İkinci parça da AEAD/Chaha20/Poly1305 ile şifrelenir. Ancak Bob'un geçici anahtarından ve Alice`in durağan anahtarından hesaplanan yeni bir anahtar kullanılır. "Yöneltici bilgileri" (RouterInfo) bölümü rastgele veri doldurma ile de eklenebilir. Ancak "Yöneltici bilgileri" (RouterInfo) genellikle farklı uzunluklarda olduğundan gerekli değildir.

source: Generation of data transfer keys --------------------------------
pt_br: Geração de chaves de transferência de dados --------------------------------
tr: Veri aktarımı anahtarlarının oluşturulması --------------------------------

source: If every hash and key verification has succeeded, a common ck value must be present after the last MixKey operation on both sides. This value is used to generate two sets of keys <k, sipk, sipiv> for each side of a connection. "k" is a AEAD/Chaha20/Poly1305 key, "sipk" is a SipHash key, "sipiv" is an initial value for SipHash IV, that is changed after each use.
pt_br: Se cada verificação de hash e chave tiver sido bem-sucedida, um valor ck comum deve estar presente após a última operação MixKey em ambos os lados. Este valor é usado para gerar dois conjuntos de chaves <k, sipk, sipiv> para cada lado de uma conexão. "k" é uma chave AEAD/Chaha20/Poly1305, "sipk" é uma chave SipHash, "sipiv" é um valor inicial para SipHash IV, que é alterado após cada uso.
tr: Tüm karma ve anahtar doğrulamaları başarılı olduysa, her iki tarafta da son MixKey işleminden sonra ortak bir ck değeri bulunmalıdır. Bu değer, bir bağlantının her iki tarafı için iki anahtar kümesi <k, sipk, sipiv> oluşturmak için kullanılır. "k" bir AEAD/Chaha20/Poly1305 anahtarıdır, "sipk" bir SipHash anahtarıdır, "sipiv" her kullanımdan sonra değişen SipHash IV için bir başlangıç değeridir.

source: Code used to generate keys looks like this in the C++ implementation of I2P:
pt_br: O código usado para gerar chaves se parece com isto na implementação C++ do I2P:
tr: I2P C++ uygulamasındaki anahtar üretmek için kullanılan kod şuna benzer:

source: i2pd (C++) implementation note: First 16 bytes of the "sipkeys" array are a SipHash key, the last 8 bytes are IV. SipHash requires two 8 byte keys, but i2pd handles them as a single 16 bytes key.
pt_br: Nota de implementação do i2pd (C++): Os primeiros 16 bytes do array "sipkeys" são uma chave SipHash , os últimos 8 bytes são IV. O SipHash requer duas chaves de 8 bytes, mas o i2pd as manipula como uma única chave de 16 bytes.
tr: i2pd (C++) uygulama notu: "sipkeys" dizisinin ilk 16 baytı bir SipHash anahtarıdır, son 8 bayt başlatma vektörüdür. SipHash iki adet 8 baytlık anahtar gerektirir, ancak i2pd bunları tek bir 16 baytlık anahtar olarak işler.

source: Data transferring -----------------
pt_br: Transferência de dados -----------------
tr: Veri aktarımı -----------------

source: Data is transferred in frames, each frame has 3 parts:
pt_br: Os dados são transferidos em quadros, cada quadro tem 3 partes:
tr: Veri çerçeveler halinde aktarılır. Her çerçevede 3 parça bulunur:

source: - 2 bytes of frame length obfuscated with SipHash - data encrypted with Chacha20 - 16 bytes of Poly1305 hash value
pt_br: - 2 bytes de comprimento de quadro ofuscados com SipHash - dados criptografados com Chacha20 - 16 bytes de valor de hash Poly1305
tr: - SipHash ile karıştırılmış 2 bayt çerçeve uzunluğu - Chacha20 ile şifrelenmiş veriler - 16 bayt Poly1305 karma değeri

source: Maximum length of data transferred in one frame is 65519 bytes.
pt_br: O comprimento máximo de dados transferidos em um quadro é de 65519 bytes.
tr: Bir çerçevede aktarılan en fazla veri 65519 bayttır.

source: Message length is obfuscated by applying the XOR function with two first bytes of the current SipHash IV.
pt_br: O comprimento da mensagem é ofuscado pela aplicação da função XOR com os dois primeiros bytes do SipHash IV atual.
tr: İleti uzunluğu, var olan SipHash başlatma vektörünün iki ilk baytı ile XOR işlevi uygulanarak gizlenir.

source: Encrypted data part contains blocks of data. Each block is prepended with 3 bytes header, that defines block type and block length. Generally, I2NP type blocks are transferred, that are I2NP messages with an altered header. One NTCP2 frame can transfer multiple I2NP blocks.
pt_br: A parte de dados criptografados contém blocos de dados. Cada bloco é prefixado com um cabeçalho de 3 bytes, que define o tipo e o comprimento do bloco. Geralmente, blocos do tipo I2NP são transferidos, que são mensagens I2NP com um cabeçalho alterado. Um quadro NTCP2 pode transferir vários blocos I2NP.
tr: Şifrelenmiş veri parçasında, veri blokları bulunur. Her bloğun başına, blok türünü ve blok uzunluğunu tanımlayan 3 baytlık üst bilgi eklenir. Genel olarak, I2NP türü bloklar aktarılır, bunlar değiştirilmiş bir üst bilgiye sahip I2NP iletileridir. Bir NTCP2 çerçevesi, birden fazla I2NP bloğunu aktarabilir.

source: The other important data block type is a random data block. It is recommended to add a random data block to every NTCP2 frame. Only one random data block can be added and it must be the last block.
pt_br: O outro tipo importante de bloco de dados é um bloco de dados aleatório. É recomendado adicionar um bloco de dados aleatório a cada quadro NTCP2. Apenas um bloco de dados aleatório pode ser adicionado e deve ser o último bloco.
tr: Diğer önemli veri bloğu türü ise rastgele bir veri bloğudur. Her NTCP2 çerçevesine rastgele bir veri bloğu eklenmesi önerilir. Yalnızca bir rastgele veri bloğu eklenebilir ve bu son blok olmalıdır.

source: Those are other data blocks used in the current NTCP2 implementation:
pt_br: Esses são outros blocos de dados usados na implementação atual do NTCP2:
tr: Bunlar, var olan NTCP2 uygulamasında kullanılan diğer veri bloklarıdır:

source: - RouterInfo — usually contains Bob's RouterInfo after the connection has been established, but it can also contain RouterInfo of a random node for the purpose of speeding up floodfills (there is a flags field for that case). - Termination — is used when a host explicitly terminates a connection and specifies a reason for that. - DateTime — a current time in seconds.
pt_br: - RouterInfo — geralmente contém o RouterInfo de Bob depois que a conexão é estabelecida, mas também pode conter o RouterInfo de um nó aleatório com o propósito de acelerar os floodfills (há um campo de sinalizadores para esse caso). - Termination — é usado quando um host encerra explicitamente uma conexão e especifica um motivo para isso. - DateTime — uma hora atual em segundos.
tr: - "Yöneltici bilgileri" (RouterInfo) — Genellikle bağlantı kurulduktan sonra Bob`un "Yöneltici bilgileri" olur. Ancak otomatik doldurmaları hızlandırmak amacıyla rastgele bir düğümün "Yöneltici bilgileri" olabilir (bu durumu belirten bir işaret alanı vardır). - Sonlandırma — Bir bilgisayar bir bağlantıyı açıkça sonlandırdığında ve bunun için bir neden belirttiğinde kullanılır. - DateTime — Saniye cinsinden geçerli saat.

source: Summary -------
pt_br: Resumo -------
tr: Özet -------

source: The new I2P transport protocol NTCP2 provides effective resistance against DPI censorship. It also results in reduced CPU load because of the faster, modern cryptography used. It makes I2P more likely to run on low-end devices, such as smartphones and home routers. Both major I2P implementations have full support for NTCP2 and it make NTCP2 available for use starting with version 0.9.36 (Java) and 2.20 (i2pd, C++).
pt_br: O novo protocolo de transporte I2P NTCP2 fornece resistência efetiva contra censura DPI . Ele também resulta em carga de CPU reduzida devido à criptografia mais rápida e moderna usada. Ele torna o I2P mais provável de rodar em dispositivos de baixo custo, como smartphones e roteadores domésticos. Ambas as principais implementações I2P têm suporte total para NTCP2 e tornam o NTCP2 disponível para uso a partir da versão 0.9.36 (Java) e 2.20 (i2pd, C++).
tr: Yeni I2P taşıyıcı iletişim kuralı NTCP2, "Derin paket denetimi" (DPI) engellemesine karşı etkili direnç sağlar. Ayrıca kullanılan daha hızlı, modern şlifreleme nedeniyle işlemci yükünün azalmasına neden olur. I2P uygulamasını akıllı telefonlar ve ev yönelticileri gibi düşük kaynaklara sahip aygıtlar üzerinde çalıştırma olasılığını artırır. Her iki büyük I2P uygulaması da NTCP2 için tam desteğe sahiptir ve NTCP2 iletişim kuralını 0.9.36 (Java) ve 2.20 (i2pd, C++) sürümlerinden başlayarak kullanıma hazır hale getirir.

source: 0.9.36 Release
pt_br: Lançamento 0.9.36
tr: 0.9.36 sürümü yayınlandı

source: 0.9.36 implements a new, more secure transport protocol called NTCP2. It is disabled by default, but you may enable it for testing. NTCP2 will be enabled in the next release.
pt_br: 0.9.36 implementa um novo protocolo de transporte mais seguro chamado NTCP2. Ele é desabilitado por padrão, mas você pode habilitá-lo para testes. O NTCP2 será habilitado na próxima versão.
tr: 0.9.36 sürümünde, daha güvenli yeni NTCP2 taşıyıcı iletişim kuralı bulunuyor. Varsayılan olarak devre dışıdır, ancak denemek için etkinleştirebilirsiniz. NTCP2 bir sonraki sürümde etkinleştirilecek.

source: This release also contains a fix for installs on Windows 10, and several performance improvements.
pt_br: Esta versão também contém uma correção para instalações no Windows 10 e diversas melhorias de desempenho.
tr: Bu sürümde ayrıca Windows 10 üzerindeki kurulumlar için bir düzeltme ve çeşitli başarım iyileştirmeleri bulunuyor.

source: i2psnark: Add sequential order option
pt_br: i2psnark: Adicionar opção de ordem sequencial
tr: i2psnark: Arka arkaya sıralama seçeneği eklendi

source: NTCP2 (disabled by default, enable with advanced config i2np.ntcp2.enable=true)
pt_br: NTCP2 (desabilitado por padrão, habilitado com configuração avançada i2np.ntcp2.enable=true)
tr: NTCP2 (varsayılan olarak devre dışıdır, gelişmiş yapılandırma i2np.ntcp2.enable=true seçeneği ile etkinleştirebilirsiniz)

source: Transport performance improvements
pt_br: Melhorias no desempenho do transporte
tr: Taşıyıcı başarımında iyileştirmeler yapıldı

source: Console: Catch rare session exception
pt_br: Console: Capturar exceção rara de sessão
tr: Pano: Nadir görülen oturum istisnası düzeltildi

source: Crypto: EdDSA constant-time fix
pt_br: Cripto: correção de tempo constante EdDSA
tr: Şifreleme: EdDSA sabit zaman düzeltmesi yapıldı

source: i2psnark: Handle deleted files on recheck/reopen
pt_br: i2psnark: Lidar com arquivos excluídos ao verificar/reabrir novamente
tr: i2psnark: Silinen dosyaların yeniden denetlenmesi/açılması ele alındı

source: i2psnark: Fix error stopping torrent when allocating
pt_br: i2psnark: Corrigir erro ao parar torrent ao alocar
tr: i2psnark: Yerleştirilirken torrent durdurma sorunu düzeltildi

source: Installer: Fix wrapper selection on Windows 10
pt_br: Instalador: Corrigir seleção de wrapper no Windows 10
tr: Kurucu: Windows 10 üzerinde Wrapper seçimi düzeltildi

source: Streaming: Change behavior on read timeout
pt_br: Streaming: Alterar comportamento no tempo limite de leitura
tr: Akış: Okuma zaman aşımı davranışı değiştirildi

source: Console: Split netdb output into pages
pt_br: Console: Dividir a saída do netdb em páginas
tr: Pano: "Ağ veri tabanı" (NetDB) çıktısı sayfalara bölündü

source: Debian: Add dependency on famfamfam-flag-png
pt_br: Debian: Adicionar dependência em famfamfam-flag-png
tr: Debian: famfamfam-flag-png bağımlılığı eklendi

source: Debian: Check for missing libtaglibs at build time
pt_br: Debian: Verifique se há libtaglibs ausentes no momento da compilação
tr: Debian: Derleme sırasında eksik libtaglibs denetlendi

source: I2CP: Add option for forcing gzip on/off per-message
pt_br: I2CP: Adicionar opção para forçar gzip ligado/desligado por mensagem
tr: I2CP: Her ileti için gzip açma/kapama dayatması seçeneği eklendi

source: i2psnark: Add icon for comments
pt_br: i2psnark: Adicionar ícone para comentários
tr: i2psnark: Yorumlar simgesi eklendi

source: i2ptunnel: Change read timeout defaults to account for streaming changes
pt_br: i2ptunnel: Alterar padrões de tempo limite de leitura para levar em conta as alterações de streaming
tr: i2ptunnel: Akış değişikliklerini hesaba katmak için okuma zaman aşımı varsayılanları değiştirildi

source: JBigI: Detect processor change at at startup, reselect lib
pt_br: JBigI: Detectar alteração do processador na inicialização, selecionar novamente a biblioteca
tr: JB hi fI: Başlangıçta işlemci değişikliği algılandı, kitaplık yeniden seçildi

source: Streaming: Performance improvements
pt_br: Streaming: Melhorias de desempenho
tr: Akış: Başarım iyileştirmeleri yapıldı

source: Update GeoIPv6 data (new installs and PPA only)
pt_br: Atualizar dados GeoIPv6 (somente novas instalações e PPA)
tr: GeoIPv6 verileri güncellendi (yalnızca yeni kurulumlar ve PPA)

source: 0.9.37 Release
pt_br: Lançamento 0.9.37
tr: 0.9.37 sürümü yayınlandı

source: 0.9.37 with NTCP2 enabled
pt_br: 0.9.37 com NTCP2 habilitado
tr: 0.9.37 sürümü etkinleştirilmiş NTCP2 ile yayınlandı

source: 0.9.37 enables the faster, more secure transport protocol called NTCP2.
pt_br: 0.9.37 habilita o protocolo de transporte mais rápido e seguro chamado NTCP2.
tr: 0.9.37 sürümünde NTCP2 adında daha hızlı ve daha güvenli bir taşıyıcı iletişim kuralı kullanılıyor.

source: Enable NTCP2 by default
pt_br: Habilitar NTCP2 por padrão
tr: NTCP2 varsayılan olarak etkinleştirildi

source: NTCP2 fixes
pt_br: Correções NTCP2
tr: NTCP2 düzeltmeleri yapıldı

source: Workaround for build hang with Tomcat 8.5.33/34
pt_br: Solução alternativa para travamento de compilação com Tomcat 8.5.33/34
tr: Tomcat 8.5.33/34 ile derlemenin askıda kalmasına geçici çözüm uygulandı

source: Progress on reproducible builds
pt_br: Progresso em compilações reproduzíveis
tr: Yinelenebilir yapılarda ilerleme sağlandı

source: Additional Arabic translations
pt_br: Traduções adicionais em árabe
tr: Arapça çeviriler eklendi

source: ========================================================= Developing privacy-aware applications with Python and I2P =========================================================
pt_br: ============================================================= Desenvolvendo aplicativos com reconhecimento de privacidade com Python e I2P ===================================================================
tr: ======================================================== Python ve I2P ile gizliliğe duyarlı uygulamalar geliştirmek ========================================================

source: Basic concepts of I2P application development with Python
pt_br: Conceitos básicos de desenvolvimento de aplicações I2P com Python
tr: Python ile temel I2P uygulaması geliştirme kavramları

source: `Invisible Internet Project`_ (I2P) provides a framework for developing privacy-aware applications. It is a virtual network working on top of the regular Internet, in which hosts can exchange data without disclosing their "real" IP addresses. Connections inside I2P network are established between virtual addresses called *I2P destinations*. It's possible to have as many of destinations as one needs, even use a new destination for each connection, they don't disclose any information about the real IP address to the other side.
pt_br: ``Invisible Internet Project`_ (I2P) fornece uma estrutura para desenvolver aplicativos com consciência de privacidade. É uma rede virtual trabalhando em cima da Internet regular, na qual os hosts podem trocar dados sem revelar seus endereços IP "reais". As conexões dentro da rede I2P são estabelecidas entre endereços virtuais chamados *destinos I2P*. É possível ter quantos destinos forem necessários, até mesmo usar um novo destino para cada conexão, eles não revelam nenhuma informação sobre o endereço IP real para o outro lado.
tr: `Invisible Internet Project`_ (I2P), gizliliğe duyarlı uygulamalar geliştirmek için bir çatı sağlar. Sunucuların "gerçek" IP adreslerini açıklamadan veri alışverişi yapabildikleri, normal İnternet üzerinde çalışan sanal bir ağ yapısıdır. I2P ağı içindeki bağlantılar, *I2P hedefleri* olarak adlandırılan sanal adresler arasında kurulur. Bir kişi gerek duyduğu kadar hedefe sahip olabilir, hatta her bağlantı için yeni bir hedef kullanabilir. Gerçek IP adresi hakkında hiçbir bilgiyi diğer tarafa açık etmez.

source: This article describes basic concepts one needs to know when developing I2P applications. Code samples are written in Python with the use of built-in asynchronous framework asyncio.
pt_br: Este artigo descreve conceitos básicos que se precisa saber ao desenvolver aplicativos I2P . Os exemplos de código são escritos em Python com o uso do framework assíncrono integrado asyncio.
tr: Bu makale, I2P uygulamaları geliştirirken bilinmesi gereken temel kavramları açıkla. Kod örnekleri, yerleşik asenkron çatı asyncio kullanılarak Python üzerinde yazılmıştır.

source: Enabling SAM API and i2plib installation ========================================
pt_br: Habilitando a API SAM e a instalação do i2plib ==========================================
tr: SAM API kullanımı ve i2plib kurulumu ========================================

source: I2P provides many different APIs to the client applications. Regular client-server apps can use I2PTunnel, HTTP and Socks proxies, Java applications usually use I2CP. For developing with other languages, like Python, the best option is `SAM`_. SAM is disabled by default in the original Java client implementation, so we need to enable it. Go to Router Console, page "I2P internals" -> "Clients". Check "Run at Startup" and press "Start", then "Save Client Configuration".
pt_br: O I2P fornece muitas APIs diferentes para os aplicativos cliente. Aplicativos cliente-servidor regulares podem usar proxies I2PTunnel, HTTP e Socks, aplicativos Java geralmente usam I2CP. Para desenvolver com outras linguagens, como Python, a melhor opção é `SAM`_. O SAM é desabilitado por padrão na implementação original do cliente Java, então precisamos habilitá-lo. Vá para o Router Console, página "I2P internals" -> "Clients". Marque "Run at Startup" e pressione "Start", depois "Save Client Configuration".
tr: I2P, istemci uygulamalarına birçok farklı API sağlar. Normal istemci-sunucu uygulamaları I2PTunnel, HTTP ve Socks vekil sunucularını kullanabilir, Java uygulamaları genellikle I2CP kullanır. Python gibi diğer dillerle geliştirmek için en iyisi `SAM`_ seçeneğidir. SAM, özgün Java istemci uygulamasında varsayılan olarak devre dışıdır, bu nedenle etkinleştirmemiz gerekir. Yöneltici panosunda, "I2P bilgileri" -> "İstemciler" bölümüne gidin. "Başlangıçta çalıştır" seçeneğini işaretleyin ve "Başlat" üzerine ardından "İstemci yapılandırmasını kaydet" üzerine tıklayın.

source: Enable SAM API
pt_br: Habilitar API SAM
tr: SAM API kullanmak
