Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Fix UTF-8 console passwords, and partial fix for usernames
pt_br: Corrigir senhas de console UTF-8 e correção parcial para nomes de usuários
tr: UTF-8 pano şifreleri düzeltildi ve kullanıcı adları kısmen düzeltildi

source: Fix router family configuration form
pt_br: Corrigir formulário de configuração da família do roteador
tr: Yöneltici ailesi yapılandırma formu düzeltildi

source: Fix NTP sending random data in some fields that should be zero
pt_br: Corrigir NTP enviando dados aleatórios em alguns campos que deveriam ser zero
tr: Sıfır olması gereken bazı alanlarda rastgele veri gönderen NTP sorunu düzeltildi

source: More verification of received NTP packets
pt_br: Mais verificação de pacotes NTP recebidos
tr: Alınan NTP paketlerinin daha fazla doğrulanması sağlandı

source: Rework resource bundle generation for 20x speedup in build time (requires gettext version 0.19)
pt_br: Retrabalhar a geração de pacotes de recursos para uma aceleração de 20x no tempo de construção (requer gettext versão 0.19)
tr: Derleme süresini 20 kat hızlandırmak için kaynak paketi oluşturma yeniden yazıldı (gettext 0.19 sürümü gerekir)

source: ==================== I2P on Maven Central ====================
pt_br: ===================== I2P no Maven Central =====================
tr: ========================= I2P Maven Central üzerinde =========================

source: The I2P client libraries are now available on Maven Central!
pt_br: As bibliotecas de cliente I2P agora estão disponíveis no Maven Central!
tr: I2P istemci kitaplıkları artık Maven Central üzerinde bulunuyor!

source: We're nearly half-way into the APIs month of Summer Dev, and making great progress on a number of fronts. I'm happy to announce that the first of these is complete: the I2P client libraries are now available on Maven Central!
pt_br: Estamos quase na metade do mês de APIs do Summer Dev, e fazendo um grande progresso em várias frentes. Estou feliz em anunciar que a primeira delas está completa: as bibliotecas de cliente I2P agora estão disponíveis no Maven Central!
tr: API uygulamaları için geliştirme yazı uygulama ayının neredeyse yarısına geldik ve bazı cephelerde büyük ilerleme kaydediyoruz. Bunlardan ilkinin tamamlandığını duyurmaktan mutluluk duyuyorum: I2P istemci kitaplıkları artık Maven Central üzerinde bulunuyor!

source: This should make it much simpler for Java developers to use I2P in their applications. Instead of needing to obtain the libraries from a current install, they can simply add I2P to their dependencies. Upgrading to new versions will similarly be much easier.
pt_br: Isso deve tornar muito mais simples para desenvolvedores Java usarem I2P em seus aplicativos . Em vez de precisar obter as bibliotecas de uma instalação atual, eles podem simplesmente adicionar I2P às suas dependências. Atualizar para novas versões será similarmente muito mais fácil.
tr: Böylece Java geliştiricilerinin uygulamalarında I2P kullanması çok daha basit olmalı. Var olan bir kurulumdan kitaplıkları almak yerine, basitçe I2P bağımlılıklarını ekleyebilirler. Yeni sürümlere yükseltmek de benzer şekilde çok daha kolay olacaktır.

source: How to use them ===============
pt_br: Como utilizar ============
tr: Nasıl kullanılır ===============

source: There are two libraries that you need to know about:
pt_br: Há duas bibliotecas que você precisa conhecer:
tr: Bilmeniz gereken iki kitaplık var:

source: The core I2P APIs; you can use these to send individual datagrams.
pt_br: As principais APIs I2P; você pode usá-las para enviar datagramas individuais.
tr: Çekirdek I2P API uygulamaları; Bireysel veri şemalarını göndermek için bunları kullanabilirsiniz.

source: A TCP-like set of sockets for communicating over I2P.
pt_br: Um conjunto de soquetes semelhante ao TCP para comunicação via I2P.
tr: I2P üzerinden iletişim kurmak için TCP benzeri bir soket takımı.

source: Add one or both of these to your project's dependencies, and you're good to go!
pt_br: Adicione um ou ambos às dependências do seu projeto e pronto!
tr: Bunlardan birini ya da ikisini de projenizin bağımlılıklarına ekleyin ve hazırsınız!

source: For other build systems, see the Maven Central pages for the `core`__ and `streaming`__ libraries.
pt_br: Para outros sistemas de compilação, consulte as páginas do Maven Central para as bibliotecas `core`__ e `streaming`__.
tr: Diğer yapım sistemlerinde kullanılabilecek, `core`__ ve `streaming`__ kitaplıkları için Maven Central sayfalarına bakabilirsiniz.

source: Android developers should use the `I2P Android client library`__, which contains the same libraries along with Android-specific helpers. I'll be updating it soon to depend on the new I2P libraries, so that cross-platform applications can work natively with either I2P Android or desktop I2P.
pt_br: Os desenvolvedores Android devem usar a `biblioteca cliente Android I2P`__, que contém as mesmas bibliotecas junto com auxiliares específicos do Android. Eu a atualizarei em breve para depender das novas bibliotecas I2P, para que aplicativos multiplataforma possam funcionar nativamente com o I2P Android ou o I2P de desktop.
tr: Android geliştiricileri, Android'e özgü yardımcılarla birlikte aynı kitaplıkları içeren `I2P Android istemci kitaplığını`__ kullanmalıdır. Bunu yeni I2P kitaplıklarına bağlı olarak yakında güncelleyeceğim, böylece platformlar arası uygulamalar yerel olarak I2P Android veya masaüstü I2P ile çalışabilir.

source: Get hacking! ============
pt_br: Comece a hackear! ============
tr: Hackleyin! ============

source: See our `application development`__ guide for help getting started with these libraries. You can also chat with us about them in #i2p-dev on IRC. And if you do start using them, let us know what you're working on with the hashtag `#I2PSummer`__ on Twitter!
pt_br: Veja nosso guia de `desenvolvimento de aplicativos`__ para obter ajuda para começar a usar essas bibliotecas . Você também pode conversar conosco sobre elas em #i2p-dev no IRC. E se você começar a usá-las, conte-nos no que você está trabalhando com a hashtag `#I2PSummer`__ no Twitter!
tr: Bu kitaplıkları kullanmaya başlama konusunda yardım için `uygulama geliştirme`__ rehberimize bakın. Ayrıca IRC üzerinde #i2p-dev kanalında bizimle onlar hakkında sohbet edebilirsiniz. Bunları kullanmaya başlarsanız, Twitter üzerinde `#I2PSummer`__ etiketiyle ne üzerinde çalıştığınızı bize bildirin!

source: ======================== Summer Dev roundup: APIs ========================
pt_br: ========================= Resumo do desenvolvimento de verão: APIs =========================
tr: ================================= Geliştirme yazı özeti: API uygulamaları =================================

source: In the first month of Summer Dev, we have improved the usability of our APIs for Java, Android, and Python developers.
pt_br: No primeiro mês do Summer Dev, melhoramos a usabilidade de nossas APIs para desenvolvedores Java, Android e Python.
tr: Geliştirme yazının ilk ayında Java, Android ve Python geliştiricileri için API uygulamalarınızın kullanılabilirliğini iyileştirdik.

source: Summer Dev is in full swing: we've been busy greasing wheels, sanding edges, and tidying the place up. Now it's time for our first roundup, where we bring you up to speed on the progress we are making!
pt_br: O Summer Dev está a todo vapor: estivemos ocupados lubrificando rodas, lixando bordas e arrumando o lugar. Agora é hora do nosso primeiro resumo, onde trazemos vocês para acelerar o progresso que estamos fazendo!
tr: Geliştirme yazı tüm hızıyla sürüyor: Tekerlekleri yağlamak, kenarları zımparalamak ve etrafı toplamakla meşguldük. Şimdi, kaydettiğimiz ilerleme konusunda size hızlandırılmış bir genel değerlendirme yapmamızın zamanı geldi!

source: But first, a big thank you to `Elio Qoshi`__ and `ura`__ for designing us the fantastic logo you see above. It adds a cheerful personality to our development program (and is going to look great on t-shirts).
pt_br: Mas primeiro, um grande obrigado a `Elio Qoshi`__ e `ura`__ por nos projetarem o logotipo fantástico que você vê acima. Ele adiciona uma personalidade alegre ao nosso programa de desenvolvimento (e ficará ótimo em camisetas).
tr: Ama önce, yukarıda gördüğünüz harika logoyu bize tasarladıkları için `Elio Qoshi`__ ve `ura`__ için teşekkür edelim. Geliştirme programımıza eğlence katıyor (ve tişörtlerde harika görünecek).

source: APIs month ==========
pt_br: Mês de APIs ===========
tr: API uygulamaları ayı ==================

source: Our goal for this month was to "blend in" - to make our APIs and libraries work within the existing infrastructure of various communities, so that application developers can work with I2P more efficiently, and users don't need to worry about the details.
pt_br: Nossa meta para este mês era "misturar" - fazer com que nossas APIs e bibliotecas funcionassem dentro da infraestrutura existente de várias comunidades, para que os desenvolvedores de aplicativos pudessem trabalhar com o I2P de forma mais eficiente, e os usuários não precisassem se preocupar com os detalhes.
tr: Bu ayki hedefimiz, uygulama geliştiricilerin I2P ile daha verimli çalışabilmesi ve kullanıcıların ayrıntılar hakkında endişelenmesine gerek kalmaması için API uygulamalarımızın ve kitaplıklarımızın çeşitli toplulukların var olan altyapısı içinde çalışmasını sağlamaktı.

source: The I2P client libraries are now available on `Maven Central`__ ! See our `previous blog post`__ for full details.
pt_br: As bibliotecas de cliente I2P agora estão disponíveis no `Maven Central`__ ! Veja nosso `postagem de blog anterior`__ para detalhes completos.
tr: I2P istemci kitaplıkları artık `Maven Central`__ üzerinde bulunuyor! Tüm ayrıntılar için 'önceki blog yazımıza'__ bakabilirsiniz.

source: The `I2P Android client library`__ has also been updated to use the new I2P libraries. This means that cross-platform applications can work natively with either I2P Android or desktop I2P.
pt_br: A `biblioteca cliente I2P Android`__ também foi atualizada para usar as novas bibliotecas I2P . Isso significa que aplicativos multiplataforma podem funcionar nativamente com I2P Android ou I2P desktop.
tr: `I2P Android istemci kitaplığı`__ yeni I2P kitaplıklarını kullanacak şekilde güncellendi. Böylece, platformlar arası uygulamalar I2P Android veya masaüstü I2P üzerinde yerel olarak çalışabilecek.

source: The `Twisted`__ plugin ``txi2p`` now supports in-I2P ports, and will work seamlessly over local, remote, and port-forwarded `SAM APIs`__. See its `documentation`__ for usage instructions, and report any issues on `GitHub`__.
pt_br: O plugin `Twisted`__ ``txi2p`` agora suporta portas in-I2P e funcionará perfeitamente em APIs SAM`__ locais, remotas e encaminhadas por porta. Veja sua `documentação`__ para instruções de uso e relate quaisquer problemas no `GitHub`__.
tr: `Twisted`__ uygulama eki ``txi2p`` artık I2P içi bağlantı noktalarını destekliyor ve yerel, uzak ve bağlantı noktası iletilmiş `SAM API uygulamaları`__ üzerinde sorunsuz bir şekilde çalışacak. Kullanım yönergeleri için `belgelere`__ bakabilirsiniz. Sorunları `GitHub`__ üzerinden bildirin.

source: The first (beta) version of ``i2psocket`` has been released! This is a direct replacement for the standard Python ``socket`` library that extends it with I2P support over the SAM API. See its `GitHub page`__ for usage instructions, and to report any issues.
pt_br: A primeira versão (beta) do ``i2psocket`` foi lançada! Esta é uma substituição direta para a biblioteca Python padrão ``socket`` que a estende com suporte I2P sobre a API SAM. Veja sua `página do GitHub`__ para instruções de uso e para relatar quaisquer problemas.
tr: İlk ``i2psocket`` (beta) sürümü çıktı! Bu kitaplık, doğrudan onu SAM API üzerinden I2P desteğiyle genişleten standart Python ``soket`` kitaplığının yerine geçmiştir. Kullanım yönergeleri ve sorunları bildirmek için `GitHub sayfasına`__ bakın.

source: Other progress --------------
pt_br: Outro progresso --------------
tr: Diğer ilerlemeler --------------

source: zzz has been hard at work on Syndie, getting a headstart on Plugins month. You can follow his progress on `the development forum thread`__.
pt_br: zzz tem trabalhado duro no Syndie, começando no mês dos Plugins. Você pode acompanhar o progresso dele no `thread do fórum de desenvolvimento`__.
tr: zzz, Syndie üzerinde sıkı bir şekilde çalışıyor ve uygulama ekleri ayına avantajlı bir başlangıç yapıyor. Gelişimini `geliştirme forumu başlığından`__ izleyebilirsiniz.

source: psi has been creating an I2P test network using i2pd, and in the process has found and fixed several i2pd bugs that will improve its compatibility with Java I2P.
pt_br: O psi vem criando uma rede de testes I2P usando o i2pd e, no processo, encontrou e corrigiu vários bugs do i2pd que melhorarão sua compatibilidade com o Java I2P.
tr: psi, i2pd kullanarak bir I2P sınama ağı oluşturuyor ve bu süreçte Java I2P ile uyumluluğunu artıracak birkaç i2pd hatası buldu ve düzeltti.

source: Coming up: Apps month! ======================
pt_br: Brevemente: mês de Aplicações! =============================
tr: Yaklaşıyor: Uygulamalar ayı! =========================

source: We are excited to be working with `Tahoe-LAFS`__ in July! I2P has for a long time been home to one of the `largest public grids`__, using a patched version of Tahoe-LAFS. During Apps month we will be helping them with their ongoing work to add native support for I2P and Tor, so that I2P users can benefit from all of the improvements upstream.
pt_br: Estamos animados em trabalhar com `Tahoe-LAFS`__ em julho! O I2P tem sido por muito tempo o lar de uma das `maiores redes públicas`__, usando uma versão corrigida do Tahoe-LAFS. Durante o mês dos aplicativos, nós os ajudaremos com seu trabalho contínuo para adicionar suporte nativo para I2P e Tor, para que os usuários do I2P possam se beneficiar de todas as melhorias upstream.
tr: Temmuz ayında `Tahoe-LAFS`__ ile çalışmaktan heyecan duyuyoruz! I2P, yamalı bir Tahoe-LAFS sürümünü kullanarak uzun süredir `en büyük kamu ağlarından`__ birine ev sahipliği yapıyor. Uygulamalar ayı boyunca, I2P kullanıcılarının kaynak koduna eklenen tüm iyileştirmelerden yararlanabilmeleri için doğal I2P ve Tor desteği eklemeye yönelik olarak süren çalışmalarında onlara yardımcı olacağız.

source: There are several other projects that we will be talking with about their plans for I2P integration, and helping with design. Stay tuned!
pt_br: Há vários outros projetos com os quais falaremos sobre seus planos para integração I2P e ajudaremos com design. Fique ligado!
tr: I2P bütünleştirmesi ve tasarıma yardımcı olma planları hakkında konuşacağımız birkaç proje daha var. Bizi izlemeyi sürdürün!

source: ============== 0.9.27 Release ==============
pt_br: ================== 0.9.27 - Lançamento ==================
tr: ====================== 0.9.27 sürümü yayınlandı ======================

source: 0.9.27 contains bug fixes
pt_br: Versão 0.9.27 contém correções de erros
tr: 0.9.27 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.27 contains a number of bug fixes. The updated GMP library for crypto acceleration, which was bundled in the 0.9.26 release for new installs and Debian builds only, is now included in the in-network update for 0.9.27. There are improvements in IPv6 transports, SSU peer testing, and hidden mode.
pt_br: 0.9.27 contém algumas correções de erros. Biblioteca GMP atualizada para aceleração de encriptação, que foi incorporada no lançamento da versão 0.9.26 apenas para novas instalações e compilações Debian, está agora incluída na atualização de rede para a versão 0.9.27. Existem alguns melhoramentos no transporte de IPv6, teste de peer SSU, e modo ocultado.
tr: 0.9.27 sürümünde çeşitli hata düzeltmeleri bulunuyor. Şifrelemeyi hızlandırmak için güncellenen ve 0.9.26 sürümünde yalnızca yeni Debian kurulumları için eklenen GMP kitaplığı şimdi ağ içi güncellemelerine eklendi. IPv6 taşıyıcıları, SSU eş sınaması ve gizli kip konularında iyileştirmeler yapıldı.

source: We updated a number of plugins during I2P Summer and your router will automatically update them after restart.
pt_br: Atualizamos vários plugins durante o I2P Summer e seu roteador os atualizará automaticamente após a reinicialização.
tr: I2P yazı boyunca bir dizi uygulama ekini güncelledik. Yönelticiniz yeniden başlatıldıktan sonra bunları otomatik olarak güncelleyecek.

source: GMP 6 (in-net updates)
pt_br: GMP 6 (atualizações na rede)
tr: GMP 6 (ağ içi güncellemeler)

source: SSU Peer Testing for IPv6
pt_br: Teste de pares SSU para IPv6
tr: IPv6 için SSU eş sınaması

source: Add outproxy plugin support for SOCKS
pt_br: Adicionar suporte ao plugin outproxy para SOCKS
tr: SOCKS için çıkış vekil sunucusu uygulama eki desteği eklendi

source: Enable desktop GUI (tray icon) on Windows
pt_br: Habilitar interface gráfica de usuário (ícone da bandeja) no Windows
tr: Windows üzerinde masaüstü görsel kullanıcı arayüzü (tepsi simgesi) etkinleştirildi

source: Fix reported GMP version when jbigi built as a shared library
pt_br: Corrigir versão GMP relatada quando jbigi é construído como uma biblioteca compartilhada
tr: Jbigi paylaşılan bir kitaplık olarak oluşturulduğunda bildirilen GMP sürümünü düzeltildi

source: Fix SSU peer test happening too frequently
pt_br: Corrigir teste de pares SSU acontecendo com muita frequência
tr: SSU eş sınamasının çok sık yapılmaması sağlandı

source: Fix SSU peer test not terminating properly in some cases
pt_br: Corrigir teste de pares SSU que não termina corretamente em alguns casos
tr: Bazı durumlarda SSU eş sınamasının düzgün bir şekilde sonlandırılmaması düzeltildi

source: Fix bote plugin not working in Debian/Ubuntu builds
pt_br: Corrigir o plugin bote que não funciona em compilações Debian/Ubuntu
tr: Debian/Ubuntu yapılarında çalışmayan bot uygulama eki düzeltildi

source: Fix rare UPnP NPE when viewing /peers
pt_br: Corrigir UPnP NPE raro ao visualizar /peers
tr: /peers görüntüleme sırasında nadir görülen UPnP NPE sorunu düzeltildi

source: Fix standalone i2psnark build and configuration
pt_br: Corrigir compilação e configuração autônoma do i2psnark
tr: Bağımsız i2psnark oluşturma ve yapılandırması düzeltildi

source: Hidden mode improvements: Enable tunnel testing and use fast peers
pt_br: Melhorias no modo oculto: habilitar testes de túnel e usar pares rápidos
tr: Gizli kip iyileştirmeleri: Tünel sınaması ve hızlı eşler etkinleştirildi

source: Fix possible CSRF in SusiMail
pt_br: Corrigir possível CSRF no SusiMail
tr: SusiMail üzerindeki olası CSRF düzeltildi

source: Fix i2psnark exception on bad configured announce URL
pt_br: Corrigir exceção i2psnark em URL de anúncio mal configurada
tr: Kötü yapılandırılmış duyuru adresindeki i2psnark istisnası düzeltildi

source: Fix layout issues on i2ptunnel registration page
pt_br: Corrigir problemas de layout na página de registro do i2ptunnel
tr: i2ptunnel kayıt sayfasındaki düzen sorunları düzeltildi

source: Fix streaming accept() hang when session disconnects
pt_br: Corrigir travamento de streaming accept() quando a sessão é desconectada
tr: Oturum bağlantısı kesildiğinde akış accept() takılması düzeltildi

source: Split up the large /configclients web page into several
pt_br: Divida a grande página da web /configclients em várias
tr: Büyük /configclients site sayfası birkaç bölüme ayrıldı

source: Add links to view complete router and wrapper log files
pt_br: Adicione links para visualizar arquivos de log completos do roteador e do wrapper
tr: Tam yöneltici ve Wrapper günlük dosyalarını görüntülemek için bağlantılar eklendi

source: Block 'Proxy' header in i2ptunnel (HTTPoxy)
pt_br: Bloquear cabeçalho 'Proxy' no i2ptunnel (HTTPoxy)
tr: i2ptunnel üzerinde (HTTPoxy) 'Proxy' üst bilgisi engellendi

source: Recognize Kaby Lake CPUIDs
pt_br: Reconhecer CPUIDs do Kaby Lake
tr: Kaby Lake işlemci kodlarının tanınması sağlandı

source: ============== 0.9.28 Release ==============
pt_br: ============== Lançamento 0.9.28 ==============
tr: ====================== 0.9.28 sürümü yayınlandı ======================

source: 0.9.28 contains bug fixes
pt_br: 0.9.28 contém correções de falha
tr: 0.9.28 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.28 contains fixes for over 25 Trac tickets, and updates for a number of bundled software packages including Jetty. There are fixes for the IPv6 peer testing feature introduced last release. We continue improvements to detect and block peers that are potentially malicious. There are preliminary fixes for Java 9, although we do not yet recommend Java 9 for general use.
pt_br: A versão 0.9.28 contém correções para mais de 25 tickets Trac, e atualizações para vários pacotes de software embutidos incluindo o Jetty. Há correções para a funcionalidade de teste de par IPv6 introduzida no último lançamento. Nós damos continuidade a melhorias para detectar e bloquear pares que sejam potencialmente maliciosos. Há correções preliminares para Java 9, embora nós ainda não recomendemos o Java 9 para uso geral.
tr: 0.9.28 sürümünde, Jetty uygulaması da dahil olmak üzere birlikte sunulan yazılım paketleri için 25 üzerinde Trac bildirimi düzeltildi Önceki sürümde sunulan IPv& eş sınaması özelliğinde bazı düzeltmeler yapıldı. Zararlı olabilecek eşleri algılayıp engellemek için geliştirmeler yapıldı. Java 9 için ek düzeltmeler yapıldı. Bununla birlikte henüz genel amaçlar için Java 9 kullanılmasını önermiyoruz.

source: I2P will be at 33C3, please stop by our table and give us your ideas on how to improve the network. We will review our 2017 roadmap and priorities 2017 at the Congress.
pt_br: I2P estará em 33C3, por favor, pare em nossa mesa e nos dê suas ideias sobre como melhorar a rede. Revisaremos nosso roteiro de 2017 e nossas prioridades para 2017 no Congresso.
tr: I2P ekibi 33C3 numaralı bölümde olacak. Ağı nasıl genişleteceğimiz hakkında fikir vermek için masamıza uğrayabilirsiniz. Kongrede 2017 önceliklerini ve 2017 yol haritasını gözden geçireceğiz.

source: Fix version test for SSU IPv6 peer testing
pt_br: Corrigir teste de versão para teste de pares SSU IPv6
tr: SSU IPv6 eş sınaması için sürüm sınaması düzeltildi

source: Fix generation of keys for SSL console
pt_br: Corrigir geração de chaves para console SSL
tr: SSL panosu için anahtar oluşturma düzeltildi

source: Fix uploader limit in i2psnark
pt_br: Corrigir limite de uploader no i2psnark
tr: i2psnark üzerinde yükleyici sınırı düzeltildi

source: Fix susimail nonce error on login after logout
pt_br: Corrigir erro nonce do susimail no login após o logout
tr: Oturum kapatıldıktan sonra oturum açılırken susimail nonce hatası düzeltildi

source: Fixes for Java 9
pt_br: Correções para Java 9
tr: Java 9 düzeltmeleri yapıldı

source: Allow Java 9 in packages
pt_br: Permitir Java 9 em pacotes
tr: Paketlerde Java 9 kullanımına izin verildi

source: Add warning for Java 9, not yet recommended
pt_br: Adicionar aviso para Java 9, ainda não recomendado
tr: Java 9 için uyarı eklendi, henüz önerilmiyor

source: Preliminary fixes for use with Tomcat 8
pt_br: Correções preliminares para uso com Tomcat 8
tr: Tomcat 8 ile kullanım için ön düzeltmeler yapıldı

source: Improved self-signed certificates
pt_br: Certificados autoassinados aprimorados
tr: Kendinden imzalı sertifikalar geliştirildi

source: Increase max IPv6 MTU (proposal #127)
pt_br: Aumentar o MTU máximo do IPv6 (proposta nº 127)
tr: En büyük IPv6 MTU değeri artırıldı (127 numaralı öneri)

source: Caching of serialized leasesets
pt_br: Armazenamento em cache de leasesets serializados
tr: Serileştirilmiş "Kiralama kümeleri" (LeaseSets) ön belleğe alındı

source: Peer selection updates
pt_br: Atualizações de seleção de pares
tr: Eş seçimi güncellemeleri
