Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: This year we focused on the massive overhaul of the new user onboarding for the download and browser configuration workflow and language. New wireframes for the I2P website have been created, and new information architecture put in place. This has been done in order to better support new users, maintainers, application developers, I2P core contributors, and researchers. This work will continue into 2022 as documentation is refined and the site changes are implemented.
pt_br: Este ano, focamos na grande reformulação da integração de novos usuários para o fluxo de trabalho e idioma de download e configuração do navegador . Novos wireframes para o site I2P foram criados e uma nova arquitetura de informações foi colocada em prática. Este foi feito para dar melhor suporte a novos usuários, mantenedores, desenvolvedores de aplicativos , colaboradores principais do I2P e pesquisadores. Este trabalho continuará em 2022, conforme a documentação for refinada e as mudanças no site forem implementadas.
tr: Bu yıl, indirme ve tarayıcı yapılandırmasının iş akışı ve dili için yeni kullanıcı katılımının kapsamlı bir şekilde elden geçirilmesine odaklandık. I2P sitesi için yeni bir yapı oluşturuldu ve yeni bilgi mimarisi devreye alındı. Bu işlemler, yeni kullanıcıları, yazılım ve uygulama geliştiricileri, I2P temel katkı sağlayıcılarını ve araştırmacıları daha iyi desteklemek amacıyla yapıldı. Bu çalışma, belgeleri iyileştirerek ve site değişikliklerini uygulayarak 2022 boyunca sürecek.

source: Read the full UX review here:
pt_br: Leia a análise completa do UX aqui:
tr: Kullanıcı deneyimi değerlendirmesinin tamamını şuradan okuyabilirsiniz:

source: Forum on internet Freedom in Africa 2021
pt_br: Fórum sobre a Liberdade da Internet em África 2021
tr: Afrika'da İnternet Özgürlüğü Forumu 2021

source: Working with our partners in Africa, the Invisible Internet Project was invited to participate in both a panel discussion, as well as work with a group of journalists to explore what privacy and security mean to them. The goal for the outcome from this opportunity was to understand what establishes trust, the concept of privacy and what it means, and egin to evaluate I2P and its tooling through this lens.
pt_br: Trabalhando com nossos parceiros na África, o Invisible Internet Project foi convidado para participar de um painel de discussão, bem como trabalhar com um grupo de jornalistas para explorar o que privacidade e segurança significam para eles. O objetivo para o resultado desta oportunidade foi entender o que estabelece confiança, o conceito de privacidade e o que ele significa, e começar a avaliar o I2P e suas ferramentas por meio desta lente.
tr: Afrika'daki iş ortaklarımızla birlikte çalışan Invisible İnternet projesi, hem bir panel tartışmasına hem de kişisel gizlilik ve güvenliğin onlar için ne anlama geldiğini öğrenmek amacıyla bir grup gazeteciyle birlikte çalışmaya davet edildi. Bu çalışmada güveni neyin oluşturduğu, kişisel gizlilik kavramının ne olduğu ve ne anlama geldiği, bu bakış açısından I2P ağı ve araçlarının yerinin değerlendirilmesi amaçlandı.

source: We saw that adoption results from efficiency, ease of use, and empowerment. All of these things result in a person not just wanting to use a privacy option, but to feel like they are actually taking control of their privacy. This is one of the most important aspects we have encountered during the past year when talking with new users: the emotional aspect of interacting with technology. Telling a person that something can technically provide a solution is one part of adoption. Providing a person with something that they can use with confidence is the other. Meeting people where they are and asking about who they are ensures that we are creating for real needs and for the most people possible.
pt_br: Vimos que a adoção resulta de eficiência, facilidade de uso e empoderamento. Todas essas coisas fazem com que uma pessoa não apenas queira usar uma opção de privacidade, mas sinta que realmente está assumindo o controle de sua privacidade. Este é um dos aspectos mais importantes que encontramos durante o último ano ao conversar com novos usuários: o aspecto emocional de interagir com a tecnologia. Dizer a uma pessoa que algo pode tecnicamente fornecer uma solução é uma parte da adoção. Fornecer a uma pessoa algo que ela possa usar com confiança é a outra. Encontros com as pessoas onde elas estão e perguntando sobre quem elas são garante que estamos criando para necessidades reais e para o maior número possível de pessoas.
tr: Alışkanlık kazandıkça verimlilik, kullanım kolaylığı ve güç sahibi olunduğunu gördük. Tüm bunlar, bir kişinin yalnızca bir kişisel gizlilik seçeneği kullanmak istemesini değil, aynı zamanda kişisel gizliliğinin kontrolünün elinde olduğunu hissetmesini sağlıyor. Geçen yıl boyunca yeni kullanıcılarla konuşurken karşılaştığımız en önemli konulardan biri teknoloji ile etkileşimin duygusal yönü oldu. Bir kişiye alışkanlık kazandırmanın bir parçası olarak, bir şeyin teknik olarak bir çözüm sağlayabileceğini söylemek ile güvenle kullanabileceği bir altyapı sağlamak farklıdır. İnsanlarla bulundukları yerde bir araya gelmek ve kim olduklarını sormak, gerçek gereksinimlerini anlayarak olabilecek en fazla sayıda insan için bir şeyler ortaya çıkarmamızı sağlar.

source: Read the entire blog post here
pt_br: Leia o post completo do blog aqui
tr: Günlük yazısının tamamını buradan okuyabilirsiniz

source: Thank you to everyone who contributes to building the Invisible Internet!
pt_br: Obrigado a todos que contribuem para construir a Internet Invisível!
tr: Invisible iİnternet projesine katkıda bulunan herkese teşekkür ederiz!

source: This post originally appeared on Sadie's blog. https://i2p.medium.com/4b926a488919 Copied with permission.
pt_br: Esta postagem apareceu originalmente no blog de Sadie. https://i2p.medium.com/4b926a488919 Copiado com permissão.
tr: Bu yazının özgün şeklini Sadie'nin blogunda bulabilirsiniz. https://i2p.medium.com/4b926a488919 İznini alarak kopyaladık.

source: SSU2 Transport
pt_br: Transporte SSU2
tr: SSU2 Taşıyıcısı

source: Overview
pt_br: Resumo
tr: Özet

source: I2P has used a censorship-resistant UDP transport protocol "SSU" since 2005. We've had few, if any, reports of SSU being blocked in 17 years. However, by today's standards of security, blocking resistance, and performance, we can do better. Much better.
pt_br: O I2P usa um protocolo de transporte UDP resistente à censura "SSU" desde 2005. Tivemos poucos, se houver, relatos de bloqueio de SSU em 17 anos. No entanto, pelos padrões atuais de segurança, resistência ao bloqueio, e desempenho, podemos fazer melhor. Muito melhor.
tr: I2P, 2005 yılından beri engellemeye dirençli bir UDP taşıyıcı iletişim kuralı olan "SSU" kullanıyor. 17 yılda SSU engellemesi hakkında çok az bildirim aldık. Ancak günümüzün güvenlik, engelleme direnci ve başarım standartlarına göre daha iyisini yapabiliriz. Çok daha iyisini.

source: That's why, together with the `i2pd project <%(link1)s>`_, we have created and implemented "SSU2", a modern UDP protocol designed to the highest standards of security and blocking resistance. This protocol will replace SSU.
pt_br: É por isso que, juntamente com o projeto `i2pd <%(link1)s>`_, criamos e implementamos o "SSU2", um protocolo UDP moderno projetado com os mais altos padrões de segurança e resistência ao bloqueio. Este protocolo substituirá o SSU.
tr: Bu nedenle, `i2pd projesi <%(link1)s>`_ ile birlikte, en yüksek güvenlik ve engellemeye direnme standartlarına göre tasarlanmış modern "SSU2" UDP iletişim kuralını oluşturduk ve uyguladık. Bu iletişim kuralı SSU yerine geçecek.

source: We have combined industry-standard encryption with the best features of UDP protocols WireGuard and QUIC, together with the censorship resistance features of our TCP protocol "NTCP2". SSU2 may be one of the most secure transport protocols ever designed.
pt_br: Combinamos criptografia padrão da indústria com os melhores recursos dos protocolos UDP WireGuard e QUIC, juntamente com os recursos de resistência à censura do nosso protocolo TCP "NTCP2". O SSU2 pode ser um dos protocolos de transporte mais seguros já projetados.
tr: Endüstri standardı şifrelemeyii WireGuard ve QUIC UDP iletişim kurallarının en iyi özellikleriyle ve "NTCP2" TCP iletişim kuralımızın engellemeye direnç özellikleriyle birleştirdik. SSU2, şimdiye kadar tasarlanmış en güvenli taşıyıcı iletişim kurallarından biri olabilir.

source: The Java I2P and i2pd teams are finishing the `SSU2 transport <%(link1)s>`_ and we will enable it for all routers in the next release. This completes our decade-long plan to upgrade all the cryptography from the original Java I2P implementation dating back to 2003. SSU2 will replace `SSU <%(link2)s>`_, our sole remaining use of `ElGamal <%(link3)s>`_ cryptography.
pt_br: As equipes Java I2P e i2pd estão finalizando o transporte `SSU2 <%(link1)s>`_ e o habilitaremos para todos os roteadores na próxima versão. Isso conclui nosso plano de uma década para atualizar toda a criptografia da implementação original Java I2P que remonta a 2003. O SSU2 substituirá o `SSU <%(link2)s>`_, nosso único uso restante da criptografia `ElGamal <%(link3)s>`_.
tr: Java I2P ve i2pd ekipleri `SSU2 taşıyıcısını <%(link1)s>`_ tamamlıyor ve bir sonraki sürümde tüm yönelticiler için etkinleştireceğiz. Böylece, 2003 yılına dayanan özgün Java I2P uygulamasındaki tüm şifrelemeyi yükseltmeye yönelik on yıllık planımızı tamamlamış olacağız. SSU2, `ElGamal <%(link3)s>`_ şifrelemesinin kalan tek kullanımı olan `SSU <%(link2)s>`_ iletişim kuralının yerini alacak.

source: After the transition to SSU2, we will have migrated all our authenticated and encrypted protocols to standard `Noise Protocol <%(link1)s>`_ handshakes:
pt_br: Após a transição para SSU2, teremos migrado todos os nossos protocolos autenticados e criptografados para o padrão `Noise Protocol <%(link1)s>`_ handshakes:
tr: SSU2 iletişim kuralına geçişin ardından, kimliği doğrulanmış ve şifrelenmiş tüm iletişim kurallarını standart `Gürültü İletişim Kuralı <%(link1)s>`_ el sıkışmalarına geçirmiş olacağız:

source: ECIES-X25519-Ratchet end-to-end protocol
pt_br: ECIES-X25519-Protocolo ponta a ponta Ratchet
tr: ECIES-X25519-Ratchet uçtan uca iletişim kuralı

source: ECIES-X25519 tunnel build messages
pt_br: Mensagens de construção de túnel ECIES-X25519
tr: ECIES-X25519 tünel oluşturma iletileri

source: All I2P Noise protocols use the following standard cryptographic algorithms:
pt_br: Todos os protocolos I2P Noise usam os seguintes algoritmos criptográficos padrão:
tr: Tüm I2P gürültü iletişim kuralları aşağıdaki standart şifreleme algoritmalarını kullanır:

source: Goals
pt_br: Metas
tr: Hedefler

source: Upgrade the asymmetric cryptography to the much faster X25519
pt_br: Atualize a criptografia assimétrica para o muito mais rápido X25519
tr: Asimetrik şifrelemeyi çok daha hızlı X25519 strandardına yükseltmek

source: Use standard symmetric authenticated encryption ChaCha20/Poly1305
pt_br: Use criptografia simétrica autenticada padrão ChaCha20/Poly1305
tr: ChaCha20/Poly1305 standart simetrik kimliği doğrulanmış şifreleme kullanılması

source: Improve the obfuscation and blocking resistance features of SSU
pt_br: Melhore os recursos de ofuscação e resistência ao bloqueio do SSU
tr: SSU gizleme ve engelleme direnci özelliklerinin iyileştirilmesi

source: Improve the resistance to spoofed addresses by adapting strategies from QUIC
pt_br: Melhore a resistência a endereços falsificados adaptando estratégias do QUIC
tr: QUIC stratejilerini uyarlayarak sahte adreslere karşı direncin artırılması

source: Improved handshake CPU efficiency
pt_br: Melhoria na eficiência da CPU do handshake
tr: El sıkışma işlemci verimliliğinin iyileştirilmesi

source: Improved bandwidth efficiency via smaller handshakes and acknowledgements
pt_br: Melhoria na eficiência da largura de banda por meio de handshakes e confirmações menores
tr: Daha küçük el sıkışmaları ve onaylar kullanılarak bant genişliği verimliliğinin iyileştirilmesi

source: Improve the security of the peer test and relay features of SSU
pt_br: Melhore a segurança dos recursos de teste e retransmissão de pares do SSU
tr: SSU eş sınaması ve aktarıcı özelliklerinin güvenliğinin iyileştirilmesi

source: Improve the handling of peer IP and port changes by adapting the "connection migration" feature of QUIC
pt_br: Melhore o tratamento de alterações de IP e porta de peer adaptando o recurso de "migração de conexão" do QUIC
tr: QUIC "bağlantı aktarımı" özelliğinin uyarlanarak eş IP ve bağlantı noktası değişikliklerinin işlenmesinin iyileştirilmesi

source: Move away from heuristic code for packet handling to documented, algorithmic processing
pt_br: Afaste-se do código heurístico para manipulação de pacotes para processamento algorítmico documentado
tr: Paket işleme için buluşsal koddan belgelenmiş, algoritmik işlemeye geçilmesi

source: Support a gradual network transition from SSU to SSU2
pt_br: Apoiar uma transição gradual da rede de SSU para SSU2
tr: SSU iletişim kuralından SSU2 iletişim kuralına kademeli ağ geçişinin desteklenmesi

source: Easy extensibility using the block concept from NTCP2
pt_br: Fácil extensibilidade usando o conceito de bloco do NTCP2
tr: NTCP2 üzerinde blok konseptinin kullanılarak kolay genişletilebilirliğin sağlanması

source: Design
pt_br: Projeto
tr: Tasarım

source: I2P uses multiple layers of encryption to protect traffic from attackers. The lowest layer is the transport protocol layer, used for point-to-point links between two routers. We currently have two transport protocols: NTCP2, a modern TCP protocol introduced in 2018, and SSU, a UDP protocol developed in 2005.
pt_br: O I2P usa várias camadas de criptografia para proteger o tráfego de invasores. A camada mais baixa é a camada de protocolo de transporte, usada para links ponto a ponto entre dois roteadores. Atualmente, temos dois protocolos de transporte: NTCP2, um protocolo TCP moderno introduzido em 2018, e SSU, um protocolo UDP desenvolvido em 2005.
tr: I2P, trafiği saldırganlardan korumak için birden çok şifreleme katmanı kullanır. En alt katman, iki yöneltici arasındaki noktadan noktaya bağlantılar için kullanılan taşıyıcı iletişim kuralı katmanıdır. Şu anda iki taşıyıcı iletişim kuralımız var: 2018 yılında tanıtılan modern bir TCP iletişim kuralı olan NTCP2 ve 2005 yılında geliştirilen bir UDP iletişim kuralı olan SSU.

source: SSU2, like previous I2P transport protocols, is not a general-purpose pipe for data. Its primary task is to securely deliver I2P's low-level `I2NP messages <%(link1)s>`_ from one router to the next. Each of these point-to-point connections comprises one hop in an I2P tunnel. Higher-layer I2P protocols run over these point-to-point connections to deliver garlic messages end-to-end between I2P's destinations.
pt_br: O SSU2, assim como os protocolos de transporte I2P anteriores, não é um pipe de uso geral para dados. Sua tarefa principal é entregar com segurança as mensagens `I2NP de baixo nível do I2P <%(link1)s>`_ de um roteador para o outro. Cada uma dessas conexões ponto a ponto compreende um salto em um túnel I2P. Os protocolos I2P de camada superior são executados nessas conexões ponto a ponto para entregar mensagens de alho de ponta a ponta entre os destinos do I2P.
tr: SSU2, önceki I2P taşıyıcı iletişim kuralları gibi, veriler için genel amaçlı bir kanal değildir. Birincil görevi, düşük düzeydeki I2P `I2NP iletilerini <%(link1)s>`_ bir yönelticiden diğerine güvenli bir şekilde aktarmaktır. Bu noktadan noktaya bağlantıların her biri, bir I2P tünelinde bir atlama içerir. Daha yüksek katmanlı I2P iletişim kuralları, I2P hedefleri arasında uçtan uca Garlic iletileri aktarmak için bu noktadan noktaya bağlantılar üzerinden çalışır.

source: Designing a UDP transport presents unique and complex challenges not present in TCP protocols. A UDP protocol must handle security issues caused by address spoofing, and must implement its own congestion control. Additionally, all messages must be fragmented to fit within the maximum packet size (MTU) of the network path, and reassembled by the receiver.
pt_br: Projetar um transporte UDP apresenta desafios únicos e complexos não presentes nos protocolos TCP. Um protocolo UDP deve lidar com problemas de segurança causados por falsificação de endereço, e deve implementar seu próprio controle de congestionamento. Além disso, todas as mensagens devem ser fragmentadas para caber no tamanho máximo de pacote (MTU) do caminho da rede e remontadas pelo receptor.
tr: Bir UDP taşıyıcısını tasarlamak, TCP iletişim kurallarında bulunmayan benzersiz ve karmaşık zorluklar sunar. Bir UDP iletişim kuralı, adres sahtekarlığının neden olduğu güvenlik sorunlarını ele almalı ve kendi tıkanıklık denetimini uygulamalıdır. Ek olarak, tüm iletilerin ağ yolunun en büyük paket boyutuna (MTU) sığacak şekilde parçalanması ve alıcı tarafından yeniden birleştirilmesi gerekir.

source: We first relied heavily on our previous experience with our NTCP2, SSU, and streaming protocols. Then, we carefully reviewed and borrowed heavily from two recently-developed UDP protocols:
pt_br: Primeiro, confiamos muito em nossa experiência anterior com nossos protocolos NTCP2, SSU e streaming. Então, revisamos cuidadosamente e tomamos emprestado muito de dois protocolos UDP desenvolvidos recentemente:
tr: Öncelikle NTCP2, SSU ve akış iletişim kurallarımızla ilgili önceki deneyimlerimize büyük ölçüde güvendik. Ardından, son zamanlarda geliştirilen iki UDP iletişim kuralını dikkatlice inceledik ve bunlardan büyük ölçüde ödünç aldık:

source: Protocol classification and blocking by adversarial on-path attackers such as nation-state firewalls is not an explicit part of the threat model for those protocols. However, it is an important part of I2P's threat model, as our mission is to provide an anonymous and censorship-resistant communications system to at-risk users around the world. Therefore, much of our design work involved combining the lessons learned from NTCP2 and SSU with the features and security supported by QUIC and WireGuard.
pt_br: A classificação e o bloqueio de protocolos por invasores adversários no caminho, como firewalls de estado-nação, não são uma parte explícita do modelo de ameaça para esses protocolos. No entanto, é uma parte importante do modelo de ameaça do I2P, pois nossa missão é fornecer um sistema de comunicação anônimo e resistente à censura para usuários em risco ao redor do mundo. Portanto, grande parte do nosso trabalho de design envolveu a combinação das lições aprendidas com NTCP2 e SSU com os recursos e a segurança suportados pelo QUIC e WireGuard.
tr: Ülke düzeyinde güvenlik duvarları gibi yol saldırganları tarafından iletişim kuralı sınıflandırması ve engelleme, bu iletişim kuralları için tehdit modelinin açık bir parçası değildir. Ancak, misyonumuz dünyanın her yerindeki risk altındaki kullanıcılara anonim ve engellemeye dirençli bir iletişim sistemi sağlamak olduğundan, I2P tehdit modelinin önemli bir parçasıdır. Bu nedenle, tasarım çalışmalarımızın çoğu, NTCP2 ve SSU çalışmalarından alınan dersleri QUIC ve WireGuard tarafından desteklenen özellikler ve güvenlikle birleştirmeyi içeriyordu.

source: Unlike QUIC, I2P transport protocols are peer-to-peer, with no defined server/client relationship. Identities and public keys are published in I2P's network database, and the handshake must authenticate participants to those identities.
pt_br: Ao contrário do QUIC, os protocolos de transporte I2P são ponto a ponto, sem uma relação definida entre servidor/cliente. Identidades e chaves públicas são publicadas no banco de dados de rede do I2P, e o handshake deve autenticar os participantes para essas identidades.
tr: QUIC uygulamasının aksine, I2P taşıyıcı iletişim kuralları eşler arasındadır ve tanımlanmış bir sunucu/istemci ilişkisi yoktur. Kimlikler ve herkese açık anahtarlar, I2P ağ veri tabanında yayınlanır ve el sıkışma, katılımcıların bu kimliklerle kimlik doğrulamasını yapmalıdır.

source: A complete summary of the SSU2 design is beyond the scope of this article. However, we highlight several features of the protocol below, emphasizing the challenges of UDP protocol design and threat models.
pt_br: Um resumo completo do design do SSU2 está além do escopo deste artigo. No entanto, destacamos vários recursos do protocolo abaixo, enfatizando os desafios do design do protocolo UDP e os modelos de ameaças.
tr: SSU2 tasarımının tam bir özeti bu makalenin kapsamı dışındadır. Ancak, aşağıda iletişim kuralının çeşitli özelliklerini vurgulayarak UDP iletişim kuralı tasarımının ve tehdit modellerinin zorluklarını vurguladık.

source: DoS Resistance
pt_br: Resistência DoS
tr: DoS direnci

source: UDP protocols are especially vulnerable to Denial of Service (DoS) attacks. By sending a large amount of packets with spoofed source addresses to a victim, an attacker can induce the victim to consume large amounts of CPU and bandwidth to respond. In SSU2, we adapt the token concept from QUIC and WireGuard. When a router receives a connection request without a valid token, it does not perform an expensive cryptographic DH operation. It simply responds with small message containing a valid token using inexpensive cryptographic operations. If the initiator was not spoofing his address, he will receive the token and the handshake may proceed normally. This prevents any traffic amplification attacks using spoofed addresses.
pt_br: Os protocolos UDP são especialmente vulneráveis a ataques de Negação de Serviço (DoS). Ao enviar uma grande quantidade de pacotes com endereços de origem falsificados para uma vítima, um invasor pode induzir a vítima a consumir grandes quantidades de CPU e largura de banda para responder. No SSU2, adaptamos o conceito de token do QUIC e do WireGuard. Quando um roteador recebe uma solicitação de conexão sem um token válido, ele não executa uma operação DH criptográfica cara. Ele simplesmente responde com uma pequena mensagem contendo um token válido usando operações criptográficas baratas. Se o iniciador não estiver falsificando seu endereço, ele receberá o token e o handshake poderá prosseguir normalmente. Isso evita qualquer ataque de amplificação de tráfego usando endereços falsificados.
tr: UDP iletişim kuralları özellikle hizmet reddi (DoS) saldırılarına karşı savunmasızdır. Saldırgan, bir kurbana sahte kaynak adresleri içeren çok sayıda paket göndererek, kurbanın yanıt vermek için büyük miktarlarda işlemci ve bant genişliği harcamasına neden olabilir. SSU2 iletişim kuralında, belirteç kavramı için QUIC ve WireGuard uygulamalarından esinlendik. Bir yöneltici, geçerli bir belirteci olmayan bir bağlantı isteği aldığında, pahalı bir Diffie-Hellman şifreleme işlemi gerçekleştirmez. Ucuz şifreleme işlemleri kullanarak geçerli bir belirteç içeren küçük bir ileti ile yanıt verir. Başlatıcı bir adres sahteciliği yapmıyorsa, belirteci alır ve el sıkışma normal şekilde ilerleyebilir. Böylece, sahte adresler kullanan herhangi bir trafik artırma saldırısı önlenmiş olur.

source: Header Encryption
pt_br: Criptografia de Cabeçalho
tr: Üst bilgi şifrelemesi

source: SSU2's packet headers are similar to WireGuard, and are encrypted in a manner similar to that in QUIC.
pt_br: Os cabeçalhos de pacotes do SSU2 são semelhantes aos do WireGuard e são criptografados de maneira semelhante à do QUIC.
tr: SSU2 paket üst bilgileri WireGuard iletişim kuralına benzer ve QUIC üzerindeki gibi şifrelenir.
