Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: The release also contains several bug fixes in i2ptunnel, i2psnark, and other areas, and updates to the latest Jetty, Tomcat, and Wrapper. We've also implemented a faster and more secure method for reseeding. Of course, there's also the usual collection of minor bug fixes and translation updates.
pt_br: A versão também contém várias correções de bugs no i2ptunnel, i2psnark e outras áreas, e atualizações para os mais recentes Jetty, Tomcat e Wrapper. Também implementamos um método mais rápido e seguro para ressemeadura. Claro, há também a coleção usual de pequenas correções de bugs e atualizações de tradução.
tr: Bu sürümde ayrıca i2ptunnel, i2psnark ve diğer alanlarda çeşitli hata düzeltmeleri ve en son Jetty, Tomcat ve Wrapper güncellemeleri bulunuyor. Ayrıca yeniden tohumlama için daha hızlı ve daha güvenli bir yöntem uyguladık. Her zamanki gibi küçük hata düzeltmeleri ve çeviri güncellemeleri de var.

source: You must update to this release immediately. The best way to maintain security and help the network is to run the latest release.
pt_br: Você deve atualizar para esta versão imediatamente. A melhor maneira de manter a segurança e ajudar a rede é executar a versão mais recente.
tr: En kısa sürede bu sürüme güncellemeniz önerilir. Güvenliği korumanın ve ağa yardımcı olmanın en iyi yolu güncel sürümü kullanmaktır.

source: Security Fixes
pt_br: Correções de segurança
tr: Güvenlik Düzeltmeleri

source: Fix several XSS issues
pt_br: Corrigir vários problemas de XSS
tr: Bazı XSS sorunları düzeltildi

source: Disable changing news feed URL from UI
pt_br: Desabilitar alteração de URL do feed de notícias na IU
tr: Kullanıcı arayüzünden haber akışı adresinin değiştirilmesi devre dışı bırakıldı

source: Disable plugin install
pt_br: Desativar instalação do plugin
tr: Uygulama eki kurulumu devre dışı bırakıldı

source: Disable setting unsigned update URL from UI
pt_br: Desabilitar configuração de URL de atualização não assinada da IU
tr: Kullanıcı arayüzünden imzalanmamış güncelleme adresinin değiştirilmesi devre dışı bırakıldı

source: Disable clients.config editing from the UI
pt_br: Desabilitar a edição de clients.config na IU
tr: Kullanıcı arayüzünden clients.config seçeneğinin değiştirilmesi devre dışı bırakıldı

source: Add Content-Security-Policy and X-XSS-Protection headers
pt_br: Adicionar cabeçalhos Content-Security-Policy e X-XSS-Protection
tr: Content-Security-Policy ve X-XSS-Protection üst bilgileri eklendi

source: Disable unused ExecNamingService (thx joernchen of Phenoelit)
pt_br: Desabilitar ExecNamingService não utilizado (obrigado joernchen do Phenoelit)
tr: Kullanılmayan ExecNamingService devre dışı bırakıldı (teşekkürler Phenoelit ekibinden joernchen)

source: Fix tunnel building so it doesn't get "stuck" on a single pool
pt_br: Corrigir a construção do túnel para que ele não fique "preso" em um único pool
tr: Tünel yapımı tek bir havuzda "takılmayacak" şekilde düzeltildi

source: Reject participating tunnels when hidden
pt_br: Rejeitar túneis participantes quando ocultos
tr: Gizlendiğinde tünellere katkıda bulunma reddedildi

source: Several i2psnark improvements and fixes (GUI and DHT), including changes for better compatibility with Vuze
pt_br: Várias melhorias e correções do i2psnark (GUI e DHT), incluindo mudanças para melhor compatibilidade com o Vuze
tr: Vuze ile daha iyi uyumluluk sağlamak için değişiklikler ve çeşitli i2psnark iyileştirmeleri ile düzeltmeleri (görsel arayüz ve "Dağıtılmış karma tablosu", DHT) yapıldı

source: Reseeding now fetches a signed zip file containing router infos for security and speed
pt_br: A nova propagação agora busca um arquivo zip assinado contendo informações do roteador para segurança e velocidade
tr: Yeniden tohumlama artık güvenlik ve hız için yöneltici bilgilerini içeren imzalı bir zip dosyası alıyor

source: Use JVM's AES implementation if it is faster
pt_br: Use a implementação AES da JVM se for mais rápida
tr: Daha hızlıysa JVM AES uygulamasının kullanılması sağlandı

source: More advanced options shown in the i2ptunnel edit pages
pt_br: Opções mais avançadas mostradas nas páginas de edição do i2ptunnel
tr: i2ptunnel düzenleme sayfalarına daha gelişmiş seçenekler eklendi

source: Per-message reliabilitiy settings in I2CP and error propagation back from router to client
pt_br: Configurações de confiabilidade por mensagem em I2CP e propagação de erro de volta do roteador para o cliente
tr: I2CP üzerinde her ileti için güvenilirlik ayarları ve yönelticiden istemciye hata yayılımı eklendi

source: Lots of findbugs fixes and cleanups
pt_br: Muitas correções e limpezas de findbugs
tr: Bulunan çok sayıda hata düzeltildi ve temizlendi

source: Support signature types in SAM, bump rev to 3.1
pt_br: Suporte a tipos de assinatura no SAM, atualização para 3.1
tr: SAM üzerinde imza türleri desteği eklendi ve rev 3.1 sürümüne yükseltildi

source: New event log page in console
pt_br: Nova página de log de eventos no console
tr: Panoya yeni olay günlüğü sayfası eklendi

source: Wrapper 3.5.25 (new installs and PPA only)
pt_br: Wrapper 3.5.25 (somente novas instalações e PPA)
tr: Wrapper 3.5.25 sürümüne güncellendi (yalnızca yeni kurulumlar ve PPA)

source: ================ 0.9.14.1 Release ================
pt_br: ============================= Lançamento da versão 0.9.14.1 =============================
tr: ====================== 0.9.14.1 sürümü yayınlandı ======================

source: 0.9.14.1 includes i2psnark and console fixes
pt_br: 0.9.14.1 inclui o i2psnark e correções no painel
tr: 0.9.14.1 sürümü i2psnark ve pano düzeltmeleri ile yayınlandı

source: 0.9.14.1 includes fixes for the "Add Torrent" form in i2psnark and some other web forms. We've restored the ability to install plugins via the console, but you must first edit your router.config file (in ~/.i2p/ or /var/lib/i2p/i2p-config/ or %APPDATA%\I2P\) to add the line routerconsole.enablePluginInstall=true. Other rarely-used advanced features that were removed in 0.9.14 may be restored by adding the line routerconsole.advanced=true.
pt_br: 0.9.14.1 inclui correções para o formulário "Adicionar Torrent" no i2psnark e alguns outros formulários da web. Restauramos a capacidade de instalar plugins via console, mas você deve primeiro editar seu arquivo router.config (em ~/.i2p/ ou /var/lib/i2p/i2p-config/ ou %APPDATA%\I2P\) para adicionar a linha routerconsole.enablePluginInstall=true. Outros recursos avançados raramente usados que foram removidos no 0.9.14 podem ser restaurados adicionando a linha routerconsole.advanced=true.
tr: 0.9.14.1 sürümünde, i2psnark ve diğer bazı internet formlarındaki "Torrent ekle" formu için düzeltmeler bulunuyor. Pano aracılığıyla uygulama eki kurma özelliğini yeniden etkinleştirdik. Ancak önce router.config dosyanızı (~/.i2p/ veya /var/lib/i2p/i2p-config/ veya %APPDATA%\I2P\ içinde) düzenleyerek routerconsole.enablePluginInstall=true satırını eklemelisiniz. 0.9.14 sürümünde devre dışı bırakılan ve nadiren kullanılan diğer gelişmiş özellikler, routerconsole.advanced=true satırı eklenerek yeniden etkinleştirilebilir.

source: As usual, if configured with the default "Download and Verify", the router will automatically download the update and display a button to restart. However, due to a bug in 0.9.14, if your update is configured for "Notify only", the download button will not be displayed. You must change your configuration to "Download and Verify" or "Download, Verify, and Restart" to update.
pt_br: Como de costume, se configurado com o padrão "Baixar e verificar", o roteador baixará automaticamente a atualização e exibirá um botão para reiniciar. No entanto, devido a um bug na versão 0.9.14, se sua atualização estiver configurada para "Somente notificar", o botão de download não será exibido. Você deve alterar sua configuração para "Baixar e verificar" ou "Baixar, verificar e reiniciar" para atualizar.
tr: Her zamanki gibi, varsayılan "Download and Verify" olarak yapılandırılmışsa, yöneltici güncellemeyi otomatik olarak indirir ve bir yeniden başlatma düğmesi görüntüler. Ancak, 0.9.14 sürümündeki bir hata nedeniyle, güncelleme "Notify only" olarak yapılandırılmışsa, indirme düğmesi görüntülenmez. Güncellemeyi yapabilmek için yapılandırmanızı "Download and Verify" ya da "Download, Verify and Restart" olarak değiştirmelisiniz.

source: If you are still running 0.9.13 or older, we recommend that you update to this release as soon as possible. If you don't often check your router console, please consider changing your configuration to "Download, Verify, and Restart" to ensure you are always running the latest release.
pt_br: Se você ainda estiver executando a versão 0.9.13 ou anterior, recomendamos que atualize para esta versão o mais rápido possível. Se você não verifica o console do roteador com frequência, considere alterar sua configuração para "Baixar, verificar e reiniciar" para garantir que você esteja sempre executando a versão mais recente.
tr: Hala 0.9.13 veya daha eski bir sürümü kullanıyorsanız, en kısa sürede bu sürüme güncellemeyi yapmanızı öneririz. Yöneltici panonuza sık sık bakmıorsanız, her zaman güncel sürümü kullandığınızdan emin olmak için lütfen yapılandırmanızı "Download, Verify and Restart" olarak değiştirmeyi düşünün.

source: Fix i2psnark add torrent form
pt_br: Corrigir formulário de adição de torrent do i2psnark
tr: i2psnark torrent ekleme formu düzeltildi

source: Fix iptunnel custom options form
pt_br: Corrigir formulário de opções personalizadas do iptunnel
tr: iptunnel özel seçenekler formu düzeltildi

source: Fix update download buttons
pt_br: Corrigir botões de download de atualização
tr: Güncelleme indirme düğmeleri düzeltildi

source: Restore all console features if routerconsole.advanced=true
pt_br: Restaura todas as características do painel se routerconsole.advanced=true
tr: console.advanced=true seçeneği kullanılmışsa yöneltici panosundaki tüm özellikler yeniden kullanılabilir

source: Restore plugin install if routerconsole.enablePluginInstall=true
pt_br: Restaurar instalação do plugin se routerconsole.enablePluginInstall=true
tr: routerconsole.enablePluginInstall=true seçeneği kullanılmışsa uygulama eki kurulumu yeniden yapılabilir

source: Restpre client adds/changes if routerconsole.enableClientChange=true
pt_br: O cliente Restpre adiciona/altera se routerconsole.enableClientChange=true
tr: routerconsole.enableClientChange=true seçeneği kullanılmışsa istemci ekleme/değiştirme özelliği yeniden kullanılabilir

source: Plugin signing keys are now whitelisted unless routerconsole.allowUntrustedPlugins=true
pt_br: As chaves de assinatura de plug-in agora estão na lista de permissões, a menos que routerconsole.allowUntrustedPlugins=true
tr: routerconsole.allowUntrustedPlugins=true seçeneği kullanılmamışsa uygulama eki imzalama anahtarları beyaz listeye eklenir

source: More escaping and cleanups in forms and messages
pt_br: Mais escapes e limpezas em formulários e mensagens
tr: Form ve iletilerde düzeltme ve temizlik

source: ============================== The birth of Privacy Solutions ==============================
pt_br: =============================================== O nascimento de SOLUÇÕES PARA PRIVACIDADE ===============================================
tr: ============================== Privacy Solutions kuruldu ==============================

source: Organization launch
pt_br: Lançamento da organização
tr: Kuruluş duyurusu

source: Hello all! Today we announce the Privacy Solutions project, a new organization that develops and maintains I2P software. Privacy Solutions includes several new development efforts designed to enhance the privacy, security, and anonymity for users, based on I2P protocols and technology. These efforts include 1) The Abscond browser bundle. 2) The i2pd C++ router project. 3) The "BigBrother" I2P network monitoring project. 4) The Anoncoin crypto-coin project. 5) The Monero crypto-coin project. Privacy Solutions' initial funding was provided by the supporters of the Anoncoin and Monero projects. Privacy Solutions is a Norway-based non-profit type of organization registered within the Norwegian government registers. ( Kind of like US 501(c)3. ) Privacy Solutions plans to apply for funding from the Norwegian goverment for network research, because of BigBrother (We'll get back to what that is) and the coins that are planned to use low-latency networks as primary transport layer. Our research will support advances in software technology for anonymity, security, and privacy. First a little bit about the Abscond Browser Bundle. This was first a one-man project by Meeh, but later on friends started sending patches, the project is now trying to create the same easy access to I2P as Tor has with their browser bundle. Our first release isn't far away, it's just some gitian script tasks left, including setup of the Apple toolchain. But again we will add monitoring with PROCESS_INFORMATION (A C struct keeping vital proces information about an process) from the Java instance to check on I2P before we declare it stable. I2pd will also switch with the Java version once it's ready, and there is no point in shipping a JRE in the bundle anymore. You can read more about the Abscond Browser Bundle at https://hideme.today/dev
pt_br: Olá a todos! Hoje anunciamos o projeto Privacy Solutions, uma nova organização que desenvolve e mantém o software I2P. O Privacy Solutions inclui vários novos esforços de desenvolvimento projetados para melhorar a privacidade, a segurança e o anonimato dos usuários, com base nos protocolos e tecnologia I2P. Esses esforços incluem 1) O pacote do navegador Abscond. 2) O projeto do roteador i2pd C++. 3) O projeto de monitoramento de rede I2P "BigBrother". 4) O projeto da criptomoeda Anoncoin. 5) O projeto da criptomoeda Monero. O financiamento inicial do Privacy Solutions foi fornecido pelos apoiadores dos projetos Anoncoin e Monero. A Privacy Solutions é uma organização sem fins lucrativos sediada na Noruega, registrada nos registros do governo norueguês. (Tipo como US 501(c)3.) A Privacy Solutions planeja solicitar financiamento do governo norueguês para pesquisa de rede, por causa do BigBrother (voltaremos ao que é isso) e das moedas que estão planejadas para usar redes de baixa latência como camada de transporte primária. Nossa pesquisa dará suporte a avanços na tecnologia de software para anonimato, segurança e privacidade. Primeiro, um pouco sobre o Abscond Browser Bundle. Este foi primeiro um projeto individual de Meeh, mas depois amigos começaram a enviar patches, o projeto agora está tentando criar o mesmo acesso fácil ao I2P que o Tor tem com seu pacote de navegador. Nosso primeiro lançamento não está longe, faltam apenas algumas tarefas de script gitian, incluindo a configuração do conjunto de ferramentas da Apple. Mas, novamente, adicionaremos monitoramento com PROCESS_INFORMATION (estrutura AC mantendo informações vitais sobre um processo) da instância Java para verificar o I2P antes de declará-lo estável. O I2pd também alternará com a versão Java quando estiver pronto, e não há mais sentido em enviar um JRE no pacote. Você pode ler mais sobre o Abscond Browser Bundle em https://hideme.today/dev
tr: Hepinize merhaba! Bugün, I2P yazılımı geliştirmek için kurduğumuz yeni Privacy Solutions kuruluşunu duyuruyoruz. Privacy Solutions, I2P iletişim kuralları ve teknolojisine dayalı olarak kullanıcıların gizliliğini, güvenliğini ve anonimliğini geliştirmek için tasarlanmış yeni geliştirme çalışmaları yapacak. Bu çalışmalar şunlardır: 1) Abscond tarayıcı paketi. 2) i2pd C++ yöneltici projesi. 3) "BigBrother" I2P ağ izleme projesi. 4) Anoncoin kripto para projesi. 5) Monero kripto para projesi. Privacy Solutions ilk mali desteğini, Anoncoin ve Monero projelerinin destekçilerinden aldı. Privacy Solutions, Norveç devlet siclinde kayıtlı, Norveç merkezli, kar amacı gütmeyen bir kuruluştur ( US 501(c)3 gibi). Privacy Solutions, BigBrother (bunun ne olduğuna geri döneceğiz) ve birincil taşıyıcı katmanı olarak düşük gecikmeli ağları kullanması planlanan coin çözümleri nedeniyle Norveç hükümetine ağ araştırması için mali destek başvurusunda bulunmayı planlıyor. Araştırmamız, anonimlik, güvenlik ve kişisel gizlilik için yazılım teknolojisindeki gelişmeleri destekleyecektir. İlk önce biraz Abscond tarayıcı paketinden bahsedelim. Bu proje önce tek kişilik bir Meeh projesiydi, ancak daha sonra başkaları da yama göndermeye başladı. Proje şimdi Tor Browser paketlerinde olduğu gibi I2P için aynı kolay erişimi yaratmaya çalışıyor. İlk sürümümüz çok uzakta değil. Yalnızca Apple araç zinciri kurulumu ve bazı gitian komut dosyası işleri kaldı. Ama yine de, kararlı sürümü duyurmadan önce I2P denetimi için Java kopyasından PROCESS_INFORMATION (bir süreç hakkında yaşamsal süreç bilgilerini tutan bir C yapısı) ile izleme ekleyeceğiz. I2pd, hazır olduğunda Java sürümüyle de değişecek ve artık pakette JRE göndermenin anlamı olmayacak. Abscond tarayıcı paketi hakkında ayrıntılı bilgi almak için https://hideme.today/dev adresine bakabilirsiniz.

source: We would also like to inform of the current status of i2pd. I2pd supports bi-directional streaming now, that allows to use not only HTTP but long-lived communication channels. Instant IRC support has been added. I2pd users are able to use it same way as Java I2P for access to I2P IRC network. I2PTunnel is one of key features of I2P network, allowing non-I2P applications communicate transparently. That's why it's vital feature for i2pd and one of key milestones.
pt_br: Gostaríamos também de informar sobre o status atual do i2pd. O I2pd suporta streaming bidirecional agora, o que permite usar não apenas HTTP, mas canais de comunicação de longa duração. Suporte instantâneo ao IRC foi adicionado. Usuários do I2pd podem usá-lo da mesma forma que o Java I2P para acesso à rede IRC do I2P. O I2PTunnel é um dos principais recursos da rede I2P, permitindo que aplicativos não I2P se comuniquem de forma transparente. É por isso que é um recurso vital para o i2pd e um dos principais marcos.
tr: Güncel i2pd durumu hakkında da bilgi vermek isteriz. I2pd artık HTTP yanında, uzun ömürlü iletişim kanallarının da kullanmasını sağlayan çift yönlü akışı destekliyor. Anlık IRC desteği eklendi. I2pd kullanıcıları, Java I2P gibi I2P IRC ağına erişmek için kullanabilir. I2PTunnel, I2P ağının temel özelliklerinden biridir ve I2P dışındaki uygulamaların saydam şekilde iletişim kurmasını sağlar. Bu yüzden i2pd için hayati bir özellik ve önemli kilometre taşlarından biridir.

source: At last, if you are familiar with I2P you probably know about Bigbrother.i2p, which is a metrics system Meeh made over a year back. Recently we noticed that Meeh actually have 100Gb of non-duplicated data from nodes reporting in since initial launch. This will also be moved to Privacy Solutions and be rewritten with a NSPOF backend. With this we will aslo start using the Graphite ( http://graphite.wikidot.com/screen-shots ). This will give us a great overview over the network without privacy issues for our end users. The clients filter all data except country, router hash and success rate on tunnel buildings. The name of this service is as always a little joke from Meeh.
pt_br: Por fim, se você conhece o I2P, provavelmente conhece o Bigbrother.i2p, que é um sistema de métricas que a Meeh criou há mais de um ano. Recentemente, notamos que a Meeh realmente tem 100 GB de dados não duplicados de nós reportando desde o lançamento inicial. Isso também será movido para o Privacy Solutions e será reescrito com um backend NSPOF. Com isso, também começaremos a usar o Graphite (http://graphite.wikidot.com/screen-shots). Isso nos dará uma ótima visão geral da rede sem problemas de privacidade para nossos usuários finais. Os clientes filtram todos os dados, exceto país, hash do roteador e taxa de sucesso em construções de túneis. O nome deste serviço é, como sempre, uma piadinha da Meeh.
tr: Son olarak, I2P kullanıyorsanız, büyük olasılıkla Meeh tarafından bir yıl önce oluşturulan Bigbrother.i2p ölçüm sistemini biliyorsunuzdur. Son zamanlarda, Meeh tarafında, başlangıçtan bu yana bilgi veren düğümlerden alınmış 100 Gb kadar kopyalanmamış veri bulunduğunu fark ettik. Bu sistem de Privacy Solutions üzerine taşınacak ve bir NSPOF arka ucu ile yeniden yazılacak. Bununla birlikte Graphite(http://graphite.wikidot.com/screen-shots) kullanmaya başlayacağız. Böylece son kullanıcılarımız için gizlilik sorunları olmadan ağ üzerine harika bir genel bakış sağlayabileceğiz. İstemciler ülke, yöneltici karma değeri ve tünel yapımlarındaki başarı oranı dışındaki tüm verileri süzer. Meeh bu hizmeti adlandırırken her zamanki gibi şakacı davranmış.

source: We have shorted down a bit of the news here, if you're interested in more information please visit https://blog.privacysolutions.no/ We're still under construction and more content will come! For further information contact: press@privacysolutions.no Best regards, Mikal "Meeh" Villa
pt_br: Resumimos um pouco as notícias aqui, se você estiver interessado em mais informações, visite https://blog.privacysolutions.no/ Ainda estamos em construção e mais conteúdo virá! Para mais informações, entre em contato com: press@privacysolutions.no Atenciosamente, Mikal "Meeh" Villa
tr: Haberleri burada kısaltarak verdik. Ayrıntılı bilgi almak için https://blog.privacysolutions.no/ adresini ziyaret edebilirsiniz. Hala yapım aşamasındayız ve daha fazla içerik eklenecek! Ayrıntılı bilgi almak için iletişim: press@privacysolutions.no Saygılarımla, Mikal "Meeh" Villası

source: ============================================= Android test release on Google Play in Norway =============================================
pt_br: ========================================================== Lançada versão-teste para Android no Google Play Noruega ==========================================================
tr: ============================================= Norveç Google Play üzerinde Android test sürümü =============================================

source: I2P Android and Bote have been released on Google Play in Norway, as a test run for a future worldwide release.
pt_br: Lançados I2P Android e Bote no Google Play Noruega, como uma execução de testes para um futuro lançamento global.
tr: I2P Android ve Bote, gelecekte dünya çapında yayınlanacak bir sürüm için test çalışması olarak Norveç Google Play üzerinde yayınlandı.
