Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: If that doesn’t work, then the next easy thing to try is to decrease the tunnel length. Don’t do this if you believe you are at risk of your code-contribution activity being de-anonymized by a well-resourced attacker seeking to run many malicious nodes and control your whole path. If that sounds unlikely to you then you can probably do it safely.
pt_br: Se isso não funcionar, a próxima coisa fácil a tentar é diminuir o comprimento do túnel . Não faça isso se você acredita que corre o risco de sua atividade de contribuição de código ser desanonimizada por um invasor bem-recursos buscando executar muitos nós maliciosos e controlar todo o seu caminho . Se isso parece improvável para você, então você provavelmente pode fazer isso com segurança.
tr: Bu da işe yaramazsa, denenmesi gereken bir sonraki kolay şey tünel uzunluğunu azaltmaktır. Ancak koda katkıda bulunma çalışmalarınızın, birçok kötü amaçlı düğüm işleterek tüm yolunuzu denetlemeye çalışan ve bol kaynağı olan bir saldırgan tarafından izlendiğini ve anonimliğinizin bozulması riskiyle karşı karşıya olduğunu düşünüyorsanız, bunu yapmayın. Bu durum size pek olası gelmiyorsa güvenle yapabilirsiniz.

source: Suggested Workflow for Developers!
pt_br: Fluxo de trabalho sugerido para desenvolvedores!
tr: Geliştiriciler için önerilen iş akışı!

source: Revision control can make your life easier, but it works best if you use it well! In light of this, we strongly suggest a fork-first, feature-branch workflow as many are familiar with from Github. In such a workflow, the master branch is used as a sort of “Trunk” for updates and is never touched by the programmmer, instead, all changes to the master are merged from branches. In order to do set up your workspace for this, take the following steps:
pt_br: O controle de versão pode tornar sua vida mais fácil, mas funciona melhor se você usá-lo bem! À luz disso, sugerimos fortemente um fluxo de trabalho de fork-first, feature-branch, que muitos já conhecem do Github. Em tal fluxo de trabalho, a branch principal é usada como uma espécie de "Tronco" para atualizações e nunca é tocada pelo programador; em vez disso, todas as mudanças na branch principal são mescladas a partir de branches. Para configurar seu espaço de trabalho para isso, siga os seguintes passos:
tr: Sürüm denetimi hayatınızı kolaylaştırabilir, ancak en iyi sonucu alabilmek için onu iyi kullanmanız gerekir! Bunun ışığında, birçoğunun GitHub üzerinden aşina olduğu, önce dallandır, özelliği dalda geliştir şeklinde bir iş akışı öneriyoruz. Böyle bir iş akışında, ana dal, güncellemeler için bir tür "Gövde" olarak kullanılır ve programcı tarafından asla dokunulmaz, bunun yerine ana dalda yapılan tüm değişiklikler diğer dallardan birleştirilir. Çalışma alanınızı buna göre kurmak için aşağıdaki adımları izleyin:

source: **Never make changes to the Master Branch**. You will be using the master branch to periodially obtain updates to the official source code. All changes should be made in feature branches.
pt_br: **Nunca faça alterações no Master Branch**. Você usará o master branch para obter atualizações periódicas do código-fonte oficial . Todas as alterações devem ser feitas em feature branches.
tr: **Asla ana dalda değişiklik yapmayın**. Resmi kaynak kodundaki güncellemeleri düzenli olarak almak için ana dalı kullanacaksınız. Tüm değişiklikler özellik dallarında yapılmalıdır.

source: Set up a second remote in your local repository using the upstream source code.
pt_br: Configure um segundo controle remoto em seu repositório local usando o código-fonte upstream .
tr: Yukarı akış kaynak kodunu kullanarak yerel deponuzda ikinci bir uzak depo kurun.

source: Pull in any upstream changes on your current master:
pt_br: Puxe quaisquer alterações upstream no seu master atual:
tr: Var olan ana daldaki tüm yukarı akış değişikliklerini çekin:

source: Before making any changes to the source code, check out a new feature branch to develop on:
pt_br: Antes de fazer qualquer alteração no código-fonte, confira um novo branch de recurso para desenvolver:
tr: Kaynak kodunda herhangi bir değişiklik yapmadan önce, üzerinde geliştirme çalışmalarının yapılacağı yeni özellik dalını denetleyin:

source: When you’re done with your changes, commit them and push them to your branch
pt_br: Quando terminar suas alterações, confirme-as e envie-as para sua ramificação
tr: Değişikliklerinizi tamamladığınızda bunları gönderin ve dalınıza itme isteğinde bulunun

source: Submit a merge request. When the merge request is approved and brought into the upstream master, check out the master locally and pull in the changes:
pt_br: Envie uma solicitação de mesclagem. Quando a solicitação de mesclagem for aprovada e trazida para o master upstream, faça check-out do master localmente e puxe as alterações:
tr: Bir birleştirme isteğinde bulunun. Birleştirme isteği onaylandığında ve yukarı akış ana dalına getirildiğinde, ana dalı yerel olarak denetleyin ve değişiklikleri alın:

source: Whenever a change to the upstream master(i2p-hackers/i2p.i2p) is made, you can update your master code using this procedure as well.
pt_br: Sempre que uma alteração no master upstream (i2p-hackers/i2p.i2p) for feita, você também pode atualizar seu código master usando este procedimento.
tr: Yukarı akış ana dalında (i2p-hackers/i2p.i2p) bir değişiklik yapıldığında da, bu akışı kullanarak ana kodunuzu güncelleyebilirsiniz.

source: Gitlab over I2P Setup
pt_br: Configuração do Gitlab sobre I2P
tr: I2P üzerinden GitLab kurulumu

source: Mirror I2P Git repositories and Bridge Clearnet repositories for others.
pt_br: Espelhe os repositórios Git do I2P e os repositórios Clearnet do Bridge para outros.
tr: Başkaları için I2P Git depolarını yansıtın ve herkese açık İnternet depolarını köprüleyin.

source: This is the setup process I use for configuring Gitlab and I2P, with Docker in place to manage the service itself. Gitlab is very easy to host on I2P in this fashion, it can be administered by one person without much difficulty. In my configuration, I use a Debian VM to host docker containers and an I2P router, on a Debian Host system, however, this may be more than necessary for some people. These instructions should work on any Debian-based system, regardless of whether it is in a VM or not, and should easily translate to any system where Docker and an I2P router are available. This guide starts at Docker and does not assume any VM underneath.
pt_br: Este é o processo de configuração que eu uso para configurar o Gitlab e o I2P, com Docker em vigor para gerenciar o serviço em si. O Gitlab é muito fácil de hospedar no I2P dessa forma, ele pode ser administrado por uma pessoa sem muita dificuldade. Na minha configuração, eu uso uma VM Debian para hospedar contêineres docker e um roteador I2P, em um sistema Debian Host, no entanto, isso pode ser mais do que necessário para algumas pessoas. Essas instruções devem funcionar em qualquer sistema baseado em Debian, independentemente de estar em uma VM ou não, e devem ser facilmente traduzidas para qualquer sistema onde o Docker e um roteador I2P estejam disponíveis. Este guia começa no Docker e não assume nenhuma VM abaixo dele.
tr: Bu bölümde hizmetin kendisini yönetmek için Docker ile GitLab ve I2P yapılandırmaları için kullandığım kurulum sürecini anlatacağım. Bu şekilde I2P üzerinde GitLab barındırmak çok kolaydır ve tek kişi tarafından çok zorlanmadan yönetilebilir. Yapılandırmamda, bir Debian sunucu sisteminde docker kapsayıcılarını ve bir I2P yönelticisini barındırmak için bir Debian sanal makinesi kullanıyorum. Ancak bu kurulum bazı insanlar için gereğinden fazla olabilir. Bu yönergeler, bir sanal makinede olsun veya olmasın, herhangi bir Debian tabanlı sistemde çalışmalı ve Docker ile bir I2P yönelticisinin bulunduğu herhangi bir sisteme kolayca dönüştürülebilmelidir. Bu rehber Docker ile başlar ve altında herhangi bir sanal makine olmadığını varsayar.

source: Dependencies and Docker
pt_br: Dependências e Docker
tr: Bağımlılıklar ve Docker

source: Because Gitlab runs in a container, we only need to install the dependencies required for the container on our main system. Conveniently, you can install everything you need with:
pt_br: Como o Gitlab é executado em um contêiner, precisamos instalar apenas as dependências necessárias para o contêiner em nosso sistema principal. Convenientemente, você pode instalar tudo o que precisa com:
tr: GitLab bir kapsayıcı içinde çalıştığı için ana sistemimize yalnızca kapsayıcı için gerekli olan bağımlılıkları kurmanız gerekir. Uygun bir şekilde, gerek duyduğunuz her şeyi aşağıdaki komutlarla kurabilirsiniz:

source: on an otherwise unmodified Debian system, or if you have added Docker’s own “Community” Debian repository, you may use:
pt_br: em um sistema Debian não modificado, ou se você adicionou o repositório Debian “Community” do Docker , você pode usar:
tr: başka şekilde değiştirilmemiş bir Debian sistemi veya Docker uygulamasının kendi "Topluluk" Debian deposunu eklediyseniz, şunları kullanabilirsiniz:

source: instead.
pt_br: em vez de.
tr: onun yerine.

source: Fetch the Docker Containers
pt_br: Obter os contêineres do Docker
tr: Docker Kapsayıcılarını Alın

source: Once you have docker installed, you can fetch the docker containers required for gitlab. *Don’t run them yet.*
pt_br: Depois de instalar o docker, você pode buscar os contêineres do docker necessários para o gitlab. *Não os execute ainda.*
tr: Docker kurduktan sonra GitLab için gerekli Docker kapsayıcılarını getirebilirsiniz. *Henüz çalıştırmayın.*

source: For those who are concerned, the gitlab-ce Docker image is built using only Ubuntu Docker images as a parent, which are built from scratch images. Since there are no third-party images involved here, updates should come as soon as they are available in the host images. To review the Dockerfile for yourself, visit the `Gitlab source code <https://gitlab.com/gitlab-org/omnibus-gitlab/-/blob/master/docker/Dockerfile>`__.
pt_br: Para aqueles que estão preocupados, a imagem Docker gitlab-ce é construída usando apenas imagens Docker do Ubuntu como pai, que são construídas do zero imagens. Como não há imagens de terceiros envolvidas aqui, as atualizações devem vir assim que estiverem disponíveis nas imagens do host. Para revisar o Dockerfile por si mesmo, visite o `Gitlab source code <https://gitlab.com/gitlab-org/omnibus-gitlab/-/blob/master/docker/Dockerfile>`__.
tr: İlgilenenler için gitlab-ce Docker kalıbı, sıfırdan ve üst öge olarak Ubuntu Docker kalıpları kullanılarak oluşturulmuştur. Burada üçüncü taraf kalıpları bulunmadığından, güncellemeler sunucu kalıplarına eklenir eklenmez gelmelidir. Dockerfile kalıbını kendiniz incelemek isterseniz `GitLab kaynak kodu <https://gitlab.com/gitlab-org/omnibus-gitlab/ /blob/master/docker/Dockerfile>`__ bölümüne bakabilirsiniz.

source: Set up an I2P HTTP Proxy for Gitlab to use(Important information, optional steps)
pt_br: Configurar um proxy HTTP I2P para uso do Gitlab (informações importantes, etapas opcionais)
tr: GitLab kullanımı için bir I2P HTTP vekil sunucusu kurun (önemli bilgiler, isteğe bağlı adımlar)

source: Gitlab servers inside of I2P can be run with or without the ability to interact with servers on the internet outside of I2P. In the case where the Gitlab server is *not allowed* to interact with servers outside of I2P, they cannot be de-anonymized by cloning a git repository from a git server on the internet outside of I2P. They can, however, export and mirror repositories from other git services inside of I2P.
pt_br: Os servidores Gitlab dentro do I2P podem ser executados com ou sem a capacidade de interagir com servidores na internet fora do I2P. No caso em que o servidor Gitlab *não tem permissão* para interagir com servidores fora do I2P, eles não podem ser desanonimizados clonando um repositório git de um servidor git na internet fora do I2P. Eles podem, no entanto, exportar e espelhar repositórios de outros serviços git dentro do I2P.
tr: I2P içindeki GitLab sunucuları, I2P dışındaki İnternet üzerindeki sunucularla etkileşime girme yeteneği olarak ya da olmayarak işletilebilir. GitLab sunucusunun I2P dışındaki sunucularla etkileşimine *izin verilmediği* bir durumda, I2P dışındaki İnternet üzerindeki bir Git sunucusundan bir Git deposunu kopyalayarak anonim hale getiremezler. Bununla birlikte, I2P içindeki diğer Git hizmetlerinden depoları dışa aktarabilir ve yansıtabilirler.

source: In the case where the Gitlab server is *allowed* to interact with servers outside of I2P, it can act as a “Bridge” for the users, who can use it to mirror content outside I2P to an I2P-accessible source, however it *is not anonymous* in this case. Git services on the non-anonymous internet will be connected to directly.
pt_br: No caso em que o servidor Gitlab é *permitido* a interagir com servidores fora do I2P, ele pode atuar como uma “Ponte” para os usuários, que podem usá-lo para espelhar conteúdo fora do I2P para uma fonte acessível pelo I2P, no entanto, ele *não é anônimo* neste caso. Os serviços Git na internet não anônima serão conectados diretamente.
tr: GitLab sunucusunun I2P dışındaki sunucularla etkileşimine *izin verildiği* durumlarda, I2P dışındaki içeriği I2P ile erişilebilir bir kaynağa yansıtmak için kullanıcılar tarafından kullanılabilen bir "Köprü" görevi görebilir. Ancak *bu kullanım anonim değildir*. Anonim olmayan İnternet üzerindeki Git hizmetleri ile doğrudan bağlantı kurulacaktır.

source: **If you want to have a bridged, non-anonymous Gitlab instance with access to** **web repositories,** no further modification is necessary.
pt_br: **Se você quiser ter uma instância Gitlab em ponte e não anônima com acesso a** **repositórios da web,** nenhuma modificação adicional será necessária.
tr: **İnternet depolarına** erişmek için **köprülenmiş, anonim olmayan bir GitLab kopyası işletmek istiyorsanız** daha fazla değişiklik yapmanız gerekmez.

source: **If you want to have an I2P-Only Gitlab instance with no access to Web-Only** **Repositories**, you will need to configure Gitlab to use an I2P HTTP Proxy. Since the default I2P HTTP proxy only listens on ``127.0.0.1``, you will need to set up a new one for Docker that listens on the Host/Gateway address of the Docker network, which is usually ``172.17.0.1``. I configure mine on port ``4446``.
pt_br: **Se você quiser ter uma instância Gitlab somente I2P sem acesso a **Repositórios somente para a Web**, você precisará configurar o Gitlab para usar um Proxy HTTP I2P. Como o proxy HTTP I2P padrão escuta apenas em ``127.0.0.1``, você precisará configurar um novo para o Docker que escuta no endereço Host/Gateway da rede Docker, que geralmente é ``172.17.0.1``. Eu configuro o meu na porta ``4446``.
tr: **Depolara** erişmek için **yalnızca internet erişimi olmayan bir I2P GitLab kopyası işletmek istiyorsanız** , GitLab yapılandırmasını bir I2P HTTP vekil sunucusu kullanacak şekilde ayarlamanız gerekir. Varsayılan I2P HTTP vekil sunucusu yalnızca ``127.0.0.1`` adresinden dinlediğinden, Docker ağının sunucu/ağ geçidi adresini dinleyen Docker için genellikle ``172.17.0.1`` olan yeni bir arayüz ayarlamanız gerekecektir. Benimkini ``4446`` bağlantı noktası için yapılandırıyorum.

source: Start the Container Locally
pt_br: Inicie o contêiner localmente
tr: Kapsayıcıyı Yerel Olarak Başlatın

source: Once you have that set up, you can start the container and publish your Gitlab instance locally.
pt_br: Depois de configurar isso, você pode iniciar o contêiner e publicar sua instância do Gitlab localmente.
tr: Bu kurulumu yaptıktan sonra kapsayıcıyı başlatabilir ve GitLab kopyanızı yerel olarak yayınlayabilirsiniz.

source: Visit your Local Gitlab instance and set up your admin account. Choose a strong password, and configure user account limits to match your resources.
pt_br: Visite sua instância do Gitlab local e configure sua conta de administrador. Escolha uma senha forte e configure os limites da conta de usuário para corresponder aos seus recursos.
tr: Yerel GitLab kopyanızı ziyaret edin ve yönetici hesabınızı ayarlayın. Güçlü bir parola seçin ve kaynaklarınıza uygun kullanıcı hesabı sınırlamalarını yapılandırın.

source: Modify gitlab.rb(Optional, but a good idea for “Bridged non-anonymous” hosts)
pt_br: Modifique gitlab.rb (opcional, mas uma boa ideia para hosts “Bridged non-anonymous”)
tr: gitlab.rb dosyasını değiştirin (isteğe bağlı, ama "köprülenmiş anonim olmayan" sunucular için iyi bir fikir)

source: It’s also possible to apply your HTTP Proxy settings in a more granular way, so that you can only allow users to mirror repositories from the domains that you choose. Since the domain is presumably operated by an organization, you can use this to ensure that repositories that are mirrorable follow a reasonable set of policies. After all, there is far more abusive content on the non-anonymous internet than there is on I2P, we wouldn’t want to make it too easy to introduce abusive content from such a nefarious place.
pt_br: Também é possível aplicar suas configurações de Proxy HTTP de uma forma mais granular , para que você possa permitir que usuários espelhem repositórios apenas dos domínios que você escolher. Como o domínio é presumivelmente operado por uma organização , você pode usar isso para garantir que repositórios que são espelháveis sigam um conjunto razoável de políticas. Afinal, há muito mais conteúdo abusivo na internet não anônima do que no I2P, não gostaríamos de tornar muito fácil introduzir conteúdo abusivo de um lugar tão nefasto.
tr: HTTP vekil sunucu ayarlarınızı daha ayrıntılı bir şekilde de uygulayabilirsiniz. Böylece kullanıcıların yalnızca seçtiğiniz etki alanlarındaki depoları yansıtmasını sağlayabilirsiniz. Etki alanı muhtemelen bir kuruluş tarafından işletildiğinden, yansıtılabilir depoların makul bir ilke kümesine uymasını sağlamak için bunu kullanabilirsiniz. Ne de olsa, anonim olmayan İnternet üzerinde I2P üzerindekinden çok daha fazla taciz edici içerik var. Bu kadar kötü bir yerden taciz edici içeriğin sunulmasını çok kolaylaştırmak istemeyiz.

source: Add the following lines to your gitlab.rb file inside the /src/gitlab/config container. These settings will take effect when you restart in a moment.
pt_br: Adicione as seguintes linhas ao seu arquivo gitlab.rb dentro do contêiner /src/gitlab/config. Essas configurações entrarão em vigor quando você reiniciar em um momento.
tr: /src/gitlab/config kapsayıcısının içindeki gitlab.rb dosyanıza aşağıdaki satırları ekleyin. Bu ayarlar, biraz sonra yeniden başlattığınızda geçerlilik kazanacak.

source: Set up your Service tunnels and sign up for a Hostname
pt_br: Configure seus túneis de serviço e inscreva-se para um nome de host
tr: Hizmet tünellerinizi kurun ve bir sunucu adı kaydı yapın

source: Once you have Gitlab set up locally, go to the I2P Router console. You will need to set up two server tunnels, one leading to the Gitlab web(HTTP) interface on TCP port 8080, and one to the Gitlab SSH interface on TCP Port 8022.
pt_br: Depois que você tiver o Gitlab configurado localmente, vá para o console do I2P Router. Você precisará configurar dois túneis de servidor, um levando para a interface web(HTTP) do Gitlab na porta TCP 8080, e um para a interface SSH do Gitlab na porta TCP 8022.
tr: GitLab yerel olarak kurulduktan sonra, I2P yöneltici panosuna gidin. Biri 8080 TCP bağlantı noktası üzerindeki GitLab internet (HTTP) arabirimine ve diğeri 802 TCP bağlantı noktası üzerindeki GitLab SSH arabirimine gidişte iki sunucu tüneli kurmanız gerekecek.

source: Gitlab Web(HTTP) Interface
pt_br: Interface Web (HTTP) do Gitlab
tr: GitLab internet (HTTP) arabirimi

source: For the Web interface, use an “HTTP” server tunnel. From http://127.0.0.1:7657/i2ptunnelmgr launch the “New Tunnel Wizard” and enter the following values at each step:
pt_br: Para a interface Web, use um túnel de servidor “HTTP”. De http://127.0.0.1:7657/i2ptunnelmgr inicie o “New Tunnel Wizard” e insira os seguintes valores em cada etapa:
tr: İnternet arayüzü için bir “HTTP” sunucu tüneli kullanın. http://127.0.0.1:7657/i2ptunnelmgr adresinden “Yeni tünel yardımcısını” başlatın ve her adımda aşağıdaki şekilde ilerleyin:

source: Select “Server Tunnel”
pt_br: Selecione “Túnel do Servidor”
tr: “Sunucu tüneli" seçin

source: Select “HTTP Server”
pt_br: Selecione “Servidor HTTP”
tr: “HTTP sunucu” seçin

source: Fill in “Gitlab Web Service” or otherwise describe the tunnel
pt_br: Preencha “Gitlab Web Service” ou descreva o túnel de outra forma
tr: “GitLab internet hizmeti” yazın veya tünele başka bir ad verin

source: Fill in ``127.0.0.1`` for the host and ``8080`` for the port.
pt_br: Preencha ``127.0.0.1`` para o host e ``8080`` para a porta.
tr: Sunucu olarak ``127.0.0.1`` ve bağlantı noktası olarak ``8080`` yazın.

source: Select “Automatically start tunnel when Router Starts”
pt_br: Selecione “Iniciar túnel automaticamente quando o roteador iniciar”
tr: “Yöneltici başlatıldığında tünel de otomatik olarak başlatılsın” olarak seçin

source: Confirm your selections.
pt_br: Confirme suas seleções.
tr: Seçimlerinizi doğrulayın.

source: Register a Hostname(Optional)
pt_br: Registre um nome de host (opcional)
tr: Bir sunucu adı kaydedin (isteğe bağlı)

source: Web services on I2P can register hostnames for themselves by providing an authentication string to a jump service provider like `stats.i2p <http://stats.i2p>`__. To do this, open the http://127.0.0.1:7657/i2ptunnelmgr again and click on the “Gitlab Web Service” item you just set up. Scroll to the bottom of the “Edit Server Settings” section and click Registration Authentication. Copy the field that says “Authentication for adding Hostname” and visit `stats.i2p <http://stats.i2p/i2p/addkey.html>`__ to add your hostname. Note that if you want to use a subdomain(Like git.idk.i2p) then you will have to use the correct authentication string for your subdomain, which is a little bit more complicated and merits it’s own instructions.
pt_br: Os serviços da Web no I2P podem registrar nomes de host para si mesmos fornecendo uma string de autenticação para um provedor de serviços de salto como `stats.i2p <http://stats.i2p>`__. Para fazer isso, abra o http://127.0.0.1:7657/i2ptunnelmgr novamente e clique no item “Gitlab Web Service” que você acabou de configurar. Role até o final da seção “Edit Server Settings” e clique em Registration Authentication. Copie o campo que diz “Authentication for adding Hostname” e visite `stats.i2p <http://stats.i2p/i2p/addkey.html>`__ para adicionar seu nome de host. Observe que se você quiser usar um subdomínio (como git.idk.i2p), você terá que usar a string de autenticação correta para seu subdomínio, o que é um pouco mais complicado e merece suas próprias instruções.
tr: I2P üzerindeki internet hizmetleri, "stats.i2p <http://stats.i2p>"__ gibi bir atlama hizmeti sağlayıcısına bir kimlik doğrulama dizgesi göndererek kendilerinin sunucu adlarını kaydedebilir. Bunun için http://127.0.0.1:7657/i2ptunnelmgr dosyasını yeniden açın ve az önce kurduğunuz “GitLab internet hizmeti” ögesine tıklayın. "Sunucu ayarlarını düzenle" bölümünün en altına gidin ve kayıt kimlik doğrulaması üzerine tıklayın. Sunucu adı eklemek için kimlik doğrulaması yazan alanı kopyalayın ve sunucu adınızı eklemek için `stats.i2p <http://stats.i2p/i2p/addkey.html>`__ adresine gidin. Bir alt etki alanı kullanmak istiyorsanız (git.idk.i2p gibi) alt etki alanınız için doğru kimlik doğrulama dizgesini kullanmanız gerektiğini unutmayın. Bu işlem biraz daha karmaşıktır ve ayrı yönergeler yazılması gerekir.

source: Gitlab SSH Interface
pt_br: Interface SSH do Gitlab
tr: GitLab SSH Arayüzü
