Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: `C++ implementation i2pd`_ has SAM enabled by default.
pt_br: `Implementação C++ i2pd`_ tem SAM habilitado por padrão.
tr: `i2pd C++ uygulaması`_ üzerinde SAM varsayılan olarak etkinleştirilmiştir.

source: I've developed a handy Python library for SAM API called `i2plib`_. You can install it with pip or manually download the source code from GitHub.
pt_br: Eu desenvolvi uma biblioteca Python útil para a API SAM chamada `i2plib`_. Você pode instalá-la com pip ou baixar manualmente o código-fonte do GitHub.
tr: SAM API için 'i2plib'_ adlı kullanışlı bir Python kitaplığı geliştirdim. Pip ile kurabilir veya kaynak kodunu GitHub üzerinden el ile indirebilirsiniz.

source: This library works with the Python's built-in `asynchronous framework asyncio`_, so please note that code samples are taken from async functions (coroutines) which are running inside the event loop. Additional examples of i2plib usage can be found in the `source code repository`_.
pt_br: Esta biblioteca funciona com o `framework assíncrono asyncio`_ interno do Python, então observe que os exemplos de código são retirados de funções assíncronas (coroutines) que estão sendo executadas dentro do loop de eventos. Exemplos adicionais do uso do i2plib podem ser encontrados no `repositório de código-fonte`_.
tr: Bu kitaplık Python yerleşik 'asenkron çatısı asyncio'_ ile çalışır. Bu nedenle lütfen kod örneklerinin olay döngüsü içinde çalışan asenkron işlevlerden (eşyordamlar) alındığını unutmayın. i2plib kullanımına ilişkin ek örnekler `kaynak kod deposu`_ üzerinde bulunabilir.

source: I2P Destination and session creation ====================================
pt_br: Destino I2P e criação de sessão =====================================
tr: I2P hedefi ve oturumu oluşturmak ====================================

source: I2P destination is literally a set of encryption and cryptographic signature keys. Public keys from this set are published to the I2P network and are used to make connections instead of IP addresses.
pt_br: O destino I2P é literalmente um conjunto de chaves de criptografia e assinatura criptográfica . Chaves públicas desse conjunto são publicadas na rede I2P e são usadas para fazer conexões em vez de endereços IP.
tr: I2P hedefi, tam olarak bir şifreleme ve şifrelenmiş imza anahtarı kümesidir. Bu kümedeki herkese açık anahtarlar, I2P ağında yayınlanır ve bağlantı kurmak için IP adresleri yerine kullanılır.

source: This is how you create `i2plib.Destination`_:
pt_br: É assim que você cria `i2plib.Destination`_:
tr: `i2plib.Destination`_ ögesi şu şekilde oluşturulur:

source: base32 address is a hash which is used by other peers to discover your full Destination in the network. If you plan to use this destination as a permanent address in your program, save the binary data from *dest.private\_key.data* to a local file.
pt_br: endereço base32 é um hash que é usado por outros pares para descobrir seu destino completo na rede. Se você planeja usar esse destino como um endereço permanente em seu programa, salve os dados binários de *dest.private\_key.data* em um arquivo local.
tr: base32 adresi, ağdaki tam hedefinizi keşfetmek için diğer eşler tarafından kullanılan bir karmadır. Bu hedefi programınızda kalıcı bir adres olarak kullanmayı planlıyorsanız, *dest.private\_key.data* içindeki binary verileri yerel bir dosyaya kaydedin.

source: Now you can create a SAM session, which literally means to make the Destination online in I2P:
pt_br: Agora você pode criar uma sessão SAM, o que significa literalmente tornar o Destino online no I2P:
tr: Artık bir SAM oturumu oluşturabilirsiniz. Bu, tam olarak hedefi I2P ağında çevrimiçi yapmak anlamına gelir:

source: Important note here: Destination will remain online while *session\_writer* socket is kept open. If you wish to switch it off, you can call *session\_writer.close()*.
pt_br: Nota importante aqui: O destino permanecerá online enquanto o socket *session\_writer* for mantido aberto. Se você quiser desligá-lo, pode chamar *session\_writer.close()*.
tr: Buradaki önemli not: *session\_writer* soketi açık tutulurken hedef çevrimiçi kalır. Kapatmak isterseniz *session\_writer.close()* işlevini çağırabilirsiniz.

source: Making outgoing connections ===========================
pt_br: Fazendo conexões de saída ============================
tr: Gidiş bağlantılarının kurulması ===========================

source: Now when the Destination is online, you can use it to connect to other peers. For example, this is how you connect to "udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p", send HTTP GET request and read the response (it is "i2p-projekt.i2p" web server):
pt_br: Agora, quando o destino estiver online, você pode usá-lo para se conectar a outros pares. Por exemplo, é assim que você se conecta a "udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p", envia uma solicitação HTTP GET e lê a resposta (é o servidor web "i2p-projekt.i2p"):
tr: Artık hedef çevrimiçi olduğundan, onu diğer eşlere bağlanmak için kullanabilirsiniz. Örneğin, "udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p" adresine şu şekilde bağlantı kurulur, HTTP GET isteği gönderir ve yanıtı okursunuz ("i2p-projekt.i2p" site sunucusudur):

source: Accepting incoming connections ==============================
pt_br: Aceitando conexões de entrada ================================
tr: Geliş bağlantılarının kabul edilmesi ==============================

source: While making outgoing connections is trivial, when you accept connections there is one important detail. After a new client is connected, SAM API sends an ASCII string with base64-encoded client's Destination to the socket. Since Destination and data can come in one chunk, you should be aware of it.
pt_br: Embora fazer conexões de saída seja trivial, quando você aceita conexões, há um detalhe importante. Depois que um novo cliente é conectado, a API SAM envia uma string ASCII com o Destination do cliente codificado em base64 para o socket. Como o Destination e os dados podem vir em um bloco, você deve estar ciente disso.
tr: Gidiş bağlantıları kurmak önemsiz olsa da, geliş bağlantılarını kabul ettiğinizde önemli bir ayrıntı vardır. Yeni bir istemci bağlandıktan sonra, SAM API, base64 ile kodlanmış istemcinin hedefi ile bir ASCII dizgesini sokete gönderir. Hedef ve veriler bir yığın halinde gelebileceğinden, bunun farkında olmalısınız.

source: This is how a simple PING-PONG server looks like. It accepts incoming connection, saves client's Destination to a *remote\_destination* variable and sends back "PONG" string:
pt_br: É assim que um servidor PING-PONG simples se parece. Ele aceita a conexão de entrada , salva o Destino do cliente em uma variável *remote\_destination* e envia de volta a string "PONG":
tr: Basit bir PING-PONG sunucusu böyle görünür. Geliş bağlantısını kabul eder, müşterinin hedefini bir *remote\_destination* değişkenine kaydeder ve "PONG" dizgesini geri gönderir:

source: More info =========
pt_br: Mais informações =========
tr: Diğer bilgiler ===========

source: This article describes the usage of a TCP-like Streaming protocol. SAM API also provides a UDP-like protocol to send and receive datagrams. This feature will be added to i2plib later.
pt_br: Este artigo descreve o uso de um protocolo de streaming semelhante ao TCP. A API SAM também fornece um protocolo semelhante ao UDP para enviar e receber datagramas. Este recurso será adicionado ao i2plib mais tarde.
tr: Bu makalede, TCP benzeri bir akış iletişim kuralının kullanımı anlatılmaktadır. SAM API ayrıca veri şemalarını göndermek ve almak için UDP benzeri bir iletişim kuralı sağlar. Bu özellik daha sonra i2plib içine eklenecek.

source: This is just a basic information, but it's enough to start your own project with the use of I2P. Invisible Internet is a great tool to develop all kinds of privacy-aware applications. There are no design constraints by the network, those applications can be client-server as well as P2P.
pt_br: Esta é apenas uma informação básica, mas é o suficiente para começar seu próprio projeto com o uso de I2P. A Internet invisível é uma ótima ferramenta para desenvolver todos os tipos de aplicativos com consciência de privacidade. Não há restrições de design pela rede, esses aplicativos podem ser cliente-servidor, bem como P2P.
tr: Bunlar yalnızca temel bilgilerdir. Ancak I2P kullanarak kendi projenizi başlatmanız için yeterlidir. Invisible Internet Project, her türlü gizliliğe duyarlı uygulamayı geliştirmek için harika bir araçtır. Ağ tarafında herhangi bir tasarım kısıtlaması yoktur. Bu uygulamalar P2P ya da istemci-sunucu yapısında olabilir.

source: 0.9.38 Release
pt_br: Lançamento 0.9.38
tr: 0.9.38 sürümü yayınlandı

source: 0.9.38 with new setup wizard
pt_br: 0.9.38 com o novo instalador passo-a-passo
tr: 0.9.38 sürümü yeni kurulum yardımcısı ile yayınlandı.

source: 0.9.38 includes a new first-install wizard with a bandwidth tester. We've added support for the latest GeoIP database format. There's a new Firefox profile installer and a new, native Mac OSX installer on our website. Work continues on supporting the new "LS2" netdb format.
pt_br: A versão 0.9.38 inclui um novo assistente de primeira instalação com um testador de largura de banda. Nós adicionamos suporte ao formato mais recente de base de dados de GeoIP. Agora há um novo instalador de perfil do Firefox e um novo instalador nativo para Mac OSX no nosso website. O trabalho continua para dar suporte ao novo formato de BD de rede "LS2".
tr: 0.9.38 sürümünde bant genişliği sınaması da bulunan yeni bir kurulum yardımcısı var. Son GeoIP veri tabanı biçimi desteği eklendi. Sitemize yeni bir Firefox profili kurucusu ve yeni bir doğal Mac OS X kurucusu eklendi. Yeni "LS2" "Ağ veri tabanı" (NetDB) biçimini destekleme çalışmaları yapılıyor.

source: This release also contains plenty of bug fixes, including several issues with susimail attachments, and a fix for IPv6-only routers.
pt_br: Esta versão também contém muitas correções de bugs, incluindo vários problemas com anexos susimail e uma correção para roteadores somente IPv6.
tr: Bu sürümde ayrıca SusiMail ek dosyaları ile ilgili çeşitli sorunlar ve yalnızca IPv6 ile çalışan yönelticiler ile ilgili bir düzeltme gibi çok sayıda hata düzeltmesi yapıldı.

source: New setup wizard with bandwidth testing
pt_br: Novo assistente de configuração com teste de largura de banda
tr: Bant genişliği sınaması içeren yeni kurulum yardımcısı

source: New beta OSX installer
pt_br: Novo instalador beta do OSX
tr: Yeni OSX kurucu beta sürümü

source: New Firefox profile installer
pt_br: Novo instalador de perfil do Firefox
tr: Yeni Firefox profil kurucusu

source: Preliminary floodfill support for LS2
pt_br: Suporte preliminar de aterro para LS2
tr: LS2 için otomatik doldurma hazırlığı yapıldı

source: Sybil tool background analysis
pt_br: Análise de antecedentes da ferramenta Sybil
tr: Arka plan incelemesi için Sybil aracı

source: Add support for Maxmind GeoLite2 GeoIP format
pt_br: Adicionar suporte para o formato Maxmind GeoLite2 GeoIP
tr: Maxmind GeoLite2 GeoIP biçimi için destek eklendi

source: Switch JSON lib to json-simple, add Debian dependency
pt_br: Troque a biblioteca JSON para json-simple, adicione a dependência Debian
tr: JSON lib, json-simple olarak değiştirildi. Debian bağımlılığı eklendi

source: Fix RouterInfo publishing for IPv6-only routers
pt_br: Corrigir publicação do RouterInfo para roteadores somente IPv6
tr: Yalnızca IPv6 kullanan yönelticiler için "Yöneltici bilgileri" (RouterInfo) yayınlaması düzeltildi

source: I2CP error propagation fixes
pt_br: Correções de propagação de erro I2CP
tr: I2CP hata yayılımı düzeltildi

source: Fix rare NetDb deadlock
pt_br: Corrigir deadlock raro do NetDb
tr: Nadir görülen "Ağ veri tabanı" (NetDB) kilitlenmesi düzeltildi

source: Fix several bugs with susimail attachments
pt_br: Corrigir vários bugs com anexos do susimail
tr: Susimail ek dosyalarındaki birkaç hata düzeltildi

source: AppArmor fixes
pt_br: Correções do AppArmor
tr: AppArmor düzeltmeleri yapıldı

source: Refactoring to support LS2
pt_br: Refatoração para dar suporte ao LS2
tr: LS2 desteği sağlamak için kod elden geçirildi

source: Preliminary LS2 support in I2CP
pt_br: Suporte LS2 preliminar no I2CP
tr: I2CP LS2 desteği için hazırlık yapıldı

source: ShellCommand and UrlLauncher refactoring for security
pt_br: Refatoração de ShellCommand e UrlLauncher para segurança
tr: Güvenlik için ShellCommand and UrlLauncher kodu elden geçirildi

source: Split /peers page into tabs
pt_br: Dividir a página /peers em abas
tr: /peers sayfası sekmelere ayrıldı

source: New background for light theme
pt_br: Novo plano de fundo para tema claro
tr: Açık tema için yeni arka plan eklendi

source: I2P Laboratory
pt_br: Laboratório da I2P
tr: I2P laboratuvarı

source: I2P Laboratory - Home For Experimental Projects
pt_br: Laboratório I2P - Casa para Projetos Experimentais
tr: I2P Laboratuvarı - Deneysel Projeler Evi

source: Hello everyone,
pt_br: Olá pessoal,
tr: Merhaba herkes,

source: There are many projects in the I2P world that we are excited about, but not all of them are ready for prime-time. We decided to create a place where we can make those available for anyone interested in trying them out, that will serve as proving grounds for projects that may one day become official I2P products. This place is the `I2P Laboratory`_.
pt_br: Há muitos projetos no mundo I2P que nos entusiasmam, mas nem todos estão prontos para o horário nobre. Decidimos criar um lugar onde podemos disponibilizá-los para qualquer um interessado em experimentá-los, que servirá como campo de provas para projetos que podem um dia se tornar produtos oficiais I2P. Este lugar é o `I2P Laboratory`_.
tr: I2P dünyasında heyecan duyduğumuz birçok proje var, ancak hepsi sunulmaya hazır değil. Bunları denemek isteyen herkese sunabileceğimiz ve bir gün resmi I2P ürünleri haline gelebilecek projeler için kavram kanıtlama alanı olarak hizmet edecek bir yer oluşturmaya karar verdik. Adını da `I2P Laboratuvarı`_ koyduk.

source: In the lab we will be offering downoads ready for you to try. Keep in mind that they are not going to be "release" quality, and some may not even be "beta" quality. We do not offer official support for them. Any of the lab projects may get discontinued at any time.
pt_br: No laboratório, ofereceremos downloads prontos para você experimentar. Tenha em mente que eles não serão de qualidade de "lançamento" e alguns podem nem mesmo ser de qualidade "beta". Não oferecemos suporte oficial para eles. Qualquer um dos projetos do laboratório pode ser descontinuado a qualquer momento.
tr: Laboratuarda denemeye hazır indirmeler sunacağız. Bunların "yayın" kalitesinde olmayacağını ve bazılarının "beta" kalitesinde bile olmayabileceğini unutmayın. Bu projeler için resmi destek vermiyoruz. Laboratuvar projelerinden herhangi biri herhangi bir zamanda durdurulabilir.

source: If you are feeling adventurous we invite you to try our ideas. We welcome your feedback at the `I2P Lab Forum`_.
pt_br: Se você estiver se sentindo aventureiro, convidamos você a experimentar nossas ideias. Agradecemos seu feedback no `I2P Lab Forum`_.
tr: Kendinizi maceraya atılmaya hazır hissediyorsanız, sizi fikirlerimizi denemeye davet ediyoruz. Görüşlerinizi `I2P Laboratuvar Forumu`_ üzerinde yazabilirsiniz.

source: 0.9.39 Release
pt_br: Lançamento 0.9.39
tr: 0.9.39 sürümü yayınlandı

source: 0.9.39 with performance improvements
pt_br: 0.9.39 com melhorias de desempenho
tr: 0.9.39 sürümü başarım iyileştirmeleri ile yayınlandı.

source: 0.9.39 includes extensive changes for the new network database types (proposal 123). We've bundled the i2pcontrol plugin as a webapp to support development of RPC applications. There are numerous performance improvements and bug fixes.
pt_br: 0.9.39 inclui mudanças extensas para os novos tipos de base de dados da rede (proposta 123) Nós empacotamos o plugin i2pcontrol como um webapp para suportar o desenvolvimento de aplicações RPC. Há numerosas melhorias de desempenho e correções de bugs.
tr: 0.9.39 sürümünde yeni ağ veri tabanı türleri (123 numaralı öneri) ile ilgili pek çok değişiklik yapıldı. RPC uygulamalarının geliştirilmesini desteklemek için i2pcontrol uygulama eki bir internet uygulaması olarak eklendi. Çeşitli başarım iyileştirmeleri ve hata düzeltmeleri yapıldı.

source: We've removed the midnight and classic themes to reduce the maintenance burden; previous users of those themes will now see the dark or light theme. There's also new home page icons, a first step in updating the console.
pt_br: Nós removemos os temas clássico e meia-noite para reduzir a carga de manutenção; usuários prévios desses temas agora verão os temas escuro ou claro. Também há novos ícones na página inicial, um primeiro passo na atualização do console.
tr: Bakım yükünü azaltmak için Gece Yarısı ve Klasik temaları kaldırıldı. Daha önce bu temaları kullanan kullanıcılar koyu ya da açık temayı seçebilir. Ayrıca yeni ana sayfa simgeleri ve ilk pano güncelleme adımı eklendi.

source: I2PControl RPC plugin bundled as a webapp
pt_br: Plugin I2PControl RPC empacotado como um webapp
tr: Bir internet uygulaması olarak paketlenmiş I2PControl RPC uygulama eki

source: Encrypted LS2 support in floodfills (proposal 123)
pt_br: Suporte LS2 criptografado em aterros (proposta 123)
tr: Otomatik doldurmada şifrelenmiş LS2 desteği eklendi (123 numaralı öneri)

source: New option to disable NTCP1
pt_br: Nova opção para desabilitar NTCP1
tr: NTCP1 özelliğini devre dışı bırakma seçeneği eklendi

source: Add offline key support in streaming
pt_br: Adicionar suporte de chave offline em streaming
tr: Akışa çevrimdışı anahtar desteği eklendi

source: Numerous LS2 fixes (proposal 123)
pt_br: Várias correções LS2 (proposta 123)
tr: Çeşitli LS2 düzeltmeleri yapıldı (123 numaralı öneri)

source: Fixes for NTCP only (SSU disabled)
pt_br: Correções somente para NTCP (SSU desabilitado)
tr: Yalnızca NTCP için düzeltmeler yapıldı (SSU devre dışı)

source: Proxy fixes for websockets
pt_br: Correções de proxy para websockets
tr: İnternet soketleri için vekil sunucu düzeltmeleri yapıldı

source: Streaming fix for sending expired messages
pt_br: Correção de streaming para envio de mensagens expiradas
tr: Süresi dolmuş iletileri göndermek için akış düzeltmesi yapıldı

source: SSU RTO/RTT calculation fixes
pt_br: Correções de cálculo SSU RTO/RTT
tr: SSU RTO/RTT hesaplama düzeltmeleri yapıldı

source: UPnP startup fixes
pt_br: Correções de inicialização UPnP
tr: UPnP başlatma düzeltmeleri yapıldı

source: Fix connectivity test at startup
pt_br: Corrigir teste de conectividade na inicialização
tr: Başlangıçta bağlantı sınaması düzeltildi

source: Remove classic and midnight themes
pt_br: Remover temas clássicos e de meia-noite
tr: Klasik ve gece yarısı temaları kaldırıldı

source: New console home page icons
pt_br: Novos ícones da página inicial do console
tr: Yeni pano açılış sayfası simgeleri

source: Caching of outproxy selection
pt_br: Armazenamento em cache da seleção de outproxy
tr: Çıkış vekil sunucusu seçimi ön belleğe alındı

source: Faster startup for i2ptunnel
pt_br: Inicialização mais rápida para i2ptunnel
tr: i2ptunnel daha hızlı başlayacak şekilde güncellendi

source: 0.9.40 Release
pt_br: Lançamento 0.9.40
tr: 0.9.40 sürümü yayınlandı

source: 0.9.40 with new icons
pt_br: 0.9.40 com novos ícones
tr: 0.9.40 sürümü yeni simgeler ile yayınlandı

source: 0.9.40 includes support for the new encrypted leaseset format. We disabled the old NTCP 1 transport protocol. There's a new SusiDNS import feature, and a new scripted filtering mechanism for incoming connections.
pt_br: 0.9.40 inclui suporte para o novo formato de leaseset criptografado. Nós desativamos o antigo protocolo de transporte NTCP1. Há um novo recurso de importação SusiDNS, e um novo mecanismo de filtro automatizado para conexões de entrada.
tr: 0.9.40 sürümünde yeni "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) biçimi destekleniyor. Eski NTCP 1 taşıyıcı iletişim kuralı devre dışı bırakıldı. Yeni SusiDNS içe aktarma özelliği ve geliş bağlantıları için yeni betik ile süzme yöntemi eklendi.

source: We've made a lot of improvements to the OSX native installer, and we've updated the IzPack installer as well. The work continues on refreshing the console with new icons. As usual, we've fixed lots of bugs as well!
pt_br: Fizemos muitas melhorias no instalador nativo do OSX e também atualizamos o instalador do IzPack. O trabalho continua na atualização do console com novos ícones. Como de costume, também corrigimos muitos bugs!
tr: OSX doğal kurucusu üzerinde birçok geliştirme yapıldı ve IzPack kurucusu da güncellendi. Pano simgelerini yenileme çalışması sürüyor. Her zamanki gibi pek çok hata düzeltildi.

source: Change installer to IzPack 5.1.3
pt_br: Alterar instalador para IzPack 5.1.3
tr: Kurucu IzPack 5.1.3 sürümüne güncellendi

source: Change Windows installer from launch4j to izpack2exe
pt_br: Alterar o instalador do Windows de launch4j para izpack2exe
tr: Windows kurucusu launch4j yerine izpack2exe kullanacak şekilde değiştirildi

source: Sign Windows installer
pt_br: Assinar instalador do Windows
tr: Windows kurucusu imzalandı

source: Console, SusiDNS: New icons
pt_br: Console, SusiDNS: Novos ícones
tr: Pano, SusiDNS: Yeni simgeler

source: Disable NTCP 1
pt_br: Desabilitar NTCP 1
tr: NTCP 1 devre dışı bırakıldı

source: New SusiDNS import feature
pt_br: Novo recurso de importação SusiDNS
tr: Yeni SusiDNS içe aktarma özelliği eklendi

source: Add UI and router support for Encrypted LS2 (proposal 123)
pt_br: Adicionar suporte de interface de usuário e roteador para LS2 criptografado (proposta 123)
tr: Şifrelenmiş LS2 için kullanıcı arayüzü ve yöneltici desteği eklendi (123 numaralı öneri)

source: Add support for new base 32 format for Encrypted LS2
pt_br: Adicionar suporte para novo formato base 32 para LS2 criptografado
tr: Şifrelenmiş LS2 için yeni base 32 biçimi desteği eklendi

source: New incoming connection filter for i2ptunnel
pt_br: Novo filtro de conexão de entrada para i2ptunnel
tr: i2ptunnel için yeni geliş bağlantısı süzgeci

source: Add Red25519 signature type option for server tunnels
pt_br: Adicionar opção de tipo de assinatura Red25519 para túneis de servidor
tr: Sunucu tünelleri için Red25519 imza türü seçeneği eklendi

source: OSX: Theme selection, auto updater, upgrade to newer swift version
pt_br: OSX: Seleção de tema, atualizador automático, atualização para versão mais recente do Swift
tr: OSX: Tema seçimi, otomatik güncelleyici, daha yeni Swift sürümü

source: Several fixes for Android
pt_br: Várias correções para Android
tr: Android için birkaç düzeltme yapıldı

source: Fixes for SSU disabled (NTCP only)
pt_br: Correções para SSU desabilitado (somente NTCP)
tr: SSU devre dışı bırakılması için düzeltmeler yapıldı (yalnızca NTCP)

source: Fixes for encrypted LS2 (proposal 123)
pt_br: Correções para LS2 criptografado (proposta 123)
tr: Şifrelenmiş LS2 için düzeltmeler yapıldı (123 numaralı öneri)

source: Fix for rare 100% CPU in NTCP
pt_br: Correção para raro 100% de CPU em NTCP
tr: Nadir görülen NTCP %100 işlemci kullanımı için düzeltme

source: Fixes for NTCP 1 disabled
pt_br: Correções para NTCP 1 desabilitado
tr: NTCP 1 devre dışı bırakmak için düzeltmeler yapıldı

source: New supported Docker image
pt_br: Nova imagem Docker suportada
tr: Yeni desteklenen Docker görseli

source: Support for SAM 3.2 features in SAM libraries
pt_br: Suporte para recursos do SAM 3.2 em bibliotecas SAM
tr: SAM kitaplıklarına SAM 3.2 özellikleri için destek eklendi
