Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: For eepSites, you will need to create an HTTP Server Tunnel. This is an I2P destination with a few special features for hosting HTTP services to enable things like rate-limiting, filtering, and the inclusion of headers to identify the destination of the client to the server. These enable flexibility in how you handle connections in terms of load-balancing and rate-limiting on a case-by-case basis, among other things. Explore these options and how they relate to the applications which you considered in step one, even though a very simple setup is easy, larger sites may benefit from taking advantage of these features.
pt_br: Para eepSites, você precisará criar um Túnel de Servidor HTTP. Este é um destino I2P com alguns recursos especiais para hospedar serviços HTTP para habilitar coisas como limitação de taxa, filtragem e inclusão de cabeçalhos para identificar o destino do cliente para o servidor. Isso permite flexibilidade em como você lida com conexões em termos de balanceamento de carga e limitação de taxa em caso a caso, entre outras coisas. Explore essas opções e como elas se relacionam com os aplicativos que você considerou na etapa um, embora uma configuração muito simples seja fácil, sites maiores podem se beneficiar ao aproveitar esses recursos.
tr: eepSites için bir HTTP sunucu tüneli oluşturmanız gerekir. Bu tünel, hız sınırlaması, süzme ve istemcinin sunucuya hedefini belirlemek için üst bilgilerin katılması gibi HTTP hizmetleri barındırmaya özel bazı özelliklere sahip bir I2P hedefidir. Bu özellikler, diğer pek çok şeyin yanında, duruma göre yük dengeleme ve hız sınırlama açısından bağlantıların yöneltilmesinde esneklik sağlar. Bu seçenekleri ve birinci adımda düşündüğünüz uygulamalarla nasıl ilişkili olduklarını keşfedin. Kurulum çok kolay olsa da, büyük siteler bu özelliklerden yararlanabilir.

source: Create an HTTP Tunnel for your application
pt_br: Crie um túnel HTTP para seu aplicativo
tr: Uygulamanız için bir HTTP tüneli oluşturun

source: If you've configured a reverse proxy or an SSH tunnel before, then the general idea here should be very familiar to you. I2PTunnel, in essence, is just forwarding ports from the host to the I2P Network. To set this up using the web interface, go to the I2PTunnel configuration page.
pt_br: Se você configurou um proxy reverso ou um túnel SSH antes, então a ideia geral aqui deve ser bem familiar para você. O I2PTunnel, em essência, é apenas encaminhando portas do host para a rede I2P. Para configurar isso usando a interface web , vá para a página de configuração do I2PTunnel.
tr: Daha önce bir ters vekil sunucu veya SSH tüneli yapılandırdıysanız, buradaki genel fikir size çok tanıdık gelecektir. I2PTunnel, özünde, yalnızca sunuculardan I2P ağına bağlantı noktaları iletir. Bunu internet arayüzünü kullanarak ayarlamak için I2PTunnel yapılandırma sayfasına gidin.

source: At the bottom of the "I2P Hidden Services" section of the page, select an HTTP Service from the drop-down and click "Create."
pt_br: Na parte inferior da seção "Serviços ocultos I2P" da página, selecione um serviço HTTP no menu suspenso e clique em "Criar".
tr: Sayfanın "I2P gizli hizmetleri" bölümünün altında, açılır menüden bir HTTP hizmeti seçin ve "Oluştur" üzerine tıklayın.

source: It will immediately drop you into the granular tunnel configuration page, which we're about to explore from top-to-bottom. The first, most essential settings are the tunnel name and the target host:port. **The target host:port is** **the place where you input the address of the service you are forwarding to** **I2P**. Once you've configured that, your web site will become available over i2p. However, there are probably a few things that we can improve.
pt_br: Ele irá imediatamente colocá-lo na página de configuração granular do túnel, que estamos prestes a explorar de cima para baixo. As primeiras configurações mais essenciais são o nome do túnel e o host:porta de destino. **O host:porta de destino é** **o lugar onde você insere o endereço do serviço para o qual está encaminhando** **I2P**. Depois de configurar isso, seu site ficará disponível em i2p. No entanto, provavelmente há algumas coisas que podemos melhorar.
tr: Böylece baştan sona keşfetmek üzere olduğumuz ayrıntılı tünel yapılandırma sayfasına gideceksiniz. Öncelikle, en önemli ayarlar tünel adı ve hedef sunucu:bağlantı noktasıdır. **Hedef sunucu:bağlantı noktası** **trafiği ilettiğiniz hizmetin adresini yazdığınız yer** **I2P**. Bunu yapılandırdıktan sonra siteniz i2p ağında kullanılabilir olur. Bununla birlikte, büyük olasılıkla geliştirebileceğimiz birkaç şey var.

source: Next, you may want to pick a hostname to use for your eepSite. This hostname doesn't need to be universally unique, for now, it will only be used locally. We'll publish it to an address helper later. **If** the *Local Destination* field isn't populated with your Base64 Destination yet, you should scroll down to the bottom, save the tunnel configuration, and return to the tunnel configuration.
pt_br: Em seguida, você pode querer escolher um nome de host para usar no seu eepSite. Este nome de host não precisa ser universalmente único, por enquanto, ele só será usado localmente. Nós o publicaremos em um ajudante de endereço mais tarde. **Se** o campo *Destino Local* ainda não estiver preenchido com seu Destino Base64, você deve rolar para baixo até o final, salvar a configuração do túnel e retornar à configuração do túnel .
tr: Ardından, eepSite için kullanmak üzere bir sunucu adı seçmek isteyebilirsiniz. Bu sunucu adının evrensel olarak benzersiz olması gerekmez, şimdilik yalnızca yerel olarak kullanılacaktır. Daha sonra bir adres yardımcısında yayınlayacağız. ***Yerel hedef* alanı henüz Base64 hedefinizle doldurulmamışsa, aşağıya doğru kaydırmanız, tünel yapılandırmasını kaydetmeniz ve tünel yapılandırmasına geri dönmeniz gerekir.

source: A little further down the configuration page, the tunnel options are available. Since you've got a site which is not intended to be anonymous, but rather to provide anonymous access to others by an alternate gateway, it may be good to reduce the number of hops the tunnel takes on the I2P network.
pt_br: Um pouco mais abaixo na página de configuração, as opções de túnel estão disponíveis. Como você tem um site que não foi criado para ser anônimo, mas sim para fornecer acesso anônimo a outros por um gateway alternativo, pode ser bom reduzir o número de saltos que o túnel realiza na rede I2P.
tr: Yapılandırma sayfasının biraz altında tünel seçenekleri bulunur. Anonim olması amaçlanmayan, bunun yerine alternatif bir ağ geçidi aracılığıyla başkalarına anonim erişim sağlayan bir siteniz olduğundan, tünelin I2P ağında kullandığı durak sayısını azaltmak iyi olabilir.

source: Next are the encrypted leaseset options. You can probably leave these as the defaults, since your site isn't anonymous it probably doesn't need features like blinding or encrypted leasesets. If you were to choose encrypted leasesets, you would not be accessible to anyone unless you shared a key with them in advance.
pt_br: Em seguida, estão as opções de leaseset criptografado. Você provavelmente pode deixá-las como os padrões , já que seu site não é anônimo, ele provavelmente não precisa de recursos como blinding ou leasesets criptografados. Se você escolhesse leasesets criptografados, você não seria acessível a ninguém, a menos que você compartilhasse uma chave com eles com antecedência.
tr: Sonraki, "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) seçenekleridir. Siteniz anonim olmadığı için bunları varsayılan değerlerinde bırakabilirsiniz. Büyük olasılıkla körleme veya "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) gibi özelliklere gerek duyulmayacak. "Şifrelenmiş kiralama kümelerini" (EncryptedLeaseSets) seçecek olsaydınız, önceden bir anahtar paylaşmadıkça kimse size erişemezdi.

source: The next few parts may be especially useful to you if you run a high-traffic site or find yourself subject to DDOS attacks. Here you can configure various kinds of connection limits.
pt_br: As próximas partes podem ser especialmente úteis para você se você administra um site de alto tráfego ou se encontra sujeito a ataques DDOS. Aqui você pode configurar vários tipos de limites de conexão.
tr: Sonraki birkaç bölüm, özellikle yüksek trafikli bir site işletiyorsanız veya DDOS saldırılarına maruz kalıyorsanız sizin için yararlı olabilir. Buradan çeşitli bağlantı sınırlamalarını yapılandırabilirsiniz.

source: After that, there are a few other ways of filtering connections by client characteristics. First, you can block access via inproxies like I2P.to and similar. Since you have a clearnet presence already, changing this may be better if you want to encourage I2P users to only use your eepSite. You can also block accesses via specific user-agents, for instance blocking wget may be helpful if you want to prevent spidering. Finally, and of particular interest to Fail2Ban users, the "Unique local address per client" will give each client it's own local IP address instead of them all appearing to the server to be from 127.0.0.1.
pt_br: Depois disso, há algumas outras maneiras de filtrar conexões por características do cliente . Primeiro, você pode bloquear o acesso via inproxies como I2P.to e similares. Como você já tem uma presença clearnet, mudar isso pode ser melhor se você quiser encorajar usuários I2P a usar somente seu eepSite. Você também pode bloquear acessos via user-agents específicos, por exemplo, bloquear wget pode ser útil se você quiser evitar spidering. Finalmente, e de particular interesse para usuários do Fail2Ban , o "Endereço local exclusivo por cliente" dará a cada cliente seu próprio endereço IP local em vez de todos eles aparecerem para o servidor como sendo de 127.0.0.1.
tr: Bundan sonra, bağlantıları istemci özelliklerine göre süzmenin birkaç yolu daha vardır. İlk olarak, I2P.to ve benzeri gibi giriş vekil sunucuları aracılığıyla erişimi engelleyebilirsiniz. Halihazırda herkesin erişebileceği İnternet üzerinde bir varlığınız olduğundan, yalnızca I2P kullanıcılarını eepSite hizmetinizi kullanmaya yönlendirmek istiyorsanız bunu değiştirmek daha iyi olabilir. Ayrıca belirli kullanıcı uygulamarının erişimini de engelleyebilirsiniz. Örneğin örümcek ağlarını önlemek istiyorsanız wget engellemesi yardımcı olabilir. Son olarak ve özellikle Fail2Ban kullanıcılarının ilgisini çeken "Benzersiz istemci yerel adresi", tüm istemcilere hepsi için 127.0.0.1 sunucu adresini vermek yerine her istemciye kendi yerel IP adresini verecektir.

source: You can probably leave these next few options to the defaults.
pt_br: Você provavelmente pode deixar essas próximas opções como padrão.
tr: Büyük olasılıkla sonraki birkaç seçeneği varsayılan değerlerinde bırakabilirsiniz.

source: Lastly, you can set up an advanced filter definition. Writing filters is beyond what I'm prepared to do in this document, for more information see the format specification for now.
pt_br: Por fim, você pode configurar uma definição de filtro avançada. Escrever filtros está além do que estou preparado para fazer neste documento, para mais informações veja a especificação do formato por enquanto.
tr: Son olarak, gelişmiş bir süzgeç tanımı yapabilirsiniz. Süzgeç yazmak, bu belgeyi hazırlama amacımın dışına çıkıyor. Ayrıntılı bilgi almak için şimdilik biçim belirtimine bakın.

source: Multi-Home an Application
pt_br: Multi-Home uma Aplicação
tr: Birden Çok Barındırma Uygulaması

source: One interesting thing that I2P can do is host the same site on multiple servers at the same time transparently, which is referred to as "Multihoming." In order to multihome your application, you will need to return to the tunnel menu and change the location of your private key file to it's own, non-shared location.
pt_br: Uma coisa interessante que o I2P pode fazer é hospedar o mesmo site em vários servidores ao mesmo tempo de forma transparente, o que é conhecido como "Multihoming". Para multihoming seu aplicativo, você precisará retornar ao menu do túnel e alterar o local do seu arquivo de chave privada para seu próprio local não compartilhado.
tr: I2P ağında yapılabilecek ilginç bir şey, aynı siteyi aynı anda birden fazla sunucuda saydam bir şekilde barındırmaktır ve buna "Birden çok barındırma" denir. Uygulamanızda birden çok barındırma kullanmak için tünel menüsüne dönmeniz ve özel anahtar dosyanızın konumunu kendi, paylaşılmayan konumunuz ile değiştirmeniz gerekecektir.

source: When you're done, copy the new key file for your new multihomed service to a storage device. Now, you can re-produce your service/tunnel configuration with those same keys on any I2P router and increase your service's redundancy.
pt_br: Quando terminar, copie o novo arquivo de chave para seu novo serviço multihomed para um dispositivo de armazenamento . Agora, você pode reproduzir sua configuração de serviço/túnel com essas mesmas chaves em qualquer roteador I2P e aumentar a redundância do seu serviço.
tr: İşlemi tamamladıktan sonra, yeni birden çok bağlantılı hizmetiniz için yeni anahtar dosyasını bir depolama aygıtına kopyalayın. Artık herhangi bir I2P yönelticide aynı anahtarlarla hizmet/tünel yapılandırmanızı yeniden üretebilir ve hizmetinizin yedekliliğini artırabilirsiniz.

source: Step four: Publicize and Authenticate your eepSite
pt_br: Etapa quatro: divulgue e autentique seu eepSite
tr: Dördüncü adım: eepSite tanıtma ve doğrulama

source: Since you're running an anonymously accessible instance of an existing clear-net service, you'll probably want to leverage some existing form of trust to distribute your eepSite URL, like a TLS Certificate signed by a recognized and reputable authority. What can I say we live in an imperfect world.
pt_br: Como você está executando uma instância anonimamente acessível de um serviço clear-net existente, você provavelmente vai querer alavancar alguma forma existente de confiança para distribuir sua URL eepSite, como um Certificado TLS assinado por uma autoridade reconhecida e respeitável. O que posso dizer, vivemos em um mundo imperfeito.
tr: Var olan bir herkese açık İnternet hizmetinin anonim olarak erişilebilen bir kopyasını çalıştırdığınız için, eepSite adresinizi dağıtmak için tanınmış ve saygın bir yetkili tarafından imzalanmış bir TLS Sertifikası gibi bazı güvenilirlik biçimlerinden yararlanmak isteyeceksiniz. Buna diyebilecek bir şey yok mükemmel olmayan bir dünyada yaşıyoruz.

source: Place your .b32.i2p link on your clearnet page
pt_br: Coloque seu link .b32.i2p na sua página clearnet
tr: .b32.i2p bağlantınızı herkese açık İnternet sayfanıza ekleyin

source: The simplest way to provide a link to your eepSite using an existing site to distribute the link is to distribute a so-called "Base32" address. The Base32 address is the hash of the public key of your I2P destination, so it cannot be forged if it is provided by a reliable source. In the case of a clear-net site with a hidden service presence, one of those places is likely to be that clear-net site.
pt_br: A maneira mais simples de fornecer um link para seu eepSite usando um site existente para distribuir o link é distribuir um endereço chamado "Base32". O endereço Base32 é o hash da chave pública do seu destino I2P, então ele não pode ser forjado se for fornecido por uma fonte confiável. No caso de um site de rede limpa com uma presença de serviço oculta, um desses lugares provavelmente será o site de rede limpa .
tr: Var olan bir siteyi kullanarak bağlantıyı dağıtmanın ve eepSite ile bağlantı kurmanın en basit yolu, "Base32" adı verilen bir adresi yayınlamaktır. Base32 adresi, I2P hedefinizin ortak anahtarının karma değeridir. Bu nedenle güvenilir bir kaynak tarafından sağlanıyorsa sahte olamaz. Bir gizli hizmetin herkese açık İnternet üzerinde bir sitesi varsa, güvenilir kaynak olarak bu site kullanılabilir.

source: Your base32 address is visible on the main i2ptunnel configuration page and it looks like this:
pt_br: Seu endereço base32 está visível na página principal de configuração do i2ptunnel e se parece com isto:
tr: Base32 adresiniz i2ptunnel yapılandırma sayfasında şöyle görüntülenir:

source: Your users can copy-and-paste this link directly into their I2P browsers and it will just work, no additional configuration required.
pt_br: Seus usuários podem copiar e colar este link diretamente em seus navegadores I2P e ele funcionará, sem necessidade de configuração adicional.
tr: Kullanıcılarınız bu bağlantıyı kopyalayıp doğrudan kendi I2P tarayıcılarına yapıştırabilir. Başka bir yapılandırma gerekmeden çalışır.

source: Distributing an "Addresshelper" link from your clearnet page
pt_br: Distribuindo um link "Addresshelper" da sua página clearnet
tr: Herkese açık İnternet sayfanızdan bir "Adres yardımcısı" bağlantısını dağıtmak

source: You can also distribute a human-readable link to suggest to your potential users by taking advantage of I2P's "Address Book" feature, which allows the users to decide to assign a human-readable domain name to your cryptographically assured identity. You can do this by distributing a specially crafted link containing the domain name that you want to suggest, followed by a slash, followed by ?i2paddresshelper=, followed by the Local Destination of the tunnel you just created, which you can see here:
pt_br: Você também pode distribuir um link legível para sugerir aos seus usuários em potencial aproveitando o recurso "Address Book" do I2P, que permite que os usuários decidam atribuir um nome de domínio legível para sua identidade criptograficamente garantida. Você pode fazer isso distribuindo um link especialmente criado contendo o nome de domínio que você deseja sugerir, seguido por uma barra, seguido por ?i2paddresshelper=, seguido pelo Destino Local do túnel que você acabou de criar, que você pode ver aqui:
tr: Ayrıca I2P "Adres defteri" özelliğinden yararlanarak potansiyel kullanıcılarınıza önerebileceğiniz insan tarafından okunabilir bir bağlantı yayınlayabilirsiniz. Böylece, şifrelenerek güvence altına alınmış kimliğinize insan tarafından okunabilir bir etki alanı adı atayabilirsiniz. Bunun için, önermek istediğiniz etki alanı adı, ardına bir bölü karakteri, ardına ?i2paddresshelper= ve ardına yeni oluşturduğunuz tünelin yerel hedefini ekleyerek oluşturduğunuz bağlantı dizgesini yayınlayabilirsiniz. Şuradan görebilirsiniz:

source: So, for the example site, such a link would point to this address
pt_br: Então, para o site de exemplo, tal link apontaria para este endereço
tr: Örnek bir site için böyle bir bağlantı adresi şöyle olur

source: I keep saying suggest because when the such a link is visited, I2P asks for the user's consent to add this human-readable name to the user's local address book. That means there is no expectation that this domain be universally agreed upon by all visitors on the I2P network, whereas in the case of base32 addresses, the opposite is true.
pt_br: Continuo dizendo sugerir porque quando tal link é visitado, o I2P pede o consentimento do usuário para adicionar este nome legível por humanos ao catálogo de endereços local do usuário. Isso significa que não há expectativa de que este domínio seja universalmente aceito por todos os visitantes na rede I2P, enquanto no caso de endereços base32, o oposto é verdadeiro.
tr: Önermek ifadesini kullanıyorum çünkü böyle bir bağlantı ziyaret edildiğinde I2P, bu insan tarafından okunabilir adı kullanıcının yerel adres defterine eklemek için kullanıcının onayını ister. Bu durum, bu etki alanının I2P ağındaki tüm ziyaretçiler tarafından evrensel olarak kabul edilmesi beklentisi olmadığı anlamına gelir, ancak base32 adresleri söz konusu olduğunda bunun tersi geçerlidir.

source: Registering with an Addresshelper service
pt_br: Registrando-se em um serviço Addresshelper
tr: Bir adres yardımcısı hizmetine kaydolmak

source: Nonetheless, there do exist publicly available address subscription feeds, and special services for discovering new human-readable addresses, such as no.i2p, inr.i2p, and stats.i2p. These are sometimes known as Address helpers or Jump Services, and can also be subscribed to automatically. This may be espescially helpful to users of your service who wish to acquire the address without leaving I2P or visiting your clearnet service.
pt_br: No entanto, existem feeds de assinatura de endereços disponíveis publicamente e serviços especiais para descobrir novos endereços legíveis por humanos, como no.i2p, inr.i2p e stats.i2p. Às vezes, eles são conhecidos como ajudantes de endereço ou Jump Services e também podem ser assinados automaticamente. Isso pode ser especialmente útil para usuários do seu serviço que desejam adquirir o endereço sem sair do I2P ou visitar seu serviço clearnet.
tr: Bununla birlikte, yeni adresleri keşfetmek için herkese açık adres aboneliği akışları ve no.i2p, inr.i2p ve stats.i2p gibi insan tarafından okunabilen özel hizmetler vardır. Bunlar bazen adres yardımcıları veya Jump hizmetleri olarak bilinir ve otomatik olarak abone olunabilir. Böylece, özellikle I2P ağından çıkmadan veya herkese açık İnternet hizmetinizi ziyaret etmeden adresi almak isteyen hizmet kullanıcılarına kolaylık sağlanabilir.

source: Register a name with stats.i2p
pt_br: Registre um nome com stats.i2p
tr: stats.i2p ile bir ad kaydedin

source: Register a new name with inr.i2p
pt_br: Registre um novo nome com inr.i2p
tr: inr.i2p ile yeni bir ad kaydedin

source: See Also:
pt_br: Veja também:
tr: Ayrıca şunlara bakabilirsiniz:

source: Most of the security issues of hosting Tor hidden services also apply to I2P. It would be advisable to take advantage of their resources as well as this one:
pt_br: A maioria dos problemas de segurança de hospedagem de serviços ocultos do Tor também se aplicam ao I2P. Seria aconselhável aproveitar os recursos deles, assim como este:
tr: Tor gizli hizmetleri barındırmayla ilgili güvenlik sorunlarının çoğu, I2P için de geçerlidir. Bu kaynakların yanında Tor kaynaklarından da yararlanmanız önerilir:

source: Misc Links
pt_br: Links diversos
tr: Çeşitli bağlantılar

source: Official Guide
pt_br: Guia Oficial
tr: Resmi rehber

source: Riseup best Practices
pt_br: Melhores práticas do Riseup
tr: En iyi Riseup örnekleri

source: Blog about config fails
pt_br: Blog sobre falhas de configuração
tr: Yapılandırma hataları ile ilgili günlük yazıları

source: Whonix Docs Onion Service
pt_br: Serviço de cebola Whonix Docs
tr: Whonix Docs onion hizmeti

source: Reddit thread
pt_br: Tópico do Reddit
tr: Reddit başlığı

source: Hosting clearnet site as onion service
pt_br: Hospedando site clearnet como serviço onion
tr: Herkese açık bir İnternet sitesini onion hizmeti olarak sunmak

source: Securing a Tor Hidden Service
pt_br: Protegendo um serviço oculto Tor
tr: Bir Tor gizli hizmetinin güvenliğini sağlamak

source: Effects of hosting hidden and non-hidden services
pt_br: Efeitos da hospedagem de serviços ocultos e não ocultos
tr: Gizli ve gizli olmayan hizmetleri barındırmanın etkileri

source: Propublica
pt_br: Propública

source: Wikipedia Proposal
pt_br: Proposta da Wikipédia
tr: Wikipedia önerisi

source: How to set up an ssh server behind I2P for personal access
pt_br: Como configurar um servidor ssh atrás do I2P para acesso pessoal
tr: Kişisel erişim için I2P arkasında SSH sunucusu kurmak
