Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: The founders of I2P had to make several choices for cryptographic algorithms and protocols. Some of those choices were better than others, but twenty years later, most are showing their age. Of course, we knew this was coming, and we've spent the last decade planning and implementing cryptographic upgrades. As the old saying goes, upgrading things while maintaining backward compatibility and avoiding a "flag day" is quite challenging, like changing the tires on the bus while it's rolling down the road.
pt_br: Os fundadores do I2P tiveram que fazer várias escolhas para algoritmos e protocolos criptográficos. Algumas dessas escolhas foram melhores que outras, mas vinte anos depois, a maioria está mostrando sua idade. Claro, sabíamos que isso aconteceria, e passamos a última década planejando e implementando atualizações criptográficas. Como diz o velho ditado, atualizar as coisas mantendo a compatibilidade com versões anteriores e evitar um "dia de bandeira" é bastante desafiador, como trocar os pneus do ônibus enquanto ele está andando na estrada.
tr: I2P kurucuları, şifreleme algoritmaları ve iletişim kuralları için birkaç seçim yapmak zorunda kaldı. Bu seçeneklerden bazıları diğerlerinden daha iyiydi ama yirmi yıl sonra çoğu yaşını gösteriyor. Elbette bu günün geleceğini biliyorduk ve son on yılı şifreleme geliştirmelerini planlayıp uygulayarak geçirdik. Eskilerin dediği gibi, yolda giderken otomobilin lastiklerini değiştirmek gibi geriye dönük uyumluluğu korurken bazı şeyleri güncellemek ve büyük değişiklikler yapmak oldukça zordur.

source: SSU2 was the last and most complex protocol to develop in our long upgrade path. UDP has a very challenging set of assumptions and threat model. We first designed and rolled out three other flavors of Noise protocols, and gained experience and deeper understanding of the security and protocol design issues. Finally, we had to research and fully understand other modern UDP protocols - WireGuard and QUIC. While the authors of those protocols didn't solve all of our problems for us, their documentation of the UDP threat models and their designed countermeasures gave us the confidence that we too would be able to complete our task. We thank them as well as the creators of all the cryptography we rely on to keep our users safe.
pt_br: O SSU2 foi o último e mais complexo protocolo a ser desenvolvido em nosso longo caminho de atualização. O UDP tem um conjunto muito desafiador de suposições e modelo de ameaça. Primeiro, projetamos e implementamos três outros tipos de protocolos Noise, e ganhamos experiência e compreensão mais profunda dos problemas de segurança e design de protocolo. Finalmente, tivemos que pesquisar e entender completamente outros protocolos UDP modernos - WireGuard e QUIC. Embora os autores desses protocolos não tenham resolvido todos os nossos problemas para nós, sua documentação dos modelos de ameaça UDP e suas contramedidas projetadas nos deram a confiança de que também seríamos capazes de concluir nossa tarefa. Agradecemos a eles, bem como aos criadores de toda a criptografia em que confiamos para manter nossos usuários seguros.
tr: SSU2, uzun güncelleme yolumuzda geliştirilen son ve en karmaşık iletişim kuralıydı UDP tarafında çok zorlu bir dizi varsayım ve tehdit modeli vardır. İlk olarak, Noise iletişim kurallarının üç çeşidini daha tasarladık ve kullanıma sunduk. Bu sırada güvenlik ve iletişim kuralı tasarımı üzerine deneyim ve daha derin bir anlayış kazandık. Son olarak, diğer modern UDP iletişim kurallarını - WireGuard ve QUIC - araştırmamız ve tam olarak anlamamız gerekiyordu. Bu iletişim kurallarının geliştiricileri bizim tüm sorunlarımızı çözemese de, UDP tehdit modellerine ilişkin belgeleri ve tasarlanmış karşı önlemleri ile bizim de işimizi tamamlayabileceğimiz konusunda güven kazanmamızı sağladı. Kullanıcılarımızı güvende tutmak için güvendiğimiz tüm kriptografinin yaratıcılarının yanı sıra onlara da teşekkür ediyoruz.

source: Expect SSU2 to be enabled in the i2pd and Java I2P releases scheduled for late November 2022. If the update goes well, nobody will notice anything different at all. The performance benefits, while significant, will probably not be measurable for most people.
pt_br: Espere que o SSU2 seja habilitado nas versões i2pd e Java I2P programadas para o final de novembro de 2022. Se a atualização for bem, ninguém notará nada diferente. Os benefícios de desempenho, embora significativos, provavelmente não serão mensuráveis para a maioria das pessoas.
tr: 2022 Kasım ayının sonlarına doğru planlanan i2pd ve Java I2P sürümlerinde SSU2 iletişim kuralının etkinleştirilmesini bekleyin. Güncelleme iyi giderse, hiç kimse bir şey fark etmeyecek. Başarım kazanımları önemli olsa da büyük olasılıkla çoğu insan için ölçülebilir bir fark olmayacak.

source: As usual, we recommend that you update to the new release when it's available. The best way to maintain security and help the network is to run the latest release.
pt_br: Como de costume, recomendamos que você atualize para a nova versão quando ela estiver disponível. A melhor maneira de manter a segurança e ajudar a rede é executar a versão mais recente.
tr: Her zamanki gibi, yayınlandığında yeni sürüme güncellemeniz önerilir. Güvenliği korumanın ve ağa yardımcı olmanın en iyi yolu güncel sürümü kullanmaktır.

source: 1.7.0 Release
pt_br: Versão 1.7.0
tr: 1.7.0 sürümü yayınlandı

source: 1.7.0 with reliability and performance improvements
pt_br: 1.7.0 com melhorias de confiabilidade e desempenho
tr: 1.7.0 sürümü güvenilirlik ve başarım iyileştirmeleri ile yayınlandı.

source: The 1.7.0 release contains several performance and reliability improvements.
pt_br: A versão 1.7.0 contém várias melhorias de desempenho e confiabilidade.
tr: 1.7.0 sürümünde birkaç başarım ve güvenilirlik iyileştirmesi yapıldı.

source: There are now popup messages in the system tray, for those platforms that support it. i2psnark has a new torrent editor. The NTCP2 transport now uses much less CPU.
pt_br: Agora há mensagens pop-up na bandeja do sistema, para as plataformas que o suportam. i2psnark tem um novo editor de torrent. O transporte NTCP2 agora usa muito menos CPU.
tr: Artık destekleyen platformların sistem tepsisinde açılır iletiler var. Yeni bir i2psnark torrent düzenleyicisi var. NTCP2 taşıyıcısı artık çok daha az işlemci kullanıyor.

source: The long-deprecated BOB interface is removed for new installs. It will continue to work in existing installs, except for Debian packages. Any remaining users of BOB applications should ask the developers to convert to the SAMv3 protocol.
pt_br: A há muito obsoleta interface BOB está removida para novas instalações. Ela continuará funcionando em instalações existentes, exceto em pacotes Debian. Quaisquer usuários de aplicações BOB que ainda restarem devem pedir aos desenvolvedores que as convertam para o protocolo SAMv3.
tr: Uzun süredir kullanımdan kaldırılan BOB arayüzü, yeni kurulumlar için kaldırıldı. Debian paketleri dışında var olan kurulumlarda çalışmayı sürdürecek. BOB uygulamalarının kalan tüm kullanıcıları, geliştiricilerden SAMv3 iletişim kuralına geçmelerini istemelidir.

source: We know that since our 1.6.1 release, network reliability has steadily deteriorated. We were aware of the problem soon after the release, but it took us almost two months to find the cause. We eventually identified it as a bug in i2pd 2.40.0, and the fix will be in their 2.41.0 release coming out about the same time as this release. Along the way, we've made several changes on the Java I2P side to improve the robustness of network database lookups and stores, and avoid poorly-performing peers in tunnel peer selection. This should help the network be more robust even in the presence of buggy or malicious routers. Additionally, we're starting a joint program to test pre-release i2pd and Java I2P routers together in an isolated test network, so we can find more problems before the releases, not after.
pt_br: Nós sabemos que desde a nossa versão 1.6.1, a estabilidade da rede tem deteriorado continuamente. Nós ficamos a par do problema logo após o lançamento, mas levou quase dois meses para nós encontrarmos a causa. Nós eventualmente a identificamos como um bug na i2pd 2.40.0, e a correção será na sua versão 2.41.0, que será lançada mais ou menos na mesma data que esta versão. Ao longo do caminho, nós fizemos várias mudanças do lado da I2P Java para melhorar a robustez dos armazenamentos e buscas na base de dados de rede, e evitar pares com desempenho ruim na seleção de par de túnel. Isso deve ajudar a rede a ficar mais robusta mesmo com a presença de roteadores problemáticos ou maliciosos. Ainda, nós estamos iniciando um programa conjunto para testar os roteadores I2P Java e i2pd pré-lançamento juntos em uma rede para testes isolada, para que possamos encontrar mais problemas antes dos lançamentos, não depois.
tr: 1.6.1 sürümümüzden bu yana ağ güvenilirliğinin giderek kötüleştiğini biliyoruz. Yayınlandıktan hemen sonra sorunun farkındaydık, ancak nedenini bulmamız neredeyse iki ayımızı aldı. Sonunda bunu i2pd 2.40.0 sürümünde bir hata olarak belirledik. Düzeltmesi, bu sürümle yaklaşık olarak aynı zamanda çıkan 2.41.0 sürümünde olacak. Bu arada, ağ veri tabanı aramalarının ve depolarının sağlamlığını geliştirmek ile tünel eş seçiminde başarımı düşük olan eşlerden kaçınmak için Java I2P tarafında birkaç değişiklik yaptık. Böylece, hatalı veya kötü niyetli yönelticilerin varlığında bile ağ daha sağlam olmalı. Ayrıca, yayın öncesi i2pd ve Java I2P yönelticilerini yalıtılmış bir deneme ağında birlikte denemek için ortak bir program başlatıyoruz. Böylece daha fazla sorunu sürümler yayınlandıktan sonra değil, yayınlanmadan önce bulabiliriz.

source: In other news, we continue to make great progress on the design of our new UDP transport "SSU2" (proposal 159) and have started implementation. SSU2 will bring substantial performance and security improvements. It will also allow us to finally replace our last usage of the very slow ElGamal encryption, completing a full cryptography upgrade that started about 9 years ago. We expect to start joint testing with i2pd soon, and roll it out to the network later this year.
pt_br: Em outras novidades, nós continuamos a fazer bastante progresso no projeto do nosso novo transporte UDP "SSU2" (proposta 159) e começamos a implementação. O SSU2 trará melhoras substanciais de desempenho e segurança. Ele também permitirá que nós finalmente substituamos nosso último uso da criptografia muito lenta ElGamal, completando uma atualização completa de criptografia que começou cerca de 9 anos atrás. Nós esperamos iniciar a testar em conjunto com a i2pd logo, e disponibilizá-lo para a rede mais tarde neste ano.
tr: Diğer yandan, yeni UDP taşıyıcımız "SSU2" (159 numaralı öneri) tasarımında büyük ilerleme kaydetmeyi sürdürüyoruz ve kullanıma almaya başladık. SSU2, önemli başarım ve güvenlik iyileştirmeleri getirecek. Ayrıca, yaklaşık 9 yıl önce başlayan tam şifreleme yükseltmesini tamamlayarak, çok yavaş ElGamal şifrelemesini değiştirmeden önce son kez kullanacağız. Yakında i2pd ile ortak denemelere başlamayı ve bu yıl ağ üzerinde kullanıma sunmayı umuyoruz.

source: i2psnark: New torrent editor
pt_br: i2psnark: Novo editor de torrent
tr: i2psnark: Yeni torrent düzenleyici eklendi

source: i2psnark standalone: Fixes and improvements
pt_br: i2psnark standalone: correções e melhorias
tr: Bağımsız i2psnark: Düzeltme ve geliştirmeler yapıldı

source: i2ptunnel: Support IRCv3 message tags
pt_br: i2ptunnel: Suporte a tags de mensagens IRCv3
tr: i2ptunnel: IRCv3 ileti kod imleri desteği eklendi

source: NetDB: Lookup/store reliability improvements
pt_br: NetDB: Melhorias na confiabilidade de pesquisa/armazenamento
tr: "Ağ veri tabanı" (NetDB): Arama ve kaydetme işlemlerinin güvenirliği iyileştirildi

source: System tray: Add popup messages
pt_br: Bandeja do sistema: Adicionar mensagens pop-up
tr: Sistem tepsisi: Açılan pencere iletileri eklendi

source: Transport: NTCP2 performance improvements
pt_br: Transporte: Melhorias no desempenho do NTCP2
tr: Taşıyıcı: NTCP2 başarımında iyileştirmeler yapıldı

source: Transport: NTCP2 clock skew handling improvements
pt_br: Transporte: melhorias no tratamento de desvio de clock NTCP2
tr: Taşıyıcı: NTCP2 saat sapmalarının ele alınması iyileştirildi

source: Transport: Use priority in SSU sender queue
pt_br: Transporte: Use prioridade na fila do remetente SSU
tr: Taşıyıcı: SSU gönderim kuyruğuna öncelik eklendi

source: Tunnels: Remove outbound tunnel when can't connect to first hop
pt_br: Túneis: remover o túnel de saída quando não for possível conectar ao primeiro salto
tr: Tüneller: İlk sıçrama ile bağlantı kurulamadığında giden tünelin kaldırılması sağlandı

source: Tunnels: Fallback to exploratory for building after repeated build failure
pt_br: Túneis: retorno à exploração para construção após repetidas falhas de construção
tr: Tüneller: Yinelenen oluşturma sorunuyla karşılaşıldığında keşif aşamasına dönüşmesi sağlandı

source: Tunnels: Enable tunnel testing by default
pt_br: Túneis: Habilitar teste de túnel por padrão
tr: Tüneller: Tünel sınaması varsayılan olarak etkinleştirildi

source: Tunnels: Use tunnel builds as a tunnel test
pt_br: Túneis: use construções de túneis como um teste de túnel
tr: Tüneller: Tünel oluşturma işleminin tünel sınaması olarak kullanılması sağlandı

source: Plugins: Fixes for webapps named different from the plugin
pt_br: Plugins: Correções para webapps com nomes diferentes do plugin
tr: Uygulama ekleri: Adı uygulama ekinden farklı olan internet uygulamaları için düzeltmeler yapıldı

source: Reseed: Fixes for IPv6-only
pt_br: Reseed: Correções somente para IPv6
tr: Yeniden tohumlama: Yalnızca IPv6 için düzeltmeler yapıldı

source: Router: Fix rare deadlock at startup
pt_br: Roteador: Corrigir deadlock raro na inicialização
tr: Yöneltici: Başlangıçta nadir görülen kilitlenme düzeltildi

source: Tunnels: Restore IP restriction tests
pt_br: Túneis: Restaurar testes de restrição de IP
tr: Tüneller: IP kısıtlama sınamaları geri yüklendi

source: API version
pt_br: Versão da API
tr: API sürümü

source: i2pcontrol: Improved state mapping
pt_br: i2pcontrol: Mapeamento de estado aprimorado
tr: i2pcontrol: Durum eşleştirmesi geliştirildi

source: i2ptunnel: Refactor UDP support
pt_br: i2ptunnel: Refatorar suporte UDP
tr: i2ptunnel: UDP desteği kodu elden geçirildi

source: Plugins: Fixes for webapps
pt_br: Plugins: Correções para webapps
tr: Uygulama ekleri: İnternet uygulamalarında düzeltmeler yapıldı

source: Router: Workarounds for i2pd 2.40.0 SSU bug
pt_br: Roteador: Soluções alternativas para o bug do SSU do i2pd 2.40.0
tr: Yöneltici: i2pd 2.40.0 SSU hatası ile ilgili düzeltmeler yapıldı

source: Jpackage Update for Java CVE-2022-21449
pt_br: Atualização do Jpackage para Java CVE-2022-21449
tr: Java CVE-2022-21449 için JPackage güncellemesi yapıldı

source: Jpackage bundles released with fixes for Java CVE-2022-21449
pt_br: Pacotes Jpackage lançados com correções para Java CVE-2022-21449
tr: Java CVE-2022-21449 için düzeltmeler içeren JPackage paketleri yayınlandı

source: New I2P Easy-Install bundles have been generated using the latest release of the Java Virtual Machine which contains a fix for CVE-2022-21449 "Psychic Signatures." It is recommended that users of the easy-install bundles update as soon as possible. Current OSX users will recieve updates automatically, Windows users should download the installer from our downloads page and run the installer normally.
pt_br: Novos pacotes I2P Easy-Install foram gerados usando a versão mais recente da Java Virtual Machine que contém uma correção para CVE-2022-21449 "Psychic Signatures". É recomendado que os usuários dos pacotes easy-install atualizem o mais rápido possível. Usuários atuais do OSX receberão atualizações automaticamente, Usuários do Windows devem baixar o instalador da nossa página de downloads e executar o instalador normalmente.
tr: CVE-2022-21449 ile, "Psişik İmzalar" için bir düzeltme içeren Java sanal makinesinin son sürümü kullanılarak yeni I2P kolay kurulum paketleri hazırlandı. Kolay kurulum paketi kullanıcılarının olabilecek en kısa sürede güncelleme yapması önerilir. macOS kullanıcıları güncellemeleri otomatik olarak alır. Windows kullanıcıları indirmeler sayfamızdan kurucuyu indirip çalıştırmalıdır.

source: The I2P router on Linux uses the Java Virtual Machine configured by the host system. Users on those platforms should downgrade to a stable Java version below Java 14 in order to mitigate the vulnerability until updates are released by the package maintainers. Other users using an external JVM should update the JVM to a fixed version as soon as possible.
pt_br: O roteador I2P no Linux usa a Java Virtual Machine configurada pelo sistema host . Usuários nessas plataformas devem fazer downgrade para uma versão estável do Java abaixo de Java 14 para mitigar a vulnerabilidade até que as atualizações sejam lançadas pelos mantenedores do pacote. Outros usuários que usam uma JVM externa devem atualizar a JVM para uma versão corrigida o mais rápido possível.
tr: Linux üzerindeki I2P yönelticisi, sunucu sistemi tarafından yapılandırılmış Java sanal makinesini kullanır. Bu platformlardaki kullanıcılar, güvenlik açığını azaltmak için güncellemeler paket sahipleri tarafından yayınlanana kadar Java 14 sürümünden önceki bir kararlı Java sürümüne geçmelidir. Dış JVM yazılımı kullanan diğer kullanıcılar, olabilecek en kısa sürede düzeltilmiş bir JVM yazılımına geçmelidir.

source: 1.8.0 Release
pt_br: Lançamento 1.8.0
tr: 1.8.0 sürümü yayınlandı

source: 1.8.0 with bug fixes
pt_br: 1.8.0 com correções de bugs
tr: 1.8.0 sürümü bazı hata düzeltmeleri ile yayınlandı

source: This release includes bug fixes in i2psnark, the router, I2CP, and UPnP. Router fixes address bugs in soft restart, IPv6, SSU peer testing, network database stores, and tunnel building. Router family handling and Sybil classification have also been significantly improved.
pt_br: Essa versão inclui correções de bugs no i2psnark, no roteador, I2CP, e UPnP. As correções no roteador tratam bugs no reinício suave, IPv6, testes de par SSU, armazenamento do banco de dados de rede, e construção de túnel. O tratamento de família de roteador e classificação de Sybil também foram melhorados significativamente.
tr: Bu sürümde, i2psnark, yöneltici, I2CP ve UPnP üzerinde yapılmış hata düzeltmeleri bulunuyor. Yöneltici, yumuşak yeniden başlatma, IPv6, SSU eş sınaması, ağ veri tabanı kaydetme ve tünel oluşturma adres hataları düzeltildi. Yöneltici ailesi kullanımı ve Sybil sınıflandırması da önemli ölçüde iyileştirildi.

source: Together with i2pd, we are developing our new UDP transport, SSU2. SSU2 will bring substantial performance and security improvements. It will also allow us to finally replace our last usage of the very slow ElGamal encryption, completing the full cryptography upgrade we started about 9 years ago. This release contains a preliminary implementation which is disabled by default. If you wish to participate in testing, please look for current information on zzz.i2p.
pt_br: Junto da i2pd, nós estamos desenvolvendo nosso novo transporte UDP, o SSU2. O SSU2 trará melhoras substanciais de desempenho e segurança. Ele também permitirá que nós finalmente substituamos nosso último uso da criptografia muito lenta ElGamal, completando a atualização completa de criptografia que nós iniciamos cerca de 9 anos atrás. Essa versão contém uma implementação preliminar que fica desabilitada por padrão. Se você deseja participar em testes, por favor, busque informações atuais em zzz.i2p.
tr: i2pd ile birlikte yeni SSU2 UDP taşıyıcımızı geliştiriyoruz. SSU2, önemli başarım ve güvenlik iyileştirmeleri getirecek. Ayrıca, yaklaşık 9 yıl önce başlattığımız tam şifreleme yükseltmesini tamamlıyoruz. Böylece çok yavaş ElGamal şifrelemesini son kez kullanıyoruz ve nihayet değiştirebileceğiz. Bu sürümde, varsayılan olarak devre dışı bırakılmış bir ön uygulama bulunuyor. Denemelere katılmak istiyorsanız, zzz.i2p adresindeki güncel bilgileri bakabilirsiniz.

source: SSU2: Preliminary implementation
pt_br: SSU2: Implementação preliminar
tr: SSU2: Ön uygulama

source: Crypto: Fix handling of EdDSA certs with official OID
pt_br: Criptografia: Corrigir manipulação de certificados EdDSA com OID oficial
tr: Şifreleme: Resmi OID ile EdDSA sertifikalarının işlenmesi düzeltildi

source: I2CP: Fix external connections when session ID is 0
pt_br: I2CP: Corrigir conexões externas quando o ID da sessão for 0
tr: I2CP: Oturum kimliği 0 olduğunda dış bağlantılar düzeltildi

source: I2PSnark: Fix size calculation causing tracker errors
pt_br: I2PSnark: Corrigir cálculo de tamanho causando erros no rastreador
tr: I2PSnark: İzleyici hatalarına neden olan boyut hesaplaması düzeltildi

source: I2PSnark standalone: More fixes and improvements
pt_br: I2PSnark autônomo: Mais correções e melhorias
tr: Bağımsız i2psnark: Daha fazla düzeltme ve geliştirmeler yapıldı

source: Router: Family fixes and improvements
pt_br: Roteador: correções e melhorias da família
tr: Yöneltici: Aile düzeltmeleri ve iyileştirmeler yapıldı

source: Router: Fix database store logic
pt_br: Roteador: Corrigir lógica de armazenamento de banco de dados
tr: Yöneltici: Veri tabanı kaydetme mantığı düzeltildi

source: Router: Fix invalid store and rekeying at startup
pt_br: Roteador: Corrigir armazenamento inválido e redigitação na inicialização
tr: Yöneltici: Başlangıçtaki geçersiz kaydetme ve yeniden anahtarlama düzeltildi

source: Router: Don't use he.net addresses for GeoIP
pt_br: Roteador: Não use endereços he.net para GeoIP
tr: Yöneltici: GeoIP için he.net adresinin kullanılması engellendi

source: Router: Soft restart fixes
pt_br: Roteador: correções de reinicialização suave
tr: Yöneltici: Yumuşak yeniden başlatma sorunu düzeltildi

source: SSU: Publish empty IPv6 address when missing introducers
pt_br: SSU: Publicar endereço IPv6 vazio quando faltarem introdutores
tr: SSU: Tanıtıcılar eksik olduğunda boş IPv6 adresinin yayınlanması sağlandı

source: SSU: Reduce ack delay to improve performance
pt_br: SSU: Reduza o atraso de confirmação para melhorar o desempenho
tr: SSU: Başarımı artırmak için onay gecikmesi azaltıldı

source: Transport: Fix UPnP deadlock
pt_br: Transporte: Corrigir deadlock UPnP
tr: Taşıyıcı: UPnP kilitlenme sorunu düzeltildi

source: Tunnels: Don't build client tunnels shorter than minimum length
pt_br: Túneis: Não construa túneis de cliente menores que o comprimento mínimo
tr: Tüneller: En az uzunluktan daha kısa istemci tünellerinin oluşturulması engellendi

source: Console: Setup wizard redesign
pt_br: Console: Redesenho do assistente de configuração
tr: Pano: Kurulum yardımcısı yeniden tasarlandı

source: i2psnark: Load system mime types if available
pt_br: i2psnark: Carregar tipos mime do sistema se disponíveis
tr: i2psnark: Kullanılabiliyorsa sistem MIME türlerinin yüklenmesi sağlandı

source: I2PSnark standalone: Add system tray
pt_br: I2PSnark autônomo: Adicionar bandeja do sistema
tr: Bağımsız I2PSnark: Sistem tepsisi eklendi

source: Router: Reduce build reply timeout so we will retry faster
pt_br: Roteador: reduza o tempo limite de resposta da compilação para que possamos tentar novamente mais rápido
tr: Yöneltici: Derleme yanıt zaman aşımını azaltılarak yeniden deneme hızı artırıldı

source: Router: Avoid Sybil penalty for trusted large families
pt_br: Roteador: Evite a penalidade Sybil para famílias grandes e confiáveis
tr: Yöneltici: Güvenilir büyük aileler için Sybil cezalarından kaçınılması sağlandı

source: Source: Remove BOB
pt_br: Fonte: Remover BOB
tr: Kaynak kodu: BOB kaldırıldı

source: 1.9.0 Release
pt_br: Lançamento 1.9.0
tr: 1.9.0 sürümü yayınlandı

source: 1.9.0 with SSU2
pt_br: 1.9.0 com SSU2
tr: 1.9.0 sürümü SSU2 ile yayınlandı
