Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: i2ptunnel: Refactor edit jsps
pt_br: i2ptunnel: Refatorar edição jsps
tr: i2ptunnel: Düzenleme jsps kodu elden geçirildi

source: i2ptunnel: Message box improvements
pt_br: i2ptunnel: Melhorias na caixa de mensagens
tr: i2ptunnel: İleti kutusu iyileştirmeleri yapıldı

source: Session Key Manager: Delete excess tag sets
pt_br: Gerenciador de chaves de sessão: Excluir conjuntos de tags em excesso
tr: Oturum anahtarı yöneticisi: Fazla etiket kümeleri silindi

source: SOCKS: Move client code to core
pt_br: SOCKS: Mover código do cliente para o núcleo
tr: SOCKS: İstemci kodu çekirdeğe taşındı

source: Startup: Increase open files ulimit if able, in i2prouter script (new installs only)
pt_br: Inicialização: Aumente o limite de arquivos abertos, se possível, no script i2prouter (somente novas instalações)
tr: Başlangıç: Yapılabiliyorsa, i2prouter komut dosyasında açık dosyaların sınırı artırıldı (yalnızca yeni kurulumlar)

source: SusiMail: UI tweaks and minor fixes
pt_br: SusiMail: ajustes de IU e pequenas correções
tr: SusiMail: Kullanıcı arayüzü ince ayarları ve küçük düzeltmeler yapıldı

source: SusiMail: Use internal sockets to connect to servers
pt_br: SusiMail: Use soquetes internos para conectar-se a servidores
tr: SusiMail: Sunuculara bağlanmak için iç soketler kullanıldı

source: SusiMail: Encoder refactoring
pt_br: SusiMail: Refatoração do codificador
tr: SusiMail: Kodlayıcı kodu elden geçirildi

source: SusiMail: State tracking refactoring
pt_br: SusiMail: Refatoração de rastreamento de estado
tr: SusiMail: Durum izleme kodu elden geçirildi

source: Update GeoIP data
pt_br: Atualizar dados GeoIP
tr: GeoIP verileri güncellendi

source: =========================== High-level Roadmap for 2018 ===========================
pt_br: ============================ Roteiro de alto nível para 2018 ============================
tr: =========================== 2018 için ayrıntılı yol haritası ===========================

source: 2018 will be the year of new protocols, new collaborations, and a more refined focus.
pt_br: 2018 será o ano de novos protocolos, novas colaborações e um foco mais refinado.
tr: 2018, yeni iletişim kuralları ve yeni işbirlikleri üzerine odaklanılan bir yıl olacak.

source: One of the many things we discussed at 34C3 was what we should focus on for the coming year. In particular, we wanted a roadmap that was clear about what we want to ensure we get done, vs what would be really nice to have, and be able to help onboard newcomers to either category. Here is what we came up with:
pt_br: Uma das muitas coisas que discutimos no 34C3 foi no que deveríamos focar para o ano que vem. Em particular, queríamos um roteiro que fosse claro sobre o que queremos garantir que seja feito, versus o que seria realmente bom ter, e ser capaz de ajudar a integrar os novatos em qualquer categoria. Aqui está o que criamos:
tr: 34C3 etkinliğinde tartıştığımız birçok şeyden biri, önümüzdeki yıl için neye odaklanmamız gerektiğiydi. Özellikle, nelerin yapılmasını sağlamak istediğimizi ve neye sahip olmanın gerçekten güzel olacağı konusunda net olacak ve her iki kategoriye yeni başlayanlara yardımcı olabilecek bir yol haritası oluşturmak istedik. İşte bulduklarımız:

source: Priority: New crypto(graphy!) -----------------------------
pt_br: Prioridade: Nova criptografia(grafia!) -----------------------------
tr: Öncelik: Yeni şifreleme (grafik!) -----------------------------

source: Many of the current primitives and protocols still retain their original designs from circa 2005, and need improvement. We have had a number of open proposals for several years with ideas, but forward progress has been slow. We all agreed that this needs to be our top priority for 2018. The core components are: - New transport protocols (to replace NTCP and SSU). See Prop111_. - New onion-encryption protocol for building and using tunnels. - New NetDB datatypes to enable enhanced Destinations. See Prop123_. - Upgraded end-to-end protocol (replacing ElGamal).
pt_br: Muitos dos primitivos e protocolos atuais ainda mantêm seus designs originais de aproximadamente 2005 e precisam de melhorias. Temos tido uma série de propostas abertas por vários anos com ideias, mas o progresso tem sido lento. Todos concordamos que essa precisa ser nossa principal prioridade para 2018. Os principais componentes são: - Novos protocolos de transporte (para substituir NTCP e SSU). Veja Prop111_. - Novo protocolo de criptografia onion para construir e usar túneis. - Novos tipos de dados NetDB para habilitar destinos aprimorados. Veja Prop123_. - Protocolo ponta a ponta atualizado (substituindo ElGamal).
tr: Var olan öncüllerin ve iletişim kurallarının çoğu hala 2005 yılındaki özgün tasarımlarını koruyor ve iyileştirilmesi gerekiyor. Birkaç yıldır fikirler içeren bir dizi açık öneri aldık, ancak ilerleme yavaş oldu. Hepimiz 2018 için en önemli önceliğimizin bu olması gerektiğine karar verdik. Temel bileşenler şunlar: - Yeni taşıyıcı iletişim kuralları (NTCP ve SSU yerine). 111 numaralı öneriye bakın_. - Tüneller oluşturmak ve kullanmak için yeni onion şifreleme iletişim kuralı. - Gelişmiş hedefleri etkinleştirmek için yeni "Ağ veri tabanı" (NetDB) veri türleri. 123 numaralı öneriye bakın_. - Güncellenmiş uçtan uca iletişim kuralı (ElGamal yerine).

source: Work on this priority falls into several areas: - Writing proposals. - Writing working implementations of them that we can test. - Reviewing proposals.
pt_br: O trabalho nessa prioridade se divide em várias áreas: - Escrever propostas. - Escrever implementações funcionais que possamos testar. - Revisar propostas.
tr: Bu öncelik üzerindeki çalışmalar birkaç alana ayrılıyor: - Önerilerin yazılması. - Deneyebileceğimiz çalışan uygulamalar yazmak. - Önerilerin gözden geçirilmesi.

source: We cannot release new protocol specifications across the entire network without work on all of these areas.
pt_br: Não podemos lançar novas especificações de protocolo em toda a rede sem trabalhar em todas essas áreas.
tr: Tüm bu alanlar üzerinde çalışmadan tüm ağda yeni iletişim kuralı teknik özelliklerini yayınlayamayız.

source: Nice-to-have: Code reuse ------------------------
pt_br: Desejável: Reutilização de código ------------------------
tr: Olsa iyi olur: Kodun yeniden kullanımı ------------------------

source: One of the benefits of starting the above work now, is that over the last few years there have been independent efforts to create simple protocols and protocol frameworks that achieve many of the aims we have for our own protocols, and have gained traction with the wider community. By leveraging this work, we get a "force multiplier" effect: - We benefit from protocol designs, security proofs, and code written by others, reducing the amount of work we need to do for the same level of feature-completeness and security assurances. - Work we do can be leveraged by other communities, increasing their interest in collaborating with us, and thinking about I2P as a whole.
pt_br: Um dos benefícios de começar o trabalho acima agora é que nos últimos anos houve esforços independentes para criar protocolos simples e estruturas de protocolo que alcançam muitos dos objetivos que temos para nossos próprios protocolos, e ganharam força com a comunidade mais ampla. Ao alavancar esse trabalho, nós obtemos um efeito "multiplicador de força": - Nós nos beneficiamos de designs de protocolo, provas de segurança e código escrito por outros, reduzindo a quantidade de trabalho que precisamos fazer para o mesmo nível de completude de recursos e garantias de segurança. - O trabalho que fazemos pode ser alavancado por outras comunidades, aumentando seu interesse em colaborar conosco e pensar sobre I2P como um todo.
tr: Yukarıdaki çalışmaya şimdi başlamanın faydalarından biri, son birkaç yılda, kendi iletişim kurallarımız için sahip olduğumuz birçok amacı gerçekleştiren basit iletişim kuralları ve iletişim kuralı çatıları oluşturmak için bağımsız çabalar gösterilmesi ve daha geniş bir topluluğa kavrayış kazandırılmış olmasıdır. Bu çalışmadan yararlanarak bir "kuvvet çarpanı" etkisi elde edebiliriz: - Aynı düzeyde özellik bütünlüğü ve güvenlik güvenceleri için yapmamız gereken iş miktarını azaltan iletişim kuralı tasarımlarından, güvenlik kanıtlarından ve başkaları tarafından yazılan kodlardan yararlanıyoruz. - Yaptığımız çalışmalardan diğer topluluklar yararlanabilir, bizimle işbirliği yapmaya ve I2P uygulamasını bir bütün olarak düşünmeye ilgiyi artırabilir.

source: My proposals in particular will be leveraging the `Noise Protocol Framework`_, and the `SPHINX packet format`_. I have collaborations lined up with several people outside I2P for these!
pt_br: Minhas propostas em particular aproveitarão o `Noise Protocol Framework`_, e o `SPHINX packet format`_. Tenho colaborações alinhadas com várias pessoas de fora do I2P para isso!
tr: Özellikle önerilerim 'Gürültü iletişim kuralı çatısı`_ ve `SPHINX paket biçiminden`_ destek almak. Bunlar için I2P dışından birkaç kişiyle işbirliklerim var!

source: Priority: Clearnet collaboration --------------------------------
pt_br: Prioridade: colaboração Clearnet --------------------------------
tr: Öncelik: Herkese açık İnternet ile işbirliği --------------------------------

source: On that topic, we've been slowly building interest over the last six months or so. Across PETS2017, 34C3, and RWC2018, I've had some very good discussions about ways in which we can improve collaboration with the wider community. This is really important to ensure we can garner as much review as possible for new protocols. The biggest blocker I've seen is the fact that the majority of I2P development collaboration currently happens inside I2P itself, which significantly increases the effort required to contribute.
pt_br: Sobre esse tópico, temos criado interesse lentamente nos últimos seis meses ou mais ou menos. Em PETS2017, 34C3 e RWC2018, tive algumas discussões muito boas sobre maneiras pelas quais podemos melhorar a colaboração com a comunidade mais ampla. Isso é realmente importante para garantir que possamos obter o máximo de revisão possível para novos protocolos. O maior obstáculo que vi é o fato de que a maioria da colaboração de desenvolvimento do I2P atualmente acontece dentro do próprio I2P, o que aumenta significativamente o esforço necessário para contribuir.
tr: Bu konuyla ilgili olarak, son altı aydır yavaş yavaş ilgi çekiyoruz. PETS2017, 34C3 ve RWC2018 etkinlikleri genelinde, daha geniş bir toplulukla işbirliğini geliştirmenin yolları hakkında çok iyi tartışmalar yaptım. Bunlar, yeni iletişim kuralları için olabildiğince çok görüş toplayabilmemiz için gerçekten önemlidir. Gördüğüm en büyük engel, I2P geliştirme işbirliğinin çoğunluğunun şu anda I2P ağının içinde yapılması. Bu durum katkıda bulunmak için gereken çabayı önemli ölçüde artırıyor.

source: The two priorities in this area are: - Set up a project-run development forum that is accessible both inside and outside I2P. - Set up mailing lists for review and discussion of proposals (possibly connected to the above forum).
pt_br: As duas prioridades nesta área são: - Criar um fórum de desenvolvimento executado pelo projeto que seja acessível tanto dentro quanto fora do I2P. - Criar listas de discussão para revisão e discussão de propostas (possivelmente conectado ao fórum acima).
tr: Bu alandaki iki öncelik şunlar: - I2P uygulamasının hem içinden hem de dışından erişilebilen, proje tarafından yürütülen bir geliştirme forumu kurmak. - Önerilerin gözden geçirilmesi ve tartışılması için e-posta listeleri oluşturmak (yukarıdaki foruma bağlı olabilir).

source: Other goals which are classed as nice-to-have: - Set up a usable git-to-mtn pathway, to enable us to effectively solicit clearnet contributions on GitHub while keeping the canonical dev environment on Monotone. - Write a "position paper" that accurately explains I2P to academic audiences, and puts it in context with existing literature.
pt_br: Outras metas que são classificadas como úteis: - Configurar um caminho git-to-mtn utilizável, para nos permitir solicitar efetivamente contribuições clearnet no GitHub, mantendo o ambiente de desenvolvimento canônico no Monotone. - Escrever um "documento de posição" que explique com precisão o I2P para públicos acadêmicos, e o coloque em contexto com a literatura existente.
tr: Olsa güzel olacak diğer hedefler: - Kanonik geliştirme ortamını Monotone üzerinde tutarken, herkese açık İnternet üzerindeki katkıları GitHub üzerinden almak için kullanılabilir bir git-mtn yolu oluşturmak. - I2P projesini akademik topluluklara doğru bir şekilde açıklayan ve var olan literatür bağlamına yerleştiren bir "konumlandırma makalesi" yazmak.

source: I expect that collaborations with people outside I2P will be done entirely on GitHub, for minimal friction.
pt_br: Espero que as colaborações com pessoas de fora do I2P sejam feitas inteiramente no GitHub, para o mínimo de atrito.
tr: En az çakışma için I2P dışındaki kişilerle işbirliklerinin tamamen GitHub üzerinde yapılmasını bekliyorum.

source: Priority: Preparation for long-lived releases ---------------------------------------------
pt_br: Prioridade: Preparação para lançamentos de longa duração ---------------------------------------------
tr: Öncelik: Uzun ömürlü sürümler için hazırlık --------------------------------------------------

source: I2P is now in Debian Sid (their unstable repo) which will stablilise in around a year and a half, and has also been pulled into the Ubuntu repository for inclusion in the next LTS release in April. We are going to start having I2P versions that end up hanging around for years, and we need to ensure we can handle their presence in the network.
pt_br: O I2P agora está no Debian Sid (seu repositório instável) que se estabilizará em cerca de ano e meio, e também foi puxado para o repositório do Ubuntu para inclusão no próximo lançamento LTS em abril. Vamos começar a ter versões do I2P que acabam ficando por aí por anos, e precisamos garantir que podemos lidar com sua presença na rede.
tr: I2P şu anda Debian Sid üzerinde (kararsız depo) ve yaklaşık bir buçuk yıl içinde kararlı sürüme eklenecek. Ayrıca Nisan ayındaki bir sonraki LTS sürümüne katılmak üzere Ubuntu deposuna alındı. Yıllarca kullanılacak I2P sürümlerine sahip olmaya başlayacağımızdan ağdaki varlıklarını idare edebildiğimizden emin olmamız gerekiyor.

source: The primary goal here is to roll out as many of the new protocols as we feasibly can in the next year, to hit the next Debian stable release. For those that require multi-year rollouts, we should incorporate the forward-compatability changes as early as we can.
pt_br: O objetivo principal aqui é lançar o máximo possível de novos protocolos no próximo ano, para atingir o próximo lançamento estável do Debian. Para aqueles que exigem lançamentos de vários anos, devemos incorporar as mudanças de compatibilidade futura o mais cedo possível.
tr: Buradaki birinci hedef, bir sonraki Debian kararlı sürümüne ulaşmak için, önümüzdeki yıl içinde olabildiğince çok sayıda yeni iletişim kuralını kullanıma sunmaktır. Çok yıllı kullanıma sunulması gerekenler için, ileriye dönük uyumluluk değişikliklerini olabildiğince erken eklemeliyiz.

source: Priority: Pluginization of current apps ---------------------------------------
pt_br: Prioridade: Pluginização de aplicativos atuais ---------------------------------------
tr: Öncelik: Var olan uygulamaların uygulama ekine dönüştürülmesi ------------------------------------------

source: The Debian model encourages having separate packages for separate components. We agreed that decoupling the currently-bundled Java applications from the core Java router would be beneficial for several reasons: - It codifies the boundary between the applications and the router. - It should make it easier to get these apps running with non-Java routers. - It would enable third parties to create "I2P bundles" containing just the applications they want.
pt_br: O modelo Debian incentiva ter pacotes separados para componentes separados. Nós concordamos que desacoplar os aplicativos Java atualmente empacotados do roteador Java principal seria benéfico por vários motivos: - Codifica o limite entre os aplicativos e o roteador. - Deve facilitar a execução desses aplicativos com roteadores não Java. - Permitiria que terceiros criassem "pacotes I2P" contendo apenas os aplicativos que desejam.
tr: Debian modeli, ayrı bileşenler için ayrı paketlere sahip olmayı teşvik ediyor. Birkaç nedenle paketlenmiş Java uygulamalarını çekirdek Java yönelticisinden ayırmanın iyi olacağına karar verdik: - Uygulamalar ve yöneltici arasındaki sınırın kodlanmasını sağlar. - Bu uygulamaların Java olmayan yönelticilerle çalışmasını kolaylaştırır. - Üçüncü tarafların yalnızca istedikleri uygulamaları içeren "I2P paketleri" oluşturmasını sağlar.

source: In combination with the earlier priorities, this moves the main I2P project more in the direction of e.g. the Linux kernel. We will spend more time focusing on the network itself, leaving third-party developers to focus on applications that use the network (something that is significantly easier to do after our work in the last few years on APIs and libraries).
pt_br: Em combinação com as prioridades anteriores, isso move o projeto principal do I2P mais na direção, por exemplo, do kernel Linux. Passaremos mais tempo focando na rede em si, deixando os desenvolvedores terceirizados se concentrarem em aplicativos que usam a rede (algo que é significativamente mais fácil de fazer depois do nosso trabalho nos últimos anos em APIs e bibliotecas).
tr: Daha erken önceliklerle birlikte bu yaklaşım, ana I2P projesini Linux çekirdeği örneğindeki gibi doğru yola sokacak. Ağın kendisine odaklanmak için daha fazla zaman harcayacağız ve üçüncü taraf geliştiricilerin ağı kullanan uygulamalara odaklanmasını sağlayacağız (son birkaç yılda API uygulamaları ve kitaplıklar üzerinde yaptığımız çalışmalardan sonra bunu çok daha kolay yapabileceğiz).

source: Nice-to-have: App improvements ------------------------------
pt_br: O que é interessante: Melhorias no aplicativo ------------------------------
tr: Olsa iyi olur: Uygulama iyileştirmeleri ------------------------------

source: There are a bunch of app-level improvements that we want to work on, but do not currently have the developer time to do so, given our other priorities. This is an area we would love to see new contributors for! Once the above decoupling is complete, it will be significantly easier for someone to work on a specific application independently of the main Java router.
pt_br: Há um monte de melhorias no nível do aplicativo nas quais queremos trabalhar, mas não temos tempo de desenvolvedor para isso no momento, dadas as nossas outras prioridades. Esta é uma área para a qual adoraríamos ver novos colaboradores! Assim que o desacoplamento acima estiver concluído, será significativamente mais fácil para alguém trabalhar em um aplicativo específico independentemente do roteador Java principal.
tr: Üzerinde çalışmak istediğimiz bir sürü uygulama düzeyi iyileştirmesi var. Ancak diğer önceliklerimiz göz önüne alındığında şu anda geliştiricinin bunları yapmak için zamanı yok. Burası, katkıda bulunacak yeni kişileri görmek istediğimiz bir alandır! Yukarıdaki ayrıştırma tamamlandıktan sonra, bir kişinin ana Java yönelticisinden bağımsız olarak belirli bir uygulama üzerinde çalışması önemli ölçüde daha kolay olacaktır.

source: One such application we would love to have help with is I2P Android. We will be keeping it up-to-date with the core I2P releases, and fixing bugs as we can, but there is much that could be done to improve the underlying code as well as the usability.
pt_br: Um desses aplicativos com os quais gostaríamos de ter ajuda é o I2P Android. Estaremos mantendo-o atualizado com os principais lançamentos do I2P e corrigindo bugs conforme pudermos, mas há muito que poderia ser feito para melhorar o código subjacente, bem como a usabilidade.
tr: Örneğin I2P Android uygulaması için yardım almak istiyoruz. Uygulamayı temel I2P sürümleriyle güncel tutacağız ve hataları elimizden geldiğince düzelteceğiz. Ancak temel kodun yanında kullanılabilirliği geliştirmek için yapılabilecek çok şey var.

source: Priority: Susimail and I2P-Bote stabilisation ---------------------------------------------
pt_br: Prioridade: Estabilização do Susimail e I2P-Bote ---------------------------------------------
tr: Öncelik: Susimail ve I2P-Bote kararlılığı ---------------------------------------------

source: Having said that, we do want to work specifically on Susimail and I2P-Bote fixes in the near term (some of which have landed in 0.9.33). They have had less work over the last few years than other I2P apps, and so we want to spend some time bringing their codebases up to par, and making them easier for new contributors to jump into!
pt_br: Dito isso, queremos trabalhar especificamente nas correções do Susimail e do I2P-Bote no curto prazo (algumas das quais chegaram à versão 0.9.33). Eles tiveram menos trabalho nos últimos anos do que outros aplicativos I2P, então queremos gastar algum tempo trazendo suas bases de código ao nível, e tornando-as mais fáceis para novos contribuidores entrarem!
tr: Bununla birlikte, kısa dönemde özellikle Susimail ve I2P-Bote düzeltmeleri üzerinde çalışmak istiyoruz (bazıları 0.9.33 sürümüne eklendi). Son birkaç yılda diğer I2P uygulamalarına göre üzerlerinde daha az çalışıldı. Bu nedenle kod tabanlarını eşit düzeye getirmek ve katkıda bulunacak yeni kişilerin katılmasını kolaylaştırmaya biraz zaman harcamak istiyoruz!

source: Nice-to-have: Ticket triage ---------------------------
pt_br: Desejável: Triagem de tickets ---------------------------
tr: Olsa iyi olur: Destek kaydı öncelik sıralaması ---------------------------

source: We have a large backlog of tickets in a number of I2P subsystems and apps. As part of the above stabilisation effort, we would love to clean up some of our older long-standing issues. More importantly, we want to ensure that our tickets are correctly organised, so that new contributors can find good tickets to work on.
pt_br: Temos um grande acúmulo de tickets em vários subsistemas e aplicativos I2P. Como parte do esforço de estabilização acima, gostaríamos de limpar alguns dos nossos problemas mais antigos e antigos. Mais importante, queremos garantir que nossos tickets estejam organizados corretamente, para que novos colaboradores possam encontrar bons tickets para trabalhar .
tr: Bir dizi I2P alt sistemi ve uygulamasında çok sayıda istek birikti. Yukarıdaki kararlılık çabasının bir parçası olarak, uzun zamandır süren sorunların bazılarını temizlemeyi çok isteriz. Daha da önemlisi, katkıda bulunacak yeni kişilerin üzerinde çalışabileceği destek kayıtlarını bulabilmeleri için destek kayıtlarının doğru şekilde organize edildiğinden emin olmak istiyoruz.

source: Priority: User support ----------------------
pt_br: Prioridade: Suporte ao usuário ----------------------
tr: Öncelik: Kullanıcı desteği ----------------------
