Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: An Empirical Study of the I2P Anonymity Network and its Censorship Resistance
pt_br: Um estudo empírico da rede de anonimato I2P e sua resistência à censura
tr: I2P anonimlik ağı ve sansür direnişi ile ilgili deneysel bir çalışma

source: Highlighting Research - An Empirical Study of the I2P Anonymity Network and its Censorship Resistance
pt_br: Destacando a Pesquisa - Um Estudo Empírico da Rede de Anonimato I2P e sua Resistência à Censura
tr: Araştırmayı vurgulamak - I2P anonimlik ağı ve sansür direnişi ile ilgili deneysel bir çalışma

source: The following blog post is authored by Information Controls Fellow Hoàng Nguyên Phong. As an ICFP fellow, Phong's research focused on analyzing different aspects of the I2P network, a privacy-enhancing Internet tool that can be used to access online content over an anonymity-enhancing network helpful in circumventing state-imposed censorship. Working with his host organization, the University of Massachusetts Amherst, Phong studied the I2P network's censorship resilience, including identifying what blocking methods a state censor might use to inhibit access to I2P and investigating potential solutions to make I2P more resistant to such blockage.
pt_br: A seguinte postagem do blog foi escrita pelo Information Controls Fellow Hoàng Nguyên Phong. Como bolsista do ICFP, a pesquisa de Phong se concentrou em analisar diferentes aspectos da rede I2P, uma ferramenta de Internet que aumenta a privacidade e pode ser usada para acessar conteúdo online em uma rede que aumenta o anonimato, útil para contornar a censura imposta pelo estado. Trabalhando com sua organização anfitriã, a University of Massachusetts Amherst, Phong estudou a resiliência da censura da rede I2P, incluindo a identificação de quais métodos de bloqueio um censor estatal pode usar para inibir o acesso ao I2P e investigar soluções potenciais para tornar o I2P mais resistente a tal bloqueio.
tr: Aşağıdaki blog yazısı Controls üyesi Hoàng Nguyên Phong tarafından yazılmıştır. Bir ICFP üyesi olarak, Phong'un araştırması, devlet tarafından dayatılan sansürü atlatmaya yardımcı olan, anonimliği artıran bir ağ üzerinden çevrimiçi içeriğe erişmek için kullanılabilen ve kişisel gizliliği artıran bir İnternet aracı olan I2P ağının farklı yönlerini incelemeye odaklamış. Ev sahibi kuruluş olan Massachusetts Amherst Üniversitesi ile birlikte çalışan Phong, bir devlet sansürünün I2P ağına erişimi engellemek için hangi yöntemleri kullanabileceğini belirlemek ve I2P ağını böyle bir engellemeye karşı daha dirençli hale getirmek için olası çözümleri araştıran yazısında I2P ağının sansür direncini incelemiş.

source: Phong found blocking attempts on the I2P network (specifically via DNS poisoning, SNI-based blocking, TCP packet injection, and page-specific blocks) emanating from five countries: China, Oman, Qatar, Iran, and Kuwait. Phong posits that because the blocks are usually imposed on the I2P download page and reseed servers, such blocking could be mitigated by hosting download links to this content on large cloud service providers - raising the collateral cost of blocking. Phong also built a metrics portal for the platform so that researchers and others can better understand who is using I2P, finding that there are about 20,000 relays in the network on a daily basis.
pt_br: Phong encontrou tentativas de bloqueio na rede I2P (especificamente via DNS envenenamento, bloqueio baseado em SNI, injeção de pacotes TCP e bloqueios específicos de página) provenientes de cinco países: China, Omã, Catar, Irã e Kuwait. Phong postula que, como os bloqueios são geralmente impostos na página de download do I2P e servidores de reseed, tal bloqueio poderia ser mitigado hospedando links de download para este conteúdo em grandes provedores de serviços de nuvem - aumentando o custo colateral do bloqueio. Phong também construiu um portal de métricas para a plataforma para que pesquisadores e outros possam entender melhor quem está usando o I2P, descobrindo que há cerca de 20.000 relés na rede diariamente.
tr: Phong, I2P ağında engelleme girişimlerinin (özellikle DNS zehirlenmesi, SNI tabanlı engelleme, TCP paket enjeksiyonu ve sayfaya özel engelleme gibi) beş ülkeden kaynaklandığını tespit etti: Çin, Umman, Katar, İran ve Kuveyt. Phong, engellemeler genellikle I2P indirme sayfasına ve yeniden tohumlama sunucularına uygulandığından, bu tür bir engellemenin, bu içerik indirme bağlantılarının büyük bulut hizmeti sağlayıcılarında barındırılmasıyla hafifletilebileceğini ve böylece engellemenin ikincil maliyetini artıracağını öne sürüyor. Phong ayrıca araştırmacılar ve diğerlerinin I2P ağını kimin kullandığını daha iyi anlayabilmesi için bir platform ölçüm portalı oluşturdu ve ağda günlük olarak yaklaşık 20.000 aktarıcı olduğunu buldu.

source: (Excerpt taken from OTF blog post)
pt_br: (Trecho retirado da postagem do blog OTF)
tr: (OTF blog yazısından alınmıştır)

source: The research paper is also available here:
pt_br: O artigo de pesquisa também está disponível aqui:
tr: Araştırma makalesine şuradan da erişebilirsiniz:

source: We thank Phong and his collaborators for their excellent study as we move to address the issues that were identified. It's exciting to see more academic study of I2P and are excited to keep working with him.
pt_br: Agradecemos a Phong e seus colaboradores por seu excelente estudo enquanto nos movemos para abordar os problemas que foram identificados. É emocionante ver mais estudos acadêmicos de I2P e estamos animados para continuar trabalhando com ele.
tr: Belirlenen sorunları ele almak için ilerlerken mükemmel çalışmaları için Phong ve çalışma arkadaşlarına teşekkür ederiz. I2P hakkında daha fazla akademik çalışma görmek heyecan verici ve onunla çalışmayı sürdürmekten heyecan duyuyoruz.

source: 0.9.44 Release
pt_br: Lançamento 0.9.44
tr: 0.9.44 sürümü yayınlandı

source: 0.9.44 with bug fixes
pt_br: 0.9.44 com correção de bugs
tr: 0.9.44 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.44 contains an important fix for a denial of service issue in hidden services handling of new encryption types. All users should update as soon as possible.
pt_br: 0.9.44 contém uma correção importante para um problema de negação de serviço no processamento de novos tipos de criptografia de serviços ocultos. Todos os usuários devem atualizar o mais rápido possível.
tr: 0.9.44 sürümünde gizli hizmetlerde yeni şifreleme türleri işlenirken hizmet reddi sorununa yol açan önemli bir hata düzeltildi. Tüm kullanıcıların en kısa sürede bu sürüme geçmesini öneriyoruz.

source: The release includes initial support for new end-to-end encryption (proposal 144). Work continues on this project, and it is not yet ready for use. There are changes to the console home page, and new embedded HTML5 media players in i2psnark. Additional fixes for firewalled IPv6 networks are included. Tunnel build fixes should result in faster startup for some users.
pt_br: Essa versão contém suporte inicial para uma nova criptografia ponto-a-ponto (proposta 144). Este é trabalho em andamento e ainda não está pronto para uso. Há mudanças na pagina inicial do console, e novos media players HTML5 embutidos na i2psnark. Correções adicionais para redes IPV6 protegidas por firewall estão incluídas. Correção para a construção dos tuneis devem resultar em uma inicialização mais rápida para certos usuários.
tr: Bu sürümde ayrıca yeni uçtan uca şifreleme desteği bulunuyor (144 numaralı öneri) Bu proje üzerindeki çalışmalar sürüyor ve henüz tamamlanmadı. Pano ana sayfasında bazı değişiklikler yapıldı ve i2psnark içine yeni HTML5 ortam oynatıcısı eklendi. Güvenlik duvarı arkasındaki IPv6 ağları için ek düzeltmeler yapıldı. Tünel oluşturma düzeltmeleri ile bazı kullanıcıların uygulamayı daha hızlı başlatması sağlandı.

source: Console home page changes
pt_br: Alterações na página inicial do console
tr: Pano açılış sayfası değiştirildi

source: Initial code for new encryption (proposal 144)
pt_br: Código inicial para nova criptografia (proposta 144)
tr: Yeni şifreleme için ilk kod (144 numaralı öneri)

source: Router changes to support multiple encryption types
pt_br: Mudanças no roteador para oferecer suporte a vários tipos de criptografia
tr: Birden çok şifreleme türünü desteklemek için yöneltici değişiklikleri yapıldı

source: HTML5 players in i2psnark
pt_br: Players HTML5 em i2psnark
tr: i2psnark üzerine HTML5 oynatıcılar eklendi

source: Audio playlist in i2psnark
pt_br: Lista de reprodução de áudio no i2psnark
tr: i2psnark üzerine ses oynatma listesi eklendi

source: Change Windows data location to %LOCALAPPDIR% (new installs only)
pt_br: Alterar o local dos dados do Windows para %LOCALAPPDIR% (somente novas instalações)
tr: Windows veri konumu %LOCALAPPDIR% olarak değiştirildi (yalnızca yeni kurulumlar)

source: Fix AppArmor config for Java 11
pt_br: Corrigir configuração do AppArmor para Java 11
tr: Java 11 için AppArmor yapılandırması düzeltildi

source: Fix handling of unsupported encryption types
pt_br: Corrigir o tratamento de tipos de criptografia não suportados
tr: Desteklenmeyen şifreleme türlerinin ele alınışı düzeltildi

source: IPv6 firewalled fixes
pt_br: Correções de firewall IPv6
tr: Güvenlik duvarı arkasındaki IPv6 için düzeltmeler yapıldı

source: Fix long stop delay for some plugins
pt_br: Corrigir atraso de parada longo para alguns plugins
tr: Bazı uygulama eklerindeki uzun durma gecikmeleri düzeltildi

source: Fix custom icons for some plugins
pt_br: Corrigir ícones personalizados para alguns plugins
tr: Bazı uygulama eklerindeki özel simgeler düzeltildi

source: Fix exploratory tunnel build issues causing long startup times
pt_br: Corrigir problemas de construção de túnel exploratório que causam longos tempos de inicialização
tr: Uzun başlatma sürelerine neden olan keşif amaçlı tünel oluşturma sorunları düzeltildi

source: Prevent multiple zero-hop tunnels in a pool
pt_br: Evitar múltiplos túneis de salto zero em um pool
tr: Bir havuzda birden fazla sıfır atlamalı tünel olması engellendi

source: Recognize gettext 0.20 in build scripts
pt_br: Reconhecer gettext 0.20 em scripts de construção
tr: Derleme betiklerinde gettext 0.20 sürümünün tanınması sağlandı

source: Don't check clove ID in Bloom filter
pt_br: Não verifique a ID do cravo no filtro Bloom
tr: Bloom süzgecinde Clove kodunun denetlenmemesi sağlandı

source: Reduce SessionTag memory usage
pt_br: Reduzir o uso de memória do SessionTag
tr: SessionTag bellek kullanımı azaltıldı

source: Change default sig type to EdDSA for Android
pt_br: Alterar o tipo de assinatura padrão para EdDSA para Android
tr: Android için varsayılan imza türü EdDSA olarak değiştirildi

source: 0.9.45 Release
pt_br: Lançamento 0.9.45
tr: 0.9.45 sürümü yayınlandı

source: 0.9.45 with bug fixes
pt_br: 0.9.45 com bugs corrigidos
tr: 0.9.45 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.45 contains important fixes for hidden mode and the bandwidth tester. There's an update to the console dark theme. We continue work on improving performance and the development of new end-to-end encryption (proposal 144).
pt_br: 0.9.45 contém correções importantes para o modo oculto e o testador de largura de banda. Há uma atualização para o tema escuro do console. Continuamos a trabalhar na melhoria do desempenho e no desenvolvimento de uma nova encriptação de ponta a ponta (proposta 144).
tr: 0.9.45 sürümünde gizli kip ve bant genişliği ölçümü için önemli düzeltmeler yapıldı. Pano karanlık temasında bir güncelleme yapıldı. Başarımı iyileştirme ve yeni uçtan uca şifreleme geliştirme çalışmalarını sürdürüyoruz (144 numaralı öneri).

source: Dark theme improvements
pt_br: Melhorias no tema escuro
tr: Koyu tema iyileştirmeleri yapıldı

source: Console icon changes
pt_br: Alterações no ícone do console
tr: Pano simgeleri değiştirildi

source: Move some translations from console to router and core for embedded uses
pt_br: Mova algumas traduções do console para o roteador e núcleo para usos incorporados
tr: Gömülü kullanımlar için bazı çeviriler panodan yönelticiye ve çekirdeğe taşındı

source: i2psnark HTML5 preview player for partial files
pt_br: i2psnark Reprodutor de pré-visualização HTML5 para arquivos parciais
tr: Bazı dosyalar için i2psnark HTML5 ön izleme oynatıcısı eklendi

source: Numerous bandwidth test fixes
pt_br: Várias correções de teste de largura de banda
tr: Çok sayıda bant genişliği sınaması düzeltmesi yapıldı

source: Hidden mode fixes to prevent losing peers
pt_br: Correções de modo oculto para evitar perda de pares
tr: Eşleri kaybetmeyi önlemek için gizli kip düzeltmeleri yapıldı

source: Hebrew translation fixes
pt_br: Correções na tradução para o hebraico
tr: İbranice çevirisi eklendi

source: Content Security Policy improvements
pt_br: Melhorias na Política de Segurança de Conteúdo
tr: İçerik güvenliği ilkesinde iyileştirmeler yapıldı

source: SSU extend timeout for large messages
pt_br: SSU estende o tempo limite para mensagens grandes
tr: SSU: Büyük iletiler için zaman aşımı süresi uzatıldı

source: ECIES-X25519 continued development and fixes
pt_br: Desenvolvimento contínuo e correções do ECIES-X25519
tr: ECIES-X25519 geliştirmesi ve düzeltmeleri sürdürüldü

source: Cancel timeout jobs on message reply
pt_br: Cancelar trabalhos de tempo limite na resposta da mensagem
tr: İleti yanıtında zaman aşımı görevleri iptal edildi

source: Add SSL and SSL redirect support to EepGet
pt_br: Adicionar suporte a SSL e redirecionamento de SSL ao EepGet
tr: EepGet üzerine SSL ve SSL yönlendirme desteği eklendi

source: Update JBigI library
pt_br: Atualizar biblioteca JBigI
tr: JBigI kitaplığı güncellendi

source: Git over I2P for Users
pt_br: Git sobre I2P para usuários
tr: Kullanıcılar için I2P üzerinden Git

source: Git over I2P
pt_br: Git sobre I2P
tr: I2P üzerinden Git

source: Tutorial for setting up git access through an I2P Tunnel. This tunnel will act as your access point to a single git service on I2P. It is part of the overall effort to transition I2P from monotone to Git.
pt_br: Tutorial para configurar o acesso git por meio de um túnel I2P. Este túnel atuará como seu ponto de acesso a um único serviço git no I2P. Ele faz parte do esforço geral para fazer a transição do I2P de monotônico para o Git.
tr: I2P tüneli üzerinden Git erişimini ayarlama eğitimi. Bu tünel, I2P üzerindeki tek bir Git hizmetine erişim noktanız olarak davranır. I2P projesini Monotone üzerinden Git üzerine geçirme çalışmalarının bir parçasıdır.

source: Before anything else: Know the capabilities the service offers to the public
pt_br: Antes de mais nada: conheça as funcionalidades que o serviço oferece ao público
tr: Her şeyden önce: Hizmetin herkese sunduğu yetenekleri öğrenin

source: Depending on how the git service is configured, it may or may not offer all services on the same address. In the case of git.idk.i2p, there is a public HTTP URL, and an SSH URL(g6u4vqiuy6bdc3dbu6a7gmi3ip45sqwgtbgrr6uupqaaqfyztrka.b32.i2p) to configure for your Git SSH client. Either can be used to push or pull, but SSH is recommended.
pt_br: Dependendo de como o serviço git está configurado, ele pode ou não oferecer todos os serviços no mesmo endereço. No caso de git.idk.i2p, há uma URL HTTP pública e uma URL SSH (g6u4vqiuy6bdc3dbu6a7gmi3ip45sqwgtbgrr6uupqaaqfyztrka.b32.i2p) para configurar para seu cliente Git SSH. Qualquer pode ser usado para enviar ou receber, mas SSH é recomendado.
tr: Git hizmetinin nasıl yapılandırıldığına bağlı olarak, tüm hizmetler aynı adresten sunulabilir ya da sunulmayabilir. git.idk.i2p durumunda, Git SSH istemciniz için yapılandırılacak herkese açık bir HTTP adresi ve bir SSH adresi(g6u4vqiuy6bdc3dbu6a7gmi3ip45sqwgtbgrr6uupqaaqfyztrka.b32.i2p) vardır. Her ikisi de itme ya da çekme istekleri için kullanılabilir, ancak SSH kullanılması önerilir.

source: First: Set up an account at a Git service
pt_br: Primeiro: crie uma conta em um serviço Git
tr: Bir: Git hizmetinde bir hesap açın

source: To create your repositories on a remote git service, sign up for a user account at that service. Of course it’s also possible to create repositories locally and push them to a remote git service, but most will require an account and for you to create a space for the repository on the server. Gitlab has a very simple sign-up form:
pt_br: Para criar seus repositórios em um serviço git remoto, inscreva-se para uma conta de usuário naquele serviço. Claro que também é possível criar repositórios localmente e enviá-los para um serviço git remoto, mas a maioria exigirá uma conta e que você crie um espaço para o repositório no servidor. O Gitlab tem um formulário de inscrição muito simples:
tr: Uzak bir Git hizmetinde depolarınızı oluşturmak için o hizmette bir kullanıcı hesabı açın. Elbette, yerel depolar oluşturarak bunları uzak bir Git hizmetine gönderme seçeneğiniz de vardır. Ancak çoğu durumda bir hesap açılması ve sunucuda kendiniz için bir depo alanı oluşturmanız gerekir. GitLab hesap açma formu çok basittir:

source: Second: Create a project to test with
pt_br: Segundo: Crie um projeto para testar
tr: İki: Bir deneme projesi oluşturun

source: To make sure the setup process works, it helps to make a repository to test with from the server, and for the sake of this tutorial, we’re going to use a fork of the I2P router. First, browse to the i2p-hackers/i2p.i2p repository:
pt_br: Para garantir que o processo de configuração funcione, ajuda criar um repositório para testar com o servidor e, para o propósito deste tutorial, vamos usar um fork do roteador I2P. Primeiro, navegue até o repositório i2p-hackers/i2p.i2p:
tr: Kurulum işleminin çalıştığından emin olmak için sunucudan bir deneme havuzu oluşturmanızı sağlar. Bu eğitimin amacına yönelik olarak I2P yöneltici dalını kullanacağız. İlk olarak, i2p-hackers/i2p.i2p deposuna gidin:

source: Then, fork it to your account.
pt_br: Depois, bifurque-o para sua conta.
tr: Ardından, hesabınızda bir dalını oluşturun.

source: Third: Set up your git client tunnel
pt_br: Terceiro: configure seu túnel de cliente git
tr: Üç: Git istemci tünelinizi kurun

source: To have read-write access to my server, you’ll need to set up a tunnel for your SSH client. As an example, we’re going to use the HTTP tunnel instead, but if all you need is read-only, HTTP/S cloning, then you can skip all this and just use the http_proxy environment variable to configure git to use the pre-configured I2P HTTP Proxy. For example:
pt_br: Para ter acesso de leitura e gravação ao meu servidor, você precisará configurar um túnel para seu cliente SSH. Como exemplo, usaremos o túnel HTTP em vez disso, mas se tudo o que você precisa é somente leitura, clonagem HTTP/S, então você pode pular tudo isso e usar apenas a variável de ambiente http_proxy para configurar o git para usar o Proxy HTTP I2P pré-configurado. Por exemplo:
tr: Sunucuma okuma-yazma erişimine sahip olmak için SSH istemciniz için bir tünel kurmanız gerekecek. Örnek olarak, bunun yerine HTTP tünelini kullanacağız. Ancak yalnızca salt okunur erişime, HTTP/S kopyalamaya gerek duyuyorsanız, tüm bunları atlayabilir ve Git yapılandırması için önceden hazırlanmış I2P HTTP vekil sunucusunu kullanmak amacıyla http_proxy ortam değişkenini kullanabilirsiniz. Örneğin:

source: Then, add the address you will be pushing and pulling from. Note that this example address is for Read-Only HTTP-over-I2P clones, if your admin does not allow the git HTTP(Smart HTTP) protocol, then you will need to get the SSH clone base32 from them. Use this Base32 to connect the client tunnel to the Git SSH service: **g6u4vqiuy6bdc3dbu6a7gmi3ip45sqwgtbgrr6uupqaaqfyztrka.b32.i2p**
pt_br: Em seguida, adicione o endereço do qual você fará push e pull. Observe que este endereço de exemplo é para clones HTTP-over-I2P somente leitura, se seu administrador não permitir o protocolo git HTTP (Smart HTTP), então você precisará obter o clone SSH base32 deles. Use este Base32 para conectar o túnel do cliente ao serviço Git SSH: **g6u4vqiuy6bdc3dbu6a7gmi3ip45sqwgtbgrr6uupqaaqfyztrka.b32.i2p**
tr: Ardından, itme ve çekme istekleri için kullanacağınız adresi ekleyin. Bu örnek adresin I2P üzerinden salt okunur HTTP kopyaları için olduğunu unutmayın. Yöneticiniz Git HTTP(Akıllı HTTP) iletişim kuralına izin vermiyorsa, SSH kopyasının base32 adresini almanız gerekecektir. İstemci tünelini Git SSH hizmetine bağlamak için şu Base32 adresini kullanın: **g6u4vqiuy6bdc3dbu6a7gmi3ip45sqwgtbgrr6uupqaaqfyztrka.b32.i2p**

source: Pick a port to forward the I2P service to locally.
pt_br: Escolha uma porta para encaminhar o serviço I2P localmente.
tr: I2P hizmetinin yerel olarak iletileceği bir bağlantı noktası seçin.

source: I use it alot, so I start my client tunnel automatically, but it’s up to you.
pt_br: Eu o uso muito, então inicio meu túnel de cliente automaticamente, mas fica a critério de você.
tr: Çok kullandığım için istemci tünelimi otomatik olarak başlatıyorum ama bu size kalmış.

source: When you’re all done, it should look alot like this.
pt_br: Quando terminar, deve ficar parecido com isso.
tr: Her şey bittiğinde, buna çok benzemeli.

source: Fourth: Attempt a clone
pt_br: Quarto: Tente um clone
tr: Dört: Bir kopya oluşturmayı deneyin

source: Now your tunnel is all set up, you can attempt a clone over SSH.
pt_br: Agora que seu túnel está configurado, você pode tentar uma clonagem via SSH.
tr: Artık tüneliniz hazır, SSH üzerinden kopyalamayı deneyebilirsiniz.

source: You might get an error where the remote end hangs up unexpectedly. Unfortunately git still doesn’t support resumable cloning. Until it does, there are a couple fairly easy ways to handle this. The first and easiest is to try and clone to a shallow depth:
pt_br: Você pode receber um erro em que o terminal remoto desliga inesperadamente. Infelizmente, o git ainda não suporta clonagem retomável. Até que faça isso, há algumas maneiras bem fáceis de lidar com isso. A primeira e mais fácil é tentar clonar para uma profundidade rasa:
tr: Uzak ucun beklenmedik bir şekilde kapandığı ile ilgili bir hata görebilirsiniz. Ne yazık ki Git, hala sürdürülebilir kopyalamayı desteklemiyor. Bunu yapana kadar, bu sorunu aşmanın oldukça kolay birkaç yolu var. İlk ve en kolayı, sığ bir derinliğe kopyalamaya çalışmaktır:

source: Once you’ve performed a shallow clone, you can fetch the rest resumably by changing to the repo directory and running:
pt_br: Depois de executar uma clonagem superficial, você pode buscar o restante normalmente em , mudando para o diretório do repositório e executando:
tr: Sığ bir kopyalama gerçekleştirdikten sonra, depo klasörüne geçerek ve aşağıdakileri çalıştırarak geri kalanını sürdürerek alabilirsiniz:

source: At this point, you still don’t have all your branches yet. You can get them by running the following commands:
pt_br: Neste ponto, você ainda não tem todos os seus branches. Você pode obter deles executando os seguintes comandos:
tr: Bu noktada, henüz tüm dallarınıza sahip değilsiniz. Aşağıdaki komutları çalıştırarak onları alabilirsiniz:

source: Which tells git to alter the repository configuration so that fetching from origin fetches all branches.
pt_br: O que diz ao git para alterar a configuração do repositório para que buscar da origem busque todos os ramos.
tr: Bu komutlar, Git yazılımına kaynaktan alma sırasında tüm dallar alınacak şekilde depo yapılandırmasını değiştirmesini söyler.

source: If that doesn’t work, you can try opening the tunnel configuration menu and adding some backup tunnels.
pt_br: Se isso não funcionar, você pode tentar abrir o menu de configuração do túnel e adicionar alguns túneis de backup.
tr: Bu işe yaramazsa, tünel yapılandırma menüsünü açarak bazı yedek tüneller eklemeyi deneyebilirsiniz.
