Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: I2P Android has existed for over three years. In that time, it has evolved from a simple test project into a usable, useful Android port of the I2P router. Our eventual goal has been to release I2P Android on Google Play, to make it easier for users to discover, install and use I2P on their Android devices. After much work improving the user interface, fixing bugs and testing, we think that I2P Android is finally ready to go where the users are.
pt_br: O I2P Android existe há mais de três anos. Nesse tempo, ele evoluiu de um simples projeto de teste para uma porta Android útil e utilizável do roteador I2P. Nosso objetivo final foi lançar o I2P Android no Google Play, para tornar mais fácil para os usuários descobrirem, instalarem e usarem o I2P em seus dispositivos Android. Depois de muito trabalho melhorando a interface do usuário, corrigindo bugs e testando, achamos que o I2P Android está finalmente pronto para ir onde os usuários estão.
tr: I2P Android, üç yılı aşkın bir süredir varlığını sürdürüyor. O zaman, basit bir deneme projesiyken I2P yönelticinin kullanışlı, bir Android sürümüne dönüştü. Son hedefimiz, kullanıcıların I2P uygulamasını Android aygıtlarında bulmasını, kurmasını ve kullanmasını kolaylaştırmak için Google Play üzerinde I2P Android sürümünü yayınlamaktı. Kullanıcı arayüzünü geliştirmek, hataları düzeltmek ve denemek için çok çalıştıktan sonra, I2P Android sürümünün nihayet kullanıcıların olduğu yere gitmeye hazır olduğunu düşünüyoruz.

source: Initially, we are only releasing to Android users in Norway, as a test run. I2P Android will have far more exposure on Google Play than it has ever had before, and there will be bugs and usability issues that we need to fix. It will be much easier (and less stressful!) to respond to feedback if we only need to deal with reports from hundreds of users instead of thousands (already orders of magnitude more feedback than we have ever had).
pt_br: Inicialmente, estamos lançando apenas para usuários do Android na Noruega, como um teste. I2P O Android terá muito mais exposição no Google Play do que nunca, e haverá bugs e problemas de usabilidade que precisamos corrigir. Será muito mais fácil (e menos estressante!) responder ao feedback se precisarmos lidar apenas com relatórios de centenas de usuários em vez de milhares (já ordens de magnitude mais feedback do que já tivemos).
tr: Başlangıçta, deneme uygulaması olarak yalnızca Norveç içindeki Android kullanıcılarına sunuyoruz. I2P Android, Google Play üzerinde daha önce hiç olmadığı kadar çok görünür olacak ve düzeltmemiz gereken hatalar ve kullanılabilirlik sorunları olacak. Binlerce kullanıcı yerine yalnızca yüzlerce kullanıcıdan gelen bildirimlerle (şimdiye kadar aldığımızdan çok daha fazla) ilgilenmemiz gerekirse, yanıt vermemiz çok daha kolay (ve daha az stresli!) olacak.

source: Simultaneously we are making the first public release of Bote, an Android port of `I2P-Bote`__. Bote is private, distributed, secure email, made easy. It runs on top of the I2P network, and while it works as a standalone app, it will use the I2P Android app by default if installed. As with I2P Android, we are initially only releasing Bote to Android users in Norway.
pt_br: Simultaneamente, estamos fazendo o primeiro lançamento público do Bote, uma porta Android do `I2P-Bote`__. O Bote é um e-mail privado, distribuído e seguro, facilitado. Ele roda em cima da rede I2P e, embora funcione como um aplicativo independente, ele usará o aplicativo I2P Android por padrão, se instalado. Assim como no I2P Android, estamos inicialmente lançando o Bote apenas para usuários Android na Noruega.
tr: Aynı zamanda, bir Android `I2P-Bote`__ sürümü olan Bote uygulamasının ilk genel sürümünü oluşturuyoruz. Bote, kişisel, dağıtılmış, güvenli ve kolaylaştırılmış bir e-posta uygulamasıdır. I2P ağının üzerinde çalışır ve bağımsız bir uygulama olarak çalışırken, kurulmuş ise varsayılan olarak I2P Android uygulamasını kullanır. I2P Android için olduğu gibi, başlangıçta Bote uygulamasını yalnızca Norveç içindeki Android kullanıcılarına sunuyoruz.

source: The apps are being released on Google Play by `The Privacy Solutions Project`__. See their `blog post`__ for further information, and links to the Google Play page for Norway users.
pt_br: Os aplicativos estão sendo lançados no Google Play pelo `The Privacy Solutions Project`__. Veja a `postagem do blog`__ para mais informações e links para a página do Google Play para usuários da Noruega.
tr: Uygulamalar, `The Privacy Solutions Project`__ tarafından Google Play üzerinde yayınlanıyor. Ayrıntılı bilgi almak ve Norveç içindeki kullanıcılar için Google Play sayfa bağlantılarını `blog yazılarında`__ bulabilirsiniz.

source: As lead developer for I2P Android and Bote, I look forward to your comments. You are the people who will be using them, and your perspectives will help me craft simple, intuitive apps that make privacy accessible to everyone.
pt_br: Como desenvolvedor líder do I2P Android e Bote, aguardo seus comentários. Vocês são as pessoas que os usarão, e suas perspectivas me ajudarão a criar aplicativos simples e intuitivos que tornam a privacidade acessível a todos.
tr: I2P Android ve Bote uygulamalarının baş geliştiricisi olarak yorumlarınızı bekliyorum. Bu uygulamaları kullanacak olan sizlersiniz ve bakış açılarınız, kişisel gizliliği herkes için erişilebilir kılan basit, sezgisel uygulamalar oluşturmama yardımcı olacak.

source: Website release details
pt_br: Detalhes do lançamento do site
tr: Site sürüm bilgileri

source: We have also updated I2P Android on the website to match the release candidate deployed in Norway. This version will be updated with changes as we respond to feedback from Norwegian users, heading towards our next stable release.
pt_br: Também atualizamos o I2P Android no site para corresponder ao release candidate implantado na Noruega. Esta versão será atualizada com alterações conforme respondermos ao feedback de usuários noruegueses, caminhando em direção ao nosso próximo lançamento estável.
tr: Ayrıca, Norveç içinde dağıtılan sürüm adayına uyacak şekilde I2P Android uygulamasını sitede güncelledik. Norveçli kullanıcılardan gelen geri bildirimlere yanıt verirken ve bir sonraki kararlı sürüme doğru ilerlerken yapılan değişiklikler güncellenecek.

source: Please note that we have upgraded the Android API to 9. This means that Froyo Android 2.2 will not be supported anymore; the minimum requirement is now Gingerbread Android 2.3.
pt_br: Observe que atualizamos a API do Android para 9. Isso significa que o Froyo Android 2.2 não será mais suportado; o requisito mínimo agora é Gingerbread Android 2.3.
tr: Lütfen Android API 9 sürümüne geçtiğimizi unutmayın. Bu durum, Froyo Android 2.2 sürümünün artık desteklenmeyeceği anlamına geliyor. Artık en düşük gereksinim Gingerbread Android 2.3 sürümüdür.

source: Also note that if you have an earlier version of I2P Android, you will need to uninstall and reinstall because we have changed the release keys. Further information about this will be provided in a subsequent blog post.
pt_br: Observe também que se você tiver uma versão anterior do I2P Android, você precisará desinstalar e reinstalar porque alteramos as chaves de lançamento. Mais informações sobre isso serão fornecidas em uma postagem de blog subsequente.
tr: Ayrıca, I2P Android uygulamasının daha eski bir sürümünü kullanıyorsanız, sürüm anahtarlarını değiştirdiğimiz için uygulamayı kaldırıp yeniden kurmanız gerekeceğini unutmayın. Bu konuda daha fazla bilgiyi sonraki bir blog yazısında vereceğiz.

source: ============== 0.9.15 Release ==============
pt_br: ============================= Lançamento da versão 0.9.15 =============================
tr: ===================== 0.9.15 sürümü yayınlandı =====================

source: 0.9.15 includes Ed25519 crypto and many fixes
pt_br: 0.9.15 inclui criptografia Ed25519 e muitas correções
tr: 0.9.15 sürümü Ed25519 şifrelemesi ve pek çok düzeltme ile yayınlandı

source: 0.9.15 adds preliminary support for Ed25519 EdDSA signatures. It includes a new persistent configuration backend for i2psnark and fixes several issues with i2psnark's handling of file names. There are several improvements to speed up SAM. Plugins now support stronger signatures in the su3 file format. Plugin installation via the console, which was disabled in 0.9.14, is re-enabled.
pt_br: 0.9.15 adiciona suporte preliminar para assinaturas EdDSA Ed25519. Inclui um novo backend de configuração persistente para i2psnark e corrige vários problemas com o tratamento de nomes de arquivo pelo i2psnark. Há várias melhorias para acelerar o SAM. Os plugins agora oferecem suporte a assinaturas mais fortes no formato de arquivo su3. A instalação de plugins via console, que foi desabilitada em 0.9.14, foi reabilitada.
tr: 0.9.15 sürümünde, Ed25519 EdDSA imzaları için ön hazırlık yapıldı. i2psnark için yeni bir kalıcı yapılandırma arka ucu hazırlandı ve Dosya adlarının i2psnark tarafından işlenmesiyle ilgili birkaç sorun giderildi. SAM hızını arttırmak için birkaç iyileştirme yapıldı. Uygulama ekleri artık su3 dosya biçimindeki daha güçlü imzaları destekliyor. 0.9.14 sürümünde devre dışı bırakılan pano üzerinden uygulama eki kurulumu yeniden etkinleştirildi.

source: We have supported ECDSA signatures since 0.9.12, and we would like to start using ECDSA by default. Unfortunately, some of you are still running older I2P versions, and for others, their distribution or Java runtime does not support ECDSA. Red Hat (RHEL, Fedora) distributions are reported to be missing ECDSA. Some have fixed the Java issues by upgrading from Java 6 to Java 7; others have had success with installing the "unlimited strength policy files". We've added information about missing crypto to the log file and the /logs page in the console. After you update to 0.9.15, please check if you are missing ECDSA support, and attempt to fix it if necessary. This is particularly important for those that run popular eepsites and services.
pt_br: Oferecemos suporte a assinaturas ECDSA desde 0.9.12 e gostaríamos de começar a usar ECDSA por padrão. Infelizmente, alguns de vocês ainda estão executando versões antigas do I2P e, para outros, sua distribuição ou Java runtime não oferece suporte a ECDSA. As distribuições Red Hat (RHEL, Fedora) são relatadas como não tendo ECDSA. Alguns corrigiram os problemas do Java atualizando do Java 6 para o Java 7; outros tiveram sucesso ao instalar os "arquivos de política de força ilimitada". Adicionamos informações sobre criptografia ausente ao arquivo de log e à página /logs no console. Após atualizar para 0.9.15, verifique se está faltando suporte a ECDSA e tente consertá-lo, se necessário. Isso é particularmente importante para aqueles que administram eepsites e serviços populares.
tr: 0.9.12 sürümünden beri ECDSA imzalarını destekliyoruz ve varsayılan olarak ECDSA kullanımına geçmek istiyoruz. Ne yazık ki, bazılarınız hala eski I2P sürümlerini çalıştırıyor ve bazılarınızın dağıtımları veya kullandıkları Java runtime ECDSA desteklemiyor. Red Hat (RHEL, Fedora) dağıtımlarında ECDSA paketinin eksik olduğu bildiriliyor. Bazı kullanıcıların Java sorunları Java 6 sürümünden Java 7 sürümüne geçildiğinde düzeldi. Bazıları "sınırsız güç ilkesi dosyalarını" kurarak başarılı sorunları çözdüler. Günlük dosyasına ve panodaki /logs sayfasına şifreleme hakkında eksik olan bilgileri ekledik. 0.9.15 sürümüne güncelledikten sonra, lütfen ECDSA desteğinin eksik olup olmadığını denetleyin ve gerekirse düzeltmeye çalışın. Bu durum, özellikle sık kullanılan eepsiteleri ve hizmetleri çalıştıranlar için önemlidir.

source: Changes
pt_br: Modificações
tr: Değişiklikler

source: Add support for Ed25519 signatures
pt_br: Adicionar suporte para assinaturas Ed25519
tr: Ed25519 imzaları için destek eklendi

source: i2psnark move to separate config file for each torrent to better support per-torrent settings
pt_br: i2psnark move para arquivo de configuração separado para cada torrent para melhor suporte às configurações por torrent
tr: i2psnark üzerinde, torrentler için bağımsız ayarları desteklemek amacıyla her torrent için ayrı yapılandırma dosyası kullanımına geçildi

source: Add i2psnark support for data outside the i2psnark/ directory
pt_br: Adicionar suporte i2psnark para dados fora do diretório i2psnark/
tr: i2psnark/ klasörü dışındaki veriler için i2psnark desteği eklendi

source: Enable stronger signatures (su3 format) for plugins
pt_br: Habilitar assinaturas mais fortes (formato su3) para plugins
tr: Uygulama ekleri için daha güçlü imzalar (su3 biçimi) etkinleştirildi

source: Speed up SSU introductions by responding to hole punch messages
pt_br: Acelere as introduções do SSU respondendo às mensagens de perfuração
tr: Delgeç iletilerine yanıt verilerek SSU tanıtımları hızlandırıldı

source: Several improvements in SAM efficiency
pt_br: Várias melhorias na eficiência do SAM
tr: SAM verimliliğinde çeşitli iyileştirmeler yapıldı

source: Form submission fixes in the console and i2psnark
pt_br: Correções de envio de formulários no console e i2psnark
tr: Panoda ve i2psnark üzerinde form gönderme düzeltmeleri yapıldı

source: Streaming fixes for long signatures
pt_br: Correções de streaming para assinaturas longas
tr: Uzun imzalar için akış düzeltmeleri yapıldı

source: i2psnark fixes for file name character mapping when seeding
pt_br: i2psnark corrige mapeamento de caracteres de nome de arquivo durante a semeadura
tr: i2psnark üzerinde tohumlama sırasında dosya adı karakter eşlemesi düzeltildi

source: I2PTunnel fixes stopping client tunnels
pt_br: I2PTunnel corrige interrupção de túneis de cliente
tr: I2PTunnel, istemci tünellerinin durması düzeltildi

source: I2PTunnel fix updating options on a running delay-open client tunnel
pt_br: I2PTunnel corrige opções de atualização em um túnel de cliente aberto com atraso em execução
tr: Çalışan bir gecikmeli açık istemci tünelinde I2PTunnel güncelleme seçenekleri düzeltildi

source: Re-enable plugin installation via the console, removed in 0.9.14
pt_br: Reative a instalação do plugin via console, removido na versão 0.9.14
tr: 0.9.14 sürümünde kaldırılan pano aracılığıyla uygulama eki kurulumu yeniden etkinleştirildi

source: i2psnark now remembers uploaded count across restarts
pt_br: i2psnark agora lembra a contagem de uploads em reinicializações
tr: i2psnark artık yeniden başlatma sonrası yüklenen dosya sayısını hatırlıyor

source: i2psnark increase max piece size to 8 MB
pt_br: i2psnark aumenta o tamanho máximo da peça para 8 MB
tr: i2psnark: en büyük parça boyutu 8MB olarak artırıldı

source: i2psnark several UI fixes
pt_br: i2psnark várias correções de IU
tr: i2psnark kullanıcı arayüzünde bir kaç düzeltme yapıldı

source: Prohibit SSU peer test requests unless a connection is established
pt_br: Proibir solicitações de teste de pares SSU, a menos que uma conexão seja estabelecida
tr: Bir bağlantı kurulmadıkça gelen SSU eş sınama istekleri engellendi

source: i2ptunnel add support for local SSL connections for standard and IRC client tunnels
pt_br: i2ptunnel adiciona suporte para conexões SSL locais para túneis de cliente padrão e IRC
tr: i2ptunnel, standart ve IRC istemci tünelleri için yerel SSL bağlantıları desteği eklendi

source: Console and log warnings for unavailable crypto
pt_br: Avisos de console e log para criptografia indisponível
tr: Şifreleme kullanılamadığında pano ve günlük uyarıları eklendi

source: More consistent routing for Delivery Status Messages to reduce network connections
pt_br: Roteamento mais consistente para mensagens de status de entrega para reduzir conexões de rede
tr: Ağ bağlantılarını azaltmak için taşıyıcı durumu iletilerinde daha tutarlı yöneltme yapıldı

source: Disable external entities in UPnP XML parser
pt_br: Desabilitar entidades externas no analisador XML UPnP
tr: UPnP XML işleyicide dış varlıklar devre dışı bırakıldı

source: Update GeoIP data (in both new installs and updates)
pt_br: Atualizar dados GeoIP (em novas instalações e atualizações)
tr: GeoIP verileri güncellendi (yeni kurulumlar ve güncellemeler)

source: ============== 0.9.16 Release ==============
pt_br: ============================= Lançamento da versão 0.9.16 =============================
tr: ===================== 0.9.16 sürümü yayınlandı =====================

source: 0.9.16 includes crypto migration and many fixes
pt_br: 0.9.16 inclui migração de criptografia e muitas correções
tr: 0.9.16 sürümü şifreleme geçişi ve pek çok düzeltme ile yayınlandı

source: 0.9.16 is a significant step forward in our plan to migrate from DSA to ECDSA and then EdDSA cryptographic signatures, and makes several other changes to increase your anonymity and security. Client tunnels for standard, IRC, and SOCKS IRC will use ECDSA signatures by default. In addition, we've fixed a large number of serious bugs, including console lockups.
pt_br: 0.9.16 é um passo significativo em nosso plano de migrar de DSA para ECDSA e então assinaturas criptográficas EdDSA, e faz várias outras mudanças para aumentar seu anonimato e segurança. Túneis de cliente para IRC padrão, IRC e SOCKS usarão assinaturas ECDSA por padrão. Além disso, corrigimos um grande número de bugs sérios, incluindo travamentos de console.
tr: 0.9.16 sürümünde, geçiş planımızda ileriye doğru atılmış önemli bir adımdır DSA => ECDSA => EdDSA şifreleme imzalarına geçiş yapıyor. Ayrıca anonimliğinizi ve güvenliğinizi artırmak için birkaç değişiklik daha bulunuyor. Standart, IRC ve SOCKS IRC için istemci tünelleri, varsayılan olarak ECDSA imzalarını kullanacak. Ayrıca, pano kilitlenmeleri ile birlikte çok sayıda ciddi hata düzeltildi.

source: Changes in router data structures will require i2pcontrol plugin users to update to version 0.0.9.
pt_br: Alterações nas estruturas de dados do roteador exigirão que os usuários do plugin i2pcontrol atualizem para a versão 0.0.9.
tr: Yöneltici veri yapılarındaki değişiklikler nedeniyle, i2pcontrol uygulama eki kullanıcıları 0.0.9 sürümüne güncellemelidir.

source: If you run an eepsite or a service and you are not running a recent release, or your Java or OS does not support ECDSA (as noted in the logs and on the /logs page in the console), please fix the issue as soon as possible or your users will soon be unable to connect.
pt_br: Se você executa um eepsite ou um serviço e não está executando uma versão recente, ou seu Java ou sistema operacional não suporta ECDSA (conforme observado nos logs e na página /logs no console), corrija o problema o mais rápido possível ou seus usuários logo não conseguirão se conectar.
tr: Bir eepsitesi ya da hizmet işletiyorsanız ve yeni bir sürüm kullanmıyorsanız ya da kullandığınız Java veya işletim sisteminiz ECDSA imzalamayı desteklemiyorsa (günlüklerden ve panodaki /logs sayfasından görebileceğiniz gibi), sorunu en kısa sürede düzeltmelisiniz yoksa kullanıcılarınız yakında bağlantı kuramayacak.

source: Add support for stronger Router Info signatures
pt_br: Adicionar suporte para assinaturas de informações do roteador mais fortes
tr: Daha güçlü yöneltici bilgisi imzaları desteği eklendi

source: Encrypt RI lookups and responses on faster boxes
pt_br: Criptografar pesquisas e respostas de RI em caixas mais rápidas
tr: Daha hızlı donanımlarda RI aramaları ve yanıtları şifrelendi

source: Require I2CP authorization for all messages when enabled (requires 0.9.11 or higher client)
pt_br: Exigir autorização I2CP para todas as mensagens quando habilitado (requer cliente 0.9.11 ou superior)
tr: Etkinleştirildiğinde tüm iletiler için I2CP kimlik doğrulaması gerekir (istemci sürümünün 0.9.11 veya üzerinde olması gerekir)

source: Disable SSLv3 and older ciphers for reseeding and other uses of SSL
pt_br: Desabilitar SSLv3 e cifras mais antigas para repropagação e outros usos de SSL
tr: Yeniden tohumlama ve diğer SSL kullanımları için SSLv3 ve daha eski şifreleyiciler devre dışı bırakıldı

source: Use ECDSA by default for i2ptunnel IRC, SOCKS-IRC, and standard client tunnels
pt_br: Use ECDSA por padrão para i2ptunnel IRC, SOCKS-IRC e túneis de cliente padrão
tr: i2ptunnel IRC, SOCKS-IRC ve standart istemci tünelleri için varsayılan olarak ECDSA imzalamasına geçildi

source: Don't prefer floodfills in some countries
pt_br: Não prefira aterros sanitários em alguns países
tr: Bazı ülkelerde otomatik doldurma yapılmıyor

source: New column sorting, set-all priority buttons, and upload ratio display in i2psnark
pt_br: Nova classificação de colunas, botões de prioridade definida e exibição de taxa de upload no i2psnark
tr: i2psnark üzerinde yeni sütun sıralama, tüm önceliği ayarlama düğmeleri ve yükleme hızı görünümü özellikleri eklendi

source: Increase i2psnark tunnel default to 3 hops
pt_br: Aumentar o túnel i2psnark padrão para 3 saltos
tr: i2psnark tüneli varsayılan olarak 3 durağa yükseltildi

source: Implement bundling of multiple fragments in a single SSU message for efficiency
pt_br: Implementar o agrupamento de vários fragmentos em uma única mensagem SSU para eficiência
tr: Verimlilik için tek bir SSU iletisinde birden çok parçanın gruplanması sağlandı

source: New add-to-addressbook links on netdb leaseset page
pt_br: Novos links para adicionar ao catálogo de endereços na página netdb leaseset
tr: "Ağ veri tabanı" (NetDB) "Kiralama kümesi" (LeaseSet) sayfasına, adres defterine ekleme bağlantıları eklendi

source: Implement I2NP DatabaseLookupMessage search type field to improve lookup efficiency
pt_br: Implementar o campo de pesquisa do tipo I2NP DatabaseLookupMessage para melhorar a eficiência da pesquisa
tr: Arama verimliliğini artırmak için I2NP "Veri tabanı arama iletisi" (DatabaseLookupMessage) arama türü alanı eklendi

source: CPUID fixes and updates for recent processors
pt_br: Correções e atualizações de CPUID para processadores recentes
tr: Son işlemci türleri için CPUID düzeltmeleri ve güncellemeleri yapıldı

source: i2psnark fix magnet links with %(pc)s-encoding
pt_br: i2psnark corrige links magnéticos com codificação %(pc)s
tr: %(pc)s ile kodlanmış i2psnark magnet bağlantıları düzeltildi

source: Improve handling of SSU socket closing out from under us (hopefully fix 100%(pc)s CPU)
pt_br: Melhorar o tratamento do fechamento do soquete SSU por baixo de nós (espero consertar 100%(pc)s CPU)
tr: Altımızdan kapanan SSU soketinin kullanımını iyileştirildi (%(pc)s100 işlemci kullanımının düzeltildiğini umuyoruz)

source: SSU bitfield handling fixes
pt_br: Correções de manipulação de bitfield SSU
tr: SSU bit alanı işleme düzeltmeleri yapıldı

source: Fix HTTP header issues in i2psnark
pt_br: Corrigir problemas de cabeçalho HTTP no i2psnark
tr: i2psnark üzerinde HTTP üst bilgi sorunları düzeltildi

source: Fix rare NPE when building garlic message
pt_br: Corrigir NPE raro ao criar mensagem de alho
tr: Garlic iletisi oluştururken nadir görülen NPE düzeltildi

source: Fix console lockups (hopefully)
pt_br: Corrigir travamentos do console (espero)
tr: Pano kilitlenlenmeleri düzeltildi (umuyoruz)

source: Fix i2ptunnel js confirm-delete
pt_br: Corrigir i2ptunnel js confirm-delete
tr: i2ptunnel js confirm-delete düzeltildi

source: Move router data structures from i2p.jar to router.jar (breaks i2pcontrol plugin)
pt_br: Mover estruturas de dados do roteador de i2p.jar para router.jar (quebra o plugin i2pcontrol)
tr: Yöneltici veri yapılarını i2p.jar üzerinden router.jar üzerine taşındı (i2pcontrol uygulama ekini bozar)

source: New router keys now stored in router.keys.dat (eepPriv.dat format) instead of router.keys
pt_br: Novas chaves de roteador agora armazenadas em router.keys.dat (formato eepPriv.dat) em vez de router.keys
tr: Yeni yöneltici anahtarları artık router.keys yerine router.keys.dat dosyasında (eepPriv.dat biçiminde) depolanıyor
