Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: For the SSH interface, use a “Standard” server tunnel. From http://127.0.0.1:7657/i2ptunnelmgr launch the “New Tunnel Wizard” and enter the following values at each step:
pt_br: Para a interface SSH, use um túnel de servidor “Standard”. De http://127.0.0.1:7657/i2ptunnelmgr inicie o “New Tunnel Wizard” e insira os seguintes valores em cada etapa:
tr: SSH arayüzü için bir “Standart” sunucu tüneli kullanın. http://127.0.0.1:7657/i2ptunnelmgr adresinden “Yeni tünel yardımcını” başlatın ve her adımda aşağıdaki şekilde ilerleyin:

source: Select “Standard Server”
pt_br: Selecione “Servidor Padrão”
tr: “Standard sunucu” seçin

source: Fill in “Gitlab SSH Service” or otherwise describe the tunnel
pt_br: Preencha “Gitlab SSH Service” ou descreva o túnel de outra forma
tr: “GitLab SSH hizmeti” yazın veya tünele başka bir ad verin

source: Fill in ``127.0.0.1`` for the host and ``8022`` for the port.
pt_br: Preencha ``127.0.0.1`` para o host e ``8022`` para a porta.
tr: Sunucu olarak ``127.0.0.1`` ve bağlantı noktası olarak ``8022`` yazın.

source: Re-start the Gitlab Service with the new Hostname
pt_br: Reinicie o serviço Gitlab com o novo nome de host
tr: GitLab hizmetini yeni sunucu adı ile yeniden başlatın

source: Finally, if you either modified ``gitlab.rb`` or you registered a hostname, you will need to re-start the gitlab service for the settings to take effect.
pt_br: Por fim, se você modificou ``gitlab.rb`` ou registrou um nome de host , será necessário reiniciar o serviço gitlab para que as configurações entrem em vigor.
tr: Son olarak, ``gitlab.rb`` dosyasını değiştirdiyseniz veya bir sunucu adı kaydettiyseniz, ayarların geçerli olması için GitLab hizmetini yeniden başlatmanız gerekir.

source: Using a git bundle to fetch the I2P source code
pt_br: Usando um pacote git para buscar o código-fonte I2P
tr: I2P kaynak kodunu almak için Git paketi kullanmak

source: Download the I2P Source code via Bittorrent.
pt_br: Baixe o código-fonte do I2P via Bittorrent.
tr: Bittorrent üzerinden I2P Kaynak kodunu indirin.

source: Cloning large software repositories over I2P can be difficult, and using git can sometimes make this harder. Fortunately, it can also sometimes make it easier. Git has a ``git bundle`` command which can be used to turn a git repository into a file which git can then clone, fetch, or import from a location on your local disk. By combining this capability with bittorrent downloads, we can solve our remaining problems with ``git clone``.
pt_br: Clonar grandes repositórios de software sobre I2P pode ser difícil, e usar git pode às vezes tornar isso mais difícil. Felizmente, às vezes também pode tornar isso mais fácil. O Git tem um comando ``git bundle`` que pode ser usado para transformar um repositório git em um arquivo que o git pode então clonar, buscar ou importar de um local no seu disco local. Ao combinar essa capacidade com downloads de bittorrent, podemos resolver nossos problemas restantes com ``git clone``.
tr: Büyük yazılım depolarını I2P üzerinden kopyalamak zor olabilir ve bazen Git kullanmak bunu zorlaştırabilir. Neyse ki, bazen de kolaylaştırabilir. Git üzerindeki ``git bundle`` komutu ile bir git deposunu bir dosyaya dönüştürerek yerel diskinize alabilirsiniz. Ardından yerel diskinizdeki bu dosyadaki bulunan depoyu git üzerine kopyalayabilir, alabilir veya içe aktarabilirsiniz. Bu özelliği bittorrent indirmeleri ile birleştirerek kalan sorunlarımızı ``git clone`` ile çözebiliriz.

source: Before you Start
pt_br: Antes de começar
tr: Başlamadan önce

source: If you intend to generate a git bundle, you **must** already possess a full copy of the **git** repository, not the mtn repository. You can get it from github or from git.idk.i2p, but a shallow clone(a clone done to –depth=1) *will not* *work*. It will fail silently, creating what looks like a bundle, but when you try to clone it it will fail. If you are just retrieving a pre-generated git bundle, then this section does not apply to you.
pt_br: Se você pretende gerar um pacote git, você **deve** já possuir uma cópia completa do repositório **git**, não do repositório mtn. Você pode obtê-lo do github ou do git.idk.i2p, mas um clone superficial (um clone feito para –depth=1) *não* *funcionará*. Ele falhará silenciosamente, criando o que parece um pacote, mas quando você tentar cloná-lo, ele falhará. Se você estiver apenas recuperando um pacote git pré-gerado, então esta seção não se aplica a você.
tr: Bir Git paketi oluşturmayı düşünüyorsanız, mtn deposunun değil, **Git** deposunun tam bir kopyasına zaten **sahip olmalısınız**. Bunu GitHub veya git.idk.i2p üzerinden alabilirsiniz. Ancak sığ bir kopya (–depth=1 ile oluşturulan bir kopya) *çalışmaz*. Sessizce başarısız olur ve bir dal gibi görünen bir şey oluşturur. Ancak onu kopyalamaya çalıştığınızda başarısız olur. Bu bölüm yalnızca önceden oluşturulmuş bir Git paketi alıyorsanız sizin için geçerli değildir.

source: Fetching I2P Source via Bittorrent
pt_br: Obtendo a fonte I2P via Bittorrent
tr: I2P Kaynağını Bittorrent ile Almak

source: Someone will need to supply you with a torrent file or a magnet link corresponding to an existing ``git bundle`` that they have already generated for you. A recent, correctly-generated bundle of the mainline i2p.i2p source code as-of Wednesday, March 18, 2020, can be found inside of I2P at my pastebin `paste.idk.i2p/f/4hq37i <http://paste.idk.i2p/f/4hq37i>`__. You can also use a `magnet link <magnet:?xt=urn:btih:72be6b12fdb38529acc3a22ad7e927842fdaa04f&tr=http://zviyq72xcmjupynn5y2f5qa3u7bxyu34jnqmwt6czte2l7idxm7q.b32.i2p/announce>`__, and if you're a BiglyBT user who wants to bridge the torrent, use `this magnet link instead <magnet:?xt=urn:btih:OK7GWEX5WOCSTLGDUIVNP2JHQQX5VICP&dn=i2p.i2p.bundle&net=Public&net=I2P&net=Tor&tr=http%3A%2F%2Fzviyq72xcmjupynn5y2f5qa3u7bxyu34jnqmwt6czte2l7idxm7q.b32.i2p%2Fannounce&tr=http%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&tr=http%3A%2F%2Ftracker1.itzmx.com%3A8080%2Fannounce&tr=http%3A%2F%2Ftracker2.postman.i2p%2Fannounce.php&tr=http%3A%2F%2Fs5ikrdyjwbcgxmqetxb3nyheizftms7euacuub2hic7defkh3xhq.b32.i2p%2Fa&tr=http%3A%2F%2Fuajd4nctepxpac4c4bdyrdw7qvja2a5u3x25otfhkptcjgd53ioq.b32.i2p%2Fannounce&tr=http%3A%2F%2Fw7tpbzncbcocrqtwwm3nezhnnsw4ozadvi2hmvzdhrqzfxfum7wa.b32.i2p%2Fa&tr=udp%3A%2F%2Fp4p.arenabg.com%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337%2Fannounce&tr=udp%3A%2F%2Fopen.stealth.si%2Fannounce&tr=udp%3A%2F%2Ftracker.cyberia.is%3A6969%2Fannounce&tr=udp%3A%2F%2Fretracker.lanta-net.ru%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.sbsub.com%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.tiny-vps.com%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.torrent.eu.org%3A451%2Fannounce&tr=udp%3A%2F%2Ftracker.moeking.me%3A6969%2Fannounce&tr=http%3A%2F%2Ftracker.nyap2p.com%3A8080%2Fannounce&tr=udp%3A%2F%2Fbt1.archive.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker3.itzmx.com%3A6961%2Fannounce&tr=udp%3A%2F%2Fbt2.archive.org%3A6969%2Fannounce&tr=udp%3A%2F%2Fipv4.tracker.harry.lu%2Fannounce&tr=udp%3A%2F%2F9.rarbg.to%3A2940%2Fannounce&tr=udp%3A%2F%2F9.rarbg.me%3A2790%2Fannounce&tr=udp%3A%2F%2Fexodus.desync.com%3A6969%2Fannounce>`__ to announce to clearnet trackers as well.
pt_br: Alguém precisará fornecer um arquivo torrent ou um link magnético correspondente a um ``git bundle`` que eles já geraram para você. Um bundle recente e corretamente gerado do código-fonte principal do i2p.i2p a partir de quarta-feira, 18 de março de 2020, pode ser encontrado dentro do I2P no meu pastebin `paste.idk.i2p/f/4hq37i <http://paste.idk.i2p/f/4hq37i>`__. Você também pode usar um `link magnético <magnet:?xt=urn:btih:72be6b12fdb38529acc3a22ad7e927842fdaa04f&tr=http://zviyq72xcmjupynn5y2f5qa3u7bxyu34jnqmwt6czte2l7idxm7q.b32.i2p/announce>`__, e se você é um usuário do BiglyBT que deseja conectar o torrent, use `este link magnético em vez <magnet:?xt=urn:btih:OK7GWEX5WOCSTLGDUIVNP2JHQQX5VICP&dn=i2p.i2p.bundle&net=Public&net=I2P&net=Tor&tr=http%3A%2F%2Fzviyq72xcmjupynn5y2f5qa3u7bxyu34jnqmwt6czte2l7idxm7q.b32.i2p%2Fannounce&tr=http%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&tr=http%3A%2F%2Ftracker1.itzmx.com%3A8080%2Fannounce&tr=http%3A%2F%2Ftracker2.postman.i2p%2Fannounce.php&tr=http%3A%2F%2Fs5ikrdyjwbcgxmqetxb3nyheizftms7euacuub2hic7defkh3xhq.b32.i2p%2Fa&tr=http%3A%2F%2Fuajd4nctepxpac4c4bdyrdw7qvja2a5u3x25otfhkptcjgd53ioq.b32.i2p%2Fannounce&tr=http%3A%2F%2Fw7tpbzncbcocrqtwwm3nezhnnsw4ozadvi2hmvzdhrqzfxfum7wa.b32.i2p%2Fa&tr=udp%3A%2F%2Fp4p.arenabg.com%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337%2Fannounce&tr=udp%3A%2F%2Fopen.stealth.si%2Fannounce&tr=udp%3A%2F%2Ftracker.cyberia.is%3A6969%2Fannounce&tr=udp%3A%2F%2Fretracker.lanta-net.ru%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.sbsub.com%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.tiny-vps.com%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.torrent.eu.org%3A451%2Fannounce&tr=udp%3A%2F%2Ftracker.moeking.me%3A6969%2Fannounce&tr=http%3A%2F%2Ftracker.nyap2p.com%3A8080%2Fannounce&tr=udp%3A%2F%2Fbt1.archive.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker3.itzmx.com%3A6961%2Fannounce&tr=udp%3A%2F%2Fbt2.archive.org%3A6969%2Fannounce&tr=udp%3A%2F%2Fipv4.tracker.harry.lu%2Fannounce&tr=udp%3A%2F%2F9.rarbg.to%3A2940%2Fannounce&tr=udp%3A%2F%2F9.rarbg.me%3A2790%2Fannounce&tr=udp%3A%2F%2Fexodus.desync.com%3A6969%2Fannounce>`__ pra anunciar aos rastreadores da clearnet também.
tr: Birinin, sizin için önceden oluşturduğu var olan bir "git paketi" karşılığı olan bir torrent dosyası veya bir magnet bağlantısı vermesi gerekiyor. 18 Mart 2020 Çarşamba tarihinde i2p.i2p kaynak kodunun yeni ve düzgün bir şekilde oluşturulmuş bir paketini I2P üzerinde kendi pastebin kaynağımda bulabilirsiniz `paste.idk.i2p/f/4hq37i <http://paste.idk.i2p/f/4hq37i>`__. Ayrıca bir `magnet bağlantısı <magnet:?xt=urn:btih:72be6b12fdb38529acc3a22ad7e927842fdaa04f&tr=http://zviyq72xcmjupynn5y2f5qa3u7bxyu34jnqmwt6czte2l7idxm7q.b32.i2p/announce>`__ kullanabilirsiniz. Torrent köprüsü isteyen bir BiglyBT kullanıcısı iseniz `bu magnet bağlantısını kullanarak <magnet:?xt=urn:btih:OK7GWEX5WOCSTLGDUIVNP2JHQQX5VICP&dn=i2p.i2p.bundle&net=Public&net=I2P&net=Tor&tr=http%3A%2F%2Fzviyq72xcmjupynn5y2f5qa3u7bxyu34jnqmwt6czte2l7idxm7q.b32.i2p%2Fannounce&tr=http%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&tr=http%3A%2F%2Ftracker1.itzmx.com%3A8080%2Fannounce&tr=http%3A%2F%2Ftracker2.postman.i2p%2Fannounce.php&tr=http%3A%2F%2Fs5ikrdyjwbcgxmqetxb3nyheizftms7euacuub2hic7defkh3xhq.b32.i2p%2Fa&tr=http%3A%2F%2Fuajd4nctepxpac4c4bdyrdw7qvja2a5u3x25otfhkptcjgd53ioq.b32.i2p%2Fannounce&tr=http%3A%2F%2Fw7tpbzncbcocrqtwwm3nezhnnsw4ozadvi2hmvzdhrqzfxfum7wa.b32.i2p%2Fa&tr=udp%3A%2F%2Fp4p.arenabg.com%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337%2Fannounce&tr=udp%3A%2F%2Fopen.stealth.si%2Fannounce&tr=udp%3A%2F%2Ftracker.cyberia.is%3A6969%2Fannounce&tr=udp%3A%2F%2Fretracker.lanta-net.ru%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.sbsub.com%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.tiny-vps.com%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.torrent.eu.org%3A451%2Fannounce&tr=udp%3A%2F%2Ftracker.moeking.me%3A6969%2Fannounce&tr=http%3A%2F%2Ftracker.nyap2p.com%3A8080%2Fannounce&tr=udp%3A%2F%2Fbt1.archive.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker3.itzmx.com%3A6961%2Fannounce&tr=udp%3A%2F%2Fbt2.archive.org%3A6969%2Fannounce&tr=udp%3A%2F%2Fipv4.tracker.harry.lu%2Fannounce&tr=udp%3A%2F%2F9.rarbg.to%3A2940%2Fannounce&tr=udp%3A%2F%2F9.rarbg.me%3A2790%2Fannounce&tr=udp%3A%2F%2Fexodus.desync.com%3A6969%2Fannounce>`__ herkese açık İnternet izleyicilerine de duyurabilirsiniz.

source: Once you have a bundle, you will need to use git to create a working repository from it. If you’re using GNU/Linux and i2psnark, the git bundle should be located in $HOME/.i2p/i2psnark or, as a service on Debian, /var/lib/i2p/i2p-config/i2psnark. If you are using BiglyBT on GNU/Linux, it is probably at “$HOME/BiglyBT Downloads/” instead. The examples here assume I2PSnark on GNU/Linux, if you use something else, replace the path to the bundle with the download directory preferred by your client and platform.
pt_br: Depois de ter um pacote, você precisará usar o git para criar um repositório funcional a partir dele. Se você estiver usando GNU/Linux e i2psnark, o pacote git deve estar localizado em $HOME/.i2p/i2psnark ou, como um serviço no Debian, /var/lib/i2p/i2p-config/i2psnark. Se você estiver usando o BiglyBT no GNU/Linux, ele provavelmente estará em “$HOME/BiglyBT Downloads/”. Os exemplos aqui assumem o I2PSnark no GNU/Linux. Se você usar outra coisa, substitua o caminho para o pacote pelo diretório de download preferido pelo seu cliente e plataforma.
tr: Bir paketiniz olduğunda, ondan çalışan bir depo oluşturmak için Git kullanmanız gerekir. GNU/Linux ve i2psnark kullanıyorsanız, Git paketi $HOME/.i2p/i2psnark içinde veya Debian üzerinde bir hizmet olarak /var/lib/i2p/i2p-config/i2psnark içinde bulunmalıdır. GNU/Linux üzerinde BiglyBT kullanıyorsanız, bunun yerine büyük olasılıkla “$HOME/BiglyBT Downloads/” konumundadır. Buradaki örnekler, GNU/Linux üzerinde I2PSnark kullandığınızı varsayıyor. Başka bir şey kullanıyorsanız, paketin yolunu istemciniz ve platformunuz tarafından yeğlenen indirme klasörü ile değiştirin.

source: Using ``git clone``
pt_br: Usando ``git clone``
tr: ``git clone`` kullanmak

source: Cloning from a git bundle is easy, just:
pt_br: A clonagem de um pacote git é fácil, basta:
tr: Git paketinden kopyalamak kolaydır:

source: If you get the following error, try using git init and git fetch manually instead.
pt_br: Se você receber o seguinte erro, tente usar git init e git fetch manualmente.
tr: Aşağıdaki hatayı alırsanız, bunun yerine el ile "git init" ve "git fetch" kullanmayı deneyin.

source: Using ``git init`` and ``git fetch``
pt_br: Usando ``git init`` e ``git fetch``
tr: ``git init`` ve ``git fetch`` kullanmak

source: First, create an i2p.i2p directory to turn into a git repository.
pt_br: Primeiro, crie um diretório i2p.i2p para transformá-lo em um repositório git.
tr: Öncelikle Git deposuna dönüştürmek için bir i2p.i2p klasörü oluşturun.

source: Next, initialize an empty git repository to fetch changes back into.
pt_br: Em seguida, inicialize um repositório git vazio para buscar as alterações novamente.
tr: Ardından, değişiklikleri geri almak için boş bir Git deposu hazırlayın.

source: Finally, fetch the repository from the bundle.
pt_br: Por fim, busque o repositório do pacote.
tr: Son olarak, paketten depoyu alın.

source: Replace the bundle remote with the upstream remote
pt_br: Substitua o controle remoto do pacote pelo controle remoto upstream
tr: Paket uzak sürümünü yukarı akış uzak sürümüyle değiştirin

source: Now that you have a bundle, you can keep up with changes by setting the remote to the upstream repository source.
pt_br: Agora que você tem um pacote, pode acompanhar as alterações definindo o controle remoto para a fonte do repositório upstream.
tr: Artık bir paketiniz olduğuna göre, uzaktaki sürümü yukarı akış deposu kaynağına ayarlayarak değişikliklere ayak uydurabilirsiniz.

source: Generating a Bundle
pt_br: Gerando um pacote
tr: Paket Oluşturmak

source: First, follow the `Git guide for Users <GIT.md>`__ until you have a successfully ``--unshallow``\ ed clone of clone of the i2p.i2p repository. If you already have a clone, make sure you run ``git fetch --unshallow`` before you generate a torrent bundle.
pt_br: Primeiro, siga o `Guia do Git para Usuários <GIT.md>`__ até que você tenha um clone ``--unshallow``\ ed com sucesso do clone do repositório i2p.i2p . Se você já tem um clone, certifique-se de executar ``git fetch --unshallow`` antes de gerar um pacote torrent.
tr: İlk olarak, i2p.i2p deposunun başarılı bir ``--unshallow``` klonunu elde edene kadar `Kullanıcılar için Git rehberini <GIT.md>`__ izleyin. Zaten bir kopyanız varsa, bir torrent paketi oluşturmadan önce ``git fetch --unshallow`` komutunu yürüttüğünüzden emin olun.

source: Once you have that, simply run the corresponding ant target:
pt_br: Depois de ter isso, basta executar o alvo ant correspondente:
tr: Bundan sonra, ilgili ant hedefini çalıştırmanız yeterlidir:

source: and copy the resulting bundle into your I2PSnark downloads directory. For instance:
pt_br: e copie o pacote resultante para o diretório de downloads do I2PSnark. Por exemplo:
tr: ve ortaya çıkan paketi I2PSnark indirme kalsörünüze kopyalayın. Örneğin:

source: In a minute or two, I2PSnark will pick up on the torrent. Click on the “Start” button to begin seeding the torrent.
pt_br: Em um ou dois minutos, o I2PSnark vai pegar o torrent. Clique no botão “Start” para começar a semear o torrent.
tr: Bir veya iki dakika içinde I2PSnark torrenti alır. Torrenti tohumlamaya başlamak için “Başlat” düğmesine tıklayın.

source: 0.9.46 Release
pt_br: Lançamento 0.9.46
tr: 0.9.46 sürümü yayınlandı

source: 0.9.46 with new ECIES Encryption
pt_br: 0.9.46 com nova criptografia ECIES
tr: 0.9.46 sürümü yeni ECIES şifrelemesi ile yayınlandı

source: 0.9.46 contains significant performance improvements in the streaming library. We have completed development of ECIES encryption (proposal 144) and there is now an option to enable it for testing.
pt_br: 0.9.46 contém melhorias significativas de desempenho na biblioteca de streaming. Concluímos o desenvolvimento da criptografia ECIES (proposta 144) e agora há uma opção para habilitá-la para testes.
tr: 0.9.46 sürümünde akış kitaplığında önemli başarım iyileştirmeleri yapıldı. ECIES şifreleme (144 numaralı öneri) geliştirilmesi tamamlandı ve bu özelliği denemek için etkinleştirme seçeneği sunuldu.

source: Windows users only: This release fixes a local privilege escalation vulnerability which could be exploited by a local user that has the ability to run programs. Please apply the update as soon as possible. Thanks to Blaze Infosec for their responsible disclosure of the issue.
pt_br: Somente usuários do Windows: Esta versão corrige uma vulnerabilidade de escalonamento de privilégios locais que pode ser explorada por um usuário local que tem a capacidade de executar programas. Aplique a atualização o mais rápido possível. Agradecemos à Blaze Infosec pela divulgação responsável do problema.
tr: Yalnızca Windows kullanıcıları: Bu sürümde, uygulamaları çalıştırma yetkisine sahip yerel bir kullanıcı tarafından yararlanılabilecek bir yerel izin yükseltme güvenlik açığı giderildi. Lütfen bu güncellemeyi en kısa sürede yapın. Blaze Infosec sorumlu davranarak sorunu açıkladığı için teşekkür ederiz.

source: This is the last release to support Java 7, Debian packages Wheezy and Stretch, and Ubuntu packages Precise and Trusty. Users on those platforms must upgrade to receive future I2P updates.
pt_br: Esta é a última versão a suportar Java 7, pacotes Debian Wheezy e Stretch, e pacotes Ubuntu Precise e Trusty. Os usuários nessas plataformas devem atualizar para receber atualizações futuras do I2P.
tr: Bu sürüm Java 7 sürümünü, Wheezy ve Stretch Debian paketlerini ve Precise and Trusty Ubuntu paketlerini destekleyen son sürüm. Bu platformları kullanan kullanıcıların gelecekteki I2P güncellemelerini alabilmesi için sürümlerini yükseltmesi gerekiyor.

source: ECIES-X25519-AEAD-Ratchet encryption complete, ready for testing (proposal 144)
pt_br: ECIES-X25519-AEAD-Criptografia Ratchet concluída, pronta para teste (proposta 144)
tr: ECIES-X25519-AEAD-Ratchet şifrelemesi tamamlandı, denemeye hazır (144 numaralı öneri)

source: Hidden Services Manager: Redesign edit pages
pt_br: Hidden Services Manager: Redesenhar páginas de edição
tr: Gizli hizmet yönetimi: Düzenleme sayfaları yeniden tasarlandı

source: i2psnark: Fix marking torrents as BAD at startup
pt_br: i2psnark: Corrigir marcação de torrents como RUINS na inicialização
tr: i2psnark: Torrentlerin başlangıçta KÖTÜ olarak işaretlenmesi düzeltildi

source: NetDB: Support ECIES replies to lookups (proposal 154)
pt_br: NetDB: Suporte ECIES responde a pesquisas (proposta 154)
tr: "Ağ veri tabanı" (NetDB): Aramalarda ECIES yanıtları desteklendi (154 numaralı öneri)

source: RRD4J 3.5 replaces jrobin
pt_br: RRD4J 3.5 substitui jrobin
tr: jrobin yerine RRD4J 3.5 kullanıldı

source: Streaming performance improvments using Westwood+ congestion control
pt_br: Melhorias no desempenho de streaming usando o controle de congestionamento Westwood+
tr: Westwood tıkanıklık denetimi kullanılarak akış başarımı iyileştirildi

source: Hidden Services Manager: Fixes for changing shared client options, prevent changing certain options while tunnel is running
pt_br: Hidden Services Manager: correções para alterar opções de cliente compartilhadas, evitar alterar certas opções enquanto o túnel estiver em execução
tr: Gizli hizmet yönetimi: Paylaşılan istemci seçeneklerini değiştirmeye yönelik düzeltmeler, tünel çalışırken belirli seçeneklerin değiştirilmesi engellendi

source: Reproducible build fix
pt_br: Correção de compilação reproduzível
tr: Yinelenebilir yapım düzeltmesi eklendi

source: Streaming: Multiple fixes
pt_br: Streaming: Várias correções
tr: Akış: Birkaç düzeltme yapıldı

source: UPnP: Several fixes for changing interfaces and devices
pt_br: UPnP: Várias correções para alterar interfaces e dispositivos
tr: UPnP: Arayüzleri ve aygıtları değiştirmek için çeşitli düzeltmeler yapıldı

source: Windows: Fix permissions on install directory
pt_br: Windows: Corrigir permissões no diretório de instalação
tr: Windows: Kurulum klasörü izinleri düzeltildi

source: Build process changes to support git
pt_br: Alterações no processo de construção para dar suporte ao git
tr: Git desteği için yapım değişiklikleri yapıldı

source: Console: Don't show IPv6 temporary addresses as bind options
pt_br: Console: Não mostrar endereços temporários IPv6 como opções de vinculação
tr: Pano: Geçici IPv6 adreslerinin bağlama seçenekleri olarak görüntülenmesi engellendi

source: Console: Fix up javascript, stricter Content Security Policy
pt_br: Console: Corrigir javascript, Política de Segurança de Conteúdo mais rigorosa
tr: Pano: JavaScript düzeltildi, daha katı içerik güvenliği ilkesi uygulandı

source: Crypto: Disable speculative tagset usage
pt_br: Cripto: Desabilitar uso especulativo de tagset
tr: Şifreleme: Spekülatif etiket kümesi kullanımı devre dışı bırakıldı

source: Eepsites: Add Jetty GzipHandler for Jetty 9.3+
pt_br: Eepsites: Adicionar Jetty GzipHandler para Jetty 9.3+
tr: Eepsite: Jetty 9.3+ için Jetty GzipHandler eklendi

source: I2CP: Disable gzip for HTTP server tunnels and i2psnark
pt_br: I2CP: Desabilitar gzip para túneis de servidor HTTP e i2psnark
tr: I2CP: HTTP sunucu tünelleri ve i2psnark için gzip devre dışı bırakıldı

source: i2psnark: Connect out to other seeds to fetch new comments
pt_br: i2psnark: Conecte-se a outras sementes para buscar novos comentários
tr: i2psnark: Yeni yorumları almak için diğer tohumlara bağlantı kurulması sağlandı

source: i2psnark: Support file paths in add form
pt_br: i2psnark: Suporte a caminhos de arquivo no formulário de adição
tr: i2psnark: Ekleme formuna dosya yolları desteği eklendi

source: NetDB: Don't send "fake hash" to indicate exploration
pt_br: NetDB: Não envie “hash falso” para indicar exploração
tr: "Ağ veri tabanı" (NetDB): Keşfi belirtmek için "sahte karma" gönderilmesi engellendi

source: Profiles: Change decay algorithm
pt_br: Perfis: Algoritmo de decaimento de mudança
tr: Profiller: Bozulma algoritması değiştirildi

source: Profiles: Limit average speed calculation to high capacity peers
pt_br: Perfis: Limitar o cálculo da velocidade média para pares de alta capacidade
tr: Profiller: Ortalama hız hesaplaması yüksek kapasiteli eşlerle sınırlandı
