Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: Router: Increase probability to rekey to ECIES
pt_br: Roteador: Aumenta a probabilidade de recodificar para ECIES
tr: Yöneltici: ECIES yeniden anahtarlama olasılığı artırıldı

source: Streaming: Performance improvements for low-latency connections
pt_br: Streaming: Melhorias de desempenho para conexões de baixa latência
tr: Akış: Düşük gecikmeli bağlantılar için başarım iyileştirmeleri yapıldı

source: I2P Celebrates its 20th Year
pt_br: I2P comemora seu 20º ano
tr: I2P 20. Yılını Kutluyor

source: I2P has been around for 20 years, let's take a look back
pt_br: A I2P existe há 20 anos, vamos dar uma olhada para trás
tr: I2P 20 yıldır var, geçmişe bir bakalım

source: 20 Years of I2P
pt_br: 20 Anos de I2P
tr: I2P ile 20 yıl

source: It's hard to believe, but I2P has been around for nearly 20 years! From its beginning as a C project which provided anonymous access to IRC, we've had hundreds of contributors, accepted checkins from dozens of coders, used 2 main languages, 3 version control systems, experienced a migration of its crypography, and multiple soft-forks. There have been around 500 registered sites on the Invisible Web, and countless unregistered I2P sites that were only accessible via their cryptographic hostnames.
pt_br: É difícil acreditar, mas a I2P existe há quase 20 anos! Desde o seuinício como um projeto C que forneceu acesso anônimo ao IRC, tivemoscentenas de contribuidores, aceitamos checkins de dezenas de codificadores, usamos 2 linguagensprincipais, 3 sistemas de controle de versão, experimentamos uma migração de suacripografia e vários soft-forks. Havia cerca de 500 sites registrados na Web Invisível, e inúmeros sites I2P não registradosque sóeram acessíveis através de seus nomes de host criptográficos.
tr: İnanması zor ama I2P yaklaşık 20 yıldır var! IRC üzerine anonim erişim sağlayan bir C projesi olarak başlamasından bu yana, yüzlerce kişi katkıda bulundu. Düzinelerce yazılım geliştiricisinden ekler kabul ettik. 2 ana yazılım dili, 3 sürüm denetimi sistemi kullandık. Bir kez şifreleme yönteminin değiştirilmesini deneyimledik ve yazılımın bir çok dala ayrıldığını gördük. Görünmez internet üzerinde kaydedilmiş yaklaşık 500 site ve yalnızca şifrelenmiş sunucu adları üzerinden erişilebilen kaydedilmemiş sayısız I2P sitesi var.

source: Thanks to the participation of users like you, the network has grown from a tiny group of power users to over 75,000 nodes operated from all over the world, made of I2P routers bundled in perhaps dozens of applications. Today I2P is available in on Windows, Mac OSX, Linux, and has ports for FreeBSD, OpenBSD, and many other systems. I2P can run on phones and even in SOHO routers (thanks to the independent C++ implementation of the protocol, i2pd).
pt_br: Graças à participação de usuários como você, a rede cresceu de um pequenogrupo de usuários avançados para mais de 75.000 nós operados de todo o mundo, feitos de roteadores I2P empacotados em talvez dezenas de aplicativos. Hoje o I2P estádisponível no Windows, Mac OSX, Linux e tem portes para FreeBSD, OpenBSD emuitos outros sistemas. I2P pode ser executado em telefones e até mesmo em roteadores SOHO (graças à implementaçãoindependente C++ do protocolo, i2pd).
tr: Sizin gibi kullanıcıların katkısı sayesinde, ağ, küçük bir güçlü kullanıcı grubundan, belki de düzinelerce farklı uygulama için hazırlanmış I2P yönelticilerinden oluşan, dünyanın her yerinde işletilen 75.000 üzerinde düğüme dönüştü. Bugün I2P, Windows, macOS ve Linux üzerinde kullanılabilir ve kaynak kodları FreeBSD, OpenBSD ve diğer birçok sistem üzerine taşınmıştır. I2P telefonlarda hatta SOHO modem yönelticilerinde çalışabilir (iletişim kuralının bağımsız C++ uygulaması i2pd sayesinde).

source: A Routing Protocol with Flagship Applications
pt_br: Um protocolo de roteamento com aplicativos emblemáticos
tr: Amiral Gemisi Uygulamalar ile Yöneltme İletişim Kuralı

source: Even before other anonymity projects were providing their own application bundles, I2P was a tool for building applications that were configured for anonymity. Over the years, we've leaned on this strength, by expanding our APIs to support more and more versatile applications. Today, we're still developing new ways of building I2P into applications.
pt_br: Mesmo antes de outros projetos de anonimato fornecerem seus próprios pacotes de aplicativos, o I2P era uma ferramenta para criar aplicativosconfigurados parao anonimato. Ao longo dos anos, nos apoiamos nessa força, expandindo nossasAPIs para oferecer suporte a aplicativos cada vez mais versáteis. Hoje, aindaestamos desenvolvendo novas maneiras de criar I2P em aplicativos.
tr: I2P, diğer anonimlik projeleri kendi uygulama paketlerini sunmadan önce bile, anonimlik için yapılandırılmış uygulamalar oluşturmak için kullanılan bir araçtı. Yıllar geçtikçe, API yazılımlarımızı giderek daha çok yönlü uygulamaları destekleyecek şekilde genişleterek güçlendirdik. Bugün de I2P yazılımını uygulamalara dönüştürmenin yeni yolları üzerinde çalışıyoruz.

source: Using the power of the Hidden Services Manager or the SAM API, developers of all kinds of applications can empower their users with anonymity using I2P. Exciting downstream projects like Monero's I2P-Zero have made it very easy for developers to help their users get connected to I2P. Today, I2P helps provide anonymity to dozens of applications including Bitcoin, IRC, email and multiple file-sharing protocols.
pt_br: Usando o poder do Gerenciador de Serviços Ocultos ou da API SAM, os desenvolvedores de todos ostipos de aplicativos podem capacitar seus usuários com o anonimato usando I2P. Projetos downstream empolgantescomo o I2P-Zero do Monero tornaram muito fácil para os desenvolvedoresajudar seus usuários a se conectarem ao I2P. Hoje, o I2P ajuda a fornecer anonimato adezenas de aplicativos, incluindo Bitcoin, IRC, e-mail e vários protocolos de compartilhamentode arquivos.
tr: Gizli hizmet yöneticisi ya da SAM API gücünü kullanarak, her türlü uygulamanın geliştiricileri, kullanıcılarının anonimliğini I2P ile sağlayabilir. Monero tarafından geliştirilmiş I2P-Zero gibi heyecan verici alt projeler, geliştiricilerin kullanıcılarının I2P ağına bağlanmasını çok kolaylaştırdı. Bugün I2P, Bitcoin, IRC, e-posta ve çoklu dosya paylaşım iletişim kuralları gibi düzinelerce uygulama için anonimlik sağlamaya yardımcı oluyoruz.

source: An Anonymous Network By Everyone, For Everyone
pt_br: Uma rede anônima para todos, para todos
tr: Herkes Tarafından, Herkes için Anonim Bir Ağ

source: I2P has always been a decentralized network, because its obvious that providing an anonymity network is an intrinsically collaborative process. To illustrate with the most extreme example, a single computer cannot provide itself with anonymity, nor can it be a useful network, by definiton. However, building I2P in this fully-decentralized manner hasn't always been easy.
pt_br: A I2P sempre foi uma rede descentralizada, porque é óbvio que forneceruma rede de anonimato é um processo intrinsecamente colaborativo. Para ilustrarcom o exemplo mais extremo, um único computador não pode sefornecer com anonimato, nem pode ser uma rede útil, por definição. No entanto, construirI2P dessa maneira totalmente descentralizada nem sempre foi fácil.
tr: I2P her zaman merkezi olmayan bir ağ olmuştur. Bir anonimlik ağı sağlamanın özünde işbirliğine dayalı bir süreç olduğu açıktır. En uç örnekle açıklamak gerekirse, tek bir bilgisayar kendi kendine anonimlik sağlayamaz ve tanım gereği faydalı bir ağ da olamaz. Ancak, I2P ağını tamamen merkezi olmayacak bir şekilde oluşturmak pek kolay değildi.

source: From the beginning, I2P would need to be scalable, and be able to balance itself so that high-bandwidth nodes wouldn't be able to easily take over the network. Sybil attacks would leave the realm of academia and we would need to develop new defenses against them.
pt_br: Desde o início, o I2P precisaria ser escalável e ser capaz de seequilibrar para que nós de alta largura de banda não fossem capazes de assumir facilmente a rede. Os ataques Sybil deixariam o domínio da academia e precisaríamos desenvolvernovas defesas contra eles.
tr: I2P en başından beri ölçeklenebilir olmalı ve yüksek bant genişliğine sahip düğümlerin ağı kolayca ele geçirememesi için kendini dengeleyebilmeliydi. Sybil saldırıları akademik alandan çıkacak ve onlara karşı yeni savunmalar geliştirmemiz gerekecek.

source: We've worked very hard to never compromise on this stance, and today every I2P router helps participate in providing the network with bandwidth resources and providing the users with anonymity. In doing so, we've learned incredible things and produced a network which at times has seemed inconceivable.
pt_br: Trabalhamos muito para nunca comprometer essa postura, e hoje cada roteador I2Pajuda a fornecer à rede recursos de largura de banda efornecer aos usuários o anonimato. Ao fazer isso, aprendemos coisasincríveis e produzimos uma rede que às vezes parecia inconcebível.
tr: Bu duruştan asla ödün vermemek için çok çalıştık ve bugün her I2P yönelticisi, ağa bant genişliği kaynakları sunmaya ve kullanıcılara anonimlik sağlamaya yardımcı oluyor. Bunu yaparken inanılmaz şeyler öğrendik ve bazen akıl almaz gibi görünen bir ağ oluşturduk.

source: Celebrating I2P
pt_br: Celebrando a I2P
tr: I2P Kutlamaları

source: Over the next 2 weeks, we've planned some blog posts where we'll explore the past, present, and future of I2P, highlight applications and tools that build on and enhance I2P, and showcase the best of our community. Check back here for more in the coming days!
pt_br: Nas próximas 2 semanas, planejamos algumas postagens de blog onde exploraremos o passado, o presente e o futuro da I2P, destacaremos aplicativos e ferramentas que se baseiam eaprimoram a I2P e mostraremos o melhor de nossa comunidade. Volte aqui paramais nos próximos dias!
tr: Önümüzdeki 2 hafta boyunca, I2P projesinin geçmişini, bugününü ve geleceğini keşfedeceğimiz, I2P yazılımını geliştiren ve genişleten uygulamalar ile araçları vurgulayacağımız ve topluluğumuzun en iyilerini sergileyeceğimiz bazı blog yazıları yayınlamayı planladık. Önümüzdeki günlerde olacakları görmek için burayı kontrol edin!

source: `The History of I2P </en/blog/post/2021/08/28/History-of-I2P>`_
pt_br: « A História da I2P </en/blog/post/2021/08/28/History-of-I2P>`_
tr: `I2P Tarihçesi </en/blog/post/2021/08/28/History-of-I2P>`_

source: `Dependency-Free I2P of the Future - Jpackage Bundles and I2P-Zero (from Monero) </en/blog/post/2021/09/08/I2P-Jpackage-Bundles-and-Zero>`_
pt_br: 'Dependency-Free I2P do Futuro - Jpackage Bundles e I2P-Zero (do Monero) </en/blog/post/2021/09/08/I2P-Jpackage-Bundles-and-Zero>`_
tr: `Gelecekteki Bağımlı Olmayan I2P - JPackage Paketleri ve I2P-Zero (Monero) 1`_

source: `Level-Up your I2P use with Encrypted LeaseSets </en/blog/post/2021/09/07/Level-Up-Encrypted-Leasesets>`_
pt_br: 'Aumente o nível do seu uso de I2P com LeaseSets criptografados </en/blog/post/2021/09/07/Level-Up-Encrypted-Leasesets>`_
tr: `I2P kullanımınızda "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) ile sınıf atlayın </en/blog/post/2021/09/07/Level-Up-Encrypted-Leasesets>`_

source: Dividing the Triangle: How I2P Eases Naming and Increases Flexibility for End-Users
pt_br: Dividindo o Triângulo: Como o I2P Facilita a Nomeação e Aumenta a Flexibilidade para Usuários Finais
tr: Üçgeni Bölmek: I2P adlandırmayı nasıl kolaylaştırıyor ve son kullanıcılar için esnekliği nasıl artırıyor?

source: I2P's Usability Journey
pt_br: Jornada de usabilidade do I2P
tr: I2P Kullanılabilirlik Yolculuğu

source: Building Bridges - Making Connections with Other Privacy Projects
pt_br: Construindo Pontes - Fazendo Conexões com Outros Projetos de Privacidade
tr: Köprüler Kurmak - Diğer gizlilik projeleriyle bağlantılar kurmak

source: 20 Years of Privacy: A Brief History of I2P
pt_br: 20 anos de privacidade: uma breve história do I2P
tr: Kişisel gizliliğin 20 yılı: Kısa I2P tarihi

source: A history of I2P As We Know It
pt_br: Uma história do I2P como o conhecemos
tr: Bildiğimiz kadarıyla I2P tarihçesi

source: Invisibility is the best defense: building an internet within an internet
pt_br: A invisibilidade é a melhor defesa: construir uma internet dentro de uma internet
tr: Görünmezlik en iyi savunmadır: İnternet içinde İnternet kurmak

source: I believe most people want this technology so they can express themselves freely. It’s a comfortable feeling when you know you can do that. At the same time we can conquer some of the problems seen within the Internet by changing the way security and privacy is viewed, as well as the extent to what it is valued.
pt_br: Acredito que a maioria das pessoas quer essa tecnologia para que possam se expressar livremente. É uma sensação confortável quando você sabe que pode fazer isso. Ao mesmo tempo, podemos vencer alguns dos problemas vistos na Internet mudando a maneira como a segurança e a privacidade são vistas, bem como a extensão do que são valorizadas.
tr: Çoğu insanın bu teknolojiyi kendisini özgürce ifade edebilmek için istediğine inanıyorum. Bunu yapabileceğini bilmek rahatlatıcı. Aynı zamanda, güvenlik ve kişisel gizliliğin nasıl görüldüğünü ve buna ne kadar değer verildiğini değiştirerek İnternet üzerinde görülen bazı sorunların üstesinden gelebiliriz.

source: In October 2001, 0x90 ( Lance James) had a dream. It started as a “desire for instant communication with other Freenet users to talk about Freenet issues, and exchange Freenet keys while still maintaining anonymity, privacy and security.” It was called IIP — the Invisible IRC Project.
pt_br: Em outubro de 2001, 0x90 (Lance James) teve um sonho. Começou como um “desejo de comunicação instantânea com outros usuários da Freenet para falar sobre problemas da Freenet e trocar chaves da Freenet, mantendo ainda anonimato, privacidade e segurança.” Era chamado de IIP — o Projeto IRC Invisível .
tr: Ekim 2001 tarihinde 0x90 ( Lance James) bir rüya gördü. Bu rüya "diğer Freenet kullanıcıları ile Freenet sorunları hakkında konuşmak ve Freenet anahtarları alıp vermek için anonimlik, kişisel gizlilik ve güvenliği korurken anında iletişim kurma arzusu" olarak başladı. Adı IIP - Görünmez IRC Projesi oldu.

source: The Invisible IRC Project was based on an ideal and framework behind The InvisibleNet:
pt_br: O Projeto IRC Invisível foi baseado em um ideal e estrutura por trás do InvisibleNet:
tr: Görünmez IRC Projesi, The InvisibleNet projesinin arkasındaki ideallere ve yapıya dayanıyordu:

source: In an interview from 2002, 0x90 described the project:
pt_br: Em uma entrevista de 2002, 0x90 descreveu o projeto:
tr: 2002 yılındaki bir röportajda 0x90 projeyi şöyle anlattı:

source: “InvisibleNet is a research & development driven organization whose main focus is the innovation of intelligent network technology. Our goal is to provide the highest standards in security and privacy on the widely used, yet notoriously insecure Internet."
pt_br: “A InvisibleNet é uma organização de pesquisa & desenvolvimento cujo foco principal é a inovação da tecnologia de rede inteligente. Nosso objetivo é fornecer os mais altos padrões em segurança e privacidade na Internet amplamente usada, mas notoriamente insegura."
tr: “InvisibleNet, ana odak noktası akıllı ağ teknolojisinin yeniliği olan araştırma ve geliştirme odaklı bir organizasyondur. Amacımız, yaygın olarak kullanılan, ancak herkesin bildiği güvensiz İnternet üzerinde güvenlik ve kişisel gizlilik konusunda en yüksek standartları sağlamaktır."

source: "The InvisibleNet team is comprised of a talented group of developers and architects entirely dedicated to providing its users with both convenience and the very best in secure communication."
pt_br: "A equipe do InvisibleNet é composta por um grupo talentoso de desenvolvedores e arquitetos inteiramente dedicados a fornecer aos seus usuários conveniência e o melhor em comunicação segura."
tr: "InvisibleNet ekibi, tamamen kullanıcılarına hem kolaylık hem de güvenli iletişimde en iyiyi sağlamaya kendini adamış yetenekli bir geliştirici ve mimar grubundan oluşuyor."

source: "Our technological ideals are reflected in the implementation of a framework that is solid in design, and transparent in its application."
pt_br: "Nossos ideais tecnológicos são refletidos na implementação de uma estrutura que é sólida em design e transparente em sua aplicação."
tr: "Teknolojik ideallerimiz, tasarımında sağlam ve uygulamasında şeffaf bir çatının kullanılmasına yansır."

source: "Here at InvisibleNet we strive towards the greatest level of quality possible by keeping all areas of our research & development open and available to the public for peer review, feedback, suggestions and new ideas.”
pt_br: "Aqui na InvisibleNet, nós nos esforçamos para atingir o maior nível de qualidade possível, mantendo todas as áreas de nossa pesquisa & desenvolvimento abertas e disponíveis ao público para revisão por pares, feedback, sugestões e novas ideias."
tr: "InvisibleNet içinde, araştırma ve geliştirmemizin tüm alanlarını eş incelemesi, geri bildirim, öneri ve yeni fikirler için herekse açık ve erişilebilir tutarak oalbilecek olan en yüksek kalite düzeyine ulaşmaya çalışıyoruz."

source: "The Invisible Internet Project: Defined as the “New Internet”. Peer 2 Peer Internet. Using your peers to protect you. It is a similar concept to the Invisible IRC Project, with its design as our test model. We plan to re-design the Internet by taking it a step further and having security and privacy be first priority."
pt_br: "O Projeto Invisível da Internet: Definido como a “Nova Internet”. Internet Peer 2 Peer. Usando seus pares para proteger você. É um conceito similar ao Projeto Invisível do IRC, com seu design como nosso modelo de teste. Planejamos redesenhar a Internet dando um passo além e tendo a segurança e a privacidade como prioridade."
tr: "Invisible Internet Project: “Yeni İnternet” olarak tanımlandı. Eşler arası İnternet. Sizi korumak için eşlerinizi kullanmak. Test modelimiz olan tasarımı ile Görünmez IRC Projesine benzer bir kavram. İnterneti bir adım ileriye götürerek, güvenlik ile kişisel gizlilik birinci öncelik olacak şekilde tasarladık."

source: "The Invisible Internet Project or Protocol will be utilizing the tests and research/development concepts of the Invisible IRC Project to give us the scalability that we need and leverage this to take it to the next level."
pt_br: "O Projeto ou Protocolo de Internet Invisível utilizará os testes e conceitos de pesquisa/desenvolvimento do Projeto IRC Invisível para nos dar a escalabilidade que precisamos e aproveitar isso para levá-lo ao próximo nível."
tr: "Invisible Internet Project veya iletişim kuralı, gerek duyduğumuz ölçeklenebilirliği sağlamak ve bunu bir sonraki düzeye çıkarmak için görünmez IRC projesinin sonuçlarını ve araştırma/geliştirme kavramlarını kullanacak."

source: "This, in essence will be an impenetrable neural-network, that is self-driven, self-defensed, and completely seamless to already applied protocols, specifically client to server (or agents as I call them). It will be THE next transport layer, a layer on top of the notoriously insecure Internet, to deliver full anonymity, privacy, and security at the highest level possible. Decentralized and peer to peer Internet, by the way, means no more worrying about your ISP controlling your traffic. This will allow you to do seamless activities and change the way we look at security and even the Internet, utilizing public key cryptography, IP steganography, and message authentication. The Internet that should have been, will be soon."
pt_br: "Isto, em essência, será uma rede neural impenetrável, que é autodirigida, autodefendida e completamente transparente para protocolos já aplicados, especificamente cliente para servidor (ou agentes como eu os chamo ). Será A PRÓXIMA camada de transporte, uma camada sobre a Internet notoriamente insegura, para fornecer anonimato total, privacidade, e segurança no mais alto nível possível. A propósito, a Internet descentralizada e ponto a ponto significa não se preocupar mais com seu ISP controlando seu tráfego. Isto permitirá que você faça atividades perfeitas e mude a maneira como vemos a segurança e até mesmo a Internet, utilizando criptografia de chave pública, esteganografia de IP e autenticação de mensagem. A Internet que deveria ter sido, será em breve."
tr: "Bu yapı, özünde, kendisini süren, kendi kendini savunan ve özellikle istemciden sunucuya (veya benim adlandırdığım aracılara) önceden uygulanmış iletişim kuralları için tamamen sorunsuz, aşılmaz bir anonimlik, sinir ağı olacaktır. Bir sonraki taşıyıcı katmanı olacaktır. Tam kişisel gizlilik ve güvenliği olabilecek en yüksek düzeyde sağlamak için, herkesin bildiği güvensiz İnternet üzerinde bir katman olacak katman. Bu arada, merkezi olmayan ve eşler arası İnternet, trafiğinizi denetleyen İntenet hizmeti sağlayıcınız hakkında da daha fazla endişelenmenize gerek kalmayacak. Açık anahtar şifreleme, IP steganografisi ve ileti kimlik doğrulaması kullanılarak sorunsuz işlemler yapmanız sağlanabilecek ve güvenliğe ve hatta İnternet ağına bakış açımızı değiştirebilecek. İnternet yakında olması gerektiği gibi olacak."

source: All citations and quotes are from the interviews found here:
pt_br: Todas as citações e citações são de entrevistas encontradas aqui:
tr: Tüm aktarma ve alıntıların kaynağı burada bulunan röportajlardır:

source: By 2003, several other similar projects had started, the largest being Freenet, GNUNet, and Tor. All of these projects had broad goals to encrypt and anonymize a variety of traffic. For IIP, it became clear that IRC alone was not a big-enough target. What was needed was an anonymizing layer for all protocols. IIP by now was also being called “InvisibleNet”.
pt_br: Em 2003, vários outros projetos semelhantes começaram, sendo os maiores Freenet, GNUNet e Tor. Todos esses projetos tinham objetivos amplos para criptografar e anonimizar uma variedade de tráfego. Para o IIP, ficou claro que o IRC sozinho não era um alvo grande o suficiente. O que era necessário era uma camada de anonimização para todos os protocolos. O IIP agora também estava sendo chamado de “InvisibleNet”.
tr: 2003 yılına kadar, en büyükleri Freenet, GNUNet ve Tor olmak üzere birçok benzer proje başlatıldı. Bu projelerin tümü, çeşitli trafiği şifrelemek ve anonimleştirmek için geniş hedeflere sahipti. Görünmez İnternet Projesi için, tek başına IRC uygulamasının yeterince büyük bir hedef olmadığı ortaya çıktı. Tüm iletişim kuralları için bir anonimleştirme katmanına gerek vardı. IIP artık “InvisibleNet” olarak da adlandırılıyordu.

source: In early 2003, a new anonymous developer, “jrandom” joined the project. His explicit goal was to broaden the charter of IIP.
pt_br: No início de 2003, um novo desenvolvedor anônimo, “jrandom”, juntou-se ao projeto. Seu objetivo explícito era ampliar o estatuto do IIP.
tr: 2003 yılının başlarında, yeni bir anonim geliştirici olan “jrandom” projeye katıldı. Açık amacı, IIP tüzüğünü genişletmekti.
