Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: The official repository is the one hosted at https://i2pgit.org/i2p-hackers/i2p.i2p and at https://git.idk.i2p/i2p-hackers/i2p.i2p, but there is a "Mirror" available at Github at https://github.com/i2p/i2p.i2p.
pt_br: O repositório oficial é o hospedado em https://i2pgit.org/i2p-hackers/i2p.i2p e em https://git.idk.i2p/i2p-hackers/i2p.i2p, mas há um "Mirror" disponível no Github em https://github.com/i2p/i2p.i2p.
tr: Resmi depo, https://i2pgit.org/i2p-hackers/i2p.i2p ve https://git.idk.i2p/i2p-hackers/i2p.i2p adresinde bulunur. Ancak bir "Yansı" vardır. Github üzerinde https://github.com/i2p/i2p.i2p adresinde bulabilirsiniz.

source: Now that we're on git, we can synchronize repositories from our own self-hosted Gitlab instance, to Github, and back again. This means that it is possible to create and submit a merge request on Gitlab and when it is merged, the result will be synced with Github, and a Pull Request on Github, when merged, will appear on Gitlab.
pt_br: Agora que estamos no git, podemos sincronizar repositórios da nossa própria instância auto-hospedada do Gitlab para o Github e vice-versa. Isso significa que é possível criar e enviar uma solicitação de mesclagem no Gitlab e quando ela for mesclada, o resultado será sincronizado com o Github, e uma solicitação de pull no Github, quando mesclada, aparecerá no Gitlab.
tr: Artık Git üzerinde olduğumuza göre, kendi içinde barındırılan GitLab kopyamızdan depoları GitHub üzerine ve geriye eşitleyebiliriz. Böylece, GitLab üzerinde bir birleştirme isteği yapılıp gönderilebilir ve birleştirildiğinde sonuç GitHub ile eşitlenir. GitHub üzerinde birleştirildiğinde GitLab üzerinde bir çekme isteği görüntülenir.

source: This means that it's possible to submit code to us through our Gitlab instance or through Github depending on what you prefer, however, more of the I2P developers are regularly monitoring Gitlab than Github. MR's to Gitlab are more likely to be merged sooner than PR's to Github.
pt_br: Isso significa que é possível enviar código para nós por meio de nossa instância do Gitlab ou por meio do Github, dependendo do que você preferir. No entanto, mais desenvolvedores I2P estão regularmente monitorando o Gitlab do que o Github. Os MRs para o Gitlab têm mais probabilidade de serem mesclados mais cedo do que os PRs para o Github.
tr: Böylece, isteğinize göre GitLab kopyamız veya GitHub üzerinden bize kod gönderebilirsiniz. Ancak I2P geliştiricilerinin çoğu GitHub yerine çoklukla GitLab platformunu izliyor. GitLab üzerinden gelen birleştirme ve çekme istekleri GitHub üzerinden gelenlere göre daha önce işlenebilir.

source: Thanks
pt_br: Obrigado
tr: Teşekkürler

source: Congratulations and thanks to everyone who helped in the git migration, especially zzz, eche|on, nextloop, and our site mirror operators! While some of us will miss Monotone, it has become a barrier for new and existing participants in I2P development and we're excited to join the world of developers using Git to manage their distributed projects.
pt_br: Parabéns e obrigado a todos que ajudaram na migração do git, especialmente zzz, eche|on, nextloop e nossos operadores de espelho do site! Enquanto alguns de nós sentirão falta do Monotone, ele se tornou uma barreira para participantes novos e existentes no desenvolvimento I2P e estamos animados para nos juntar ao mundo dos desenvolvedores que usam o Git para gerenciar seus projetos distribuídos .
tr: Başta zzz, eche|on, nextloop ve site yansı işletmecilerimiz olmak üzere Git geçişinde yardımcı olan herkese tebrikler ve teşekkürler! Bazılarımız Monotone platformunu özleyecek olsa da, I2P geliştirmede yeni ve var olan katılımcılar için bir engel haline gelmişti. Dağıtılmış projelerini yönetmek için Git kullanan geliştiricilerin dünyasına katılmaktan heyecan duyuyoruz.

source: 0.9.49 Release
pt_br: Lançamento 0.9.49
tr: 0.9.49 sürümü yayınlandı

source: 0.9.49 with SSU fixes and faster crypto
pt_br: 0,9,49 com correções do SSU e criptografia mais rápida
tr: 0.9.49 sürümü SSU hata ayıklamaları ve daha hızlı şifreleme ile yayınlandı

source: 0.9.49 continues the work to make I2P faster and more secure. We have several improvements and fixes for the SSU (UDP) transport that should result in faster speeds. This release also starts the migration to new, faster ECIES-X25519 encryption for routers. (Destinations have been using this encryption for a few releases now) We've been working on the specifications and protocols for new encryption for several years, and we are getting close to the end of it! The migration will take several releases to complete.
pt_br: A versão 0.9.49 dá continuidade ao trabalho para tornar a I2P mais rápida e mais segura. Nós temos várias melhorias e correções para o transporte SSU (UDP) que devem resultar em velocidades mais rápidas. Essa versão também dá início à migração para a nova e mais rápida criptografia ECIES-X25519 para os roteadores. (Destinos têm usado essa criptografia há alguns lançamentos agora) Nós temos trabalhado nas especificações e protocolos para a nova criptografia por vários anos, e nós estamos chegando perto de terminar! A migração levará diversos lançamentos para ser completada.
tr: 0.9.49 sürümünde I2P uygulamasını daha hızlı ve daha güvenli hale getirme çalışmaları sürüyor. SSU (UDP) taşıyıcısı için daha yüksek hızlar sağlayacak çeşitli iyileştirme ve düzeltmeler yapıldı. Ayrıca bu sürümde yönelticiler için yeni ve daha hızlı ECIES-X25519 şifrelemesine geçiş de başlatıldı. (Hedefler birkaç sürümdür bu şifrelemeyi kullanıyordu) Birkaç yıldır yeni şifreleme için teknik özellikler ve iletişim kuralları üzerine çalışıyoruz ve çalışmalarımızın sonuna yaklaşıyoruz! Geçişin tamamlanması birkaç sürüm alacak.

source: For this release, to minimize disruption, only new installs and a very small percentage of existing installs (randomly selected at restart) will be using the new encryption. If your router does "rekey" to use the new encryption, it may have lower traffic or less reliability than usual for several days after you restart. This is normal, because your router has generated a new identity. Your performance should recover after a while.
pt_br: Para esse lançamento, para minimizar o transtorno, apenas novas instalações e uma porcentagem muito pequena de instalações existentes (selecionadas aleatoriamente ao reiniciar) estarão usando a nova criptografia. Se seu roteador "rechavear" para usar a nova criptografia, ele pode ter tráfego menor ou menor estabilidade do que o normal por vários dias após você reiniciar. Isso é normal, porque seu roteador gerou uma nova identidade. Seu desempenho deveria ser recuperado após um tempo.
tr: Bu sürümde kesintiyi en aza indirmek için yalnızca yeni kurulumlar ve var olan kurulumların çok küçük bir yüzdesi (yeniden başlatma sırasında rastgele seçilir) yeni şifrelemeyi kullanacak. Yönelticiniz yeni şifrelemeyi kullanmak için "yeniden anahtarlama" yaparsa, yeniden başlatıldıktan sonraki birkaç gün boyunca normalden daha düşük trafik ya da daha düşük güvenilirlik görebilirsiniz. Yönelticiniz yeni bir kimlik oluşturduğundan bu durum normaldir. Başarımınız bir süre sonra düzelecektir.

source: We have "rekeyed" the network twice before, when changing the default signature type, but this is the first time we've changed the default encryption type. Hopefully it will all go smoothly, but we're starting slowly to be sure.
pt_br: Nós "rechaveamos" a rede duas vezes antes, ao alterar o tipo de assinatura padrão, mas esta é a primeira vez que mudamos o tipo de criptografia padrão. Espero que tudo corra bem, mas estamos começando devagar para ter certeza.
tr: Varsayılan imza türünü değiştirirken ağı daha önce iki kez "yeniden anahtarladık" ancak varsayılan şifreleme türünü ilk kez değiştiriyoruz. Her şeyin yolunda gideceğini umuyoruz. Ancak emin olmak için yavaş yavaş başlıyoruz.

source: Build: Git migration
pt_br: Construção: migração do Git
tr: Yapım: Git aktarımı

source: Build: Move web resources to wars
pt_br: Construir: Mover recursos da web para guerras
tr: Yapım: İnternet kaynakları wars üzerine aktarıldı

source: i2psnark WebSeed support
pt_br: Suporte i2psnark WebSeed
tr: i2psnark WebSeed desteği

source: i2psnark padding file support
pt_br: Suporte a arquivo de preenchimento i2psnark
tr: i2psnark boşluk dosyası desteği

source: i2ptunnel: Move proxy resources to jar
pt_br: i2ptunnel: Mover recursos de proxy para jar
tr: i2ptunnel: Vekil sunucu kaynakları jar üzerine aktarıldı

source: Router: Redesign ECIES encryption for floodfills (proposal 156)
pt_br: Roteador: Redesenhar a criptografia ECIES para floodfills (proposta 156)
tr: Yöneltici: Otomatik doldurmalar için ECIES şifrelemesi yeniden tasarlandı (156 numaralı öneri)

source: Router: Verify RI stores after startup
pt_br: Roteador: Verificar armazenamentos RI após a inicialização
tr: Yöneltici: Başlatıldıktan sonra RI depolarının doğrulanması sağlandı

source: Router: Reduce Sybil threshold
pt_br: Roteador: Reduzir o limite Sybil
tr: Yöneltici: Sybil eşiği düşürüldü

source: Router: ECIES for new routers
pt_br: Roteador: ECIES para novos roteadores
tr: Yöneltici: Yeni yönelticiler için ECIES

source: Router: Start of ECIES migration
pt_br: Roteador: Início da migração do ECIES
tr: Yöneltici: ECIES geçişine başlandı

source: SSU: Send individual fragments of messages
pt_br: SSU: Enviar fragmentos individuais de mensagens
tr: SSU: Bireysel ileti parçalarının gönderilmesi sağlandı

source: SSU: Westwood+ congestion control
pt_br: SSU: Westwood+ controle de congestionamento
tr: SSU: Westwood + tıkanıklık denetimi eklendi

source: SSU: Fast retransmit
pt_br: SSU: Retransmissão rápida
tr: SSU: Hızlı yeniden aktarım eklendi

source: Build: Fix Gradle build
pt_br: Build: Corrigir compilação do Gradle
tr: Yapım: Gradle yapımı düzeltildi

source: Crypto: Increase ratchet tag window to prevent message loss
pt_br: Criptografia: Aumente a janela da tag de catraca para evitar perda de mensagens
tr: Şifreleme: İleti kaybını önlemek için ratchet etiket penceresi artırıldı

source: I2CP: Fix encrypted leaseset combined with ECIES crypto or offline keys
pt_br: I2CP: Corrigir leaseset criptografado combinado com chaves criptográficas ou offline ECIES
tr: I2CP: ECIES şifreleme veya çevrimdışı anahtarlarla birleştirilmiş "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) düzeltildi

source: i2ptunnel: Fix config file saving issues
pt_br: i2ptunnel: Corrigir problemas de salvamento de arquivo de configuração
tr: i2ptunnel: Yapılandırma dosyası kaydetme sorunları düzeltildi

source: Router: Fix leaseset request fails causing watchdog to bark
pt_br: Roteador: Corrigir falhas na solicitação do leaseset que fazem o watchdog latir
tr: Yöneltici: "Kiralama kümesi" (LeaseSet) isteği başarısız olduğunda bekçi köpeğinin havlaması engellendi

source: Router: Hidden mode fixes
pt_br: Roteador: correções de modo oculto
tr: Yöneltici: Gizli kip düzeltmeleri yapıldı

source: SSU: Fix partial acks not being sent
pt_br: SSU: Corrigir acks parciais não enviados
tr: SSU: Gönderilmeyen kısmi onaylar düzeltildi

source: SSU: Fix occasional high CPU usage
pt_br: SSU: Corrigir alto uso ocasional da CPU
tr: SSU: Ara sıra görülen yüksek işlemci kullanımı düzeltildi

source: Crypto: AES performance improvements
pt_br: Cripto: Melhorias no desempenho do AES
tr: Şifrelem: AES başarımı iyileştirildi

source: DoH: Change to RFC 8484 style
pt_br: DoH: Mudança para o estilo RFC 8484
tr: DoH: RFC 8484 biçemine geçildi

source: i2ptunnel: Remove DSA shared clients
pt_br: i2ptunnel: Remover clientes compartilhados DSA
tr: i2ptunnel: DSA paylaşılan istemcileri kaldırıldı

source: Proxy: Add jump servers
pt_br: Proxy: Adicionar servidores de salto
tr: Vekil sunucu: Atlama sunucuları eklendi

source: Router: Add more countries for hidden mode
pt_br: Roteador: Adicione mais países para o modo oculto
tr: Yöneltici: Gizli kip için daha fazla ülke eklendi

source: Router: Tunnel peer selection changes
pt_br: Roteador: Alterações na seleção de pares de túnel
tr: Yöneltici: Tünel eş seçiminde değişiklikler yapıldı

source: Router: Move Sybil subsystem from console to router for embedded use
pt_br: Roteador: Mova o subsistema Sybil do console para o roteador para uso incorporado
tr: Yöneltici: Sybil alt sistemi yerleşik kullanım için panodan yönelticiye taşındı

source: Router: Verify RI stores for a while after startup
pt_br: Roteador: Verifique os armazenamentos RI por um tempo após a inicialização
tr: Yöneltici: Başlangıçtan sonra bir süre RI depolarının doğrulanması sağlandı

source: Util: New unit tests
pt_br: Util: Novos testes unitários
tr: Araçlar: Yeni birim sınamaları

source: 0.9.50 Release
pt_br: Lançamento 0.9.50
tr: 0.9.50 sürümü yayınlandı

source: 0.9.50 with IPv6 fixes
pt_br: 0.9.50 com correções do IPv6
tr: 0.9.50 sürümü IPv6 düzeltmeleri ile yayınlandı

source: 0.9.50 continues the transition to ECIES-X25519 for router encryption keys. We have enabled DNS over HTTPS for reseeding to protect users from passive DNS snooping. There are numerous fixes and improvements for IPv6 addresses, including new UPnP support.
pt_br: A versão 0.9.50 dá continuidade à transição ao ECIES-X25519 para chaves de criptografia dos roteadores. Nós habilitamos DNS sobre HTTPS para repropagação para proteger usuários contra snooping passivo de DNS. Há diversas correções e melhorias para endereços IPv6, incluindo o novo suporte aUPnP.
tr: 0.9.50 sürümünde, yöneltici şifreleme anahtarları için ECIES-X25519 geçişi çalışmaları sürüyor. Kullanıcıları pasif DNS gözetlemesinden korumak için yeniden tohumlama işleminde HTTPS üzerinden DNS özelliği etkinleştirildi. Yeni UPnP desteği ile IPv6 adresleri için çok sayıda düzeltme ve iyileştirme yapıldı.

source: We have finally fixed some longstanding SusiMail corruption bugs. Changes to the bandwidth limiter should improve network tunnel performance. There are several improvements in our Docker containers. We have improved our defenses for possible malicious and buggy routers in the network.
pt_br: Nós finalmente corrigimos alguns antigos bugs de corrupção no SusiMail. Mudanças no limitador de banda devem melhorar o desempenho de túnel da rede. Há várias melhorias no nossos contêiners Docker. Nós melhoramos nossas defesas contra possíveis roteadores com problemas ou maliciosos na rede.
tr: Uzun süredir var olan bazı SusiMail bozulma hataları nihayet düzeltildi. Bant genişliği sınırlayıcısında yapılan değişiklikler ağ tüneli başarımını iyileştirmiş olmalı. Docker kapsayıcılarımızda birkaç iyileştirme yapıldı. Ağdaki olası kötü amaçlı ve hatalı yönelticilere karşı savunma geliştirildi.

source: Docker improvements
pt_br: Melhorias no Docker
tr: Docker iyileştirmeleri yapıldı

source: NTCP: Remove support for version 1
pt_br: NTCP: Remover suporte para versão 1
tr: NTCP: 1. sürüm desteği kaldırıldı

source: Router: Increase ECIES rekey probability
pt_br: Roteador: Aumenta a probabilidade de recodificação do ECIES
tr: Yöneltici: ECIES yeniden anahtarlama olasılığı artırıldı

source: Router: Persist Sybil blocklist
pt_br: Roteador: Persistir lista de bloqueio Sybil
tr: Yöneltici: Sybil engelleme listesi kalıcı kılındı

source: SSU: Enable introducers and introductions via IPv6 (proposal 158)
pt_br: SSU: Habilitar introdutores e introduções via IPv6 (proposta 158)
tr: SSU: IPv6 üzerinde tanıtıcılar ve tanıtımlar etkinleştirildi (158 numaralı öneri)

source: Transports: Publish support for outbound IPv4/v6 (proposal 158)
pt_br: Transportes: Publicar suporte para IPv4/v6 de saída (proposta 158)
tr: Taşıyıcılar: Gidiş IPv4/v6 desteği yayınlandı (158 numaralı öneri)

source: UPnP: Add support for IPv6
pt_br: UPnP: Adicionar suporte para IPv6
tr: UPnP: IPv6 desteği eklendi

source: Debian: Fix link to compiler jar
pt_br: Debian: Corrigir link para o jar do compilador
tr: Debian: Derleyici jar bağlantısı düzeltildi

source: i2psnark: Fix theme selection
pt_br: i2psnark: Corrigir seleção de tema
tr: i2psnark: Tema seçimi düzeltildi

source: Jetty: Fix detection of SSL connector
pt_br: Jetty: Corrigir detecção do conector SSL
tr: Jetty: SSL bağlantısının algılanması düzeltildi

source: NetDB: Fix NPE when validating expired blinded leaseset
pt_br: NetDB: Corrigir NPE ao validar leaseset cego expirado
tr: "Ağ veri tabanı" (NetDB): Süresi dolmuş Kör "Kiralama kümesi" (LeaseSet) doğrulanırken oluşan NPE düzeltildi

source: NTP: Year 2036 fixes
pt_br: NTP: Correções do ano 2036
tr: NTP: 2036 yılı düzeltmeleri yapıldı

source: Router: Fix rekeying every restart on ARM
pt_br: Roteador: Corrigir a necessidade de redigitar a cada reinicialização no ARM
tr: Yöneltici: ARM üzerinde her yeniden başlatmanın yeniden anahtarlanması düzeltildi

source: Router: Fix decryption of encrypted leasesets
pt_br: Roteador: Corrigir descriptografia de leasesets criptografados
tr: Yöneltici: "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) şifrelerinin çözülmesi düzeltildi

source: SAM: Fix removal of subsessions
pt_br: SAM: Corrigir remoção de subsessões
tr: SAM: Alt oturumların kaldırılması düzeltildi

source: SSU: Fix excessive dropping by the bandwidth limiter
pt_br: SSU: Corrigir queda excessiva pelo limitador de largura de banda
tr: SSU: Bant genişliği sınırlayıcının aşırı kayıpları düzeltildi

source: SSU: Fix publishing 'C' capability when not an introducer
pt_br: SSU: Corrigir a capacidade de publicação 'C' quando não for um apresentador
tr: SSU: Bir tanıtıcı değilken 'C' özelliğinin yayınlanması düzeltildi

source: SSU: Fixes for firewalled/not firewalled state transitions
pt_br: SSU: Correções para transições de estado com firewall/sem firewall
tr: SSU: Güvenlik duvarı arkasında olan/olmayan durum geçişleri için düzeltmeler yapıldı

source: SSU: IPv6 fixes
pt_br: SSU: correções de IPv6
tr: SSU: IPv6 düzeltmeleri yapıldı

source: SSU: Peer test fixes
pt_br: SSU: Correções de teste de pares
tr: SSU: Eş sınaması düzeltmeleri yapıldı

source: SusiMail: Fix theme selection
pt_br: SusiMail: Corrigir seleção de tema
tr: SusiMail: Tema seçimi düzeltildi

source: SusiMail: Fix stream closed errors
pt_br: SusiMail: Corrigir erros de fechamento de fluxo
tr: SusiMail: Akış kapanma sorunları giderildi

source: SusiMail: Fix corruption in display of large, new messages
pt_br: SusiMail: Corrigir corrupção na exibição de mensagens grandes e novas
tr: SusiMail: Büyük, yeni iletilerin görüntülenmesindeki bozulma düzeltildi

source: Tunnels: Several fixes in the participating tunnel bandwidth limiter
pt_br: Túneis: Várias correções no limitador de largura de banda do túnel participante
tr: Tüneller: Katılan tünel bant genişliği sınırlayıcısında çeşitli düzeltmeler yapıldı

source: UPnP: Fix leases not being renewed before expiration
pt_br: UPnP: Corrigir arrendamentos que não estão sendo renovados antes do vencimento
tr: UPnP: Kiralamaların sona ermeden önce yenilenmemesi sağlandı

source: Build: Remove empty jars and wars from installers
pt_br: Build: Remover jars vazios e wars dos instaladores
tr: Yapım: Kuruculardan kalan boş jars ve wars dosyaları kaldırıldı

source: Build: Prep for different release and API versions
pt_br: Build: Preparação para diferentes versões de lançamento e API
tr: Yapım: Farklı sürüm ve API sürümleri için hazırlık yapıldı

source: Build: Remove launcher code
pt_br: Construir: Remover código do iniciador
tr: Yapım: Başlatıcı kodu kaldırıldı

source: Gradle build fixes
pt_br: Correções de compilação do Gradle
tr: Gradle derleme düzeltmeleri yapıldı

source: Profiles: Disable tunnel peer test
pt_br: Perfis: Desabilitar teste de peer de túnel
tr: Profiller: Tünel eş sınaması devre dışı bırakıldı

source: Profiles: Remove unused tunnel test response time stat
pt_br: Perfis: Remover estatísticas de tempo de resposta de teste de túnel não utilizadas
tr: Profiller: Kullanılmayan tünel sınaması yanıt süresi durumu kaldırıldı

source: SSU: Avoid outbound connections to buggy routers
pt_br: SSU: Evite conexões de saída para roteadores com bugs
tr: SSU: Hatalı yönelticilere gidiş bağlantılarından kaçınılması sağlandı

source: Transports: Increase connection limits for some platforms
pt_br: Transportes: Aumentar os limites de conexão para algumas plataformas
tr: Taşıyıcılar: Bazı platformlar için bağlantı sınırları artırıldı

source: 1.5.0 Release
pt_br: Versão 1.5.0
tr: 1.5.0 sürümü yayınlandı

source: 1.5.0 with new tunnel build messages
pt_br: 1.5.0 com novas mensagens de construção do túnel
tr: 1.5.0 sürümü yeni tünel oluşturma iletileri ile yayınlandı

source: Yes, that's right, after 9 years of 0.9.x releases, we are going straight from 0.9.50 to 1.5.0. This does not signify a major API change, or a claim that development is now complete. It is simply a recognition of almost 20 years of work to provide anonymity and security for our users.
pt_br: Sim, é isso mesmo, após nove anos de versões 0.9.x, nós estamos indo direto de 0.9.50 para 1.5.0. Isso não simboliza uma grande mudança de API, ou uma declaração de que o desenvolvimento agora está completo. É simplesmente um reconhecimento dos quase 20 anos de trabalho para proporcionar anonimato e segurança para nossos usuários.
tr: Evet, doğru. 9 yıldır süren 0.9.x sürümlerinden sonra, doğrudan 0.9.50 sürümünden 1.5.0 sürümüne geçiyoruz. Bu durum, büyük bir API değişikliği olduğu ya da geliştirmenin tamamlandığı anlamına gelmiyor. Yaklaşık 20 yıldır kullanıcılarımıza anonimlik ve güvenlik sağlamak için süren çalışmaları onurlandırıyor.

source: This release finishes implementation of smaller tunnel build messages to reduce bandwidth. We continue the transition of the network's routers to X25519 encryption. Of course there are also numerous bug fixes and performance improvements.
pt_br: Essa versão finaliza a implementação de mensagens de criação de túnel menores para reduzir largura de banda. Nós continuamos a transição dos roteadores da rede para a criptografia X25519. Claro que há também diversas correções de bugs e melhorias de desempenho.
tr: Bu sürüm, bant genişliğini azaltmak için daha küçük tünel oluşturma iletileri uygulamasını tamamlar. Ağ yönelticilerinin X25519 şifrelemesine geçişini sürdürüyoruz. Elbette çok sayıda hata düzeltmesi ve başarım iyileştirmesi de var.

source: Tunnels: Finish support for new build messages (proposal 157)
pt_br: Túneis: Concluir o suporte para novas mensagens de construção (proposta 157)
tr: Tüneller: Yeni derleme iletileri için destek tamamlandı (157 numaralı öneri)

source: Updates: Support for .dmg and .exe updates
pt_br: Atualizações: Suporte para atualizações .dmg e .exe
tr: Güncellemeler: .dmg ve .exe güncellemeleri için destek sağlandı

source: Console: Fix generation of SSL keys on Java 17
pt_br: Console: Corrigir geração de chaves SSL no Java 17
tr: Pano: Java 17 sürümündeki SSL anahtarlarının üretilmesi düzeltildi

source: i2psnark: Fix autostart for magnets
pt_br: i2psnark: Corrigir inicialização automática para ímãs
tr: i2psnark: Magnet bağlantılar için otomatik başlatma düzeltildi

source: Router: Fix rare deadlock in publishing our RI
pt_br: Roteador: Corrigir deadlock raro na publicação de nosso RI
tr: Yöneltici: RI değerini yayınlarken nadir görülen kilitlenme düzeltildi

source: SSU: Fix handling of bad peer test responses
pt_br: SSU: Corrigir o tratamento de respostas incorretas de testes de pares
tr: SSU: Kötü eş sınaması yanıtlarının işlenmesi düzeltildi

source: UPnP: IPv6 fixes
pt_br: UPnP: correções de IPv6
tr: UPnP: IPv6 düzeltmeleri yapıldı

source: Jetty: Improve sort in directory listings
pt_br: Jetty: Melhore a classificação em listagens de diretórios
tr: Jetty: Dizin listelerinin sıralanması iyileştirildi

source: Jetty: Add X-I2P-Location header
pt_br: Jetty: Adicionar cabeçalho X-I2P-Location
tr: Jetty: X-I2P-Location üst bilgisi eklendi
