Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: One aspect of the above we will be focusing on is keeping in touch with users who take the time to report issues. Thank you! The smaller we can make the feedback loop, the quicker we can resolve problems that new users face, and the more likely it is that they keep participating in the community.
pt_br: Um aspecto do acima que focaremos é manter contato com usuários que reservam um tempo para relatar problemas. Obrigado! Quanto menor pudermos tornar o ciclo de feedback, mais rápido poderemos resolver problemas que novos usuários enfrentam, e mais provável será que eles continuem participando da comunidade.
tr: Yukarıda odaklanacağımız konulardan biri, sorunları bildirmek için zaman ayıran kullanıcılarla iletişim halinde olmaktır. Teşekkürler! Geri bildirim döngüsünü ne kadar küçültebilirsek, yeni kullanıcıların karşılaştığı sorunları o kadar hızlı çözebiliriz ve topluluğa katılmayı sürdürme olasılıkları o kadar yüksek olur.

source: We'd love your help! --------------------
pt_br: Gostaríamos muito da sua ajuda! --------------------
tr: Yardımınızı istiyoruz! --------------------

source: That all looks very ambitious, and it is! But many of the items above overlap, and with careful planning we can make a serious dent in them.
pt_br: Tudo isso parece muito ambicioso, e é! Mas muitos dos itens acima se sobrepõem, e com um planejamento cuidadoso podemos fazer um grande estrago neles.
tr: Bunların hepsi çok iddialı görünüyor ve öyle! Ancak yukarıdaki ögelerin çoğu örtüşüyor ve dikkatli bir planlama ile bunlarda ciddi bir gelişme sağlayabiliriz.

source: If you are interested in helping with any of the goals above, come chat to us! You can find us on OFTC and Freenode (#i2p-dev), and Twitter (@GetI2P).
pt_br: Se você estiver interessado em ajudar com qualquer um dos objetivos acima, venha conversar conosco! Você pode nos encontrar no OFTC e no Freenode (#i2p-dev) e no Twitter (@GetI2P).
tr: Yukarıdaki hedeflerden herhangi birine yardımcı olmakla ilgileniyorsanız, bizimle sohbet etmeye gelin! Bizi OFTC ve Freenode üzerinde (#i2p-dev) ve Twitter üzerinde (@GetI2P) bulabilirsiniz.

source: ================ I2P at BSidesNYC ================
pt_br: ================ I2P na BSidesNYC ================
tr: ========================= BSidesNYC etkinliğinde I2P =========================

source: Trip report about the I2P meetup at BSidesNYC.
pt_br: Relatório de viagem sobre o encontro I2P no BSidesNYC.
tr: BSidesNYC etkinliğindeki I2P buluşması hakkında gezi raporu.

source: 0.9.34 Release
pt_br: Lançamento 0.9.34
tr: 0.9.34 sürümü yayınlandı

source: 0.9.34 with Bug Fixes
pt_br: 0.9.34 com correções de bugs
tr: 0.9.34 sürümü bazı hata düzeltmeleri ile yayınlandı

source: 0.9.34 contains a lot of bug fixes! It also has improvements in SusiMail, IPv6 handling, and tunnel peer selection. We add support for IGD2 schemas in UPnP. There's also preparation for more improvements you will see in future releases.
pt_br: A versão 0.9.34 contém várias correções de bugs! Ela também inclui melhorias no SusiMail, tratamento de IPv6, e seleção de par de túnel. Nós adicionamos suporte para os esquemas IGD2 no UPnP. Há também preparação para mais melhorias que você verá em lançamentos futuros.
tr: 0.9.34 sürümünde birçok hata düzeltmesi bulunuyor! SusiMail, IPv6 dağıtımı, ve eş tünel seçimi için iyileştirmeler yapıldı. UPnP için IGD2 şemaları desteği eklendi. Ayrıca sonraki sürümlerde göreceğiniz iyileştirmeler için hazırlıklar yapıldı.

source: SusiMail: Improved startup and memory management
pt_br: SusiMail: Melhoria na inicialização e gerenciamento de memória
tr: SusiMail: Başlatma ve bellek yönetimi iyileştirildi

source: UPnP: Support IGD 2
pt_br: UPnP: Suporte IGD 2
tr: UPnP: IGD 2 desteği eklendi

source: Console: Numerous fixes
pt_br: Console: Várias correções
tr: Pano: Çeşitli düzeltmeler yapıldı

source: i2ptunnel: Fix servers not accepting after router restart
pt_br: i2ptunnel: Corrigir servidores que não aceitam após reinicialização do roteador
tr: i2ptunnel: Yöneltici yeniden başlatıldıktan sonra sunucuların kabul edilmemesi düzeltildi

source: Router: Improved tunnel peer selection for hidden and IPv6-only modes
pt_br: Roteador: Seleção de pares de túnel aprimorada para modos ocultos e somente IPv6
tr: Yöneltici: Gizli ve yalnızca IPv6 kipleri için tünel eş seçimi iyileştirildi

source: SusiMail: Numerous fixes
pt_br: SusiMail: Várias correções
tr: SusiMail: Çeşitli düzeltmeler yapıldı

source: Transport: Better selection of IPv6 addresses
pt_br: Transporte: Melhor seleção de endereços IPv6
tr: Taşıyıcı: IPv6 adreslerinin daha iyi seçilmesi sağlandı

source: Prep for HTTPS console and eepsite
pt_br: Preparação para console HTTPS e eepsite
tr: HTTPS panosu ve eepsite için hazırlık yapıldı

source: Prep for splitting up Debian package
pt_br: Preparação para dividir o pacote Debian
tr: Debian paketini bölmek için hazırlık yapıldı

source: Streaming: Return HTTP response when limits exceeded
pt_br: Streaming: Retornar resposta HTTP quando os limites forem excedidos
tr: Akış: Sınırlar aşıldığında HTTP yanıtının döndürülmesi sağlandı

source: Console: Number formatting changes
pt_br: Console: Alterações na formatação de números
tr: Pano: Sayı biçimlendirme değişiklikleri yapıldı

source: EdDSA cleanups
pt_br: Limpezas EdDSA
tr: EdDSA temizlikleri yapıldı

source: 0.9.35 Release
pt_br: Lançamento 0.9.35
tr: 0.9.35 sürümü yayınlandı

source: 0.9.35 with SusiMail folders and SSL Wizard
pt_br: Versão 0.9.35 com pastas SusiMail e Assistente de SSL
tr: 0.9.35 sürümü SusiMail klasörleri ve SSL yardımcısı ile yayınlandı

source: 0.9.35 adds support for folders in SusiMail, and a new SSL Wizard for setting up HTTPS on your Hidden Service website. We also have the usual collection of bug fixes, especially in SusiMail.
pt_br: A versão 0.9.35 adiciona suporte para pastas no SusiMail, e um novo 'Assistente' de SSL Wizard para a configurar HTTPS no seu site da Web de "Serviço Oculto". Nós também temos a coleção usual de correções de erros, especialmente no SusiMail.
tr: 0.9.35 sürümünde SusiMail uygulaması için klasör desteği ile gizli hizmetler siteniz için HTTPS kurulumu yapmanıza yardımcı olacak yeni bir SSL Yardımcısı bulunuyor. Ayrıca özellikle SusiMail üzerinde olmak üzere çeşitli hata düzeltmeleri yapıldı.

source: We're hard at work on several things for 0.9.36, including a new OSX installer and a faster, more secure transport protocol called NTCP2.
pt_br: Nós estamos trabalhando duro em muitas coisas para a versão 0.9.36, incluindo um instalador para OSX e um protocolo de transporte mais rápido e seguro chamado NTCP2.
tr: 0.9.36 sürümüne hazırlık olarak, yeni bir OSX kurucusu ve NTCP2 olarak adlandırılan daha güvenli ve daha hızlı bir taşıyıcı iletişim kuralı gibi bir kaç şey üzerinde sıkı çalışıyoruz.

source: I2P will be at HOPE in New York City, July 20-22. Find us and say hello!
pt_br: A I2P estará na HOPE em Nova York, de 20 a 22 de julho. Encontre-nos e diga olá!
tr: I2P ekibi 20-22 Temmuz arasında New York City HOPE etkinliğine katılıyor. Merhaba demek için bizi bulun!

source: New Hidden Service SSL Wizard
pt_br: Novo Assistente de SSL de Serviço Oculto
tr: Yeni gizli hizmet SSL yardımcısı

source: SusiMail support for Folders, Drafts, background sending
pt_br: Suporte SusiMail para pastas, rascunhos e envio em segundo plano
tr: Klasörler, taslaklar, arka planda gönderme için SusiMail desteği

source: Console: Fix changes to wrong tunnel on /configtunnels
pt_br: Console: Corrigir alterações no túnel errado em /configtunnels
tr: Pano: /configtunnels ile yanlış tünelde yapılan değişiklikler düzeltildi

source: CPUID: Fix TBM detection
pt_br: CPUID: Corrigir detecção de TBM
tr: CPUID: TBM algılaması düzeltildi

source: i2psnark: Fix torrents ignoring priority settings when autostart enabled
pt_br: i2psnark: Corrigir torrents ignorando configurações de prioridade quando a inicialização automática está habilitada
tr: i2psnark: Otomatik başlatma etkinleştirildiğinde torrentlerin öncelik ayarlarını yok sayması düzeltildi

source: i2ptunnel: Retry accept after server socket closed
pt_br: i2ptunnel: Tentar aceitar novamente após o soquete do servidor ser fechado
tr: i2ptunnel: Sunucu soketi kapatıldıktan sonra kabul etme yeniden denendi

source: NTCP: Fix bug causing initial latency for outbound connections
pt_br: NTCP: Corrigir bug que causa latência inicial para conexões de saída
tr: NTCP: Gidiş bağlantıları için ilk gecikmeye neden olan hata düzeltildi

source: SusiMail: Include attachments in forwarded mail
pt_br: SusiMail: Incluir anexos em e-mails encaminhados
tr: SusiMail: İletilen postaya ek dosyaların katılması sağlandı

source: SusiMail: Many other fixes
pt_br: SusiMail: Muitas outras correções
tr: SusiMail: Çeşitli düzeltmeler yapıldı

source: Tunnels: Prevent zero-hop even when no active peers
pt_br: Túneis: evitam saltos zero mesmo quando não há pares ativos
tr: Tüneller: Aktif eşler olmadığında bile sıfır sıçrama engellendi

source: Add support for notes in Addressbook
pt_br: Adicionar suporte para notas no Catálogo de endereços
tr: Adres defterine not alma desteği eklendi

source: Rewrite and new translations for eepsite help page (new installs only)
pt_br: Reescreva e novas traduções para a página de ajuda do eepsite (somente novas instalações)
tr: Eepsite yardım sayfası için yeniden yazma ve yeni çeviriler eklendi (yalnızca yeni kurulumlar)

source: DNSoverHTTPS (disabled by default)
pt_br: DNSoverHTTPS (desabilitado por padrão)
tr: DNSoverHTTPS (varsayılan olarak devre dışı)

source: NTCP refactoring in prep for NTCP2
pt_br: Refatoração NTCP em preparação para NTCP2
tr: NTCP2 hazırlığı için NTCP kodu elden geçirildi

source: Move SusiMail logging to router logs
pt_br: Mover o registro do SusiMail para os registros do roteador
tr: SusiMail günlüğünü yöneltici günlüklerine taşındı

source: SusiMail BCC-to-self feature replaced with Sent folder
pt_br: O recurso BCC-para-si do SusiMail foi substituído pela pasta Enviados
tr: SusiMail kendine BCC özelliği, Gönderilmiş klasörü ile değiştirildi

source: Fix eepget handling of response line with no status text
pt_br: Corrigir o tratamento eepget da linha de resposta sem texto de status
tr: Durum metni bulunmayan yanıt satırının eepget işlenmesi düzeltildi

source: i2psnark UI cleanups
pt_br: Limpezas de IU do i2psnark
tr: i2psnark kullanıcı arayüzü temizlendi

source: New Azerbaijani translation
pt_br: Nova tradução do azerbaijano
tr: Azerice çevirisi eklendi

source: ============================ NTCP2 implementation details ============================
pt_br: ============================= Detalhes da implementação do NTCP2 =============================
tr: ======================== NTCP2 geçişi ayrıntıları ========================

source: I2P's new transport protocol implementation details
pt_br: Detalhes da implementação do novo protocolo de transporte do I2P
tr: Yeni I2P taşıyıcı iletişim kuralına geçiş ayrıntıları

source: `Source article`_ by orignal at habr.com
pt_br: `Artigo fonte`_ por orignal em habr.com
tr: `Kaynak makale`_ orignal tarafından habr.com üzerinde

source: I2P's transport protocols were originally developed around 15 years ago. Back then, the main goal was to hide the transferred data, not to hide the fact that one was using the protocol itself. Nobody thought seriously about protecting against DPI (deep packets inspection) and protocols censorship. Times change, and even though original transport protocols are still providing strong security, there was a demand for a new transport protocol. NTCP2 is designed to resist current censorship threats. Mainly, DPI analysis of packets length. Plus, the new protocol uses the most modern cryptography developments. NTCP2 is based on the `Noise Protocol Framework`_, with SHA256 as a hash function and x25519 as an elliptic curve Diffie-Hellman (DH) key exchange.
pt_br: Os protocolos de transporte do I2P foram originalmente desenvolvidos há cerca de 15 anos. Naquela época, o principal objetivo era ocultar os dados transferidos, e não esconder o fato de que alguém estava usando o protocolo em si. Ninguém pensou seriamente em proteger contra DPI (inspeção profunda de pacotes) e censura de protocolos. Os tempos mudam e, embora os protocolos de transporte originais ainda ofereçam segurança forte, houve uma demanda por um novo protocolo de transporte. O NTCP2 foi projetado para resistir às ameaças atuais de censura. Principalmente, a análise DPI do comprimento dos pacotes. Além disso, o novo protocolo utiliza os desenvolvimentos mais modernos em criptografia. O NTCP2 é baseado na `Noise Protocol Framework`_, com SHA256 como função hash e x25519 como troca de chave de Diffie-Hellman (DH) com curva elíptica.
tr: I2P taşıyıcı iletişim kuralları ilk olarak yaklaşık 15 yıl önce geliştirildi. O zamanlar asıl amaç, kişinin iletişim kuralını kullandığı gerçeğini gizlemek değil, aktarılan verileri gizlemekti. "Derin paket denetimi" (DPI) ve iletişim kuralı engellemeye karşı korumayı kimse ciddi olarak düşünmedi. Zaman değişiyor ve özgün taşıyıcı iletişim kuralları hala güçlü güvenlik sağlıyor olsa da, yeni bir taşıyıcı iletişim kuralı geliştirme isteği vardı. NTCP2, var olan engelleme tehditlerine direnecek şekilde tasarlandı. Özellikle, paket uzunluğunun "Derin paket denetimi" (DPI) incelemesi üzerinde çalışıldı. Ayrıca, yeni iletişim kuralı en modern şifreleme gelişmelerini kullanıyor. NTCP2, karma işlevi olarak SHA256 ve eliptik eğri Diffie-Hellman anahtar alış verişi olarak x25519 ile "Gürültü iletişim kuralı çatısını" temel alıyor.

source: Full specification of NTCP2 protocol can be `found here`_.
pt_br: A especificação completa do protocolo NTCP2 pode ser `encontrada aqui`_.
tr: NTCP2 iletişim kuralının tam özellikleri 'burada bulunabilir'_.

source: New crypto ----------
pt_br: Nova criptografia ----------
tr: Yeni şifreleme ----------

source: NTCP2 requires adding the next cryptographic algorithms to an I2P implementation:
pt_br: O NTCP2 requer a adição dos seguintes algoritmos criptográficos a uma implementação I2P:
tr: NTCP2 için bir I2P uygulamasına gelecekte kullanılacak şifreleme algoritmalarının eklenmesi gerekir:

source: Compared to our original protocol, NTCP, NTCP2 uses x25519 instead of ElGamal for DH function, AEAD/Chaha20/Poly1305 instead of AES-256-CBC/Adler32, and uses SipHash for obfuscating the packet's length information. The key derivation function used in NTCP2 is more complex, now using many HMAC-SHA256 calls.
pt_br: Comparado ao nosso protocolo original, NTCP, o NTCP2 usa x25519 em vez de ElGamal para função DH, AEAD/Chaha20/Poly1305 em vez de AES-256-CBC/Adler32, e usa SipHash para ofuscar as informações de comprimento do pacote. A função de derivação de chave usada no NTCP2 é mais complexa, agora usando muitas chamadas HMAC-SHA256.
tr: Özgün NTCP iletişim kuralı ile karşılaştırıldığında NTCP2, Diffie-Hellman işlevi için ElGamal yerine x25519, AES-256-CBC/Adler32 yerine AEAD/Chaha20/Poly1305 ve paketin uzunluk bilgilerini gizlemek için de SipHash kullanıyor. NTCP2 için kullanılan anahtar türetme işlevi daha karmaşıktır ve birçok HMAC SHA256 çağrısı kullanmaktadır.

source: i2pd (C++) implementation note: All of the algorithms mentioned above, except SipHash, are implemented in OpenSSL 1.1.0. SipHash will be added to the coming OpenSSL 1.1.1 release. For compatibility with OpenSSL 1.0.2, which is used in most of the current systems, core i2pd developer `Jeff Becker`_ has contributed standalone implementations of missing cryptographic algorithms.
pt_br: Nota de implementação do i2pd (C++): Todos os algoritmos mencionados acima, exceto SipHash, são implementados no OpenSSL 1.1.0. O SipHash será adicionado à próxima versão do OpenSSL 1.1.1. Para compatibilidade com o OpenSSL 1.0.2, que é usado na maioria dos sistemas atuais, o desenvolvedor principal do i2pd `Jeff Becker`_ contribuiu com implementações autônomas de algoritmos criptográficos ausentes.
tr: i2pd (C++) uygulama notu: SipHash dışında yukarıda bahsedilen tüm algoritmalar OpenSSL 1.1.0 sürümünde uygulanmaktadır. SipHash, gelecek OpenSSL 1.1.1 sürümüne eklenecektir. Var olan sistemlerin çoğunda kullanılan OpenSSL 1.0.2 sürümü ile uyumluluk sağlamak için, çekirdek i2pd geliştiricisi 'Jeff Becker'_ eksik şifreleme algoritmalarının bağımsız uygulamalarına katkıda bulunmuştur.

source: RouterInfo changes ------------------
pt_br: Alterações no RouterInfo ------------------
tr: "Yöneltici bilgileri" (RouterInfo) değişiklikleri ---------------------------------------------------------------

source: NTCP2 requires having a third (x25519) key in addition to existing two (the encryption and signature keys). It is called a static key and it has to be added to any of RouterInfo addresses as an "s" parameter. It is required for both NTCP2 initiator (Alice) and responder (Bob). If more than one address supports NTCP2, for example, IPv4 and IPv6, "s" is required to be the same for all of them. Alice's address is allowed to have just the "s" parameter without "host" and "port" set. Also, a "v" parameter is required, that is currently always set to "2".
pt_br: O NTCP2 requer uma terceira chave (x25519) além das duas existentes (as chaves de criptografia e assinatura ). Ela é chamada de chave estática e precisa ser adicionada a qualquer um dos endereços RouterInfo como um parâmetro "s". É necessário para o iniciador NTCP2 (Alice) e o respondedor (Bob). Se mais de um endereço suportar NTCP2, por exemplo, IPv4 e IPv6, "s" precisa ser o mesmo para todos eles. O endereço de Alice pode ter apenas o parâmetro "s" sem "host" e "port" definidos. Além disso, um parâmetro "v" é necessário, que atualmente está sempre definido como "2".
tr: NTCP2 üzerinde, var olan iki anahtara (şifreleme ve imza) ek olarak üçüncü bir (x25519) anahtara gerekir. Bu yeni durağan anahtar, "Yöneltici bilgileri" (RouterInfo) adreslerinden herhangi birine "s" parametresi olarak eklenmelidir. Hem NTCP2 başlatıcısı (Alice) hem de yanıtlayıcı (Bob) için gereklidir. Birden fazla adres NTCP2 destekliyorsa, örneğin IPv4 ve IPv6, "s" değerinin hepsi için aynı olması gerekir. Alice`in adresinde, "server" ve "port" ayarlanmadan yalnızca "s" parametresine bulunabilir. Ayrıca, şu anda her zaman "2" olarak ayarlanmış bir "v" parametresi gereklidir.

source: NTCP2 address can be declared as a separate NTCP2 address or as an old-style NTCP address with additional parameters, in which case it will accept both NTCP and NTCP2 connections. Java I2P implementation uses the second approach, i2pd (C++ implementation) uses the first.
pt_br: O endereço NTCP2 pode ser declarado como um endereço NTCP2 separado ou como um endereço NTCP de estilo antigo com parâmetros adicionais, em cujo caso ele aceitará conexões NTCP e NTCP2. A implementação Java I2P usa a segunda abordagem, i2pd (implementação C++) usa a primeira.
tr: NTCP2 adresi ayrı bir NTCP2 adresi olarak veya ek parametrelerle eski tarz bir NTCP adresi olarak bildirilebilir. Bu durumda hem NTCP hem de NTCP2 bağlantıları kabul edilir. Java I2P uygulaması ikinci yaklaşımı, i2pd (C++ uygulaması) ise birinci yaklaşımı kullanır.

source: If a node accepts NTCP2 connections, it has to publish its RouterInfo with the "i" parameter, which is used as an initialization vector (IV) for the public encryption key when that node establishes new connections.
pt_br: Se um nó aceitar conexões NTCP2, ele terá que publicar seu RouterInfo com o parâmetro "i", que é usado como um vetor de inicialização (IV) para a chave de criptografia pública quando esse nó estabelece novas conexões.
tr: Bir düğüm NTCP2 bağlantılarını kabul ederse, bu düğüm yeni bağlantılar kurduğunda "Yöneltici bilgileri" (RouterInfo) verilerini genel şifreleme anahtarı için bir "Başlatma vektörü" (IV) olarak kullanılan "i" parametresiyle yayınlamalıdır.

source: Establishing a connection -------------------------
pt_br: Estabelecendo uma conexão -------------------------
tr: Bağlantı kurmak -------------------------

source: To establish a connection both sides need to generate pairs of ephemeral x25519 keys. Based on those keys and "static" keys they derive a set of keys for data transferring. Both parties must verify that the other side actually has a private key for that static key, and that static key is the same as in RouterInfo.
pt_br: Para estabelecer uma conexão, ambos os lados precisam gerar pares de chaves efêmeras x25519 . Com base nessas chaves e chaves "estáticas", eles derivam um conjunto de chaves para transferência de dados . Ambas as partes devem verificar se o outro lado realmente tem uma chave privada para essa chave estática, e se essa chave estática é a mesma que em RouterInfo.
tr: Bir bağlantı kurmak için her iki tarafın da kısa ömürlü bir x25519 anahtar çifti oluşturması gerekir. Bu anahtarlara ve "durağan" anahtarlara dayanarak, veri aktarımı için bir dizi anahtar elde ederler. Her iki taraf da diğer tarafın bu durağan anahtar için özel bir anahtara sahip olduğunu ve bu durağan anahtarın "Yöneltici bilgileri" (RouterInfo) verileriyle aynı olduğunu doğrulamalıdır.

source: Three messages are being sent to establish a connection:
pt_br: Três mensagens estão sendo enviadas para estabelecer uma conexão:
tr: Bağlantı kurmak için üç ileti gönderilir:

source: A common x25519 key, called «input key material», is computed for each message, after which message encryption key is generated with a MixKey function. A value ck (chaining key) is kept while messages are being exchanged. That value is used as a final input when generating keys for data transferring.
pt_br: Uma chave x25519 comum, chamada «input key material», é computada para cada mensagem, após a qual a chave de criptografia da mensagem é gerada com uma função MixKey. Um valor ck (chave de encadeamento) é mantido enquanto as mensagens estão sendo trocadas. Esse valor é usado como uma entrada final ao gerar chaves para transferência de dados.
tr: Her ileti için «giriş anahtarı malzemesi» adı verilen ortak bir x25519 anahtarı hesaplanır ve ardından bir MixKey işleviyle ileti şifreleme anahtarı oluşturulur. İletiler alınıp verilirken bir ck değeri (zincirleme anahtarı) tutulur. Bu değer, veri aktarımı için anahtarlar oluşturulurken son giriş olarak kullanılır.

source: MixKey function looks something like this in the C++ implementation of I2P:
pt_br: A função MixKey se parece com isso na implementação C++ do I2P:
tr: I2P C++ uygulamasındaki MixKey işlevi şuna benzer:
