Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: One common question after installing the app was "what do I do now?". The app doesn't have a 'hidden services of interest' section or first-run wizard like our desktop application does, and most of the default addressbook entries are long-dead. There's improvements we could make to the first-run experience. Also, some of the more interesting parts of the app are hidden behind an advanced setting; we should review those items and consider un-hiding some of them.
pt_br: Uma pergunta comum após instalar o aplicativo era "o que eu faço agora?". O aplicativo não tem uma seção de 'serviços ocultos de interesse' ou um assistente de primeira execução como nosso aplicativo de desktop tem, e a maioria das entradas padrão do catálogo de endereços estão mortas há muito tempo. Há melhorias que poderíamos fazer na experiência de primeira execução. Além disso, algumas das partes mais interessantes do aplicativo estão escondidas atrás de uma configuração avançada; devemos revisar esses itens e considerar mostrar alguns deles .
tr: Uygulamayı yükledikten sonra sık sorulan sorulardan biri "şimdi ne yapacağım?" oldu. Uygulamanın, masaüstü uygulamamızdaki gibi 'gizli ilgi çekici hizmetler' bölümü veya ilk çalıştırma yardımcısı bulunmuyor ve varsayılan adres defteri girişlerinin çoğu öleli epey oldu. İlk çalıştırma deneyiminde yapabileceğimiz iyileştirmeler var. Ayrıca, uygulamanın daha ilginç bölümlerinden bazıları gelişmiş ayarların arkasında gizli. Bu ögeleri gözden geçirmeli ve bazılarını gizlemeyi düşünmeliyiz.

source: It's always useful to go to Tor talks, not so much to find out what they're doing, but to hear how they explain things to people, and what terminology they are using. Roger's talk "The Tor Censorship Arms Race" was in a large room attended by about two thousand people. He gave a very brief overview of Tor with only three or four slides. He says they now have "two to eight million users a day". Most of the talk was a review of national blocking attempts over the years, starting with Thailand and Iran in '06-'07 through Tunisia, china, and Ethiopia in 2011. He called Tor bridges a "crappy arms race". He showed a new form to be showed to new users, with a checkbox "Tor is censored in my country".
pt_br: É sempre útil ir às palestras do Tor, não tanto para descobrir o que eles estão fazendo, mas para ouvir como eles explicam as coisas para as pessoas e qual terminologia eles estão usando. A palestra de Roger "The Tor Censorship Arms Race" foi em uma sala grande com a presença de cerca de duas mil pessoas. Ele deu uma visão geral muito breve do Tor com apenas três ou quatro slides. Ele diz que eles agora têm "dois a oito milhões de usuários por dia". A maior parte da palestra foi uma revisão das tentativas nacionais de bloqueio ao longo dos anos, começando com a Tailândia e o Irã em 2006-07, passando pela Tunísia, China, e Etiópia em 2011. Ele chamou as pontes do Tor de uma "corrida armamentista de baixa qualidade". Ele mostrou um novo formulário para ser exibido aos novos usuários, com uma caixa de seleção "Tor é censurado no meu país".
tr: Tor konuşmalarına gitmek her zaman yararlıdır. Genellikle ne yaptıklarını öğrenmek için değil, insanlara olayları nasıl açıkladıklarını ve hangi terminolojiyi kullandıklarını duymak iyi oluyor. "Tor sansür silahlanma yarışı" konuşmasını Roger yaptı ve yaklaşık iki bin kişinin katıldığı geniş bir salondaydı. Yalnızca üç veya dört slaytla Tor hakkında çok kısa bir özet verdi. Artık "günde iki ila sekiz milyon kullanıcı" bulunduğunu söylüyor. Konuşmanın çoğu, '06-'07 arasında Tayland ve İran'dan başlayarak 2011'de Tunus, Çin ve Etiyopya'ya kadar uzanan, yıllar içinde yapılmış ulusal engelleme girişimlerinin bir incelemesiydi. Tor köprülerini "berbat bir silahlanma yarışı" olarak nitelendirdi. Yeni kullanıcılara görüntülenecek "Tor ağı ülkemde engelleniyor" seçeneği formunu gösterdi.

source: Their new pluggable transport "snowflake" uses a combination of domain fronting, webrtc, javascript, brokers and proxies to reach a Tor bridge. Roger only had one slide on it, and I wasn't familiar with it, so we should do more research on what it's all about. He briefly mentioned some things they may be working on next, including "salmon" distribution of bridges, FTE/Marionette, decoy routing, and "cupcake" which is an extension of snowflake. While I don't have any further information about them, they may be good buzzwords to keep an eye out for on their mailing lists.
pt_br: O novo transporte plugável "snowflake" deles usa uma combinação de domínio fronting, webrtc, javascript, brokers e proxies para alcançar uma ponte Tor. Roger só tinha um slide sobre isso, e eu não estava familiarizado com ele, então deveríamos fazer mais pesquisa sobre o que é tudo isso. Ele mencionou brevemente algumas coisas em que eles podem estar trabalhando em seguida, incluindo distribuição "salmon" de pontes, FTE/Marionette, roteamento de isca e "cupcake" que é uma extensão do snowflake. Embora eu não tenha mais informações sobre eles, eles podem ser bons chavões para ficar de olho em suas listas de e-mail.
tr: Yeni değiştirilebilir taşıyıcıları "snowflake", bir Tor köprüsüne ulaşmak için etki alanı ön girişi, webrtc, JavaScript, aracılar ve vekil sunucuların kombinasyonunu kullanıyor. Roger bu konuda yalnızca bir slayt gösterdi ve ben bunu anlayamadım. Bu yüzden neyle ilgili olduğu hakkında daha fazla araştırma yapmalıyız. Köprülerin "somon" dağıtımı, FTE/Marionette, yem yönlendirme ve bir snowflake eklentisi olan "cupcake" ile, gelecekte üzerinde çalışacakları bazı şeylerden kısaca bahsetti. Bu konular hakkında ayrıntılı bilgiye sahip olmasam da, e-posta listelerinde izlemek için yeni moda sözcükler olabilir.

source: Much of Tor's censorship woes is due to Tor's popularity, but their TLS handshake is a particular issue and it's been the focus of much of the "arms race" over the years. In some ways we're in better shape, as we've taken several features of their current-best obfs4 pluggable transport and build them into NTCP2. However, we do have issues with our website and reseeds being blocked, as Sadie and Phong will be presenting at USENIX FOCI this week.
pt_br: Grande parte dos problemas de censura do Tor se deve à popularidade do Tor, mas seu handshake TLS é um problema específico e tem sido o foco de grande parte da "corrida armamentista " ao longo dos anos. De certa forma, estamos em melhor forma, pois pegamos vários recursos de seu melhor transporte plugável obfs4 atual e os construímos no NTCP2. No entanto, temos problemas com nosso site e reseeds sendo bloqueados, pois Sadie e Phong farão uma apresentação no USENIX FOCI esta semana.
tr: Tor engelleme sorunlarının çoğu Tor ağının yaygınlığından kaynaklanıyor. Ancak TLS el sıkışmaları özel bir konudur ve yıllar boyunca "silahlanma yarışının" çoğunun odak noktası olmuştur. Şu anki en iyi obfs4 değiştirilebilir taşıyıcılarının birkaç özelliğini aldığımız ve bunları NTCP2 içine yerleştirdiğimiz için bazı yönlerden daha iyi durumdayız. Ancak, Sadie ve Phong bu hafta USENIX FOCI etkinliğinde sunum yapacakları için sitemizle ve yeniden tohumlamaların engellenmesiyle ilgili sorunlarımız var.

source: Notes for next time: I do recommend DEFCON, as long as we find a village to call our home. It's an enormous conference and the limited general hangout spaces are massively overcrowded. Both Monero Village and Crypto/Privacy Village were fantastic hosts and we had several hours at each spot to meet with people. We should find more opportunities to work with both organizations. There were also ZCash people at the Monero Village and we should work with them also. Any future workshop should be targeted at a more general audience. We do need a standard "Intro to I2P" slide deck; it would have been helpful at the workshops. Don't expect attendees to have laptops with them, focus on Android for any hands-on exercises. There's several improvements to be made in our Android app. Drink lots of water in Vegas... and stay away from the slot machines.
pt_br: Notas para a próxima vez: Eu recomendo DEFCON, contanto que encontremos uma vila para chamar de lar. É uma conferência enorme e os limitados espaços de encontro geral estão superlotados. Tanto a Monero Village quanto a Crypto/Privacy Village foram anfitriões fantásticos e tivemos várias horas em cada local para nos encontrar com pessoas. Deveríamos encontrar mais oportunidades de trabalhar com ambas as organizações. Também havia pessoas do ZCash na Monero Village e deveríamos trabalhar com elas também. Qualquer workshop futuro deve ser direcionado a um público mais geral. Nós precisamos de um slide deck padrão "Introdução ao I2P"; teria sido útil nos workshops . Não espere que os participantes tenham laptops com eles, concentre-se no Android para quaisquer exercícios práticos. Há várias melhorias a serem feitas em nosso aplicativo Android . Beba muita água em Vegas... e fique longe das máquinas caça-níqueis .
tr: Gelecek sefer için notlar: Evimizi arayacak bir köy bulduğumuz sürece DEFCON etkinliğini öneririm. Muazzam bir konferans ve sınırlı genel mekân alanları aşırı kalabalık. Hem Monero köyü hem de Kripto/Gizlilik köyü harika ev sahipleriydi ve her noktada insanlarla tanışmak için birkaç saatimiz vardı. Her iki kuruluşla da çalışmak için daha fazla fırsat bulmalıyız. Monero köyünde ZCash çalışanları vardı ve onlarla da çalışmalıyız. Gelecekteki herhangi bir atölye çalışması daha genel bir kitleyi hedef almalı. Standart bir "I2P tanıtımı" sunum bölümüne ihtiyacımız var; çalıştaylarda yardımı dokunurdu. Katılımcıların yanlarında dizüstü bilgisayar olmasını beklemeyin, uygulamalı egzersizler için Android üzerine odaklanın. Android uygulamamızda yapılacak birkaç iyileştirme var. Vegas'ta bol su iç ve kumar makinelerinden uzak dur.

source: Def Con Trip Report- idk
pt_br: Relatório de viagem da Def Con - não sei
tr: Def Con gezi notları - idk

source: I went to Def Con 27 last weekend to give a workshop on I2P application development, and to meet zzz, mhatta, and Alex in person.
pt_br: Fui à Def Con 27 no último final de semana para dar um workshop sobre desenvolvimento de aplicativos I2P e para conhecer zzz, mhatta e Alex pessoalmente.
tr: Geçen hafta sonu I2P uygulama geliştirme üzerine bir atölye çalışması yapmak ve zzz, mhatta ve Alex ile şahsen tanışmak için Def Con 27 etkinliğine gittim.

source: My workshop went well, we even had a few application developers attend! In particular I had a pretty lengthy conversation with a person named Mary about how I2P could be used to eliminate centralization and enhance privacy in a "Magic Wormhole" type of application. While I wasn't totally familiar with Magic Wormhole at the time, I think most of my advice was usable. I think Mary had some very interesting and workable ideas about sharing information in more human-centric ways that could be interesting in I2P applications, and am looking forward to experimenting with some of those.
pt_br: Meu workshop foi bem, até tivemos alguns desenvolvedores de aplicativos presentes! Em em particular, tive uma conversa bem longa com uma pessoa chamada Mary sobre como o I2P poderia ser usado para eliminar a centralização e aumentar a privacidade em um tipo de aplicativo "Magic Wormhole". Embora eu não estivesse totalmente familiarizado com Magic Wormhole na época, acho que a maioria dos meus conselhos era utilizável. Acho que Mary teve algumas ideias muito interessantes e viáveis sobre compartilhar informações de maneiras mais centradas no ser humano que poderiam ser interessantes em aplicativos I2P, e estou ansioso para experimentar algumas delas.
tr: Atölyem iyi geçti, hatta birkaç uygulama geliştiricimiz bile katıldı! Özellikle Mary adında bir kişiyle, merkezileştirmeyi ortadan kaldırmak ve "Sihirli solucan deliği" türünde bir uygulamada gizliliği artırmak için I2P ağının nasıl kullanılabileceği hakkında oldukça uzun bir konuşma yaptım. O zamanlar sihirli solucan deliğine tam olarak aşina olmasam da, önerilerimin çoğunun kullanılabilir olduğunu düşünüyorum. Mary, I2P uygulamalarının daha insan merkezli yollarla bilgi paylaşımı sağlaması hakkında çok ilginç ve uygulanabilir fikirlere sahip ve bunlardan bazılarını denemek için sabırsızlanıyorum.

source: The materials I made for the application development workshop are available on Github! https://github.com/eyedeekay/defcon Please consider it a living document, your input is desired! As it is licensed permissively, you are free to fork it and make it your own as well. Share your examples, your hacks, or correct my comma use, complain about my document preparation style, or just print off your own copy in booklet form!
pt_br: Os materiais que fiz para o workshop de desenvolvimento de aplicativos estão disponíveis no Github! https://github.com/eyedeekay/defcon Por favor, considere-o um documento vivo, sua contribuição é desejada! Como ele é licenciado permissivamente, você é livre para bifurcá-lo e torná-lo seu também. Compartilhe seus exemplos, seus hacks ou corrija meu uso de vírgulas, reclame sobre meu estilo de preparação de documentos ou apenas imprima sua própria cópia em forma de livreto!
tr: Uygulama geliştirme atölyesi için hazırladığım malzemeler GitHub üzerinde bulunabilir! https://github.com/eyedeekay/defcon Lütfen bunu yaşayan bir belge olarak kabul edin, katkılarınızı bekliyorum! İzinli olarak lisanslandığı için, yeni bir dal oluşturmakta ve kendiniz geliştirmekte özgürsünüz. Örneklerinizi ve püf noktalarınızı paylaşın veya virgül kullanımımı düzeltin, belge hazırlama biçimimi şikayet edin veya kendi kopyanızı kitapçık biçiminde yazdırın!

source: I also talked to a guy who gives advice to the government about the differences between I2P and Tor, why I2P is more P2P-friendly, and some scenarios in which peers in a P2P application might want to have enhanced privacy from each-other, and why I2P is perhaps uniquely suited to accomplish that.
pt_br: Também conversei com um cara que dá conselhos ao governo sobre as diferenças entre I2P e Tor, por que o I2P é mais amigável ao P2P e alguns cenários nos quais pares em um aplicativo P2P podem querer ter maior privacidade uns dos outros, e por que o I2P talvez seja especialmente adequado para fazer isso.
tr: Ayrıca hükümete I2P ve Tor arasındaki farklar, I2P ağının neden daha P2P dostu olduğu ve bir P2P uygulamasındaki eşlerin birbirlerinden daha fazla gizliliğe sahip olmak isteyebilecekleri bazı senaryolar ile bunu sağlamak için I2p ağının neden benzersiz bir şekilde uygun olduğu hakkında önerilerde bulunan bir adamla konuştum.

source: In general, both the application development workshops went well, even though they didn't go entirely according to plan in that only a small proportion of the audience were application developers. The impression I got was that many people are very interested in I2P, but also many people are confused by how interacting with I2P works. By re-focusing on their questions and by teaming off with zzz, mhatta, and Alex we were fairly successful at dealing with our audience, which was more varied in terms of occupation, interest, and I2P knowledge than expected.
pt_br: Em geral, ambos os workshops de desenvolvimento de aplicativos foram bem, embora eles não tenham saído totalmente de acordo com o planejado, pois apenas uma pequena proporção do público eram desenvolvedores de aplicativos. A impressão que tive foi que muitas pessoas estão muito interessadas em I2P, mas também muitas pessoas estão confusas sobre como a interação com I2P funciona. Ao nos concentrarmos novamente em suas perguntas e nos unirmos a zzz, mhatta e Alex, fomos bem-sucedidos em lidar com nosso público, que era mais variado em termos de ocupação, interesse e conhecimento de I2P do que o esperado.
tr: Genel olarak, uygulama geliştirme atölyelerinin ikisi de, izleyicilerin yalnızca küçük bir bölümü uygulama geliştiricisi olduğu için tamamen plana göre gitmemiş olsa da iyi gitti. Aldığım izlenim, birçok insanın I2P ile çok ilgili olduğu, ancak aynı zamanda I2P ile etkileşimin nasıl çalıştığı konusunda kafa karışıklığı olduğu yönündeydi. Sorularına yeniden odaklanarak ve zzz, mhatta ve Alex ile ekip halinde, beklediğimizden daha çeşitli meslek, ilgi alanı ve I2P bilgi düzeyinden izleyicilerimizle görüşmekte oldukça başarılı olduk.

source: Besides that, I also talked to Alex about my experimental contextual-identity driven I2P proxy plugin for Firefox and eventually, Brave Browser. Got to talk a little about bundling, but not too much, as it was a very busy convention. I'm looking forward to following up with him on that soon.
pt_br: Além disso, também conversei com Alex sobre meu plugin de proxy I2P experimental de identidade contextual para Firefox e, eventualmente, Brave Browser. Consegui falar um pouco sobre empacotamento, mas não muito, pois foi uma convenção muito movimentada. Estou ansioso para falar com ele sobre isso em breve.
tr: Bunun yanında, Alex ile Firefox için deneysel bağlamsal kimlik odaklı I2P vekil sunucu eklentim ve sonrasında Brave Browser hakkında da konuştum. Paketleme hakkında biraz konuşmalıyım, ama çok yoğun bir kongre olduğu için çok fazla değil. Onu yakından izlemek için sabırsızlanıyorum.

source: mhatta and I almost won a lobster from a claw machine, but it was a real fighter and got away at the last second. Really thought I had it for a moment though. :)
pt_br: mhatta e eu quase ganhamos uma lagosta de uma máquina de garras, mas ela era uma verdadeira lutadora e escapou no último segundo. Realmente pensei que tinha conseguido por um momento embora. :)
tr: mhatta ve ben bir pençe makinesinden neredeyse bir ıstakoz kazanıyorduk, ama gerçek bir dövüşçüydü ve son saniyede kaçtı. Bir an gerçekten yakaladığımı sandım. :)

source: To add to zzz's notes for next time, aside from being more general I believe our workshops would not have been as able to adapt to the needs of the audience without the support of mhatta and Alex. Having people who can help particpants individually or in small groups was immensely helpful, many, many thanks to both of them for helping us out.
pt_br: Para adicionar às notas do zzz para a próxima vez, além de ser mais geral, acredito que nossos workshops não teriam sido capazes de se adaptar às necessidades do público sem o apoio de mhatta e Alex. Ter pessoas que podem ajudar os participantes individualmente ou em pequenos grupos foi imensamente útil, muitos, muitos agradecimentos a ambos por nos ajudarem.
tr: zzz notlarına ek yapmak gerekirse gelecek sefer daha genel olmanın yanı sıra, atölyelerimizin mhatta ve Alex tarafından destek almadan izleyicilerin ihtiyaçlarına bu kadar uyum sağlamasının zor olacağını düşünüyorum. Katılımcılara bireysel veya küçük gruplar halinde yardımcı olabilecek insanların olmasının çok yardımı oldu. Bize yardım ettikleri için ikisine de çok ama çok teşekkürler.

source: USENIX FOCI Trip Report
pt_br: Relatório de viagem USENIX FOCI
tr: USENIX FOCI gezi notları

source: Over the past year I have had the good fortune to participate in the research Nguyen Phong Hoang from Stony Brook University has been doing regarding I2P censorship. The infrastructure used for this research provided numerous and geographically diverse vantage points, and also the ability to conduct in-depth measurements across all levels of the network stack. I2P services which were measured for availability included official homepage, mirror site, reseed servers and active relays.
pt_br: No ano passado, tive a sorte de participar da pesquisa que Nguyen Phong Hoang da Stony Brook University vem fazendo sobre a censura I2P . A infraestrutura usada para essa pesquisa forneceu vários e pontos de vista geograficamente diversos, e também a capacidade de conduzir medições aprofundadas em todos os níveis da pilha de rede. Os serviços I2P que foram medidos para disponibilidade incluíram página inicial oficial, site espelho, servidores de reseed e relés ativos.
tr: Geçen yıl boyunca Stony Brook Üniversitesi'nden Nguyen Phong Hoang'ın I2P sansürüyle ilgili yaptığı araştırmaya katılma şansım oldu. Bu araştırma için kullanılan altyapı, çeşitli ve coğrafi olarak farklı bakış noktaları ile ağ yığınının tüm düzeylerinde derinlemesine ölçümler yapma yeteneği sağladı. Kullanılabilirlik için ölçülen I2P hizmetleri, resmi ana sayfa, yansı sitesi, yeniden tohumlama sunucular ve aktif aktarıcıları içeriyordu.

source: The presentation on Tuesday went very well, and Phong was very busy afterwards answering questions about his work. I was busy too answering questions about I2P and what it does. The new stickers featuring the updated logo by Ura Design got rave reviews! It was a very positive experience and I will be looking forward to continuing to work with Phong and monitoring I2P censorship. I would encourage anyone who has encountered blocking, or has had success using I2P to communicate in restricted environments to reach out if you can. I2P is currently working on new solutions to circumvent internet blocking. Having met people this year who have given me first hand accounts of the effects of censorship and the need to stay connected, makes the need for I2P to be more resilient where it needs to be and for the team to be creating guides for using I2P in these situations.
pt_br: A apresentação na terça-feira foi muito boa, e Phong estava muito ocupado depois respondendo perguntas sobre seu trabalho. Eu também estava ocupado respondendo perguntas sobre I2P e o que ele faz. Os novos adesivos com o logotipo atualizado da Ura Design receberam ótimas críticas! Foi uma experiência muito positiva e estarei ansioso para continuar trabalhando com Phong e monitorar a censura do I2P. Eu encorajaria qualquer um que tenha encontrado bloqueio ou tenha tido sucesso usando o I2P a se comunicar em ambientes restritos a entrar em contato se puder. O I2P está atualmente trabalhando em novas soluções para contornar o bloqueio da Internet. Tendo conhecido pessoas este ano que me deram relatos em primeira mão dos efeitos da censura e da necessidade de permanecer conectado, torna-se necessário que o I2P seja mais resiliente onde for necessário e que a equipe crie guias para usar o I2P nessas situações.
tr: Salı günkü sunum çok iyi geçti ve Phong daha sonra çalışmalarıyla ilgili soruları yanıtlamakla çok meşguldü. Ben de I2P ve ne yaptığıyla ilgili soruları yanıtlamakla ilgilendim. Güncellenmiş Ura Design logosunu içeren yeni çıkartmalar büyük beğeni topladı! Çok olumlu bir deneyimdi. Phong ile çalışmayı sürdürmeyi ve I2P sansürünü izlemeyi dört gözle bekleyeceğim. Engellemeyle karşılaşan veya kısıtlı ortamlarda iletişim kurmak için I2P kullanarak başarılı olan herkesi mümkünse ulaşmaya teşvik ediyorum. I2P şu anda internet engellemesini aşmak için yeni çözümler üzerinde çalışıyor. Bu yıl bana sansürün etkileri ve bağlantıda kalma ihtiyacı hakkında ilk elden açıklamalar veren insanlarla tanışmış olmak, bu durumlarda I2P ağının olması gereken yerde daha dayanıklı olmasını ve ekibin I2P ağını kullanmak için rehberler oluşturmasını sağlıyor.

source: I will be putting together better resources for researchers interested in I2P, as well.
pt_br: Estarei reunindo melhores recursos para pesquisadores interessados em I2P, também.
tr: I2P ile ilgilenen araştırmacılar için de daha iyi kaynakları bir araya getireceğim.
