Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/blog.po
Languages: pt_br, tr

source: This is a tutorial on how to set up and tweak an I2P tunnel in order to use it to access an SSH server remotely, using either I2P or i2pd. For now, it assumes you will install your SSH server from a package manager and that it's running as a service.
pt_br: Este é um tutorial sobre como configurar e ajustar um túnel I2P para usá-lo para acessar um servidor SSH remotamente, usando I2P ou i2pd. Por enquanto, ele assume que você instalará seu servidor SSH de um gerenciador de pacotes e que ele está sendo executado como um serviço.
tr: Bu eğitimde, bir SSH sunucusuna I2P veya i2pd kullanarak uzaktan erişmek için bir I2P tünelinin nasıl kurulacağı ve ayarlanacağı anlatılacak. Şimdilik, SSH sunucunuzu bir paket yöneticisinden kuracağınızı ve bir hizmet olarak çalıştırdığınızı varsayıyoruz.

source: Considerations: In this guide, I'm assuming a few things. They will need to be adjusted depending on the complications that arise in your particular setup, especially if you use VM's or containers for isolation. This assumes that the I2P router and the ssh server are running on the same localhost. You should be using newly-generated SSH host keys, either by using a freshly installed sshd, or by deleting old keys and forcing their re-generation. For example:
pt_br: Considerações: Neste guia, estou assumindo algumas coisas. Elas precisarão ser ajustadas dependendo das complicações que surgirem em sua configuração específica, especialmente se você usar VMs ou contêineres para isolamento. Isso pressupõe que o roteador I2P e o servidor ssh estejam em execução no mesmo host local. Você deve estar usando chaves de host SSH recém-geradas, seja usando um sshd recém-instalado, ou excluindo chaves antigas e forçando sua regeneração. Por exemplo:
tr: Varsayımlar: Bu rehberde, birkaç şeyi varsayıyorum. Özel kurulumunuzda ortaya çıkabilecek sorunlara bağlı olarak, özellikle de yalıtım için sanal makineler veya kapsayıcılar kullanıyorsanız, bunların ayarlanması gerekebilir. Bu eğitimde, I2P yönelticisinin ve SSH sunucusunun aynı yerel sunucuda çalıştığı varsayılıyor. Ya yeni kurulmuş bir sshd kullanarak ya da eski anahtarları silip yeniden oluşturulmasını sağlayarak yeni SSH sunucu anahtarlarını kullanmalısınız. Örneğin:

source: Step One: Set up I2P tunnel for SSH Server
pt_br: Etapa 1: Configurar túnel I2P para servidor SSH
tr: Birinci adım: SSH sunucusu için I2P tünelini kurun

source: Using Java I2P
pt_br: Usando Java I2P
tr: Java I2P kullanarak

source: Using java I2P's web interface, navigate to the (Links to your Router Console)\ `Hidden Services Manager <http://127.0.0.1:7657/i2ptunnelmgr>`__ and start the tunnel wizard.
pt_br: Usando a interface web do Java I2P, navegue até (Links para o console do seu roteador)\ `Hidden Services Manager <http://127.0.0.1:7657/i2ptunnelmgr>`__ e inicie o assistente de túnel.
tr: Java I2P internet arayüzünü kullanarak (Yöneltici panonuzun bağlantısı)\ `Gizli hizmetler yönetimi <http://127.0.0.1:7657/i2ptunnelmgr>`__ seçeneğine gidin ve tünel yardımcısını başlatın.

source: Tunnel Wizard
pt_br: Assistente de túneis
tr: Tünel Yardımcısı

source: Since you are setting up this tunnel for the SSH server, you need to select the "Server" tunnel type.
pt_br: Como você está configurando este túnel para o servidor SSH, você precisa selecionar o tipo de túnel "Servidor".
tr: Bu tüneli SSH sunucusu için kurduğunuzdan tünel türünü "Sunucu" olarak seçmelisiniz.

source: You should fine-tune it later, but the Standard tunnel type is easiest to start with.
pt_br: Você deve ajustá-lo mais tarde, mas o tipo de túnel Padrão é mais fácil de começar .
tr: Daha sonra ince ayar yapmalısınız. Ancak Standart tünel türüyle başlamak en kolayıdır.

source: Give it a good description:
pt_br: Dê uma boa descrição:
tr: İyi bir açıklama yazın:

source: And tell it where the SSH server will be available.
pt_br: E informe onde o servidor SSH estará disponível.
tr: Ve SSH sunucusunun nerede kullanılacağını anlatın.

source: Look over the results, and save your settings.
pt_br: Revise os resultados e salve suas configurações.
tr: Sonuçları gözden geçirin ve ayarlarınızı kaydedin.

source: Advanced Settings
pt_br: Configurações Avançadas
tr: Gelişmiş Ayarlar

source: Now head back over the the Hidden Services Manager, and look over the available advanced settings. One thing you'll definitely want to change is to set it up for interactive connections intstead of bulk connections.
pt_br: Agora volte para o Hidden Services Manager e olhe as configurações avançadas disponíveis. Uma coisa que você definitivamente vai querer mudar é configurá-lo para conexões interativas em vez de conexões em massa.
tr: Şimdi gizli hizmetler yönetimi bölümüne geri dönün ve var olan gelişmiş ayarlara bakın. Toplu bağlantılar yerine etkileşimli bağlantılar kullanılması ayarını kesinlikle değiştirmek istersiniz.

source: Besides that, these other options can affect performance when accessing your SSH server. If you aren't that concerned about your anonymity, then you could reduce the number of hops you take. If you have trouble with speed, a higher tunnel count might help. A few backup tunnels are probably a good idea. You might have to dial-it-in a bit.
pt_br: Além disso, essas outras opções podem afetar o desempenho ao acessar seu servidor SSH . Se você não estiver tão preocupado com seu anonimato, então você pode reduzir o número de saltos que você faz. Se você tiver problemas com velocidade, uma contagem de túneis maior pode ajudar. Alguns túneis de backup provavelmente são uma boa ideia. Você pode ter para discar um pouco.
tr: Bunun yanında, diğer seçenekler, SSH sunucunuza erişme başarımını etkileyebilir. Anonimliğiniz hakkında o kadar endişeli değilseniz, durak sayısını azaltabilirsiniz. Hız konusunda sorun yaşıyorsanız, daha yüksek bir tünel sayısı yardımcı olabilir. Birkaç yedek tünel büyük olasılıkla iyi fikirdir. Değerlerle biraz oynamanız gerekebilir.

source: Finally, restart the tunnel so that all of your settings take effect.
pt_br: Por fim, reinicie o túnel para que todas as suas configurações entrem em vigor.
tr: Son olarak, tüm ayarlarınızın etkili olması için tüneli yeniden başlatın.

source: Another interesting setting, especially if you choose to run a high number of tunnels is "Reduce on Idle" which will reduce the number of tunnels that run when the serve has experienced extended inactivity.
pt_br: Outra configuração interessante, especialmente se você escolher executar um grande número de túneis , é "Reduzir em Inatividade", que reduzirá o número de túneis executados quando o saque tiver passado por inatividade prolongada.
tr: Özellikle çok sayıda tünel çalıştırmayı seçerseniz, "Boştayken azaltılsın" seçeneği de ilginçtir. Hizmet uzun süre boşta beklerse çalışan tünellerin sayısı azaltılır.

source: Using i2pd
pt_br: Usando i2pd
tr: i2pd kullanarak

source: With i2pd, all configuration is done with files instead of via a web interface. In order to configure an SSH Service tunnel for i2pd, tweak the following example settings to your anonymity and performance needs and copy them into tunnels.conf
pt_br: Com o i2pd, toda a configuração é feita com arquivos em vez de por meio de uma interface da web. Para configurar um túnel de serviço SSH para o i2pd, ajuste as seguintes configurações de exemplo de acordo com suas necessidades de anonimato e desempenho e copie-as para tunnels.conf
tr: i2pd ile tüm yapılandırma internet arayüzü yerine dosyalar ile yapılır. i2pd ile bir SSH hizmet tüneli yapılandırmak için, aşağıdaki örnek ayarları anonimlik ve başarım gereksinimlerinize göre düzenleyin ve bunları tunnels.conf dosyasına kopyalayın.

source: Restart your I2P router
pt_br: Reinicie seu roteador I2P
tr: I2P yönelticinizi yeniden başlatın

source: Step Two: Set up SSH server
pt_br: Etapa dois: configurar o servidor SSH
tr: İkinci adım: SSH sunucusunu kurun

source: Depending on how you want to access your SSH Server, you may want to make a few changes to the settings. Besides the obvious SSH hardening stuff you should do on all SSH servers(Public-Key Authentication, no login as root, etc), if you don't want your SSH server to listen on any addresses except your server tunnel, you should change AddressFamily to inet and ListenAddress to 127.0.0.1.
pt_br: Dependendo de como você deseja acessar seu servidor SSH, você pode querer fazer algumas alterações nas configurações. Além das coisas óbvias de endurecimento do SSH, você deve fazer em todos os servidores SSH (autenticação de chave pública, sem login como root, etc.), se você não quiser que seu servidor SSH escute em nenhum endereço, exceto seu túnel de servidor, você deve alterar AddressFamily para inet e ListenAddress para 127.0.0.1.
tr: SSH sunucunuza nasıl erişmek istediğinize bağlı olarak, ayarlarda birkaç değişiklik yapmak isteyebilirsiniz. Tüm SSH sunucularında (Public-Key Authentication, root olarak oturum açma vb.) yapmanız gereken bilinen SSH koruma işlemlerinin yanı sıra, SSH sunucunuzun sunucu tüneliniz dışındaki herhangi bir adresi dinlemesini istemiyorsanız, AddressFamily değerini inet ve ListenAddress değerini 127.0.0.1 olarak ayarlamalısınız.

source: If you choose to use a port other than 22 for your SSH server, you will need to change the port in your I2P tunnel configuration.
pt_br: Se você optar por usar uma porta diferente de 22 para seu servidor SSH, será necessário alterar a porta na configuração do seu túnel I2P.
tr: SSH sunucunuz için 22 dışında bir bağlantı noktası kullanmayı seçerseniz, I2P tünel yapılandırmanızdaki bağlantı noktasını değiştirmeniz gerekecektir.

source: Step Three: Set up I2P tunnel for SSH Client
pt_br: Etapa três: configurar o túnel I2P para o cliente SSH
tr: Üçüncü adım: SSH istemcisi için I2P tünelini kurun

source: You will need to be able to see the I2P router console of the SSH server in order to configure your client connection. One neat thing about this setup is that the initial connection to the I2P tunnel is authenticated, somewhat reducing the risk of your initial connection to the SSH server being MITM'ed, as is a risk in Trust-On-First-Use scenarios.
pt_br: Você precisará ser capaz de ver o console do roteador I2P do servidor SSH em ordem para configurar sua conexão de cliente. Uma coisa legal sobre essa configuração é que a conexão inicial com o túnel I2P é autenticada, de certa forma reduzindo o risco de sua conexão inicial com o servidor SSH ser MITM'ed, como é um risco em cenários Trust-On-First-Use.
tr: İstemci bağlantınızı yapılandırmak için SSH sunucusunun I2P yöneltici panosunu görebilmeniz gerekecektir. Bu kurulumla ilgili güzel bir şey, I2P tüneline ilk bağlantının kimliğinin doğrulanmasıdır. Bu durum, ilk kullanıma güvenilme senaryolarında olduğu gibi, SSH sunucusuna ilk bağlantınızın MITM ile yapılması riskini bir şekilde azaltır.

source: First, start the tunnel configuration wizard from the hidden services manager and select a client tunnel.
pt_br: Primeiro, inicie o assistente de configuração do túnel no gerenciador de serviços ocultos e selecione um túnel de cliente.
tr: İlk olarak, gizli hizmetler yöneticisinden tünel yapılandırma yardımcısını başlatın ve bir istemci tüneli seçin.

source: Next, select the standard tunnel type. You will fine-tune this configuration later.
pt_br: Em seguida, selecione o tipo de túnel padrão. Você ajustará essa configuração mais tarde.
tr: Ardından, standart tünel türünü seçin. Daha sonra bu yapılandırmada ince ayar yapacaksınız.

source: Give it a good description.
pt_br: Dê uma boa descrição.
tr: İyi bir açıklama yazın.

source: This is the only slightly tricky part. Go to the hidden services manager of the I2P router console and find the base64 "local destination" of the SSH server tunnel. You'll need to find a way to copy this information into the next step. I generally `Tox <https://tox.chat>`__ it to myself, any off-the-record should be sufficient for most people.
pt_br: Esta é a única parte um pouco complicada. Vá para o gerenciador de serviços ocultos do console do roteador I2P e encontre o "destino local" base64 do túnel do servidor SSH . Você precisará encontrar uma maneira de copiar essas informações para a próxima etapa. Eu geralmente `Tox <https://tox.chat>`__ para mim mesmo, qualquer off-the-record deve ser suficiente para a maioria das pessoas.
tr: Tek zor olabilecek bölüm budur. I2P yöneltici panosunda gizli hizmetler yönetimi bölümüne gidin ve SSH sunucu tünelinin base64 "yerel hedefini" bulun. Bu bilgiyi bir sonraki adıma kopyalamanın bir yolunu bulmanız gerekecek. Ben genellikle `Tox <https://tox.chat>`__ kullanıyorum. Çoğu kişi için herhangi bir kayıt dışı uygulama yeterli olmalıdır.

source: Once you've found the base64 destination you want to connect to transmitted to your client device, then paste it into the client destination field.
pt_br: Depois de encontrar o destino base64 ao qual você deseja se conectar, transmita para seu dispositivo cliente e cole-o no campo de destino do cliente.
tr: İstemci aygıtınıza iletilen bağlanmak istediğiniz base64 hedefini bulduktan sonra bunu istemci hedef alanına yapıştırın.

source: Lastly, set a local port to connect your ssh client to. This will local port will be connected to the base64 destination and thus the SSH server.
pt_br: Por fim, defina uma porta local para conectar seu cliente ssh. Esta porta local será conectada ao destino base64 e, portanto, ao servidor SSH.
tr: Son olarak, SSH istemcinizin bağlantı kuracağı yerel bir bağlantı noktası ayarlayın. Yerel bağlantı noktası base64 hedefine ve dolayısıyla SSH sunucusuna bağlanacaktır.

source: Decide whether you want it to start automatically.
pt_br: Decida se você quer que ele inicie automaticamente.
tr: Otomatik başlatmayı isteyip istemediğinize karar verin.

source: Like before, you'll want to change the settings to be optimized for interactive connections. Additionally, if you want to set up client whiteliting on the server, you should check the "Generate key to enable persistent client tunnel identity" radial button.
pt_br: Assim como antes, você vai querer alterar as configurações para serem otimizadas para conexões interativas . Além disso, se você quiser configurar o whiteliting do cliente no servidor , você deve marcar o botão radial "Gerar chave para habilitar a identidade persistente do túnel do cliente ".
tr: Daha önce olduğu gibi, etkileşimli bağlantılar için iyileştirilebilecek ayarları değiştirmek isteyeceksiniz. Ek olarak, sunucuda istemci beyaz listesini ayarlamak istiyorsanız, "Kalıcı istemci tüneli kimliğini etkinleştirmek için anahtar oluşturulsun" seçeneğini işaretlemelisiniz.

source: You can set this up by adding the following lines to your tunnels.conf and adjust it for your performance/anonymity needs.
pt_br: Você pode configurar isso adicionando as seguintes linhas ao seu tunnels.conf e ajustá-lo de acordo com suas necessidades de desempenho/anonimato.
tr: Bunun için, tunnels.conf dosyanıza aşağıdaki satırları ekleyebilir ve başarım/anonimlik gereksinimlerinize uygun ayarları yapabilirsiniz.

source: Restart the I2P router on the client
pt_br: Reinicie o roteador I2P no cliente
tr: İstemcide I2P yönelticisini yeniden başlatın

source: Step Four: Set up SSH client
pt_br: Etapa quatro: configurar o cliente SSH
tr: Dördüncü adım: SSH istemcisini kurun

source: There are lots of ways to set up an SSH client to connect to your server on I2P, but there are a few things you should do to secure your SSH client for anonymous use. First, you should configure it to only identify itself to SSH server with a single, specific key so that you don't risk contaminating your anonymous and non-anonymous SSH connections.
pt_br: Há muitas maneiras de configurar um cliente SSH para se conectar ao seu servidor em I2P, mas há algumas coisas que você deve fazer para proteger seu cliente SSH para uso anônimo . Primeiro, você deve configurá-lo para se identificar apenas com o servidor SSH com uma única chave específica para que você não corra o risco de contaminar suas conexões SSH anônimas e não anônimas.
tr: I2P üzerinde sunucunuza ile bağlantı kurmak amacıyla bir SSH istemcisi kurmanın birçok yolu vardır. Ancak SSH istemcinizi anonim olarak güvenceye almak için yapmanız gereken birkaç şey vardır. İlk olarak, anonim ve anonim olmayan SSH bağlantılarınızı kirletme riskiniz olmaması için kendisini yalnızca SSH sunucusuna tek bir özel anahtarla tanımlayacak şekilde yapılandırmalısınız.

source: Make sure your $HOME/.ssh/config contains the following lines:
pt_br: Certifique-se de que seu $HOME/.ssh/config contém as seguintes linhas:
tr: $HOME/.ssh/config dosyanızda aşağıdaki satırların bulunduğundan emin olun:

source: Alternatively, you could make a .bash_alias entry to enforce your options and automatically connect to I2P. You get the idea, you need to enforce IdentitiesOnly and provide an identity file.
pt_br: Alternativamente, você pode fazer uma entrada .bash_alias para impor suas opções e conectar-se automaticamente ao I2P. Você entendeu a ideia, você precisa impor IdentitiesOnly e fornecer um arquivo de identidade.
tr: Alternatif olarak, seçeneklerinizi dayatmak ve otomatik olarak I2P bağlantısı kurmak için bir .bash_alias kaydı yapabilirsiniz. Fikri anladınız, IdentitiesOnly seçeneğini dayatmanız ve bir kimlik dosyası belirtmeniz gerekiyor.

source: Step Five: Whitelist only the client tunnel
pt_br: Etapa cinco: coloque na lista de permissões apenas o túnel do cliente
tr: Beşinci adım: Yalnızca istemci tünelini beyaz listeye alın

source: This is more-or-less optional, but it's pretty cool and will prevent anyone who happens to come across your destination from being able to tell you are hosting an SSH service.
pt_br: Isso é mais ou menos opcional, mas é muito legal e evitará que qualquer pessoa que por acaso encontre seu destino consiga saber que você está hospedando um serviço SSH.
tr: Bu seçenek, aşağı yukarı isteğe bağlıdır, ancak oldukça havalıdır ve hedefinize rastlayan kişilerin bir SSH hizmeti barındırdığınızı anlamasını engeller.

source: First, retrieve the persistent client tunnel destination and transmit it to the server.
pt_br: Primeiro, recupere o destino do túnel do cliente persistente e transmita-o para o servidor .
tr: İlk olarak, kalıcı istemci tüneli hedefini alın ve sunucuya iletin.

source: Add the client's base64 destination to the server's destination whitelist. Now you'll only be able to connect to the server tunnel from that specific client tunnel and no one else will be able to connect to that destination.
pt_br: Adicione o destino base64 do cliente à lista de permissões de destino do servidor. Agora você só poderá se conectar ao túnel do servidor daquele túnel cliente específico e ninguém mais poderá se conectar a esse destino.
tr: İstemcinin base64 hedefini sunucunun hedef beyaz listesine ekleyin. Artık yalnızca o belirli istemci tünelinden sunucu tüneline bağlantı kurabilirsiniz ve başka hiç kimse bu hedefe bağlanamaz.

source: Mutual authentication FTW.
pt_br: Autenticação mútua FTW.
tr: Karşılıklı kimlik doğrulama FTW.

source: So You Want To Write A SAM Library
pt_br: Então você quer escrever uma biblioteca SAM
tr: Bir SAM kitaplığı yazmak

source: Beginners guide to writing a SAM library!
pt_br: Guia para iniciantes sobre como escrever uma biblioteca SAM!
tr: Yeni başlayanlar için SAM kitaplığı yazma rehberi!

source: One of the best features of I2P, in my opinion, is it's SAM API, which can be used to build a bridge between I2P and your application or language of choice. Currently, dozens of SAM libraries exist for a variety of languages, including:
pt_br: Um dos melhores recursos do I2P, na minha opinião, é sua API SAM, que pode ser usada para construir uma ponte entre o I2P e seu aplicativo ou linguagem de escolha. Atualmente, existem dezenas de bibliotecas SAM para uma variedade de linguagens, incluindo:
tr: Bence I2P ile ilgili en iyi özelliklerden biri, I2P ağı ile uygulamanız veya seçtiğiniz programlama dili arasında bir köprü oluşturmak için kullanılabilecek SAM API uygulamasıdır. Şu anda, aşağıdakilerle birlikte çeşitli diller için düzinelerce SAM kitaplığı bulunmaktadır:

source: If you're using any of these languages, you may be able to port your application to I2P already, using an existing library. That's not what this tutorial is about, though. This tutorial is about what to do if you want to create a SAM library in a new language. In this tutorial, I will implement a new SAM library in Java. I chose Java because there isn't a Java library that connects you to SAM yet, because of Java's use in Android, and because it's a language almost everybody has at least a *little* experience with, so hopefully you can translate it into a language of your choice.
pt_br: Se você estiver usando qualquer uma dessas linguagens, você pode ser capaz de portar seu aplicativo para I2P já, usando uma biblioteca existente. Não é disso que este tutorial se trata, no entanto. Este tutorial é sobre o que fazer se você quiser criar uma biblioteca SAM em uma nova linguagem. Neste tutorial, implementarei uma nova biblioteca SAM em Java. Eu escolhi Java porque não há uma biblioteca Java que conecte você ao SAM ainda, por causa do uso do Java no Android, e porque é uma linguagem com a qual quase todo mundo tem pelo menos um *pouco* de experiência, então espero que você possa traduzi-la para uma linguagem de sua escolha.
tr: Bu dillerden herhangi birini kullanıyorsanız, uygulamanızı var olan bir kitaplığı kullanarak I2P üzerine taşıyabilirsiniz. Yine de bu eğitimin konusu bu değil. Bu eğitimde, yeni bir dilde bir SAM kitaplığı oluşturmak istiyorsanız ne yapacağınızı anlatacağım. Bu derste Java ile yeni bir SAM kitaplığı oluşturacağım. Android üzerinde kullanıldığından ve neredeyse herkesin *az çok* deneyimi olduğundan Java dilini seçtim çünkü henüz sizi SAM üzerine bağlayan bir Java kitaplığı yok. Umarım bu örneği seçeceğiniz başka bir dile çevirebilirsiniz.

source: Creating your library
pt_br: Criando sua biblioteca
tr: Kitaplığınızı oluşturmak

source: How you set up your own library will vary depending on the language you wish to use. For this example library, we'll be using java so we can create a library like this:
pt_br: Como você configura sua própria biblioteca irá variar dependendo da linguagem que você deseja usar. Para esta biblioteca de exemplo, usaremos Java para que possamos criar uma biblioteca assim:
tr: Kendi kitaplığınızı nasıl kuracağınız, kullanmak istediğiniz dile bağlı olarak değişir. Bu örnek kitaplık için java kullanacağız, böylece şöyle bir kitaplık oluşturabiliriz:

source: Or, if you are using gradle 5 or greater:
pt_br: Ou, se você estiver usando o Gradle 5 ou superior:
tr: Ya da gradle 5 veya daha üzerini kullanıyorsanız:

source: Setting up the Library
pt_br: Configurando a Biblioteca
tr: Kitaplığı kurmak

source: There are a few pieces of data that almost any SAM library should probably manage. It will at least need to store the address of the SAM Bridge you intend to use and the signature type you wish to use.
pt_br: Existem alguns pedaços de dados que quase qualquer biblioteca SAM provavelmente deveria gerenciar. Ela precisará, pelo menos, armazenar o endereço da SAM Bridge que você pretende usar e o tipo de assinatura que você deseja usar.
tr: Neredeyse tüm SAM kitaplıklarının yönetmesi gereken birkaç veri parçası vardır. En azından kullanmayı düşündüğünüz SAM köprüsünün adresini ve kullanmak istediğiniz imza türünü kaydetmesi gerekecektir.

source: Storing the SAM address
pt_br: Armazenando o endereço SAM
tr: SAM adresini kaydetmek
