Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/comparison.po
Languages: ja, pt_br, ru, tr

source: I2P Compared to Freenet
ja: I2PをFreenetと比較
pt_br: Comparação entre a I2P e a Freenet
ru: I2P в сравнении с Freenet
tr: I2P ile Freenet karşılaştırması

source: Freenet is a fully distributed, peer to peer anonymous publishing network, offering secure ways to store data, as well as some approaches attempting to address the loads of a flash flood. While Freenet is designed as a distributed data store, people have built applications on top of it to do more generic anonymous communication, such as static websites and message boards.
pt_br: A Freenet é uma rede p2p de publicação anônima, completamente distribuída, que oferece meios seguros para o armazenamento de dados, bem como algumas abordagens que tentam lidar com o problema de sobrecarga por inundação. Ainda que a Freenet tenha sido projetada como um sistema de armazenamento distribuído, há quem use a Freenet para aplicações que visam uma comunicação anônima mais geral, tais como websites e fóruns.
ru: Freenet - это полностью распределенная, точка-точка, анонимная сеть для публикации, предоставляющая безопасный способ хранить данные, также некоторые подходы, позволяющие обрабатывать нагрузки в пиках. Хотя Freenet разработан как распределенное хранилище, пользователи сделали приложения поверх него, которые позволяют другие формы взаимодействия, такие как статичные веб-сайты и доски сообщений.
tr: Freenet, tamamen dağıtılmış, uçtan uca anonim bir yayıncılık ağıdır. Verileri güvenle depolamanın yanında ani akış yüklerini çözmeye çalışan bazı yaklaşımlar sunar. Freenet dağıtılmış bir veri deposu olarak tasarlanırken, insanlar onun üzerine, durağan siteler ve forumlar gibi daha genel anonim iletişim kurulabilecek uygulamalar oluşturdu.

source: Compared to I2P, Freenet offers some substantial benefits - it is a distributed data store, while I2P is not, allowing people to retrieve the content published by others even when the publisher is no longer online. In addition, it should be able to distribute popular data fairly efficiently. I2P itself does not and will not provide this functionality. On the other hand, there is overlap for users who simply want to communicate with each other anonymously through websites, message boards, file sharing programs, etc. There have also been some attempts to develop a distributed data store to run on top of I2P, (most recently a port of <a href="%(tahoe)s">Tahoe-LAFS</a>) but nothing is yet ready for general use.
pt_br: Comparada à I2P, a Freenet oferece alguns benefícios substanciais - é um sistema de armazenamento distribuído, ao passo que a I2P não é, permitindo que pessoas recuperem o conteúdo publicado por outros mesmo que o responsável pela publicação não esteja online. Adicionalmente, parece ser capaz de distribuir informações populares de maneira satisfatoriamente eficiente. A I2P não possui e não possuirá esta funcionalidade. Por outro lado, há uma rede de sobreposição para usuários que querem tão somente comunicarem-se anonimamente através de websites, fóruns de discussão, programas de compartilhamento de arquivos etc. Há também algumas tentativas de desenvolver um sistema de armazenamento distribuído para funcionar sobre a infraestrutura da I2P, (a mais recente é um porte do <a href="%(tahoe)s">Tahoe-LAFS</a>) mas nada ainda pronto para uso geral.
ru: По сравнению с I2P, Freenet имеет некоторые преимущества - это распределенное хранилище данных, чем I2P не является, позволяющее людям обмениваться данными, даже если оригинальный автор более недоступен. Также сеть позволяет эффективно распределять данные. I2P сам по себе не имеет и не будет иметь такой функции. С другой стороны, здесь есть недостаток для пользователей, которые просто хотят анонимно общаться через веб-сайты, доски объявлений, программы файлообмена и т.д В I2P есть варианты реализации таких функций с помощью специальных приложений (a href="%(tahoe)s">Tahoe-LAFS</a>), но еще ничего для обычного использования не готово.
tr: I2P ile karşılaştırıldığında, Freenet bazı önemli avantajlar sunar. Freenet, dağıtılmış bir veri deposudur, ancak I2P öyle değildir. Yayıncı artık çevrimiçi olmadığında bile insanlar başkaları tarafından yayınlanmış içerikleri alabilir. Ayrıca, sık kullanılan verileri oldukça verimli bir şekilde dağıtabilir. I2P bu özelliği sağlamaz ve sağlamayacaktır. Öte yandan, yalnızca siteler, forumlar, dosya paylaşım programları gibi uygulamalar kullanarak birbirleriyle anonim olarak iletişim kurmak isteyen kullanıcılarda örtüşme vardır. Ayrıca, I2P uygulaması (en son bir <a href="%(tahoe)s">Tahoe-LAFS</a> dalında) üzerinde çalışacak dağıtılmış bir veri deposu geliştirmeye yönelik bazı girişimlerde bulunuldu Ancak henüz genel kullanıma hazır bir şey yok.

source: However, even ignoring any implementations issues, there are some concerns about Freenet's algorithms from both a scalability and anonymity perspective, owing largely to Freenet's heuristic driven routing. The interactions of various techniques certainly may successfully deter various attacks, and perhaps some aspects of the routing algorithms will provide the hoped for scalability. Unfortunately, not much analysis of the algorithms involved has resulted in positive results, but there is still hope. At the very least, Freenet does provide substantial anonymity against an attacker who does not have the resources necessary to analyze it further.
pt_br: Contudo, mesmo ignorando quaisquer problemas de implementação, ainda há algumas preocupações em relação aos algoritmos da Freenet tanto de uma perspectiva de anonimato quanto de escalabilidade, decorrentes sobretudo do roteamento dirigido por heurística da Freenet. As interações de várias técnicas certamente podem ter sucesso em deter vários ataques, e talvez alguns aspectos dos algoritmos de roteamento proporcionarão o esperado para a escalabilidade. Infelizmente, não muita da análise dos algoritmos envolvidos tem tido resultados positivos, mas ainda há esperança. Para dizer o mínimo, a Freenet oferece anonimato substancial contra um atacante que não possui os recursos necessários para analisar além.
ru: Тем не менее, даже не обращая внимание на проблемы реализации, есть определенные соображения об алгоритмах Freenet с точки зрения масштабирования и анонимности, в области эвристической маршрутизации внутри Freenet. Взаимодействие разных техник определенно может защитить от ряда атак, и, возможно, некоторые аспекты алгоритмов маршрутизации дают надежды на масштабирование. К сожалению, немногие из попыток анализа алгоритмов дали позитивные результаты, но надежда есть. В конце концов, Freenet предоставляет значительный уровень анонимности против атакующего, который не обладает достаточными для дальнейшего анализа ресурсами.
tr: Bununla birlikte, herhangi bir uygulama sorunu göz ardı edilse bile, büyük ölçüde Freenet tarafından kullanılan buluşsal kaynaklı yöneltme nedeniyle, Freenet algoritmaları hakkında hem ölçeklenebilirlik hem de anonimlik açısından bazı endişeler vardır. Çeşitli tekniklerin etkileşimleri kesinlikle çeşitli saldırıları başarılı bir şekilde engelleyebilir ve belki de yöneltme algoritmalarının bazı özellikleri, umut edilen ölçeklenebilirliği sağlayacaktır. Ancak ne yazık ki, ilgili algoritmaların çoğu incelemesi olumlu sonuçlar vermedi. Gene de hala umut var. En azından Freenet, kendisini daha fazla incelemek için gerekli kaynakları bulunmayan bir saldırgana karşı önemli bir anonimlik sağlar.

source: Comparing I2P to other projects
ja: I2Pと他のプロジェクトを比較
pt_br: Comparação entre o projeto I2P e outros projetos
ru: Сравнение I2P с другими проектами
tr: I2P ile diğer projelerin karşılaştırılması

source: There are a great many other applications and projects working on anonymous communication and I2P has been inspired by much of their efforts. This is not a comprehensive list of anonymity resources - both freehaven's <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> and GNUnet's <a href="https://www.gnunet.org/links/">related projects</a> serve that purpose well. That said, a few systems stand out for further comparison. The following have individual comparison pages:
ja: 他にも匿名通信に取り組んでいるアプリケーションやプロジェクトは非常に多く、I2P はそれら の努力の多くに触発を受けています。これは匿名リソースの包括的な一覧ではありませんが、freehavenの <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> とGNUnetの<a href="https://www.gnunet.org/links/">関連プロジェクト</a>がその目的を十分に果たしています。とはいえ、いくつかのシステムは際立っており、詳細な比較ができます。以下は、個別の比較ページがあるものです。
pt_br: Há muitos outros excelentes aplicativos e projetos trabalhando com comunicação anônima e a I2P tem se inspirado em muitos desses esforços. Esta não é uma lista abrangente de recursos de anonimato - tanto a <a href="http://freehaven.net/anonbib/topic.html">bibliografia sobre anonimato do Freehaven</a> bem como a relação de <a href="https://www.gnunet.org/links/">projetos correlatos ao GNUnet</a> servem pra esse propósito. Isso dito, alguns sistemas merecem comparações. Os seguintes são comparados em páginas em separado:
ru: Существует много других хороших приложений и проектов в области анонимных коммуникаций, и I2P определенно обогащается их опытом. Это неполный список подобных ресурсов - у freehaven'а в <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> и в GNUnet <a href="https://www.gnunet.org/links/">проектах</a> эти списки полнее. Всего несколько систем имеет смысл сравнивать далее. Ниже перечислены страницы, посвященные сравнениям с этими системами:
tr: Anonim iletişim üzerinde çalışan birçok başka uygulama ve proje var ve I2P bu uygulamaların çoğuna harcanan çabalardan ilham aldı. Bu liste, kapsamlı olarak anonimlik kaynaklarını içermez. Bu amaç için freehaven <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> ve <a href="https://www.gnunet.org/links/">ilgili GNUnet projeleri</a> kullanılabilir. Bununla birlikte, daha fazla karşılaştırma için birkaç sistem öne çıkar. Aşağıdakilerin ayrı karşılaştırma sayfaları vardır:

source: The following are discussed on the <a href="%(othernetworks)s">other networks page:</a>
ja: 下記は<a href="%(othernetworks)s">他のネットワークのページ</a>で議論されています：
pt_br: Os seguintes são discutidos na <a href="%(othernetworks)s">página de outras redes:</a>
ru: Обсуждается на <a href="%(othernetworks)s">странице других сетей:</a>
tr: <a href="%(othernetworks)s">Diğer ağlar sayfasında</a> aşağıdaki konular tartışılıyor:

source: The content of this page is subject to update, discussion and dispute, and we welcome comments and additions. You may contribute an analysis by entering a <a href="%(trac)s">new issue on Github</a>.
ja: 本ページの内容は更新、議論、論争される可能性があり、論評や追加を歓迎します。 <a href="%(trac)s">Githubで新しいissue</a>を入力することで、分析を貢献することができます。
pt_br: O conteúdo desta página está sujeito a atualizações, discussões e disputa, e comentários e adições são bem-vindos. Você pode contribuir uma análise criando uma <a href="%(trac)s">nova "issue" no Github</a>.
tr: Bu sayfanın içeriği güncellemeye, tartışmaya, düzeltmeye, yorum ve eklemelere açıktır. <a href="%(trac)s">GitHub üzerinde yeni bir konu açarak</a> bir incelemeye katkıda bulunabilirsiniz.

source: I2P Compared to Other Anonymous Networks
ja: I2Pを他の匿名ネットワークと比較
pt_br: Comparação entre a I2P e outras redes anônimas
ru: I2P в сравнении с другими анонимными сетями
tr: I2P ile diğer anonim ağların karşılaştırılması

source: The following networks are discussed on this page.
ja: 以下のネットワークはこのページで議論されています。
pt_br: As seguintes redes são discutidas nesta página.
ru: Следующие сети обсуждаются на этой странице:
tr: Bu bölümde aşağıdaki ağlar değerlendirilmiştir.

source: Most of the following sections are fairly old, and may not be accurate. For an overview of available comparisons, see the <a href="%(comparison)s">main network comparisons page</a>. You may contribute an analysis by entering a <a href="%(trac)s">new issue on Github</a>.
pt_br: A maioria das seções a seguir são consideravelmente antigas, e podem estar imprecisas. Para uma visão geral das comparações disponíveis, veja a <a href="%(comparison)s">página principal de comparações de redes</a>. Você pode contribuir uma análise criando uma <a href="%(trac)s">nova "issue" no Github</a>.
tr: Aşağıdaki bölümlerin çoğu oldukça eskidir ve doğru olmayabilir. Yapılmış karşılaştırmaların özeti için <a href="%(comparison)s">ana ağ karşılaştırmaları sayfasına</a> bakabilirsiniz. <a href="%(trac)s">GitHub üzerinde yeni bir konu açarak</a> bir incelemeye katkıda bulunabilirsiniz.

source: RetroShare is a set of peer-to-peer applications running in a <a href="%(f2fwiki)s">Friend-to-friend (F2F)</a> network. Each peer of such F2F network makes direct IP connections only to authenticated peers ("friends") after explicit certificates exchange. It can discover unauthenticated peers (e.g. friends of friends), but connections to them are relayed over "friend" peers for providing privacy and anonymity.
pt_br: O RetroShare é um conjunto de aplicações peer-to-peer ("par a par") sendo executadas em uma rede <a href="%(f2fwiki)s">Friend-to-friend (F2F)</a>, "amigo a amigo". Cada par de tal rede F2F realiza conexões IP diretas apenas para pares autenticados ("amigos") após troca explícita de certificados. Ela consegue descobrir pares não autenticados (amigos de amigos, por exemplo), mas conexões até eles são repassadas através de pares "amigos" para proporcionar privacidade e anonimato.
ru: RetroShare - это набор peer-to-peer приложений, работающих в <a href="%(f2fwiki)s">Friend-to-friend (F2F)</a> сети. Каждый пир такой F2F сети устанавливает прямые IP-соединения только с проверенными пирами ("друзьями") после явного обмена сертификатами. Он может обнаружить непроверенные пиры (например, друзья друзей), но соединения с ними производятся только через пиры "друзей" для обеспечения конфиденциальности и анонимности.
tr: RetroShare, <a href="%(f2fwiki)s">Friend-to-Friend (F2F)</a> ağında çalışan bir eşler arası uygulamalar kümesidir. Böyle bir F2F ağının her bir eşi, açık sertifika alışverişinden sonra yalnızca kimliği doğrulanmış eşlere ("arkadaşlar") doğrudan IP bağlantıları kurar. Kimliği doğrulanmamış eşleri (örneğin, arkadaşların arkadaşları) keşfedebilir, ancak onlarla kurulan bağlantılar, gizlilik ve anonimlik sağlamak için "arkadaş" eşler üzerinden aktarılır.

source: RetroShare is designed to build a private network of trusted peers, while I2P is designed to be a large-scaled public anonymous network. Recent versions of RetroShare have options to run as a public "darknet" by using I2P or Tor as a transport. That way all connections are anonymized and no trust is required for adding new "friends".
pt_br: O RetroShare é projetado para construir uma rede privada de pares de confiança, enquanto a I2P é projetada para ser uma rede anônima pública de larga escala. Versões recentes do RetroShare incluem opções para executar como uma "darknet" pública usando a I2P ou o Tor como transporte. Dessa forma, todas as conexões são anonimizadas e nenhuma confiança é necessária para adicionar novos "amigos".
ru: RetroShare предназначен для построения частноой сети доверенных пиров, в то время как I2P предназначен быть крупной публичной анонимной сетью. Последние версии RetroShare имеют варианты запуска в качестве публичного "даркнета", используя I2P или Tor в качестве транспорта. Таким образом, все соединения анонимны и не требуют доверия для добавления новых "друзей".
tr: RetroShare, güvenilen eşlerden oluşan özel bir ağ oluşturmak için tasarlanmıştır. I2P ise büyük ölçekli bir genel anonim ağ olarak tasarlanmıştır. Son RetroShare sürümlerinde, taşıyıcı olarak I2P veya Tor kullanarak genel bir "darknet" olarak çalıştırma seçenekleri bulunur. Böylece tüm bağlantılar anonimleştirilir ve yeni "arkadaşlar" eklemek için güvenilirlik gerekmez.

source: Morphmix and Tarzan are both fully distributed, peer to peer networks of anonymizing proxies, allowing people to tunnel out through the low latency mix network. Morphmix includes some very interesting collusion detection algorithms and Sybil defenses, while Tarzan makes use of the scarcity of IP addresses to accomplish the same. The two primary differences between these systems and I2P are related to I2P's <a href="%(threatmodel)s">threat model</a> and their out-proxy design (as opposed to providing both sender and receiver anonymity). There is source code available to both systems, but we are not aware of their use outside of academic environments.
pt_br: A Morphmix e a Tarzan são ambas redes peer-to-peer inteiramente distribuídas de proxies anonimizantes, permitindo que as pessoas saiam por túneis pela rede mista de baixa latência. A Morphmix inclui alguns algoritmos de detecção de conluio e defesas contra ataques Sybil muito interessantes, enquanto a Tarzan faz uso da escassez de endereços IP para alcançar o mesmo. As duas diferenças primárias entre esses sistemas e a I2P estão relacionados ao<a href="%(threatmodel)s">modelo de risco</a> da I2P e seus designs de proxy de saída (em oposição a oferecer anonimato tanto para o remetente quando para o destinatário). Há código fonte disponível para ambos os sistemas, mas nós não estamos a par do seu uso fora de ambientes acadêmicos.
ru: Morphmix и Tarzan - это полностью распределенные точка-точка сети анонимных прокси-серверов, позволяющие людям организовывать соединения через смешанную сеть с низкими задержками. Morphmix включает интересные алгоритмы обхода коллизий и защиты от атаки Sybil, а Tarzan использует для этого недостаток IP-адресов. Два основных отличия таких систем от I2P связаны с <a href="%(threatmodel)s">моделью угроз</a> I2P и их дизайнов выходящих узлов (в отличие от обеспечения анонимности и отправителя, и получателя). Для обоих систем доступны исходные коды, но нам не известно об их использовании за пределами научной деятельности.
tr: Hem Morphmix hem Tarzan tamamen dağıtılmış, eşler arası anonimleştirici vekil sunucu ağları olup, insanların düşük gecikmeli karma ağ üzerinden tünel açmasını sağlar. Morphmix, bazı çok ilginç gizli anlaşma algılama algoritmaları ve Sybil savunmaları içerirken Tarzan, aynısını gerçekleştirmek için IP adreslerinin azlığından yararlanır. Bu sistemler ve I2P arasındaki iki temel fark, I2P <a href="%(threatmodel)s">tehdit modeli</a> ve bunların vekil sunucu dışı tasarımıyla ilgilidir (hem gönderici hem de alıcı anonimliği sağlamanın aksine). Her iki sisteminde de kaynak kodu bulunur. Ancak akademik ortamlar dışındaki kullanımlarının farkında değiliz.

source: Mixminion and Mixmaster are networks to support anonymous email against a very powerful adversary. High-latency messaging applications running on top of I2P (for example <a href="%(syndie)s">Syndie</a> or I2PBote) may perhaps prove adequate to meet the threat model of those adversaries, while running in parallel along side the needs of low latency users, to provide a significantly larger anonymity set. High-latency support within the I2P router itself may or may not be added in a distant future release. It is too early to say if I2P will meet the needs of users requiring extreme protection for email.
pt_br: A Mixminion e a Mixmaster são redes para dar suporte a email anônimo contra um adversário muito poderoso. Aplicações de mensagens de alta latência executando sobre a I2P (por exemplo, <a href="%(syndie)s">Syndie</a> ou I2PBote) podem talvez ser adequadas para atender ao modelo de risco desses adversários, executando em paralelo de acordo com as necessidades de usuários de baixa latência, para fornecer um conjunto de anonimato significativamente maior. Suporte a alta latência dentro do próprio roteador I2P pode ou não ser adicionado em uma versão futura distante. É muito cedo para dizer se a I2P atenderá às necessidades de usuários que requerem proteção extrema para email.
ru: Mixminion и Mixmaster являются сетями, поддерживающими анонимность электронной корреспонденции с очень сильной защитой. Программы обмена сообщениями с высокой скрытностью, работающие поверх I2P (например <a href="%(syndie)s">Syndie</a> или I2PBote), возможно, смогут показать достаточную сопротивляемость существующей модели угроз, в то же время удовлетворяя потребности пользователей по обмену сообщениями меньшей скрытности, обеспечивая гораздо лучшую анонимность. Поддержка высокой скрытности в самом I2P маршрутизаторе, возможно, будет реализована, а, возможно, и нет, в отдалённом будущем. Ещё слишком рано говорить, удовлетворяет ли I2P потребностям пользователей в экстремально защищённом обмене сообщениями.
tr: Mixminion ve Mixmaster, çok güçlü bir düşmana karşı anonim e-posta sağlayan ağlardır. I2P üzerinde çalışan yüksek gecikmeli ileti gönderme uygulamaları (örneğin <a href="%(syndie)s">Syndie</a> ya da I2PBote), önemli ölçüde daha büyük bir anonimlik kümesi sağlamak için düşük gecikmeli kullanıcıların gereksinimlerine göre paralel olarak çalışırken, bu düşmanların tehdit modelini karşılamak için yeterli olabilir. . I2P yöneltici içine yüksek gecikmeli desteği, uzak gelecekteki bir sürümde eklenebilir ya da eklenmeyebilir. I2P uygulamasının aşırı e-postası koruması isteyen kullanıcıların gereksinimlerini karşılayıp karşılamayacağını söylemek için henüz çok erken.

source: As with Tor and Onion Routing, both Mixminion and Mixmaster take the directory based approach as well.
pt_br: Assim como o Tor e o Roteamento Onion, tanto a Mixminion quanto a Mixmaster empregam a abordagem baseada em diretórios.
ru: Как и в случае с Tor и Onion Routing, Mixminion и Mixmaster применяют подход на основе справочных директорий.
tr: Tor ve Onion Routing için olduğu gibi, hem Mixminion hem de Mixmaster, dizin tabanlı yaklaşımı da kullanır.
