Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/comparison.po
Languages: ja, pt_br, ru, tr

source: Has more developers, including several that are funded
ja: 資金提供を受けている数人を含め、より多い開発者がいる
pt_br: Possui mais desenvolvedores, muitos dos quais recebem financiamento
ru: Больше разработчиков, включая ряд оплачиваемых
tr: Bir kaçı bağışlarla desteklenen daha fazla geliştiriciye sahip

source: More resistant to state-level blocking due to TLS transport layer and bridges (I2P has proposals for "full restricted routes" but these are not yet implemented)
ja: TLSトランスポート層とブリッジのお陰で、国家級の遮断へのより強い耐性 （I2Pは"full restricted routes"のための提案があるが、まだ実装されていない）
pt_br: Mais resistente a bloqueios de níveis-de-estado devidos a pontes e camada de transporte TLS (a I2P tem propostas de "rotas completamente restritas", que não foram ainda implementadas)
ru: Более устойчивый к блокировкам на уровне государств, благодаря транспорту поверх TLS и мостам (I2P имеет предложения по "полностью закрытым путям", но они еще не реализованы)
tr: TLS taşıyıcı katmanı ve köprüler nedeniyle devlet düzeyinde engellemeye karşı daha dirençli (I2P "tam kısıtlı rotalar" için öneriler sunar ancak bunlar henüz uygulanmadı)

source: Big enough that it has had to adapt to blocking and DOS attempts
ja: 遮断とDOSに順応するための十分に大きな試みがある
pt_br: Grande o suficiente para que ele tenha tido que se adaptar a tentativas de bloqueio e DOS
ru: Достаточно большая сеть, чтобы адаптироваться к блокировке и попыткам DOS
tr: Engellemeye ve DOS saldırılarına uyum sağlamak zorunda kalacak kadar büyük

source: Designed and optimized for exit traffic, with a large number of exit nodes
ja: 外へのトラフィック用に設計と最適化がされ、多数の出口ノードがある
pt_br: Projetada e otimizada para tráfego de saída, com um número enorme de nodos de saída
ru: Разработан и оптимизирован для выхода трафика с большим числом выходных узлов
tr: Çok sayıda çıkış aktarıcısı ile çıkış trafiği için tasarlanmış ve iyileştirilmiştir

source: Better documentation, has formal papers and specifications, better website, many more translations
ja: 公式文書と仕様集のように、より良い資料を持ち、より良いウェブサイトや、遥かに多い翻訳がある
pt_br: Documentação melhor, com artigos e especificações formais, melhor website, muito mais traduções
ru: Лучше документация, есть исследования и спецификации, лучше веб-сайт, гораздо больше переведенных данных
tr: Daha iyi belgeler, resmi belgeler ve teknik özellikler, daha iyi site, çok daha fazla çeviri

source: More efficient with memory usage
ja: より効率的なメモリ使用量
pt_br: Maior eficiência no uso de memória
ru: Более эффективен в использовании памяти
tr: Daha verimli bellek kullanımı

source: Tor client nodes have very low bandwidth overhead
ja: Torのクライアントノードでは、帯域幅の余剰が非常に小さい
pt_br: Nós-clientes da rede Tor possuem sobrecarga de banda muito pequena
ru: Клиенты Tor работают с очень небольшими затратами на протоколе
tr: Tor istemci noktalarının ek bant genişliği yükü çok düşüktür

source: Centralized control reduces the complexity at each node and can efficiently address Sybil attacks
ja: 一元化された制御が各ノードで複雑さを減らし、Sybil攻撃への対処が効率的に可能
pt_br: Controle centralizado reduz a complexidade em cada nó e pode eficientemente contrapor-se a ataques Sybil
ru: Централизованный контроль уменьшает сложность каждого узла и может эффективно работать с атаками Sybil
tr: Merkezi kontrol, her duraktaki karmaşıklığı azaltır ve Sybil saldırılarına verimli bir şekilde karşı koyabilir

source: A core of high capacity nodes provides higher throughput and lower latency
ja: 中心となる高性能なノードが高効率と低遅延を提供する
pt_br: Um núcleo de nós de alta capacidade proporciona taxas de transferência mais altas e latência mais baixa
ru: Набор высокопроизводительных узлов обеспечивает высокую производительность и меньшие задержки
tr: Yüksek kapasiteli duraklardan oluşan çekirdek, daha yüksek verim ve daha düşük gecikme süresi sağlar

source: C, not Java (ewww)
ja: Java言語ではなくC言語（笑）
pt_br: C, não Java (ewww)
ru: реализация на C, не Java (фу...)
tr: C, Java değil (ewww)

source: Benefits of I2P over Tor
pt_br: Benefícios da rede I2P em relação a Tor
ru: Преимущества I2P перед Tor
tr: Tor karşısında I2P yararları

source: Designed and optimized for hidden services, which are much faster than in Tor
ja: 秘匿サービス用に設計と最適化がされ、Tor内よりとても高速
pt_br: Projetada e otimizada para serviços ocultos, que são mais rápidos do que na rede Tor
ru: Разработан и оптимизирован для работы скрытых сервисов, что гораздо быстрее, чем в Tor
tr: Tor üzerindekilerden çok daha hızlı gizli hizmetler için tasarlanmış ve iyileştirilmiş

source: Fully distributed and self organizing
ja: 完全に分散化され、自ら整理する
pt_br: Completamente distribuída e com capacidade de auto-organização
ru: Полностью распределенная и самоорганизующаяся сеть
tr: Tamamen dağıtılmış ve kendini düzenleyen

source: Peers are selected by continuously profiling and ranking performance, rather than trusting claimed capacity
ja: ピアが主張する許容量を信頼するのではなく、 間断なくプロファイルと性能の順位付けを行うことによってピアが選択される
pt_br: Os pares são selecionados por meio da criação contínua de perfis e classificação de desempenho, em vez de confiar na capacidade reivindicada
ru: Пиры выбираются на основе постоянного профайлинга и замеров по производительности, нежели по объявленной пиром пропускной способности
tr: Eşler, istenilen kapasiteye güvenmek yerine sürekli olarak başarım profili çıkarılarak ve sıralanarak seçilir

source: Floodfill peers ("directory servers") are varying and untrusted, rather than hardcoded
pt_br: Os pares de enchimento ("servidores de diretório") são variáveis e não confiáveis, em vez de codificados
ru: Пиры Floodfill ("справочные сервера") постоянно меняются и не обладают доверием, в отличие от явно прошитых в Tor
tr: Otomatik doldurma eşleri ("dizin sunucuları") katı kodlanmamıştır, çok çeşitli ve güvenilmezdir

source: Small enough that it hasn't been blocked or DOSed much, or at all
ja: 十分に小さいので、遮断されたりDOSを受けたりすることはあまりない。
pt_br: Pequeno o suficiente para que ele não tenha sido bloqueado ou DOSed muito, ou em tudo
ru: Достаточно небольшая, чтобы ее сильно блокировали или DOS'или.
tr: Engellenmeyecek veya DOS saldırısı yapılmayacak kadar küçük

source: Peer-to-peer friendly
ja: ピアツーピアに調和的
pt_br: Amigável ponto a ponto
ru: Обеспечивает пиринговые сервисы
tr: Eşler arası çalışmaya uygun

source: Packet switched instead of circuit switched
ja: 回路が交換されるのではなく、パケットが交換される
pt_br: Comutação de pacotes em vez de comutados por circuito
ru: Коммутирует пакеты вместо соединений
tr: Devre anahtarlamalı yerine paket anahtarlamalı

source: implicit transparent load balancing of messages across multiple peers, rather than a single path
ja: 単一の経路ではなく、複数のピアと交差するメッセージの、利用者の意に介さない潜んだ負荷分散
pt_br: balanceamento de carga de mensagem transparente e implícito ao longo de vários pares, ao invés de um único caminho
ru: Явная прозрачная балансировка сообщений по многим пирам, в отличие от использования одного пути
tr: iletiler için tek bir yol yerine birden çok eş kullanan örtülü şeffaf yük dengelemesi

source: resilience vs. failures by running multiple tunnels in parallel, plus rotating tunnels
ja: 複数のトンネルが並行して稼働し、加えてトンネルを交換させることで、障害に強い。
pt_br: resiliência a falhas ao executar vários túneis em paralelo, além de rotacionar túneis
ru: Надежность и отказоустойчивость за счет поддержания нескольких параллельных туннелей и обеспечения ротации туннелей
tr: dayanıklılık ve sorun dengesi için paralel olarak birden fazla tünel ve dönen tüneller çalıştırma

source: scale each client's connections at O(1) instead of O(N) (Alice has e.g. 2 inbound tunnels that are used by all of the peers Alice is talking with, rather than a circuit for each)
pt_br: escalar conexões de cada cliente a O(1) ao invés de O(N) (Alice tem, por exemplo, 2 túneis de entrada que são usados por todos os pares com os quais Alice está conversando, em vez de um circuito para cada)
ru: соединения каждого пользователя масштабируются как O(1) вместо O(N) (например, Алиса держит 2 входящих туннеля, которые может использовать любой пир, с которым Алиса общается, а не держим по цепочке на каждый пир)
tr: her istemcinin bağlantılarını O(N) yerine O(1) olarak ölçeklendirme (Alice, her biri için bir devre yerine, Alice'in konuştuğu tüm eşler tarafından kullanılan örneğin 2 geliş tüneline sahiptir)

source: Unidirectional tunnels instead of bidirectional circuits, doubling the number of nodes a peer has to compromise to get the same information.
pt_br: Túneis unidirecionais ao invés de circuitos bidirecionais, dobrando o número de nodos que um par tem de comprometer para obter alguma informação.
ru: Односторонние туннели вместо двусторонних цепочек, удваивая число узлов, которые пир должен скомпрометировать, чтобы получить ту же информацию
tr: Çift yönlü devreler yerine tek yönlü tüneller, bir eşin aynı bilgiyi elde etmek için uzlaşması gereken düğüm sayısını iki katına çıkarır.

source: Counter-arguments and further discussion <a href="%(netdb)s">here</a>.
pt_br: Contra-argumentos e maiores discussões <a href="%(netdb)s">aqui</a>.
ru: Контраргументы и дальнейшая дискуссия <a href="%(netdb)s">здесь</a>.
tr: Karşı argümanları ve daha fazla tartışmayı <a href="%(netdb)s">burada bulabilirsiniz</a>

source: Protection against detecting client activity, even when an attacker is participating in the tunnel, as tunnels are used for more than simply passing end to end messages (e.g. netDb, tunnel management, tunnel testing)
ja: トンネルは、単なる端末から端末までのメッセージの受け渡し以外（例えば、netDb、トンネル管理、トンネル試験など）にも使われ、 攻撃者がトンネルに参加している場合であっても、クライアントの活動内容の探り当てに強く、保護がある
pt_br: Proteção contra a detecção de atividade do cliente, mesmo quando o atacante está participando do túnel, já que túneis são usados para mais do que simplesmente passar mensagens de ponta a ponta (por exemplo, BD de rede, gerência de túnel, teste de túnel)
ru: Защита против детектирования клиентской активности, даже если атакующий участвует в туннеле, так как туннели используются не только для передачи сообщений, но и для работы NetDb, управления туннелями, проверки работоспособности туннелей)
tr: Tüneller, yalnızca uçtan uca iletileri iletmekten daha fazlası için kullanıldığından (örneğin "Ağ veri tabanı" (NetDB), tünel yönetimi, tünel sınaması) bir saldırgan tünele katılırken bile istemci etkinliği algılanmaya karşı korunur

source: Tunnels in I2P are short lived, decreasing the number of samples that an attacker can use to mount an active attack with, unlike circuits in Tor, which are typically long lived.
ja: I2Pでのトンネルは、Torでの大抵は長命な回路とは異なり短命であり、攻撃者が能動的な攻撃を仕掛ける際に用いる標本の数を減らしている。
pt_br: Os túneis no I2P são de curta duração, diminuindo o número de amostras que um atacante pode usar para montar um ataque ativo com, ao contrário dos circuitos em Tor, que são tipicamente de vida longa.
ru: В I2P реализованы короткоживущие туннели, что уменьшает количество способов, которые атакующий может использовать для атаки, в отличие от цепочек в Tor'е, которые как правило живут долго.
tr: I2P tünelleri kısa ömürlüdür ve tipik olarak uzun ömürlü Tor devrelerin aksine, bir saldırganın aktif bir saldırı başlatmak için kullanabileceği örnek sayısını azaltır.

source: I2P APIs are designed specifically for anonymity and security, while SOCKS is designed for functionality.
ja: SOCKSが機能性のために設計されているのに対して、 I2P APIは、明確に匿名性と安全性のために設計されている。
pt_br: As APIs da I2P são especialmente projetadas para anonimato e segurança, enquanto o SOCKs é projetado para funcionalidade.
ru: API I2P спроектированы под анонимность и безопасность, тогда как SOCKS сделан для функциональности
tr: I2P API yazılımları özellikle anonimlik ve güvenlik için tasarlanırken, SOCKS işlevsellik için tasarlanmıştır.

source: Essentially all peers participate in routing for others
ja: 基本的に、全ピアが他者のために経路中に参加する
pt_br: Essencialmente, todos os pares participam roteando para todos os demais
ru: За редким исключением, все пиры участвуют в маршрутизации трафика для других
tr: Temel olarak tüm eşler başkaları için yöneltmeye katılır

source: The bandwidth overhead of being a full peer is low, while in Tor, while client nodes don't require much bandwidth, they don't fully participate in the mixnet.
pt_br: O overhead de largura de banda por ser um par completo é baixo, enquanto no Tor, ao passo em que os clientes não requerem muita banda, eles não participam inteiramente na mixnet.
ru: Затраты на работу в полном режиме довольно низки, тогда как в Tor, если клиент сам по себе не требует много полосы, но они еще и не полностью используют сеть.
tr: Tam bir eş olmanın ek bant genişliği yükü düşüktür, Tor üzerinde istemci düğümleri fazla bant genişliği gerektirmezken, mixnet üzerine tam olarak katılmazlar.

source: Integrated automatic update mechanism
ja: 統合された自動更新の仕組み
pt_br: Mecanismo de atualização automática integrado
ru: Встроенный механизм автоматических обновлений
tr: Bütünleşik otomatik güncelleme sistemi

source: Both TCP and UDP transports
ja: TCPとUDPの両トランスポート
pt_br: Tanto transporte via TCP quanto UDP
ru: Используется как TCP, так и UDP транспорт
tr: Hem TCP hem de UDP taşıyıcıları

source: Java, not C (ewww)
ja: C言語ではなくJava言語（笑）
pt_br: Java, não C (ewww)
ru: Реализация на Java, не C (фу....)
tr: Java, C (ewww) değil

source: Other potential benefits of I2P but not yet implemented
ja: I2Pのその他の潜在的な利点だが、まだ実装されていない
pt_br: Outros benefícios potenciais da rede I2P, mas ainda não implementados
ru: Другие потенциальные, но еще не реализованные преимущества I2P
tr: Henüz kullanılmayan olası diğer I2P faydaları

source: ...and may never be implemented, so don't count on them!
ja: …全く実装されないかもしれないので、期待しない方が良いだろう！
pt_br: ... e talvez nunca sejam implementados, portanto, não conte com eles!
ru: ... и, возможно, никогда не реализуемые, так что не рассчитывайте на них!
tr: ... bunlar asla kullanılmayabileceğinden fazla güvenmeyin!

source: Defense vs. message count analysis by garlic wrapping multiple messages
pt_br: Defesa contra análise de número de mensagens por meio de embrulho do roteamento alho de várias mensagens
ru: Защита от количественного анализа сообщений за счет заворачивания нескольких сообщений в одно
tr: Garlic kapsama çoklu iletileri ile savunma ile ileti sayısı analizi

source: Defense vs. long term intersection by adding delays at various hops (where the delays are not discernible by other hops)
pt_br: Defesa conta interseção de longo termo por meio da adição de atrasos em vários pulos (em que os atrasos não são discerníveis em outros pulos)
ru: Защита от статистического анализа за счет добавления задержек на разных хопах (где задержки не зависят от других хостов)
tr: Çeşitli duraklarda gecikmeler ekleyerek savunma ve uzun dönemli kesişme (gecikmelerin diğer duraklar nedeniyle fark edilemediği yerlerde)

source: Various mixing strategies at the tunnel level (e.g. create a tunnel that will handle 500 messages / minute, where the endpoint will inject dummy messages if there are insufficient messages, etc)
pt_br: Várias estratégias de mistura a nível de túnel (por exemplo, criar um túnel que irá lidar com 500 mensagens / minuto, onde o endpoint injetará mensagens fictícias se não houver mensagens suficientes, etc)
ru: Разные стратегии имитовставки на уровне туннелей (например, создание туннеля, который будет обрабатывать 500 сообщений в минуту, где эндпойнт посылает случайные данные, если полезный трафик не передается и т.д.)
tr: Tünel düzeyinde çeşitli karıştırma stratejileri (yeterli sayıda ileti yoksa, uç noktada 500 ileti/dakika işleyecek ve sahte iletiler gönderecek bir tünelin oluşturulması gibi)
