Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/comparison.po
Languages: ja, pt_br, ru, tr

source: JAP (Java Anonymous Proxy) is a network of mix cascades for anonymizing web requests, and as such it has a few centralized nodes (participants in the cascade) that blend and mix requests from clients through the sequence of nodes (the cascade) before proxying out onto the web. The scope, threat model, and security is substantially different from I2P, but for those who don't require significant anonymity but still are not satisfied with an Anonymizer-like service, JAP is worth reviewing. One caution to note is that anyone under the jurisdiction of the German courts may want to take care, as the German Federal Bureau of Criminal Investigation (FBCI) has successfully mounted an <a href="%(url)s">attack</a> on the network. Even though the method of this attack was later found to be illegal in the German courts, the fact that the data was successfully collected is the concern. Courts change their minds based upon circumstance, and this is evidence that if a government body or intelligence agency wanted to, they could gather the data, even if it may be found inadmissible in some courts later)
pt_br: A JAP (Java Anonymous Proxy) é uma rede de cascatas de mistura para anonimizar requisições web, e como tal ela possui alguns nodos centralizados (participantes na cascata) que diluem e misturam requisições de clientes ao longo da sequência de nodos (a cascata) antes de sair por um proxy para a web. O escopo, modelo de risco, e segurança são substancialmente diferentes da I2P, mas para aqueles que não necessitam de anonimato significativo mas ainda não estão satisfeitos com um serviço do tipo anonimizador, a JAP vale a pena ser avaliada. Um cuidado a notar é que qualquer um sob jurisdição das cortes alemãs pode querer tomar cuidado, já que o Birô Federal de Investigação Criminal alemão (FBCI) montou com sucesso um <a href="%(url)s">ataque</a> na rede. Ainda que o método desse ataque foi depois determinado como ilegal nas cortes alemãs, o fato de que os dados foram coletados com sucesso é o preocupante. Cortes mudam de ideia com base em circunstâncias, e isso é evidência de que se uma instituição governamental ou uma agência de inteligência quisesse, eles conseguiriam coletar os dados, mesmo que isso possa ser determinado inadmissível em algumas cortes depois.
ru: JAP (Java Anonymous Proxy) - это сеть смешанных каскадов для анонимизации веб-запросов, и для этого применяется несколько централизованных узлов (участников каскада), которые смешивают и обрабатывают запросы пользователей через набор узлов (каскад) перед доставкой их в сеть. Задача, модель угроз и безопасности существенно отличаются от принятых в I2P, но те, кто не нуждается в значительном уровне анонимности, но не удовлетворен уровнем анонимности существующих анонимайзеров, могут рассмотреть этот вариант. Те, кто в зоне ответственности немецкого законодательства, должны учитывать опасность того, что German Federal Bureau of Criminal Investigation (FBCI) успешно провело <a href="%(url)s">атаку</a> на эту сеть. Хотя методы атаки позже были признаны незаконными в немецком суде, факт успешного сбора данных стоит учитывать. Суды могут поменять свои решения по обстоятельствам и техническую возможность сбора информации правительством или агентствами нельзя сбрасывать со счетов).
tr: JAP (Java Anonim Proxy), internet isteklerini anonimleştiren bir karma ardışıklık ağıdır ve bu nedenle, vekil sunucudan internet üzerine çıkarmadan önce, istemcilerden gelen istekleri bir dizi düğüm dizisinden (ardışıklar) geçirerek harmanlayan ve karıştıran birkaç merkezi düğüme (ardışık katılımcılar) sahiptir. Kapsam, tehdit modeli ve güvenlik, I2P uygulamasından önemli ölçüde farklıdır. Ancak önemli bir anonimlik gerektirmese de Anonymizer benzeri bir hizmetten memnun olmayanlar için JAP incelemeye değer. Dikkat edilmesi gereken bir nokta; Alman Federal Suç Soruşturma Bürosu (FBCI) bu ağa başarılı bir <a href="%(url)s">saldırı</a> düzenlediğinden, Alman mahkemelerinin yargı yetkisi altındaki herkesin dikkatli olmak isteyebileceğidir. Bu saldırının yöntemi daha sonra Alman mahkemelerinde hukuka aykırı bulunsa da verilerin başarılı bir şekilde toplanmış olması endişe vericidir. Mahkemeler duruma göre fikir değiştirebilir ve bu durum, bir devlet kurumu veya istihbarat teşkilatı isterse, (daha sonra bazı mahkemelerde kabul edilemez bulunsa bile) verilerin alınabileceğinin kanıtıdır

source: Both of these systems work through the same basic <a href="%(antnet)s">antnet</a> routing, providing some degree of anonymity based on the threat model of providing plausible deniability against a simple non-colluding adversary. With the antnet routing, they first either do a random walk or a broadcast search to find some peer with the data or identity desired, and then use a feedback algorithm to optimize that found path. This works well for applications that merely want to know what other people around them have to offer - "How are y'all doing" vs. "Hey Alice, how are you" - you basically get a local cluster of nodes that can share files with and maintain some degree of anonymity (though you don't have much control over who is in that group of peers).
pt_br: Ambos esses sistemas funcionam por meio do mesmo roteamento de <a href="%(antnet)s">rede de formiga</a> básico, fornecendo certo grau de anonimato baseado no modelo de risco de oferecer negação plausível contra um adversário simples que não está em conluio. No roteamento de rede de formiga, eles primeiro fazem ou um percurso aleatório ou uma busca por transmissão para encontrar algum par com os dados ou com a identidade desejada, e então usam um algoritmo de retroalimentação para otimizar o caminho encontrado. Isso funciona bem para aplicações que meramente querem saber o que outras pessoas ao seu redor têm a oferecer - "Como vocês estão" vs. "Ei, Alice, como você está?" - você basicamente obtém um aglomerado de nodos com os quais você pode compartilhar arquivos e manter algum grau de anonimato (embora você não tenha muito controle sobre quem está nesse grupo de pares).
ru: Обе эти системы работают на одном базовом механизме <a href="%(antnet)s">маршрутизации</a>, добиваясь некоторой анонимности, предоставляя путь отказа при несложном, неорганизованном противнике. Используя antnet маршрутизацию, они сначала делают случайный проход или широковещательный запрос на поиск пира с нужными данными или адресами, а затем используют обратную связь для оптимизации найденного пути. Это нормально работает для приложений, которые собирают информацию о том, что другие пиры вокруг могут предложить - "как у вас всех дела?" против "Алиса, привет, ты как?". На выходе вы получаете локальный набор узлов, с которыми можно обмениваться файлами и поддерживать определенный уровень анонимности (хотя вы не имеете особого контроля над тем, кто будет в этой группе пиров).
tr: Bu sistemlerin her ikisi de aynı temel <a href="%(antnet)s">antnet</a> yöneltmesi ile çalışır ve basit bir gizli düşmana karşı makul bir reddedilebilirlik sağlayan tehdit modeline göre, bir dereceye kadar anonimlik sağlar. Antnet yöneltmesi ile, önce istenen veri veya kimliğe sahip bir eş bulmak için rastgele bir yürüyüş veya yayın araması yapılır. Ardından bulunan yolu iyileştirmek için bir geri bildirim algoritması kullanılır. Bu durum, yalnızca etraflarındaki diğer insanların neler sunabileceğini bilmek isteyen uygulamalar için işe yarar - "Herkes nasıl" ile "Hey Alice, nasılsın" - temelde, dosyaları paylaşabilen ve bir dereceye kadar anonimlik sağlayan ve koruyan yerel bir düğüm kümesi sağlar (bu eşler grubunda kimlerin olduğu konusunda fazla kontrolünüz olmasa da).

source: However, the algorithm does not scale well at all - if the application wants to speak with a particular peer it ends up doing a broadcast search or random walk (though if they are lucky enough for that to succeed, the antnet routing should optimize that found connection). This means that while these networks can work great at small scales, they are not suitable for large networks where someone wants to get in touch with another specific peer. That does not mean that there is no value in these systems, just that their applicability is limited to situations where their particular issues can be addressed.
pt_br: Contudo, o algoritmo não escala nem um pouco bem - se a aplicação deseja falar com um determinado par, ela acaba fazendo uma busca por transmissão ou um percurso aleatório (apesar de que se você tiver sorte o suficiente para isso dar certo, o roteamento de rede de formiga deveria otimizar a conexão encontrada). Isso significa que ao passo em que essas redes podem funcionar muito bem em pequenas escalas, elas não são adequadas para redes grandes onde alguém deseja se comunicar com outro par específico. Isso não significa que não há valor algum nesses sistemas, mas apenas que a sua aplicabilidade é limitada a situações onde suas questões particulares podem ser abordadas.
ru: Тем не менее, этот алгоритм не очень хорошо масштабируется - если приложение хочет говорить с конкретным пиром, оно делает широковещательный запрос или случайный поиск (хотя, если поиск удался, antnet позволит оптимизировать связь). Это означает, что хотя эти сети работают на малом числе узлов, для большого числа узлов они не очень применимы при попытке связаться с конкретным пиром. Это не означает, что эти системы бесполезны, просто их применимость ограничена сценариями, где эти недостатки можно обработать другими средствами.
tr: Bununla birlikte, algoritma hiç iyi ölçeklenmiyor. Uygulama belirli bir eş ile konuşmak isterse, bir yayın araması ya da rastgele yürüyüş yapar (bunun başarılı olması için yeterince şanslılarsa, antnet yöneltmesi bulunan bağlantıyı iyileştirmellidir). Bu durum, bu ağların küçük ölçeklerde harika çalışabilmesine rağmen, bir eşin belirli başka bir eş ile iletişim kurmak istediği büyük ağlar için uygun olmadıkları anlamına gelir. Ancak bu durum, bu sistemlerin hiçbir değeri olmadığı anlamına gelmez. Yalnızca uygulanabilirlikleri, bilinen sorunlarının çözülebildiği durumlarla sınırlıdır.

source: This was a closed-source network targeted at Iranian users. Tor did a <a href="%(torpost)s">good writeup on what to look for in a circumvention tool</a>. Suffice it to say that being closed source and publicly targeting a specific country are not good ideas. I2P is, of course, open source. However, that source, and our <a href="%(docs)s">technical documentation</a>, need much more review.
pt_br: Essa foi uma rede de código fechado visando usuários iranianos. O Tor fez um <a href="%(torpost)s">bom artigo sobre por o que procurar em uma ferramenta de contorno</a>. Basta dizer que ser de código fechado e visar um país específico publicamente não são boas ideias. A I2P é, claro, de código aberto. Contudo, esse código, e nossa <a href="%(docs)s">documentação técnica</a>, precisam de muito mais revisão.
ru: Это был проект с закрытым исходным кодом, нацеленный на иранских пользователей. Tor стал <a href="%(torpost)s">хорошим примером того, что нужно инструменту обхода цензуры</a>. Однако, нужно сказать, что закрытый исходный код и нацеленность на аудиторию конкретной страны - это не лучшие идеи. I2P - это, конечно же, проект с открытым исходным кодом. Тем не менее, эти исходные коды, а также <a href="%(docs)s">техническая документация</a> требуют гораздо большего внимания.
tr: Bu, İranlı kullanıcıları hedef alan kapalı kaynaklı bir ağdı. Tor, <a href="%(torpost)s">engellemeyi aşma aracı gibi görünen uygulamalarda bakılacak şeyleri yazdı</a>. Kapalı kaynaklı olmanın ve kamuya açık olarak belirli bir ülkeyi hedeflemenin iyi fikirler olmadığı söylemek yeterli. I2P doğal olarak açık kaynaklıdır. Bununla birlikte, bu kaynak kodunun ve <a href="%(docs)s">teknik belgelerimizin</a> üzerinde oldukça fazla çalışılması gerekiyor.

source: Paid VPN Services
ja: 有料VPNサービス
pt_br: Serviços de VPN pagos
ru: Платные VPN-сервисы
tr: Ücretli VPN Hizmetleri

source: You may contribute an analysis by entering a <a href="%(trac)s">new issue on Github</a>.
ja: <a href="%(trac)s">Github上の新規issue</a>に書き込むことによって、分析に貢献できます。
pt_br: Você pode contribuir uma análise criando uma <a href="%(trac)s">nova "issue" no Github</a>.
tr: <a href="%(trac)s">GitHub üzerinde yeni bir konu açarak</a> bir incelemeye katkıda bulunabilirsiniz.

source: Others
ja: その他
pt_br: Outros
ru: Другие
tr: Diğerleri

source: I2P Compared to Tor
ja: I2PをTorと比較
pt_br: I2P comparada com a rede Tor
ru: I2P в сравнении с Tor
tr: I2P ile Tor ağının karşılaştırılması

source: November 2016
ja: 2016年11月
pt_br: Novembro de 2016
ru: Ноябрь 2016
tr: Kasım 2016

source: Tor and Onion Routing are both anonymizing proxy networks, allowing people to tunnel out through their low latency mix network. The two primary differences between Tor / Onion-Routing and I2P are again related to differences in the threat model and the out-proxy design (though Tor supports hidden services as well). In addition, Tor takes the directory-based approach - providing a centralized point to manage the overall 'view' of the network, as well as gather and report statistics, as opposed to I2P's distributed <a href="%(netdb)s">network database</a> and <a href="%(peerselection)s">peer selection</a>.
pt_br: O Tor e o Roteamento Cebola são ambos redes de proxies para anonimato, e permitem que pessoas se comuniquem por meio de tunelamento nas suas redes mix de baixa latência. As duas principais diferenças entre Tor / Roteamento-Cebola e I2P estão, novamente, relacionadas a diferenças no modelo de risco e no projeto do proxy de saída (ainda que o Tor também suporte serviços ocultos). Adicionalmente, o Tor se vale da abordagem baseada em diretórios - fornecendo um ponto centralizado para gerenciar a 'visão' global da rede, bem como para recolher e reportar estatísticas, em oposição ao <a href="%(netdb)s">banco de dados da rede</a> I2P, que é distribuído, e a <a href="%(peerselection)s">seleção de pares</a>.
ru: Tor и Onion Routing - это анонимные сети прокси-серверов, позволяющие пользователям туннелировать данные через их сеть с низкими задержками. Два основных отличия Tor и I2P основаны на разнице в моделях угроз и дизайне выходных прокси-узлов (хотя Tor и поддерживает скрытые сервисы, как и I2P). Кроме того, Tor реализует централизованную точку для управления видимостью сети, а также для сбора статистики, в отличие от распределенной модели сети I2P, <a href="%(netdb)s">базы сети</a> и <a href="%(peerselection)s">выбора пира</a>.
tr: Tor ve Onion Routing, vekil sunucu ağlarını anonimleştirir ve insanların düşük gecikmeli karma ağlar üzerinden tünel açmasını sağlar. Tor / Onion Routing ile I2P arasındaki iki temel fark, tehdit modeli ve çıkış vekil sunucusu tasarımındaki farklılıklardır (ancak Tor, gizli hizmetleri de destekler). Ayrıca Tor, dizin tabanlı yaklaşımı benimser - I2P uygulamasındaki dağıtılmış <a href="%(netdb)s">"Ağ veri tabanı" (NetDB)</a> ve <a href="%(peerselection)s">eş seçimi</a> özelliklerinin aksine, ağın genel 'görünümünü' yönetmek ve istatistikleri toplamak ve raporlamak için merkezi bir nokta sağlar.

source: The I2P/Tor outproxy functionality does have a few substantial weaknesses against certain attackers - once the communication leaves the mixnet, global passive adversaries can more easily mount traffic analysis. In addition, the outproxies have access to the cleartext of the data transferred in both directions, and outproxies are prone to abuse, along with all of the other security issues we've come to know and love with normal Internet traffic.
pt_br: A funcionalidade de proxy de saída da/o I2P/Tor possuem algumas fraquezas substanciais contra certos atacantes - uma vez que a comunicação deixe a rede mix, adversários compassivos globais podem mais facilmente perpetrar análise de tráfego. Ademais, os proxies de saída possuem acesso ao texto puro dos dados transferidos em ambas direções, e proxies de saída são inclinados a aproveitar, levando em conta todos os outros problemas de segurança que viemos a conhecer e apreciar com o tráfego da Internet comum.
ru: Функция выходных узлов в I2P/Tor обладает несколькими явными проблемами - как только данные покидают сеть, глобальные наблюдатели легко обеспечивают мониторинг этого трафика. Вдобавок, выходные узлы имеют доступ к незашифрованным данным в обе стороны, а также легко выявляются и подвержены разного рода атакам реального мира. И это все в добавление к обычным проблемам безопасности, которые мы знаем.
tr: I2P/Tor çıkış vekil sunucusu işlevinin belirli saldırganlara karşı birkaç önemli zayıflığı vardır. İletişim mixnet üzerinden ayrıldığında, küresel pasif düşmanlar trafik incelemesini daha kolay yapabilir. Ek olarak, çıkış vekil sunucuları her iki yönde de aktarılan verilerin açık metnine erişebilir ve çıkış vekil sunucuları, normal İnternet trafiğinde bildiğimiz ve sevdiğimiz diğer tüm güvenlik sorunlarıyla birlikte kötüye kullanılmaya açıktır.

source: However, many people don't need to worry about those situations, as they are outside their threat model. It is, also, outside I2P's (formal) functional scope (if people want to build outproxy functionality on top of an anonymous communication layer, they can). In fact, some I2P users currently take advantage of Tor to outproxy.
pt_br: Todavia, muitas pessoas não precisam se preocupar com essas situações, haja visto que estão fora do seu modelo de risco. E está, também, fora do escopo funcional (formal) da I2P (se alguém quiser construir a funcionalidade de proxy de saída no topo da camada de comunicação, pode fazê-lo). Na verdade, alguns usuários da I2P aproveitam atualmente essa vantagem do Tor para proxy de saída.
ru: Тем не менее, многим людям не стоит беспокоиться на этот счет, т.к. они за пределами угроз модели. Они также вне (формальной) границы I2P (если людям нужно сделать выходной узел, они могут его сделать). На самом деле, ряд пользователей I2P в качестве выходного узла используют Tor.
tr: Bununla birlikte, pek çok insanın, kendi tehdit modellerinin dışında olduğundan bu durumlar hakkında endişelenmesi gerekmez. Aynı zamanda, I2P uygulamasının (resmi) işlevsel kapsamının dışındadır (insanlar anonim bir iletişim katmanı üzerinde çıkış vekil sunucusu işlevselliği oluşturmak istiyorlarsa bunu yapabilirler). Aslında, bazı I2P kullanıcıları şu anda Tor uygulamasını çıkış vekil sunucusu için kullanıyor.

source: Comparison of Tor and I2P Terminology
ja: TorとI2Pの用語の比較
pt_br: Comparação entre a terminologia da rede Tor e da I2P
ru: Сравнение терминологии Tor и I2P
tr: Tor ile I2P terminolojisinin karşılaştırılması

source: While Tor and I2P are similar in many ways, much of the terminology is different.
ja: TorとI2Pは多くの点で似ていますが、多くの用語は異なっています。
pt_br: As redes Tor e I2P são semelhantes em muitos aspectos, mas muito da terminologia é diferente.
ru: Хотя Tor и I2P во многом похожи, у них значительно отличается терминология.
tr: Tor ile I2P birçok yönden benzer olsa da, terminolojinin çoğu farklıdır.

source: Cell
pt_br: Célula
ru: Ячейка
tr: Hücre

source: Message
ja: メッセージ
pt_br: Mensagem
ru: Сообщение
tr: İleti

source: Client
ja: クライアント
pt_br: Cliente
ru: Клиент
tr: İstemci

source: Router or Client
ja: ルーターまたはクライアント
pt_br: Roteador ou Cliente
ru: Маршрутизатор или Клиент
tr: Yöneltici ya da istemci

source: Circuit
ja: 回路
pt_br: Circuito
ru: Цепочка
tr: Devre

source: Tunnel
ja: トンネル
pt_br: Túnel
ru: Туннель
tr: Tünel

source: Directory
ja: ディレクトリ
pt_br: Diretório
ru: Справочник
tr: Dizin

source: NetDb
pt_br: BD de rede
tr: "Ağ veri tabanı" (NetDB)

source: Directory Server
pt_br: Servidor de diretórios
ru: Сервер справочников
tr: Dizin sunucusu

source: Floodfill Router
pt_br: Roteador baseado em Preenchimento por Inundação
ru: Floodfill маршрутизатор
tr: Sel yöneltici

source: Entry Guards
pt_br: Guardiões de Acesso
ru: Входные стражи
tr: Giriş korumaları

source: Fast Peers
pt_br: Pares rápidos
ru: Быстрые пиры
tr: Hızlı eşler

source: Entry Node
pt_br: Nó de entrada
ru: Входные узлы
tr: Giriş durağı

source: Inproxy
pt_br: Proxy de entrada
ru: Входной прокси
tr: Giriş vekil sunucusu

source: Exit Node
ja: 出口ノード
pt_br: Nó de saída
ru: Выходной узел
tr: Çıkış durağı

source: Outproxy
ja: アウトプロキシ
pt_br: Proxy de saída
ru: Выходной прокси
tr: Çıkış vekil sunucusu

source: Hidden Service
ja: 秘匿サービス
pt_br: Serviço oculto
ru: Скрытый сервис
tr: Gizli hizmet

source: I2P Site or Destination
pt_br: Site ou Destino I2P
tr: I2P sitesi veya hedef

source: Hidden Service Descriptor
pt_br: Descritor de serviço oculto
ru: Дескриптор скрытого сервиса
tr: Gizli hizmet belirteci

source: LeaseSet
ja: リースセット
tr: "Kiralama kümesi" (LeaseSet)

source: Introduction point
ja: 紹介ポイント
pt_br: Ponto de entrada
ru: Введение
tr: Giriş noktası

source: Inbound Gateway
ja: 受信ゲートウェイ
pt_br: Gateway entrante
ru: Входной шлюз
tr: Giriş bağlantısı ağ geçidi

source: Node
ja: ノード
pt_br: Nó
ru: Узел
tr: Durak

source: Router
ja: ルーター
pt_br: Roteador
ru: Маршрутизатор
tr: Yöneltici

source: Onion Proxy
ja: オニオンプロキシ
pt_br: Proxy Cebola
tr: Onion vekil sunucusu

source: I2PTunnel Client (more or less)
pt_br: Cliente de túnel I2P (mais ou menos)
ru: I2PTunnel клиент (более-менее)
tr: I2PTunnel istemcisi (az ya da çok)

source: Onion Service
ja: オニオンサービス
pt_br: Serviço Onion
tr: Onion hizmeti

source: Relay
ja: 中継
pt_br: Relê
tr: Aktarıcı

source: Rendezvous Point
ja: ランデブーポイント
pt_br: Ponto de rendezvous
ru: Точка встречи
tr: Buluşma noktası

source: somewhat like Inbound Gateway + Outbound Endpoint
pt_br: um pouco como Inbound Gateway + Outbound Endpoint
ru: что-то вроде Входной шлюз + Выходная точка
tr: biraz geliş ağ geçidi + gidiş uç noktası gibi

source: Router Descriptor
pt_br: Descritor de roteador
ru: Дескриптор маршрутизатора
tr: Yöneltici belirteci

source: RouterInfo
ja: ルーター情報
pt_br: Informações de roteador
tr: "Yöneltici bilgileri" (RouterInfo)

source: Server
ja: サーバー
pt_br: Servidor
ru: Сервер
tr: Sunucu

source: Benefits of Tor over I2P
pt_br: Benefícios da rede Tor em relação à I2P
ru: Преимущества Tor перед I2P
tr: Tor uygulamasının I2P uygulamasına göre faydaları

source: Much bigger user base; much more visibility in the academic and hacker communities; benefits from formal studies of anonymity, resistance, and performance; has a non-anonymous, visible, university-based leader
ja: 遥かに大きな利用者の基盤。遥かに多い学術界とハッカー界内での知名度。匿名性、抵抗、及び性能の正式な精査からの便益。非匿名者に目立ち、大学基盤の先導者がいる。
pt_br: Base de usuários muito maior; muito mais visibilidade nas comunidades acadêmicas e no mundo hacker; beneficiada por estudos formais de anonimato, resistência e desempenho; possui lideranças não anônimas, visíveis, nas universidades
ru: Значительно большая пользовательская база; Большее внимание со стороны науки и хакерского сообщества; выгоды от формальных исследований анонимности, сопротивления и производительности; известен неанонимный, видимый, связанный с университетом лидер
tr: Çok daha büyük kullanıcı tabanı; akademik ve hacker topluluklarında çok daha fazla görünürlük; anonimlik, direnç ve başarımla ilgili resmi çalışmalardan yararlanma; anonim olmayan, görünür, üniversite tabanlı bir lidere sahip

source: Has already solved some scaling issues I2P has yet to address
ja: I2Pではまだ中途である、需要増大による問題が既に解決されている
pt_br: Já solucionou algumas questões de escalonamento que a I2P ainda precisa abordar
ru: Уже разрешили ряд проблем масштабирования, к которым I2P еще просто не подошел
tr: I2P tarafından henüz çözülmemiş bazı ölçeklendirme sorunlarını çözmüş durumda

source: Has significant funding
ja: かなりの資金を持つ
pt_br: Possui financiamento significativo
ru: Имеет значительное финансирование
tr: Önemli miktarda bağış alıyor
