Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: To reduce the susceptibility to <a href="http://blog.torproject.org/blog/one-cell-enough">some attacks</a>, and increase performance, peers for building client tunnels are chosen randomly from the smallest group, which is the "fast" group. There is no bias toward selecting peers that were previously participants in a tunnel for the same client.
pt: Para reduzir a suscetibilidade a <a href="http://blog.torproject.org/blog/one-cell-enough">alguns ataques</a>, e aumentar o desempenho, pares para construir túneis de cliente são escolhidos aleatoriamente do menor grupo, que é o grupo "rápido". Não há preconceito em selecionar pares que já foram participantes de um túnel para o mesmo cliente.
tr: <a href="http://blog.torproject.org/blog/one-cell-enough">Bazı saldırılara</a> duyarlılığı azaltmak ve başarımı artırmak için, istemci tünelleri oluşturmaya yönelik eşler, "hızlı" grup olan en küçük gruptan rastgele seçilir. Daha önce aynı istemci için bir tünele katılan eşleri seçmeye yönelik bir önyargı yoktur.

source: Peer Selection for Exploratory Tunnels
pt: Seleção de pares para túneis exploratórios
tr: Keşif Tünelleri için Eş Seçimi

source: Exploratory tunnels are used for router administrative purposes, such as network database traffic and testing client tunnels. Exploratory tunnels are also used to contact previously unconnected routers, which is why they are called "exploratory". These tunnels are usually low-bandwidth.
pt: Túneis exploratórios são usados para fins administrativos do roteador, como tráfego de banco de dados de rede e testes de túneis de cliente. Túneis exploratórios também são usados para contatar roteadores anteriormente desconectados, e é por isso que eles são chamados de "exploratórios". Esses túneis geralmente são de baixa largura de banda.
tr: Keşif tünelleri, ağ veri tabanı trafiği ve istemci tünellerini sınama gibi yöneltici yönetim amaçları için kullanılır. Keşif tünelleri, daha önce bağlantısı olmayan yönelticilerle iletişim kurmak için de kullanılır, bu nedenle bunlara "keşif" adı verilir. Bu tüneller bant genişliği genellikle düşüktür.

source: Peers for building exploratory tunnels are generally chosen randomly from the standard group. If the success rate of these build attempts is low compared to the client tunnel build success rate, the router will select a weighted average of peers randomly from the high capacity group instead. This helps maintain a satisfactory build success rate even when network performance is poor. There is no bias toward selecting peers that were previously participants in an exploratory tunnel.
pt: Os pares para construção de túneis exploratórios geralmente são escolhidos aleatoriamente do grupo padrão. Se a taxa de sucesso dessas tentativas de construção for baixa em comparação com a taxa de sucesso de construção do túnel do cliente, o roteador selecionará uma média ponderada de pares aleatoriamente do grupo de alta capacidade. Isso ajuda a manter uma taxa de sucesso de construção satisfatória mesmo quando o desempenho da rede é ruim. Não há preconceito em relação à seleção de pares que foram participantes anteriores de um túnel exploratório.
tr: Keşif tünelleri oluşturmak için eşler genellikle standart gruptan rastgele seçilir. Bu oluşturma girişimlerinin başarı oranı, istemci tüneli oluşturma başarı oranına kıyasla düşükse, yöneltici, bunun yerine yüksek kapasite grubundan rastgele bir ağırlıklı ortalamadaki eşleri seçer. Böylece, ağ başarımı düşük olduğunda bile tatmin edici bir derleme başarı oranı korunabilir. Daha önce bir keşif tüneline katılan eşleri seçmeye yönelik bir önyargı yoktur.

source: As the standard group includes a very large subset of all peers the router knows about, exploratory tunnels are essentially built through a random selection of all peers, until the build success rate becomes too low.
pt: Como o grupo padrão inclui um subconjunto muito grande de todos os pares que o roteador conhece, túneis exploratórios são essencialmente construídos por meio de uma seleção aleatória de todos os pares, até que a taxa de sucesso da construção se torne muito baixa.
tr: Standart grup, yönelticinin bildiği tüm eşlerin çok büyük bir alt kümesini içerdiğinden, keşif tünelleri, temel olarak, oluşturma başarı oranı çok düşük olana kadar tüm eşlerin rastgele seçilmesiyle oluşturulur.

source: Restrictions
pt: Restrições
tr: Kısıtlamalar

source: To prevent some simple attacks, and for performance, there are the following restrictions:
pt: Para evitar alguns ataques simples, e por questão de desempenho, há as seguintes restrições:
tr: Bazı basit saldırıları önlemek ve başarımı artırmak için aşağıdaki kısıtlamalar vardır:

source: Two peers from the same /16 IP space may not be in the same tunnel.
pt: Dois pares do mesmo espaço IP /16 não podem estar no mesmo túnel.
tr: Aynı /16 IP adresi aralığından iki eş aynı tünelde olmayabilir.

source: A peer may participate in a maximum of 33&#37; of all tunnels created by the router.
pt: Um peer pode participar de no máximo 33&#37; de todos os túneis criados pelo roteador.
tr: Bir eş, yöneltici tarafından oluşturulan tüm tünellerin en fazla 33&#37; kadarına katkıda bulunabilir.

source: Peers with extremely low bandwidth are not used.
pt: Pares com largura de banda extremamente baixa não são utilizados.
tr: Bant genişliği çok düşük olan eşler kullanılmaz.

source: Peers for which a recent connection attempt failed are not used.
pt: Os pares para os quais uma tentativa de conexão recente falhou não são usados.
tr: Yakın zamanda bir bağlantı girişiminin başarısız olduğu eşler kullanılmaz.

source: Peer Ordering in Tunnels
pt: Ordenação de pares em túneis
tr: Tünellerde Eş Sıralaması

source: Peers are ordered within tunnels to to deal with the <a href="%(pdf)s">predecessor attack</a> <a href="%(pdf2008)s">(2008 update)</a>. More information is on the <a href="%(tunnelimpl)s#ordering">tunnel page</a>.
pt: Os pares são ordenados dentro dos túneis para para lidar com o ataque predecessor <a href="%(pdf)s"></a> <a href="%(pdf2008)s">(atualização de 2008)</a>. Mais informações na página do túnel <a href="%(tunnelimpl)s#ordering"></a>.
tr: Eşler, tüneller içinde <a href="%(pdf)s">öncül saldırı</a> <a href="%(pdf2008)s">(2008 güncellemesi)</a> ile başa çıkacak şekilde sıralanır. Ayrıntılı bilgi almak için <a href="%(tunnelimpl)s#ordering">tünel sayfasına</a> bakabilirsiniz.

source: Continue to analyze an tune speed and capacity calculations as necessary
pt: Continue analisando os cálculos de velocidade e capacidade de ajuste conforme necessário
tr: Gerekli oldukça hız ve kapasite hesaplamalarını incelemeye ve ince ayarları yapmayı sürdürün

source: Implement a more aggressive ejection strategy if necessary to control memory usage as the network grows
pt: Implemente uma estratégia de ejeção mais agressiva, se necessário, para controlar o uso da memória à medida que a rede cresce
tr: Ağ büyüdükçe bellek kullanımını denetlemek için gerekirse daha agresif bir çıkartma stratejisi uygulayın

source: Evaluate group size limits
pt: Avalie os limites de tamanho do grupo
tr: Grup boyutu sınırlarını değerlendirin

source: Use GeoIP data to include or exclude certain peers, if configured
pt: Usar dados de GeoIP para incluir ou excluir determinados pares, quando configurado
tr: Yapılandırılmışsa, belirli eşlerin katılması ya da katılmaması için GeoIP verilerini kullanın

source: For those reading the paper <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a>, please keep in mind the following minor changes in I2P since the paper's publication:
pt: Para aqueles que estão lendo o artigo <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a>, , por favor, tenham em mente as seguintes pequenas mudanças no I2P desde a publicação do artigo:
tr: <a href="%(pdf)s">I2P Anonim Ağı üzerinde Eş Profilinin Belirlenmesi ve Seçimi</a> makalesini okuyanlar için, yayınlanmasından bu yana I2P üzerinde yapılan şu küçük değişiklikleri unutmayın:

source: The Integration calculation is still not used
pt: O cálculo de integração ainda não é utilizado
tr: Bütünleşme hesaplaması hala kullanılmıyor

source: In the paper, "groups" are called "tiers"
pt: No artigo, “grupos” são chamados de “camadas”
tr: Makalede, "gruplar" "düzeyler" olarak anılmıştır.

source: The "Failing" tier is no longer used
pt: O nível "Falha" não é mais usado
tr: "Başarısız" düzeyi artık kullanılmıyor

source: The "Not Failing" tier is now named "Standard"
pt: O nível "Não falhando" agora é chamado de "Padrão"
tr: "Başarısız olmayan" düzeyi artık "Standart" olarak adlandırılıyor

source: One Cell Enough
pt: Uma célula é o suficiente
tr: Bir hücre yeter

source: Tor Entry Guards
pt: Guardas de entrada do Tor
tr: Tor giriş koruyucuları

source: Murdoch 2007 Paper
pt: Artigo de Murdoch 2007
tr: Murdoch 2007 makalesi

source: Tune-up for Tor
pt: Ajuste para Tor
tr: Tor için ince ayarlar

source: Low-resource Routing Attacks Against Tor
pt: Ataques de roteamento de poucos recursos contra Tor
tr: Tor karşıtı düşük kaynaklı yöneltme saldırıları

source: I2P: A scalable framework for anonymous communication
pt: I2P: Uma estrutura escalável para comunicação anônima
tr: I2P: Anonim iletişim için ölçeklenebilir bir çatı

source: Introduction
pt: Início
tr: Giriş

source: I2P Operation
pt: Operação I2P
tr: I2P İşlemesi

source: Transport protocols
pt: Protocolos de transporte
tr: Taşıyıcı iletişim kuralları

source: Cryptography
pt: Criptografia
tr: Şifreleme

source: I2P is a scalable, self organizing, resilient packet switched anonymous network layer, upon which any number of different anonymity or security conscious applications can operate. Each of these applications may make their own anonymity, latency, and throughput tradeoffs without worrying about the proper implementation of a free route mixnet, allowing them to blend their activity with the larger anonymity set of users already running on top of I2P.
pt: O I2P é uma camada de rede anônima escalável, auto-organizada e resiliente comutada por pacotes, na qual qualquer número de diferentes aplicativos de anonimato ou conscientes da segurança pode operar. Cada um desses aplicativos pode fazer suas próprias compensações de anonimato, latência e throughput sem se preocupar com a implementação adequada de uma mixnet de rota livre, permitindo que eles misturem sua atividade com o conjunto maior de usuários de anonimato já em execução no topo do I2P.
tr: I2P, üzerinde herhangi bir sayıda farklı anonimlik veya güvenlik bilincine sahip uygulamanın çalışabileceği, ölçeklenebilir, kendi kendini düzenleyen, esnek bir paket anahtarlamalı anonim ağ katmanıdır. Bu uygulamaların her biri, özgür bir rota karma ağının uygun şekilde uygulanması konusunda endişelenmeden kendi anonimliklerini, gecikme sürelerini ve verim uzlaşmalarını yapabilir ve etkinliklerini halihazırda I2P üzerinde çalışan daha büyük anonimlik grubuyla harmanlayabilir.

source: Applications available already provide the full range of typical Internet activities - <b>anonymous</b> web browsing, web hosting, chat, file sharing, e-mail, blogging and content syndication, newsgroups, as well as several other applications under development.
pt: Os aplicativos disponíveis já fornecem toda a gama de atividades típicas da Internet - <b>anônimo</b> navegação na web, hospedagem na web, bate-papo, compartilhamento de arquivos, e-mail, blogs e distribuição de conteúdo, grupos de notícias, bem como vários outros aplicativos em desenvolvimento.
tr: Var olan uygulamalar, <b>anonim</b> internet üzerinde gezinme, site barındırma, sohbet, dosya paylaşımı, e-posta, blog oluşturma ve içerik paylaşımı, haber grupları ile ayrıca geliştirilmekte olan diğer birçok uygulama gibi tipik İnternet etkinliklerinin tamamını karşılamaktadır.

source: Web browsing: using any existing browser that supports using a proxy.
pt: Navegação na Web: usando qualquer navegador existente que suporte o uso de proxy.
tr: İnternet üzerinde gezinme: Vekil sunucu desteği olan herhangi bir tarayıcı kullanılabilir.

source: Chat: IRC, Jabber, <a href="#app.i2pmessenger">I2P-Messenger</a>.
pt: Bate-papo: IRC, Jabber, <a href="#app.i2pmessenger">I2P-Messenger</a>.
tr: Sohbet: IRC, Jabber, <a href="#app.i2pmessenger">I2P-Messenger</a>.

source: File sharing: <a href="#app.i2psnark">I2PSnark</a>, <a href="#app.robert">Robert</a>, <a href="#app.imule">iMule</a>, <a href="#app.i2phex">I2Phex</a>, <a href="#app.pybit">PyBit</a>, <a href="#app.i2pbt">I2P-bt</a> and others.
pt: Compartilhamento de arquivos: <a href="#app.i2psnark">I2PSnark</a>, <a href="#app.robert">Robert</a>, <a href="#app.imule">iMule</a>, <a href="#app.i2phex">I2Phex</a>, <a href="#app.pybit">PyBit</a>, <a href="#app.i2pbt">I2P-bt</a> e outros.
tr: Dosya paylaşımı: <a href="#app.i2psnark">I2PSnark</a>, <a href="#app.robert">Robert</a>, <a href="#app.imule">iMule</a>, <a href="#app.i2phex">I2Phex</a>, <a href="#app.pybit">PyBit</a>, <a href="#app.i2pbt">I2P-bt</a> ve diğerleri.

source: E-mail: <a href="#app.i2pmail">susimail</a> and <a href="#app.i2pbote">I2P-Bote</a>.
pt: E-mail: <a href="#app.i2pmail">susimail</a> e <a href="#app.i2pbote">I2P-Bote</a>.
tr: E-posta: <a href="#app.i2pmail">susimail</a> ve <a href="#app.i2pbote">I2P-Bote</a>.

source: Blog: using e.g. the pebble plugin or the distributed blogging software <a href="#app.syndie">Syndie</a>.
pt: Blog: usando, por exemplo, o plugin pebble ou o software de blog distribuído <a href="#app.syndie">Syndie</a>.
tr: Blog: Pebble uygulama eki ya da <a href="#app.syndie">Syndie</a> dağıtılmış blog yazılımı.

source: Distributed Data Store: Save your data redundantly in the Tahoe-LAFS cloud over I2P.
pt: Armazenamento de dados distribuído: salve seus dados de forma redundante na nuvem Tahoe-LAFS via I2P.
tr: Dağıtılmış veri depolama: Verilerinizi I2P üzerinden Tahoe-LAFS bulutunda yedekli olarak kaydedebilirsiniz.

source: Newsgroups: using any newsgroup reader that supports using a proxy.
pt: Grupos de notícias: usando qualquer leitor de grupos de notícias que suporte o uso de um proxy.
tr: Haber grupları: Vekil sunucu desteği olan herhangi bir haber grubu okuyucusu kullanılabilir.

source: Unlike web sites hosted within content distribution networks like <a href="#similar.freenet">Freenet</a> or <a href="https://www.gnunet.org/en/">GNUnet</a>, the services hosted on I2P are fully interactive - there are traditional web-style search engines, bulletin boards, blogs you can comment on, database driven sites, and bridges to query static systems like Freenet without needing to install it locally.
pt: Ao contrário de sites hospedados em redes de distribuição de conteúdo como <a href="#similar.freenet">Freenet</a> ou <a href="https://www.gnunet.org/en/">GNUnet</a>, os serviços hospedados no I2P são totalmente interativos - há mecanismos de busca tradicionais no estilo web, quadros de avisos, blogs nos quais você pode comentar, sites baseados em banco de dados e pontes para consultar sistemas estáticos como o Freenet sem precisar instalá-lo localmente.
tr: <a href="#similar.freenet">Freenet</a> ya da <a href="https://www.gnunet.org/en/">GNUnet</a> gibi içerik dağıtım ağlarında barındırılan sitelerin aksine, I2P üzerinde barındırılan hizmetler tamamen etkileşimlidir. Geleneksel internet tarzı arama motorları, forumlar, yorum yapabileceğiniz bloglar, veri tabanı destekli siteler ve yerel olarak kurmaya gerek kalmadan Freenet gibi sabit sistemleri sorgulamak için köprüler vardır.

source: With all of these anonymity enabled applications, I2P takes on the role of the message oriented middleware - applications say that they want to send some data to a cryptographic identifier (a "destination") and I2P takes care of making sure it gets there securely and anonymously. I2P also bundles a simple <a href="#app.streaming">streaming</a> library to allow I2P's anonymous best-effort messages to transfer as reliable, in-order streams, transparently offering a TCP based congestion control algorithm tuned for the high bandwidth delay product of the network. While there have been several simple SOCKS proxies available to tie existing applications into the network, their value has been limited as nearly every application routinely exposes what, in an anonymous context, is sensitive information. The only safe way to go is to fully audit an application to ensure proper operation and to assist in that we provide a series of APIs in various languages which can be used to make the most out of the network.
pt: Com todos esses aplicativos habilitados para anonimato, o I2P assume o papel do middleware orientado a mensagens - os aplicativos dizem que querem enviar alguns dados para um identificador criptográfico (um "destino") e o I2P cuida de garantir que eles cheguem lá de forma segura e anônima. O I2P também agrupa uma biblioteca simples <a href="#app.streaming">de streaming</a> para permitir que as mensagens anônimas de melhor esforço do I2P sejam transferidas como fluxos confiáveis e ordenados, de forma transparente oferecendo um algoritmo de controle de congestionamento baseado em TCP ajustado para o produto de atraso de alta largura de banda da rede. Embora existam vários proxies SOCKS simples disponíveis para vincular aplicativos existentes à rede, seu valor tem sido limitado, pois quase todos os aplicativos expõem rotineiramente o que, em um contexto anônimo , são informações confidenciais. A única maneira segura de fazer isso é auditar completamente um aplicativo para garantir a operação adequada e para ajudar nisso, fornecemos uma série de APIs em várias linguagens que podem ser usadas para aproveitar ao máximo a rede.
tr: Anonimliğin etkin olduğu tüm bu uygulamalarla, I2P ileti odaklı ara yazılım rolünü üstlenir. Uygulamalar bir şifreli belirtece ("hedef") bazı veriler göndermek istediklerini söyler ve I2P verilerin oraya anonim bir şeklikde güvenli olarak ulaşmasını sağlar. Ayrıca, I2P en iyi çabayla anonim iletilerin güvenilir, sıralı akışlar olarak aktarılmasını sağlamak için basit bir <a href="#app.streaming">akış</a> kitaplığı sağlar ve ağın yüksek bant genişliği gecikme ürünü için ayarlanmış TCP tabanlı bir tıkanıklık kontrol algoritmasını şeffaf bir şekilde sunar. Var olan uygulamaları ağa bağlamak için birkaç basit SOCKS vekil sunucusu bulunsa da, hemen hemen her uygulama, anonim bir bağlamda hassas bilgileri rutin olarak açığa çıkardığından, bunların değeri pek bilinmemiştir. İlerlemenin tek güvenli yolu, düzgün çalışmayı sağlamak için bir uygulamayı tamamen denetlemek ve ağdan en iyi şekilde yararlanmak için kullanılabilecek çeşitli dillerde bir dizi API sağlamamıza yardımcı olmaktır.

source: I2P is not a research project - academic, commercial, or governmental, but is instead an engineering effort aimed at doing whatever is necessary to provide a sufficient level of anonymity to those who need it. It has been in active development since early 2003 with one full time developer and a dedicated group of part time contributors from all over the world. All of the work done on I2P is open source and freely available on the <a href="%(site)s">website</a>, with the majority of the code released outright into the public domain, though making use of a few cryptographic routines under BSD-style licenses. The people working on I2P do not control what people release client applications under, and there are several GPL'ed applications available (<a href="#app.i2ptunnel">I2PTunnel</a>, <a href="#app.i2pmail">susimail</a>, <a href="#app.i2psnark">I2PSnark</a>, <a href="#app.i2pbote">I2P-Bote</a>, <a href="#app.i2phex">I2Phex</a> and others.). <a href="%(halloffame)s">Funding</a> for I2P comes entirely from donations, and does not receive any tax breaks in any jurisdiction at this time, as many of the developers are themselves anonymous.
pt: O I2P não é um projeto de pesquisa - acadêmico, comercial ou governamental, mas é, em vez disso, um esforço de engenharia que visa fazer o que for necessário para fornecer um nível suficiente de anonimato para aqueles que precisam. Ele está em desenvolvimento ativo desde o início de 2003 com um desenvolvedor em tempo integral e um dedicado grupo de colaboradores em meio período de todo o mundo. Todo o trabalho feito no I2P é de código aberto e está disponível gratuitamente no <a href="%(site)s">site</a>, com a maioria do código lançado diretamente no domínio público, embora faça uso de algumas rotinas criptográficas sob licenças no estilo BSD. As pessoas trabalhando no I2P não controlam sob quais versões as pessoas liberam aplicativos clientes, e há vários aplicativos GPL disponíveis (<a href="#app.i2ptunnel">I2PTunnel</a>, <a href="#app.i2pmail">susimail</a>, <a href="#app.i2psnark">I2PSnark</a>, <a href="#app.i2pbote">I2P-Bote</a>, <a href="#app.i2phex">I2Phex</a> e outros.). <a href="%(halloffame)s">O financiamento</a> para o I2P vem inteiramente de doações, e não recebe nenhuma isenção fiscal em nenhuma jurisdição neste momento, já que muitos dos desenvolvedores são anônimos.
tr: I2P, akademik, ticari veya resmi bir araştırma projesi değildir. Gerek duyanlara yeterli düzeyde anonimlik sağlamak için ne gerekiyorsa yapmayı amaçlayan bir mühendislik çalışmasıdır. 2003 yılının başından beri bir tam zamanlı geliştirici ve dünyanın her yerinden özel bir yarı zamanlı katılımcı grubuyla etkin şekilde geliştirilmektedir. I2P üzerinde yapılan tüm çalışmalar açık kaynak kodludur ve <a href="%(site)s">sitesinde</a> ücretsiz olarak sunulmaktadır. Kodun çoğu doğrudan herkese açık olarak yayınlanır. Birkaç şifreleme rutini BSD tarzı lisanslar altında sunulur. I2P üzerine çalışan kişiler, istemci uygulamalarını kimlerin yayınlayacağını kontrol etmez ve GPL lisansı ile birkaç uygulama vardır (<a href="#app.i2ptunnel">I2PTunnel</a>, <a href="#app.i2pmail">susimail</a>, <a href="#app.i2psnark">I2PSnark</a>, <a href="#app.i2pbote">I2P-Bote</a>, <a href="#app.i2phex">I2Phex</a> ve diğerleri.). I2P için <a href="%(halloffame)s">Kaynak</a> tamamen bağışlardan sağlanır ve geliştiricilerin çoğu anonim olduğu için şu anda herhangi bir yasal yetki bölgesindeki herhangi bir vergi indiriminden yararlanılmıyor.

source: Operation
pt: Operação
tr: İşletme
