Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: If the floodfills are not sufficiently misbehaving to be marked as "bad" using the peer profile metrics described above, this is a difficult scenario to handle. Tor's response can be much more nimble in the relay case, as the suspicious relays can be manually removed from the consensus. Some possible responses for the I2P network are listed below, however none of them is completely satisfactory:
pt: Se os floodfills não estiverem se comportando mal o suficiente para serem marcados como "ruins" usando as métricas de perfil de pares descritas acima, este é um cenário difícil de lidar. A resposta do Tor pode ser muito mais ágil no caso de retransmissão, pois os retransmissores suspeitos podem ser removidos manualmente do consenso. Algumas respostas possíveis para a rede I2P estão listadas abaixo, no entanto, nenhuma delas é completamente satisfatória:
tr: Otomatik doldurma yönelticileri, yukarıda açıklanan eş profil ölçümleri kullanılarak "kötü" olarak işaretlenecek kadar hatalı çalışmıyorsa, bu senaryonun, ele alınması zordur. Tor yanıtı, aktarıcı durumunda çok daha çevik olabilir, çünkü şüpheli aktarıcılar uzlaşmadan el ile kaldırılabilir. I2P ağı için bazı olası yanıtlar aşağıda listelenmiştir. Ancak bunların hiçbiri tam olarak tatmin edici değildir:

source: Compile a list of bad router hashes or IPs, and announce the list through various means (console news, website, forum, etc.); users would have to manually download the list and add it to their local "blacklist".
pt: Compile uma lista de hashes ou IPs de roteadores ruins e anuncie a lista por vários meios (notícias do console, site, fórum, etc.); os usuários teriam que baixar manualmente a lista e adicioná-la à sua "lista negra" local.
tr: Kötü yöneltici karmalarının veya IP adreslerinin bir listesini derleyin ve listeyi çeşitli yollarla duyurun (konsol haberleri, site, forum vb.); kullanıcıların listeyi el ile indirmeleri ve yerel "kara listelerine" eklemeleri gerekir.

source: Ask everyone in the network to enable floodfill manually (fight Sybil with more Sybil)
pt: Peça a todos na rede para habilitar o floodfill manualmente (lute contra Sybil com mais Sybil)
tr: Ağdaki herkesten otomatik doldurmayı el ile etkinleştirmesini isteyin (Sybil ile daha fazla Sybil kullanarak savaşın)

source: Release a new software version that includes the hardcoded "bad" list
pt: Lançar uma nova versão de software que inclua a lista "ruim" codificada
tr: Sabit kodlanmış "hatalı" listeyi içeren yeni bir yazılım sürümü yayınlayın

source: Release a new software version that improves the peer profile metrics and thresholds, in an attempt to automatically identify the "bad" peers.
pt: Lançar uma nova versão de software que melhora as métricas e limites do perfil dos pares, , em uma tentativa de identificar automaticamente os pares "ruins".
tr: "Kötü" eşleri otomatik olarak belirleme girişiminde bulunarak, eş profili ölçümlerini ve eşiklerini iyileştiren yeni bir yazılım sürümü yayınlayın.

source: Add software that disqualifies floodfills if too many of them are in a single IP block
pt: Adicione software que desqualifique floodfills se muitos deles estiverem em um único bloco de IP
tr: Tek bir IP bloğundaki otomatik doldurma yönelticileri çok fazla sayıdaysa azaltan yazılım ekleyin

source: Implement an automatic subscription-based blacklist controlled by a single individual or group. This would essentially implement a portion of the Tor "consensus" model. Unfortunately it would also give a single individual or group the power to block participation of any particular router or IP in the network, or even to completely shutdown or destroy the entire network.
pt: Implementar uma lista negra automática baseada em assinatura controlada por um único indivíduo ou grupo. Isso implementaria essencialmente uma parte do modelo de "consenso" do Tor. Infelizmente, isso também daria a um único indivíduo ou grupo o poder de bloquear a participação de qualquer roteador ou IP específico na rede, ou até mesmo desligar ou destruir completamente a rede inteira.
tr: Tek bir kişi veya grup tarafından kontrol edilen, aboneliğe dayalı otomatik bir kara liste uygulayın. Bu, aslında Tor "uzlaşma" modelinin bir bölümünü uygular. Ne yazık ki, tek bir bireye veya gruba belirli bir yönelticinin veya IP adresinin ağdaki katılımını engelleme veya hatta tüm ağı tamamen kapatma veya yok etme gücü de verir.

source: This attack becomes more difficult as the network size grows.
pt: Esse ataque se torna mais difícil à medida que o tamanho da rede aumenta.
tr: Ağ boyutu büyüdükçe bu saldırı daha zor hale gelir.

source: Sybil Attack (Partial Keyspace)
pt: Ataque Sybil (Keyspace Parcial)
tr: Sybil Saldırısı (Parçalı Anahtar Uzayı)

source: An attacker may mount a <a href="%(url)s">Sybil attack</a> by creating a small number (8-15) of floodfill routers clustered closely in the keyspace, and distribute the RouterInfos for these routers widely. Then, all lookups and stores for a key in that keyspace would be directed to one of the attacker's routers. If successful, this could be an effective DOS attack on a particular I2P Site, for example.
pt: Um invasor pode montar um ataque Sybil <a href="%(url)s"></a> criando um pequeno número (8-15) de roteadores floodfill agrupados no keyspace, e distribuir amplamente o RouterInfos para esses roteadores. Então, todas as pesquisas e armazenamentos para uma chave naquele keyspace seriam direcionados para um dos roteadores do invasor. Se bem-sucedido, este poderia ser um ataque DOS eficaz em um site I2P específico, por exemplo.
tr: Saldırgan, anahtar alanında yakın bir şekilde kümelenmiş az sayıda (8-15) otomatik doldurma yönelticisi oluşturarak bir <a href="%(url)s">Sybil saldırısı</a> başlatabilir ve bu yönelticiler için "Yöneltici bilgilerini" (RouterInfo) geniş çapta dağıtabilir. Ardından, bu anahtar alanındaki tüm aramalar ve anahtarlar, saldırganın yönelticilerinden birine yöneltilir. Başarılı olursa, belirli bir I2P sitesinde etkili bir DOS saldırısı gibi olabilir.

source: As the keyspace is indexed by the cryptographic (SHA256) Hash of the key, an attacker must use a brute-force method to repeatedly generate router hashes until he has enough that are sufficiently close to the key. The amount of computational power required for this, which is dependent on network size, is unknown.
pt: Como o keyspace é indexado pelo hash criptográfico (SHA256) da chave, um invasor deve usar um método de força bruta para gerar repetidamente hashes de roteador até que ele tenha o suficiente que esteja suficientemente próximo da chave. A quantidade de poder computacional necessária para isso, que depende do tamanho da rede , é desconhecida.
tr: Anahtar uzayı, anahtarın şifreleme (SHA-256) karması tarafından dizine eklendiğinden, bir saldırgan, anahtara yeterince yakın olana kadar üst üste yöneltici karmaları oluşturmak için bir kaba kuvvet yöntemi kullanmalıdır. Ağ boyutuna bağlı olduğundan bunun için gereken hesaplama gücü miktarı bilinmemektedir.

source: As a partial defense against this attack, the algorithm used to determine Kademlia "closeness" varies over time. Rather than using the Hash of the key (i.e. H(k)) to determine closeness, we use the Hash of the key appended with the current date string, i.e. H(k + YYYYMMDD). A function called the "routing key generator" does this, which transforms the original key into a "routing key". In other words, the entire netdb keyspace "rotates" every day at UTC midnight. Any partial-keyspace attack would have to be regenerated every day, for after the rotation, the attacking routers would no longer be close to the target key, or to each other.
pt: Como uma defesa parcial contra esse ataque, o algoritmo usado para determinar a "proximidade" do Kademlia varia ao longo do tempo. Em vez de usar o Hash da chave (ou seja, H(k)) para determinar a proximidade, usamos o Hash da chave anexado com a sequência de data atual, ou seja, H(k + AAAAMMDD). Uma função chamada "gerador de chave de roteamento" faz isso, o que transforma a chave original em uma "chave de roteamento". Em outras palavras, todo o keyspace netdb "gira" todos os dias à meia-noite UTC. Qualquer ataque de keyspace parcial teria que ser regenerado todos os dias, pois após a rotação, os roteadores atacantes não estariam mais próximos da chave alvo ou entre si.
tr: Bu saldırıya karşı kısmi bir savunma olarak, Kademlia tarafından "yakınlığı" belirlemek için kullanılan algoritma zamanla değiştirilir. Yakınlığı belirlemek için anahtarın karmasını (H(k)) kullanmak yerine, geçerli tarih dizgesine eklenen anahtarın karmasını kullanırız, (H(k + YYYYMMDD)). Özgün anahtarı bir "yöneltme anahtarına" dönüştüren "yöneltme anahtarı oluşturucu" adlı bir işlev bunu yapar. Başka bir deyişle, "Ağ veri tabanı" (NetDB) anahtar uzayının tamamı her gün UTC gece yarısında "döndürülür". Herhangi bir kısmi anahtar alanı saldırısının her gün yeniden oluşturulması gerekir. Çünkü döndürme işleminden sonra saldıran yönelticiler artık hedef anahtara veya birbirlerine yakın olmayacaktır.

source: This attack becomes more difficult as the network size grows. However, recent research demonstrates that the keyspace rotation is not particularly effective. An attacker can precompute numerous router hashes in advance, and only a few routers are sufficient to "eclipse" a portion of the keyspace within a half hour after rotation.
pt: Esse ataque se torna mais difícil à medida que o tamanho da rede aumenta. No entanto, pesquisas recentes demonstram que a rotação do espaço de chaves não é particularmente eficaz. Um invasor pode pré-computar vários hashes de roteador com antecedência, e apenas alguns roteadores são suficientes para "eclipsar" uma parte do espaço de chaves em meia hora após a rotação.
tr: Ağ boyutu büyüdükçe bu saldırı daha zor hale gelir. Bununla birlikte, son araştırmalar, anahtar uzayını döndürmenin özellikle etkili olmadığını göstermektedir. Bir saldırgan, çok sayıda yöneltici karma değerini önceden hesaplayabilir ve yalnızca birkaç yöneltici, döndürmeden sonraki yarım saat içinde anahtar uzayının bir bölümünü "tutturmak" için yeterlidir.

source: One consequence of daily keyspace rotation is that the distributed network database may become unreliable for a few minutes after the rotation -- lookups will fail because the new "closest" router has not received a store yet. The extent of the issue, and methods for mitigation (for example netdb "handoffs" at midnight) are a topic for further study.
pt: Uma consequência da rotação diária do espaço de chaves é que o banco de dados de rede distribuído pode se tornar não confiável por alguns minutos após a rotação -- as pesquisas falharão porque o novo roteador "mais próximo" ainda não recebeu um armazenamento. A extensão do problema e os métodos de mitigação (por exemplo, "transferências" do netdb à meia-noite) são um tópico para estudo posterior.
tr: Günlük anahtar uzayı döndürmenin bir sonucu, dağıtılmış "Ağ veri tabanının" (NetDB) döndürme işleminden birkaç dakika sonra güvenilmez olmasıdır. Yeni "en yakın" yöneltici henüz bir depolama almadığı için aramalar başarısız olur. Sorunun kapsamı ve hafifletme yöntemleri (örneğin gece yarısı "Ağ veri tabanı" (NetDB) "terkleri") üzerinde daha fazla çalışılması gereken bir konudur.

source: Bootstrap Attacks
pt: Ataques Bootstrap
tr: Ön Yükleme Saldırıları

source: An attacker could attempt to boot new routers into an isolated or majority-controlled network by taking over a reseed website, or tricking the developers into adding his reseed website to the hardcoded list in the router.
pt: Um invasor pode tentar inicializar novos roteadores em uma rede isolada ou controlada pela maioria, assumindo o controle de um site de reseed, ou enganando os desenvolvedores para adicionar seu site de reseed à lista codificada no roteador.
tr: Bir saldırgan, yeniden oluşturulmuş bir siteyi ele geçirerek veya geliştiricileri, yeniden oluşturulmuş siteyi yönelticideki sabit kodlanmış listeye eklemeleri için kandırarak, yalıtılmış veya çoğunluğun denetimindeki bir ağda yeni yönelticiler başlatmayı deneyebilir.

source: Several defenses are possible, and most of these are planned:
pt: Várias defesas são possíveis, e a maioria delas são planejadas:
tr: Birkaç savunma önlemi alınabilir ve bunların çoğu planlanmıştır:

source: Disallow fallback from HTTPS to HTTP for reseeding. A MITM attacker could simply block HTTPS, then respond to the HTTP.
pt: Não permitir fallback de HTTPS para HTTP para repropagação. Um invasor MITM poderia simplesmente bloquear o HTTPS e então responder ao HTTP.
tr: Yeniden tohumlama için HTTPS yerine HTTP iletişim kuralına dönülmesine izin vermeyin. Bir MITM saldırganı kolayca HTTPS erişimini engelleyip ardından HTTP iletişim kuralına yanıt verebilir.

source: Bundling reseed data in the installer
pt: Agrupando dados de reseed no instalador
tr: Kurucuda yeniden çekirdek verilerinin paketlenmesi

source: Defenses that are implemented:
pt: Defesas que são implementadas:
tr: Uygulanan savunmalar:

source: Changing the reseed task to fetch a subset of RouterInfos from each of several reseed sites rather than using only a single site
pt: Alterar a tarefa de reseed para buscar um subconjunto de RouterInfos de cada um dos vários sites de reseed em vez de usar apenas um único site
tr: Yeniden tohumlama görevi, yalnızca tek bir site kullanmak yerine, birkaç yeniden oluşturulmuş sitenin her birinden bir "Yöneltici bilgileri" (RouterInfo) alt kümesi alacak şekilde değiştirildi.

source: Creating an out-of-network reseed monitoring service that periodically polls reseed websites and verifies that the data are not stale or inconsistent with other views of the network
pt: Criação de um serviço de monitoramento de reseed fora da rede que periodicamente pesquisa sites de reseed e verifica se os dados não estão desatualizados ou inconsistentes com outras visões da rede
tr: Yeniden tohumlanmış siteleri düzenli olarak yoklayan ve verilerin eskimiş veya ağın diğer görünümleriyle tutarsız olmadığını doğrulayan ağ dışı bir yeniden izleme hizmeti oluşturuldu.

source: As of release 0.9.14, reseed data is bundled into a signed zip file and the signature is verified when downloaded.
pt: A partir da versão 0.9.14, os dados de reseed são agrupados em um arquivo zip assinado e a assinatura é verificada quando baixada.
tr: 0.9.14 sürümünden başlayarak, yeniden tohumlama verileri imzalanmış bir zip dosyasında paketleniyor ve indirildiğinde imza doğrulanıyor.

source: Query Capture
pt: Captura de consulta
tr: Sorgu Yakalama

source: See also <a href="#lookup">lookup</a> (Reference: <a href="%(pdf)s">Hashing it out in Public</a> Sections 2.2-2.3 for terms below in italics)
pt: Veja também <a href="#lookup">lookup</a> (Referência: <a href="%(pdf)s">Hashing it out in Public</a> Seções 2.2-2.3 para termos abaixo em itálico)
tr: Ayrıca <a href="#lookup">lookup</a> bölümüne bakabilirsiniz (Referans: Aşağıdaki yatık yazılmış terimler için <a href="%(pdf)s">Hashing out in Public</a> 2.2 ve 2.3 bölümleri)

source: Similar to a bootstrap attack, an attacker using a floodfill router could attempt to "steer" peers to a subset of routers controlled by him by returning their references.
pt: Semelhante a um ataque bootstrap, um invasor usando um roteador floodfill poderia tentar "direcionar" pares para um subconjunto de roteadores controlados por ele retornando suas referências.
tr: Ön yükleme saldırısına benzer şekilde, otomatik doldurma yönelticisi kullanan bir saldırgan, referanslarını döndürerek, eşleri kendisi tarafından kontrol edilen bir yöneltici alt kümesine "yöneltmeye" çalışabilir.

source: This is unlikely to work via exploration, because exploration is a low-frequency task. Routers acquire a majority of their peer references through normal tunnel building activity. Exploration results are generally limited to a few router hashes, and each exploration query is directed to a random floodfill router.
pt: É improvável que isso funcione por meio de exploração, porque a exploração é uma tarefa de baixa frequência. Os roteadores adquirem a maioria de suas referências de pares por meio da atividade normal de construção de túneis. Os resultados da exploração são geralmente limitados a alguns hashes de roteador, e cada consulta de exploração é direcionada a um roteador de inundação aleatório.
tr: Bunun keşif yoluyla çalışması pek olası değildir. Çünkü keşif düşük sıklıkla yapılan bir görevdir. Yönelticiler, eş referanslarının çoğunu normal tünel oluşturma faaliyeti yoluyla elde eder. Keşif sonuçları genellikle birkaç yöneltici karmasıyla sınırlıdır ve her keşif sorgusu rastgele bir otomatik doldurma yönelticisine yönlendirilir.

source: As of release 0.8.9, <i>iterative lookups</i> are implemented. For floodfill router references returned in a <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage response to a lookup, these references are followed if they are closer (or the next closest) to the lookup key. The requesting router does not trust that the references are closer to the key (i.e. they are <i>verifiably correct</i>. The lookup also does not stop when no closer key is found, but continues by querying the next-closet node, until the timeout or maximum number of queries is reached. This prevents a malicious floodfill from black-holing a part of the key space. Also, the daily keyspace rotation requires an attacker to regenerate a router info within the desired key space region. This design ensures that the query capture attack described in <a href="%(pdf)s">Hashing it out in Public</a> is much more difficult.
pt: A partir da versão 0.8.9, <i>pesquisas iterativas</i> são implementadas. Para referências de roteador de preenchimento retornadas em uma <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage resposta a uma pesquisa, essas referências são seguidas se estiverem mais próximas (ou as mais próximas) da chave de pesquisa. O roteador solicitante não confia que as referências estejam mais próximas da chave (ou seja, elas estejam <i>verificavelmente corretas</i>. A pesquisa também não para quando nenhuma chave mais próxima é encontrada, mas continua consultando o nó mais próximo, até que o tempo limite ou o número máximo de consultas seja atingido. Isso evita que um floodfill malicioso crie um buraco negro em uma parte do espaço da chave. Além disso, a rotação diária do espaço da chave exige que um invasor regenere uma informação do roteador dentro da região do espaço da chave desejada. Este design garante que o ataque de captura de consulta descrito em <a href="%(pdf)s">Falar sobre isso em público</a> é muito mais difícil.
tr: 0.8.9 sürümünden başlayarak <i> yinelemeli aramalar</i> uygulanıyor. Bir aramaya <a href="%(i2np)s">I2NP</a> "Veri tabanı arama yanıtı iletisi" (DatabaseSearchReplyMessages) ile döndürülen otomatik doldurma yönelticisi referansları için, bu referanslar arama anahtarına daha yakınsa (veya bir sonraki en yakınsa) izlenir. İstekte bulunan yöneltici, referansların anahtara daha yakın olduğuna güvenmez (yani, bunlar <i>doğrulanabilir şekilde doğrudur</i>. Arama, daha yakın bir anahtar bulunmadığında da durmaz, ancak zaman aşımına uğrayana ya da en fazla sorgu sayısına ulaşılana kadar sonfraki en yakın düğümünü sorgulanarak sürdürülür. Böylece, kötü niyetli bir otomatik doldurma yönelticisinin anahtar uzayının bir bölümünde kara delik oluşturması önlenir. Ayrıca, günlük anahtar uzayını döndürmek, bir saldırganın istenen anahtar alanı uzayında bir yöneltici bilgisini yeniden oluşturmasını gerektirir. Bu tasarım, <a href="%(pdf)s">Hashing it in Public</a> bölümünde açıklanan sorgu yakalama saldırısının çok daha zor olmasını sağlar.

source: DHT-Based Relay Selection
pt: Seleção de relé baseada em DHT
tr: "Dağıtılmış karma tablosu" (DHT) temelli aktarıcı seçimi

source: (Reference: <a href="%(pdf)s">Hashing it out in Public</a> Section 3)
pt: (Referência: <a href="%(pdf)s">Hashing it out in Public</a> Seção 3)
tr: (Referans: <a href="%(pdf)s">Hashing it out in Public</a> 3. bölüm)

source: This doesn't have much to do with floodfill, but see the <a href="%(peerselection)s">peer selection page</a> for a discussion of the vulnerabilities of peer selection for tunnels.
pt: Isso não tem muito a ver com floodfill, mas veja a <a href="%(peerselection)s">página de seleção de pares</a> para uma discussão sobre as vulnerabilidades da seleção de pares para túneis.
tr: Bunun otomatik doldurma ile pek bir ilgisi yoktur. Yine de tüneller için eş seçiminin güvenlik açıkları hakkında bir tartışmayı görmek için <a href="%(peerselection)s">eş seçimi sayfasına</a> bakın.

source: Information Leaks
pt: Vazamentos de informação
tr: Bilgi Kaçakları

source: (Reference: <a href="%(pdf)s">In Search of an Anonymous and Secure Lookup</a> Section 3)
pt: (Referência: <a href="%(pdf)s">Em busca de uma pesquisa anônima e segura</a> Seção 3)
tr: (Referans: <a href="%(pdf)s">In Search of an Anonymous and Secure Lookup</a> 3. bölüm)

source: This paper addresses weaknesses in the "Finger Table" DHT lookups used by Torsk and NISAN. At first glance, these do not appear to apply to I2P. First, the use of DHT by Torsk and NISAN is significantly different from that in I2P. Second, I2P's network database lookups are only loosely correlated to the <a href="%(peerselection)s">peer selection</a> and <a href="%(tunnelrouting)s">tunnel building</a> processes; only previously-known peers are used for tunnels. Also, peer selection is unrelated to any notion of DHT key-closeness.
pt: Este artigo aborda as fraquezas nas pesquisas DHT "Finger Table" usadas por Torsk e NISAN. À primeira vista, elas não parecem se aplicar ao I2P. Primeiro, o uso de DHT por Torsk e NISAN é significativamente diferente daquele no I2P. Segundo, as pesquisas de banco de dados de rede do I2P são apenas vagamente correlacionadas aos processos de seleção de pares <a href="%(peerselection)s"></a> e <a href="%(tunnelrouting)s">construção de túneis</a> ; apenas pares previamente conhecidos são usados para túneis. Além disso, a seleção de pares não está relacionada a nenhuma noção de proximidade de chave DHT.
tr: Bu belgede, Torsk ve NISAN tarafından kullanılan "Finger Table" "Dağıtılmış karma tablosu" (DHT) aramalarındaki zayıflıklar ele alınmıştır. İlk bakışta, bunlar I2P için geçerli görünmüyor. İlk olarak, Torsk ve NISAN tarafındaki "Dağıtılmış karma tablosu" (DHT) kullanımı I2P üzerindekinden önemli ölçüde farklıdır. İkincisi, I2P "Ağ veri tabanı" (netDB) aramaları, <a href="%(peerselection)s">eş seçimi</a> ve <a href="%(tunnelrouting)s">tünel oluşturma</a> süreçleriyle yalnızca gevşek bir şekilde ilişkilidir. Tüneller için yalnızca önceden bilinen eşler kullanılır. Ayrıca, eş seçimi, herhangi bir "Dağıtılmış karma tablosu" (DHT) anahtar yakınlığı kavramıyla ilgisizdir.
