Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Some of this may actually be more interesting when the I2P network gets much larger. Right now, each router knows a large proportion of the network, so looking up a particular Router Info in the network database is not strongly indicative of a future intent to use that router in a tunnel. Perhaps when the network is 100 times larger, the lookup may be more correlative. Of course, a larger network makes a Sybil attack that much harder.
pt: Parte disso pode ser realmente mais interessante quando a rede I2P ficar muito maior. No momento, cada roteador conhece uma grande proporção da rede, então procurar por uma Router Info específica no banco de dados da rede não é fortemente indicativo de uma intenção futura de usar aquele roteador em um túnel. Talvez quando a rede for 100 vezes maior, a pesquisa pode ser mais correlativa. Claro, uma rede maior torna um ataque Sybil muito mais difícil.
tr: Bunlardan bazıları, I2P ağı daha fazla genişlediğinde daha ilginç olabilir. Şu anda, her yöneltici ağın büyük bir bölümünü biliyor. Bu nedenle ağ veri tabanında belirli Yöneltici Bilgilerini aramak, gelecekte bu yönelticiyi bir tünelde kullanma niyetinin güçlü bir göstergesi değildir. Belki ağ 100 kat daha büyük olduğunda, arama daha ilişkilendirilebilir olabilir. Tabii ki, daha büyük bir ağ, bir Sybil saldırısını çok daha zor hale getirir.

source: However, the general issue of DHT information leakage in I2P needs further investigation. The floodfill routers are in a position to observe queries and gather information. Certainly, at a level of <i>f</i> = 0.2 (20&#37; malicious nodes, as specifed in the paper) we expect that many of the Sybil threats we describe (<a href="%(threatmodel)s#sybil">here</a>, <a href="#sybil">here</a> and <a href="#sybil-partial">here</a>) become problematic for several reasons.
pt: Entretanto, a questão geral do vazamento de informações DHT no I2P precisa de mais investigação. Os roteadores floodfill estão em posição de observar consultas e coletar informações. Certamente, em um nível de <i>f</i> = 0,2 (20&#37; nós maliciosos, conforme especificado no artigo) esperamos que muitas das ameaças Sybil que descrevemos (<a href="%(threatmodel)s#sybil">aqui</a>, <a href="#sybil">aqui</a> e <a href="#sybil-partial">aqui</a>) se tornem problemáticas por vários motivos.
tr: Ancak, I2P üzerindeki "Dağıtılmış karma tablosu" (DHT) bilgi sızıntısı genel konusunun daha fazla araştırılması gerekiyor. Otomatik doldurma yönelticileri, sorguları gözlemleyecek ve bilgi toplayacak bir konumdadır. Elbette, <i>f</i> = 0,2 (20&#37 yazısında belirtildiği gibi; kötü niyetli düğümler) düzeyinde, tanımladığımız Sybil tehditlerinin çoğunun (<a href="%(threatmodel)s#sybil">burada</a>, <a href="#sybil">burada</a> ve <a href="#sybil-partial">burada</a>) belirtilen nedenlerle sorunlu hale gelmesini bekliyoruz.

source: Moved to the netdb discussion page
pt: Movido para a página de discussão do netdb
tr: "Ağ veri tabanı" (NetDB) tartışma sayfasına taşındı

source: End-to-end encryption of additional netDb lookups and responses.
pt: Criptografia de ponta a ponta de pesquisas e respostas adicionais do netDb.
tr: Ek "Ağ veri tabanı" (NetDB) aramalarının ve yanıtlarının uçtan uca şifrelenmesi.

source: Better methods for tracking lookup responses.
pt: Melhores métodos para rastrear respostas de pesquisa.
tr: Arama yanıtlarını izlemek için daha iyi yöntemler.

source: Peer Profiling and Selection
pt: Determinação de perfis e seleção de pares
tr: Eş Profilinin Belirlenmesi ve Seçimi

source: July 2010
pt: Julho de 2010
tr: 2010 Temmuz

source: Peer Profiling
pt: Criação de perfil de pares
tr: Eş Profilinin Belirlenmesi

source: <b>Peer profiling</b> is the process of collecting data based on the <b>observed</b> performance of other routers or peers, and classifying those peers into groups. Profiling does <b>not</b> use any claimed performance data published by the peer itself in the <a href="%(netdb)s">network database</a>.
pt: <b>O perfil de pares</b> é o processo de coleta de dados com base no <b>desempenho observado</b> de outros roteadores ou pares e na classificação desses pares em grupos. O perfil <b>não</b> usa nenhum dado de desempenho reivindicado publicado pelo próprio par no <a href="%(netdb)s">banco de dados de rede</a>.
tr: <b>Eş profilinin belirlenmesi</b> diğer yönelticilerin veya eşlerin <b>gözlenen</b> başarımına dayalı olarak veri toplama ve bu eşleri gruplara ayırma işlemidir. Eş belirleme, eşin kendisi tarafından <a href="%(netdb)s">"Ağ veri tabanı" (NetDB)</a> üzerinde yayınlanarak iddia ettiği başarım verilerini <b>kullanmaz</b>.

source: Profiles are used for two purposes:
pt: Os perfis são usados para duas finalidades:
tr: Profiller iki amaçla kuıllanılır:

source: Selecting peers to relay our traffic through, which is discussed below
pt: Selecionando pares para retransmitir nosso tráfego, o que é discutido abaixo
tr: Aşağıda tartışılan, trafiğimizi aktarmak için eşlerin seçilmesi

source: Choosing peers from the set of floodfill routers to use for network database storage and queries, which is discussed on the <a href="%(netdb)s">network database</a> page
pt: Escolha de pares do conjunto de roteadores de floodfill para usar para armazenamento e consultas de banco de dados de rede, que é discutido na página <a href="%(netdb)s">banco de dados de rede</a>
tr: <a href="%(netdb)s">"Ağ veri tabanı" (NetDB)</a> sayfasında açıklanan ağ veri tabanı depolaması ve sorguları için kullanılacak otomatik doldurma yönelticileri kümesinden eşler seçilmesi

source: Peer Selection
pt: Seleção de Pares
tr: Eş Seçimi

source: <b>Peer selection</b> is the process of choosing which routers on the network we want to relay our messages to go through (which peers will we ask to join our tunnels). To accomplish this, we keep track of how each peer performs (the peer's "profile") and use that data to estimate how fast they are, how often they will be able to accept our requests, and whether they seem to be overloaded or otherwise unable to perform what they agree to reliably.
pt: <b>Seleção de pares</b> é o processo de escolher quais roteadores na rede queremos retransmitir nossas mensagens para passar (quais pares iremos pedir para se juntarem aos nossos túneis). Para fazer isso, nós monitoramos como cada par se desempenha (o "perfil" do par) e usamos esses dados para estimar quão rápidos eles são, com que frequência eles serão capazes de aceitar nossas solicitações e se eles parecem estar sobrecarregados ou de outra forma incapazes de executar o que eles concordam de forma confiável.
tr: <b>Eş seçimi</b>, iletilerimizi aktarmak için ağda hangi yönelticilerden geçmesini istediğimizi seçme işlemidir (hangi eşlerin tünellerimize katılmasını isteyeceğiz). Bunu başarmak için, her bir eşin başarımını (eşin "profili") izleriz ve bu verilerle ne kadar hızlı olduklarını, isteklerimizi ne sıklıkla kabul edebileceklerini, aşırı yüklenmiş gibi görünüp görünmediklerini ve işlemleri güvenilir bir şekilde yerine getirebilecekler mi öngörmek için kullanırız.

source: Unlike some other anonymous networks, in I2P, claimed bandwidth is untrusted and is <b>only</b> used to avoid those peers advertising very low bandwidth insufficient for routing tunnels. All peer selection is done through profiling. This prevents simple attacks based on peers claiming high bandwidth in order to capture large numbers of tunnels. It also makes <a href="%(threatmodel)s#timing">timing attacks</a> more difficult.
pt: Ao contrário de algumas outras redes anônimas, no I2P, a largura de banda reivindicada não é confiável e é <b>apenas</b> usada para evitar aqueles pares anunciando largura de banda muito baixa, insuficiente para túneis de roteamento. Toda a seleção de pares é feita por meio de criação de perfil. Isso evita ataques simples baseados em pares reivindicando alta largura de banda para capturar um grande número de túneis. Também torna <a href="%(threatmodel)s#timing">ataques de temporização</a> mais difíceis.
tr: Diğer bazı anonim ağların aksine, I2P üzerinde iddia edilen bant genişliği bilgisi güvenilmezdir ve <b>yalnızca</b> yöneltme tünelleri için yetersiz olan çok düşük bant genişliği duyurusu yapan eşlerden kaçınmak için kullanılır. Tüm eş seçimleri profil belirleme yoluyla yapılır. Böylece, çok sayıda tüneli yakalamak için yüksek bant genişliği isteyen eşlere dayalı basit saldırılar önlenir. Ayrıca <a href="%(threatmodel)s#timing">zamanlama saldırılarının</a> yapılması zorlaşır.

source: Peer selection is done quite frequently, as a router may maintain a large number of client and exploratory tunnels, and a tunnel lifetime is only 10 minutes.
pt: A seleção de pares é feita com bastante frequência, pois um roteador pode manter um grande número de túneis de cliente e exploratórios, e a vida útil de um túnel é de apenas 10 minutos.
tr: Bir yöneltici çok sayıda istemci ve keşif tüneli tutabileceğinden ve tünel ömrü yalnızca 10 dakika olduğundan, eş seçimi oldukça sık yapılır.

source: Further Information
pt: Mais informações
tr: Diğer Bilgiler

source: For more information see the paper <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a> presented at <a href="%(url)s">PET-CON 2009.1</a>. See <a href="#notes">below</a> for notes on minor changes since the paper was published.
pt: Para mais informações, veja o artigo <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a> apresentado em <a href="%(url)s">PET-CON 2009.1</a>. Veja <a href="#notes">abaixo</a> para notas sobre pequenas mudanças desde que o artigo foi publicado.
tr: Ayrıntılı bilgi almak için <a href="%(url)s">PET-CON 2009.1</a> etkinliğinde sunulan <a href="%(pdf)s">I2P Anonim Ağında Eş Profilinin Belirlenmesi ve Seçimi</a> makalesine bakabilirsiniz. Makalenin yayınlanmasından bu yana yapılan küçük değişikliklerle ilgili notlar için <a href="#notes">aşağıya</a> bakın.

source: Profiles
pt: Perfis
tr: Profiller

source: Each peer has a set of data points collected about them, including statistics about how long it takes for them to reply to a network database query, how often their tunnels fail, and how many new peers they are able to introduce us to, as well as simple data points such as when we last heard from them or when the last communication error occurred. The specific data points gathered can be found in the <a href="%(url)s">code</a>.
pt: Cada peer tem um conjunto de pontos de dados coletados sobre eles, incluindo estatísticas sobre quanto tempo leva para eles responderem a uma consulta de banco de dados de rede, com que frequência seus túneis falham e quantos novos peers eles conseguem nos apresentar , bem como pontos de dados simples, como quando ouvimos falar deles pela última vez ou quando ocorreu o último erro de comunicação. Os pontos de dados específicos coletados podem ser encontrados no <a href="%(url)s">código</a>.
tr: Her eşten, bir ağ veri tabanı sorgusuna yanıt vermelerinin ne kadar sürdüğü, tünellerinin ne sıklıkla başarısız olduğu ve bizi kaç yeni eş ile tanıştırabilecekleri gibi istatistiklerle birlikte, onlardan en son ne zaman haber aldığımız veya son iletişim hatasının ne zaman ortaya çıktığı gibi kendileri hakkında bir dizi veri toplanır. Toplanan belirli veri noktaları <a href="%(url)s">kod</a> içinde bulunabilir.

source: Profiles are fairly small, a few KB. To control memory usage, the profile expiration time lessens as the number of profiles grows. Profiles are kept in memory until router shutdown, when they are written to disk. At startup, the profiles are read so the router need not reinitialize all profiles, thus allowing a router to quickly re-integrate into the network after startup.
pt: Os perfis são bem pequenos, alguns KB. Para controlar o uso da memória, o tempo de expiração do perfil diminui conforme o número de perfis cresce. Os perfis são mantidos na memória até o desligamento do roteador, quando são gravados no disco. Na inicialização, os perfis são lidos para que o roteador não precise reinicializar todos os perfis, permitindo assim que um roteador se reintegre rapidamente à rede após a inicialização.
tr: Profiller oldukça küçüktür ve birkaç KB boyutundadır. Bellek kullanımını kontrol etmek için, profil sayısı arttıkça profil geçerliliği süresi azalır. Profiller, diske yazıldığında yöneltici kapanana kadar bellekte tutulur. Başlangıçta profiller okunur, böylece yönelticinin tüm profilleri yeniden başlatmasına gerek kalmaz. Böylece bir yönelticinin başlatılmasından sonra hızla ağ ile yeniden bütünleşmesine izin verilir.

source: Peer Summaries
pt: Resumos de pares
tr: Eş Özetleri

source: While the profiles themselves can be considered a summary of a peer's performance, to allow for effective peer selection we break each summary down into four simple values, representing the peer's speed, its capacity, how well integrated into the network it is, and whether it is failing.
pt: Embora os perfis em si possam ser considerados um resumo do desempenho de um peer , para permitir uma seleção eficaz de peers, dividimos cada resumo em quatro valores simples, representando a velocidade do peer, sua capacidade, quão bem integrado ele está na rede e se ele está falhando.
tr: Profiller bir eşin başarımının bir özeti olarak kabul edilebilirken, etkili eş seçimine izin vermek için her bir özeti, eşin hızını, kapasitesini, ağ ile ne kadar iyi bütünleştiğini ve ne kadar başarısız olduğunu gösteren dört basit değere böldük.

source: Speed
pt: Velocidade
tr: Hız

source: The speed calculation simply goes through the profile and estimates how much data we can send or receive on a single tunnel through the peer in a minute. For this estimate it just looks at performance in the previous minute.
pt: O cálculo de velocidade simplesmente percorre o perfil e estima quantos dados podemos enviar ou receber em um único túnel através do peer em um minuto. Para esta estimativa, ele apenas olha para o desempenho de no minuto anterior.
tr: Hız hesaplaması basitçe profilden geçer ve bir dakika içinde eş üzerinden tek bir tünelde ne kadar veri gönderip alabileceğimizi öngörür. Bu öngörü için yalnızca bir önceki dakikadaki başarıma bakar.

source: Capacity
pt: Capacidade
tr: Kapasite

source: The capacity calculation simply goes through the profile and estimates how many tunnels the peer would agree to participate in over a given time period. For this estimate it looks at how many tunnel build requests the peer has accepted, rejected, and dropped, and how many of the agreed-to tunnels later failed. While the calculation is time-weighted so that recent activity counts more than later activity, statistics up to 48 hours old may be included.
pt: O cálculo de capacidade simplesmente percorre o perfil e estima quantos túneis o peer concordaria em participar em um determinado período de tempo. Para essa estimativa, ele analisa quantas solicitações de construção de túnel o peer aceitou, rejeitou e descartou, e quantos dos túneis acordados falharam posteriormente. Embora o cálculo seja ponderado pelo tempo para que a atividade recente conte mais do que a atividade posterior, estatísticas de até 48 horas podem ser incluídas.
tr: Kapasite hesaplaması basitçe profilden geçer ve eşin belirli bir zaman diliminde kaç tünele katılmayı kabul edeceğini öngörür. Bu öngörü için, eşin kaç tünel oluşturma isteğini kabul ettiğine, reddettiğine ve vazgeçtiğine ve daha sonra üzerinde uzlaşmaya varılan tünellerden kaçının başarısız olduğuna bakar. Hesaplama zaman ağırlıklı olarak yapılır. Yakın geçmişteki eylemler daha eski eylemlere göre daha ağırlıklıdır. 48 saate kadar olan istatistikler katılabilir.

source: Recognizing and avoiding unreliable and unreachable peers is critically important. Unfortunately, as the tunnel building and testing require the participation of several peers, it is difficult to positively identify the cause of a dropped build request or test failure. The router assigns a probability of failure to each of the peers, and uses that probability in the capacity calculation. Drops and test failures are weighted much higher than rejections.
pt: Reconhecer e evitar pares não confiáveis e inacessíveis é extremamente importante. Infelizmente, como a construção e o teste do túnel exigem a participação de vários pares, é difícil identificar positivamente a causa de uma solicitação de construção descartada ou falha de teste. O roteador atribui uma probabilidade de falha a cada um dos pares e usa essa probabilidade no cálculo de capacidade. Descartas e falhas de teste são ponderadas muito mais do que rejeições.
tr: Güvenilmez ve ulaşılamayan eşleri tanımak ve bunlardan kaçınmak kritik derecede önemlidir. Ne yazık ki, tünel oluşturma ve sınama birkaç eşin katılımını gerektirdiğinden, vazgeçilen bir oluşturma isteğinin ya da sınama hatasının nedenini kesin olarak belirlemek zordur. Yöneltici, eşlerin her birine bir arıza olasılığı atar ve bu olasılığı kapasite hesaplamasında kullanır. Vazgeçmeler ve sınama başarısızlıkları, reddetmelere göre ağırlıklıdır.

source: Peer organization
pt: Organização de pares
tr: Eş organizasyonu

source: As mentioned above, we drill through each peer's profile to come up with a few key calculations, and based upon those, we organize each peer into three groups - fast, high capacity, and standard.
pt: Conforme mencionado acima, analisamos o perfil de cada peer para chegar a alguns cálculos importantes e, com base neles, organizamos cada peer em três grupos - rápido, alta capacidade e padrão.
tr: Yukarıda bahsedildiği gibi, birkaç temel hesaplama yapmak için her bir eşin profilini inceleriz ve bunlara dayanarak, her bir eşi hızlı, yüksek kapasiteli ve standart olmak üzere üç gruba ayırırız.

source: The groupings are not mutually exclusive, nor are they unrelated:
pt: Os agrupamentos não são mutuamente exclusivos nem são independentes:
tr: Gruplamalar birbirini dışlamaz ya da ilgisiz değildir:

source: A peer is considered "high capacity" if its capacity calculation meets or exceeds the median of all peers.
pt: Um par é considerado de "alta capacidade" se seu cálculo de capacidade atende ou excede a mediana de todos os pares.
tr: Bir eşin kapasite hesaplaması tüm eşlerin medyan değerine eşit ya da büyükse "yüksek kapasiteli" olarak kabul edilir.

source: A peer is considered "fast" if they are already "high capacity" and their speed calculation meets or exceeds the median of all peers.
pt: Um peer é considerado "rápido" se já tiver "alta capacidade" e seu cálculo de velocidade atender ou exceder a mediana de todos os peers.
tr: Bir eş, zaten "yüksek kapasiteli" ise ve hız hesaplamaları tüm eşlerin medyan değerine eşit ya da büyükse "hızlı" olarak kabul edilir.

source: A peer is considered "standard" if it is not "high capacity"
pt: Um par é considerado "padrão" se não for de "alta capacidade"
tr: Bir eş, "yüksek kapasiteli" değilse "standart" olarak kabul edilir

source: These groupings are implemented in the router's <a href="%(url)s">ProfileOrganizer</a>.
pt: Esses agrupamentos são implementados no <a href="%(url)s">ProfileOrganizer</a> do roteador;
tr: Bu gruplamalar yönelticide <a href="%(url)s">ProfileOrganizer</a> tarafından uygulanır.

source: Group size limits
pt: Limites de tamanho do grupo
tr: Grup boyutu sınırları

source: The size of the groups may be limited.
pt: O tamanho dos grupos pode ser limitado.
tr: Grupların büyüklüğü sınırlı olabilir.

source: The fast group is limited to 30 peers. If there would be more, only the ones with the highest speed rating are placed in the group.
pt: O grupo rápido é limitado a 30 pares. Se houver mais, apenas aqueles com a maior classificação de velocidade serão colocados no grupo.
tr: Hızlı grup 30 eş ile sınırlıdır. Daha fazla olacaksa, yalnızca en yüksek hız derecesindekiler gruba yerleştirilir.

source: The high capacity group is limited to 75 peers (including the fast group) If there would be more, only the ones with the highest capacity rating are placed in the group.
pt: O grupo de alta capacidade é limitado a 75 pares (incluindo o grupo rápido) Se houver mais, apenas aqueles com a maior classificação de capacidade serão colocados no grupo.
tr: Yüksek kapasiteli grup 75 eşle sınırlıdır (hızlı grup dahil) Daha fazla olacaksa, yalnızca en yüksek kapasite derecesindekiler gruba yerleştirilir.

source: The standard group has no fixed limit, but is somewhat smaller than the number of RouterInfos stored in the local network database. On an active router in today's network, there may be about 1000 RouterInfos and 500 peer profiles (including those in the fast and high capacity groups)
pt: O grupo padrão não tem limite fixo, mas é um pouco menor que o número de RouterInfos armazenados no banco de dados da rede local. Em um roteador ativo na rede atual, pode haver cerca de 1000 RouterInfos e 500 perfis de pares (incluindo aqueles nos grupos de alta e rápida capacidade)
tr: Standart grubun sabit bir sınırı yoktur, ancak yerel "Ağ veri tabanı" (netDB) üzerinde depolanan "Yöneltici bilgileri" (RouterInfo) sayısından biraz daha küçüktür. Günümüz ağındaki etkin bir yönelticide, yaklaşık 1000 "Yöneltici bilgisi" (RouterInfo) ve 500 eş profil (hızlı ve yüksek kapasiteli gruplardakiler dahil) bulunabilir.

source: Recalculation and Stability
pt: Recálculo e Estabilidade
tr: Yeniden Hesaplama ve Kararlılık

source: Summaries are recalculated, and peers are resorted into groups, every 45 seconds.
pt: Os resumos são recalculados e os pares são reunidos em grupos a cada 45 segundos.
tr: Özetler yeniden hesaplanır ve eşler her 45 saniyede bir gruplara ayrılır.

source: The groups tend to be fairly stable, that is, there is not much "churn" in the rankings at each recalculation. Peers in the fast and high capacity groups get more tunnels build through them, which increases their speed and capacity ratings, which reinforces their presence in the group.
pt: Os grupos tendem a ser bastante estáveis, ou seja, não há muita "rotatividade" nas classificações a cada recálculo. Pares nos grupos rápido e de alta capacidade obtêm mais túneis construídos através deles, o que aumenta suas classificações de velocidade e capacidade, o que reforça sua presença no grupo.
tr: Gruplar oldukça kararlı olma eğilimindedir. Yani her yeniden hesaplamada sıralamada çok fazla "çalkalanma" yoktur. Hızlı ve yüksek kapasiteli gruplardaki eşler, içlerinde daha fazla tünel oluşturur. Bu da onların hız ve kapasite oranlarını artırır ve gruptaki varlıklarını güçlendirir.

source: The router selects peers from the above groups to build tunnels through.
pt: O roteador seleciona pares dos grupos acima para construir túneis.
tr: Yöneltici, tüneller oluşturmak için yukarıdaki gruplardan eşler seçer.

source: Peer Selection for Client Tunnels
pt: Seleção de pares para túneis de clientes
tr: İstemci Tünelleri için Eş Seçimi

source: Client tunnels are used for application traffic, such as for HTTP proxies and web servers.
pt: Os túneis de cliente são usados para tráfego de aplicativos, como proxies HTTP e servidores web.
tr: İstemci tünelleri, HTTP vekil sunucuları ve site sunucuları gibi uygulama trafiği için kullanılır.
