Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: If a blocklist is hosted at a central location with automatic updates the network is vulnerable to a <a href="#central">central resource attack</a>. Automatic subscription to a list gives the list provider the power to shut the i2p network down. Completely.
pt: Se uma lista de bloqueio for hospedada em um local central com atualizações automáticas a rede fica vulnerável a um <a href="#central">ataque de recurso central</a>. A assinatura automática de uma lista dá ao provedor da lista o poder de desligar a rede i2p. Completamente.
tr: Bir engelleme listesi otomatik güncellemelerle merkezi bir yerde barındırılıyorsa, ağ bir <a href="#central">merkezi kaynak saldırısına</a> karşı savunmasızdır. Bir listeye otomatik abone olunması, liste hizmeti sağlayıcısına i2p ağını kapatma gücü verir. Tamamen.

source: Currently, a default blocklist is distributed with our software, listing only the IPs of past DOS sources. There is no automatic update mechanism. Should a particular IP range implement serious attacks on the I2P network, we would have to ask people to update their blocklist manually through out-of-band mechanisms such as forums, blogs, etc.
pt: Atualmente, uma lista de bloqueio padrão é distribuída com nosso software, listando apenas os IPs de fontes DOS anteriores. Não há mecanismo de atualização automática. Caso um intervalo de IP específico implemente ataques sérios na rede I2P, teríamos que pedir às pessoas que atualizassem sua lista de bloqueio manualmente por meio de mecanismos fora de banda, como fóruns, blogs, etc.
tr: Şu anda, yazılımımızla birlikte yalnızca geçmiş DOS kaynaklarının IP adreslerini listeleyen varsayılan bir engelleme listesi dağıtılıyor. Otomatik güncelleme mekanizması yok. Belirli bir IP aralığı I2P ağına ciddi saldırılar uygularsa, insanlardan forumlar, bloglar gibi bant dışı mekanizmalar aracılığıyla engelleme listelerini el ile güncellemelerini istememiz gerekir.

source: Tunnel Routing
pt: Roteamento de Túnel
tr: Tünel Yöneltme

source: July 2011
pt: Julho de 2011
tr: 2011 Temmuz

source: This page contains an overview of I2P tunnel terminology and operation, with links to more technical pages, details, and specifications.
pt: Esta página contém uma visão geral da terminologia e operação do túnel I2P, com links para mais páginas técnicas, detalhes e especificações.
tr: Bu sayfada, daha teknik sayfalara, ayrıntılara ve özelliklere verilen bağlantılarla birlikte I2P tünel terminolojisine ve çalışma şekline genel bir bakış bulunur.

source: As briefly explained in the <a href="%(intro)s">introduction</a>, I2P builds virtual "tunnels" - temporary and unidirectional paths through a sequence of routers. These tunnels are classified as either inbound tunnels (where everything given to it goes towards the creator of the tunnel) or outbound tunnels (where the tunnel creator shoves messages away from them). When Alice wants to send a message to Bob, she will (typically) send it out one of her existing outbound tunnels with instructions for that tunnel's endpoint to forward it to the gateway router for one of Bob's current inbound tunnels, which in turn passes it to Bob.
pt: Conforme explicado brevemente na introdução <a href="%(intro)s"></a>, o I2P constrói "túneis" virtuais - caminhos temporários e unidirecionais por meio de uma sequência de roteadores. Esses túneis são classificados como túneis de entrada (onde tudo dado a ele vai para o criador do túnel) ou túneis de saída (onde o criador do túnel empurra as mensagens para longe deles). Quando Alice quer enviar uma mensagem para Bob, ela (normalmente) a enviará por um de seus túneis de saída existentes com instruções para o ponto final desse túnel encaminhá-la ao roteador de gateway para um dos túneis de entrada atuais de Bob, que por sua vez a passa para Bob.
tr: <a href="%(intro)s">Giriş</a> bölümünde kısaca açıklandığı gibi, I2P, bir dizi yöneltici üzerinden geçici ve tek yönlü yollar olan sanal "tüneller" oluşturur. Bu tüneller, geliş tünelleri (kendisine verilen her şeyin tüneli oluşturan kişiye doğru gittiği) veya gidiş tünelleri (tünel oluşturucunun iletilerini gönderen) olarak sınıflandırılır. Alice Bob kullanıcısına bir ileti göndermek istediğinde, onu (tipik olarak) var olan gidiş tünellerinden birine gönderir ve o tünelin uç noktasının iletiyi Bob kullanıcısının var olan geliş tünellerinden birinin ağ geçidi yönelticisine iletmesi için yönergeler vererek aktarır.

source: Alice connecting through her outbound tunnel to Bob via his inbound tunnel
pt: Alice conectando-se através de seu túnel de saída a Bob através de seu túnel de entrada
tr: Alice, gidiş tünelini kullanarak, Bob'un geliş tüneli üzerinden bağlantı kurar

source: Outbound Gateway
pt: Gateway de saída
tr: Çıkış Ağ Geçidi

source: Outbound Participant
pt: Participante de saída
tr: Çıkış Katılımcısı

source: Outbound Endpoint
pt: Ponto de saída
tr: Gidiş Uç Noktası

source: Inbound Gateway
pt: Ponto de entrada
tr: Geliş Ağ Geçidi

source: Inbound Participant
pt: Participante de entrada
tr: Geliş Katılımcısı

source: Inbound Endpoint
pt: Ponto de extremidade de entrada
tr: Geliş Uç Noktası

source: Tunnel vocabulary
pt: Vocabulário do túnel
tr: Tünel sözlüğü

source: <b>Tunnel gateway</b> - the first router in a tunnel. For inbound tunnels, this is the one mentioned in the LeaseSet published in the <a href="%(netdb)s">network database</a>. For outbound tunnels, the gateway is the originating router. (e.g. both A and D above)
pt: <b>Gateway de túnel</b> - o primeiro roteador em um túnel. Para túneis de entrada, este é o mencionado no LeaseSet publicado no banco de dados de rede <a href="%(netdb)s"></a>. Para túneis de saída, o gateway é o roteador de origem. (por exemplo, A e D acima)
tr: <b>Tünel ağ geçidi.</b> Bir tüneldeki ilk yöneltici. Geliş tünelleri için, <a href="%(netdb)s">"Ağ veri tabanında" (NetDB)</a> yayınlanan "Kiralama kümesinde" (LeaseSet) anılan yönelticidir. Gidiş tünelleri için ağ geçidi, kaynak yönelticidir (yukarıdaki A ve D gibi).

source: <b>Tunnel endpoint</b> - the last router in a tunnel. (e.g. both C and F above)
pt: <b>Ponto final do túnel</b> - o último roteador em um túnel. (por exemplo, C e F acima)
tr: <b>Tünel uç noktası.</b> Bir tüneldeki son yöneltici. (yukarıdaki C ve F gibi)

source: <b>Tunnel participant</b> - all routers in a tunnel except for the gateway or endpoint (e.g. both B and E above)
pt: <b>Participante do túnel</b> - todos os roteadores em um túnel, exceto o gateway ou o ponto final (por exemplo, B e E acima)
tr: <b>Tünel katılımcısı.</b> Ağ geçidi veya uç nokta dışında bir tüneldeki tüm yönelticiler (yukarıdaki B ve E gibi)

source: <b>n-Hop tunnel</b> - a tunnel with a specific number of inter-router jumps, e.g.:
pt: <b>túnel n-Hop</b> - um túnel com um número específico de saltos entre roteadores, por exemplo:
tr: <b>n sıçramalı tünel.</b>Belirli sayıda yönelticiler arası sıçrama içeren bir tünel. Örnek:

source: <b>0-hop tunnel</b> - a tunnel where the gateway is also the endpoint
pt: <b>túnel de 0 saltos</b> - um túnel onde o gateway também é o ponto final
tr: <b>0 sıçramalı tünel.</b> Ağ geçidinin de bir uç nokta olduğu bir tünel

source: <b>1-hop tunnel</b> - a tunnel where the gateway talks directly to the endpoint
pt: <b>Túnel de 1 salto</b> - um túnel onde o gateway fala diretamente com o ponto final
tr: <b>1 sıçramalı tünel.</b> Bir ağ geçidinin doğrudan uç nokta ile görüştüğü bir tünel

source: <b>2-(or more)-hop tunnel</b> - a tunnel where there is at least one intermediate tunnel participant. (the above diagram includes two 2-hop tunnels - one outbound from Alice, one inbound to Bob)
pt: <b>túnel de 2 (ou mais) saltos</b> - um túnel onde há pelo menos um participante intermediário do túnel . (o diagrama acima inclui dois túneis de 2 saltos - um saindo de Alice, um entrando em Bob)
tr: <b>2 (ya da daha fazla) sıçramalı tünel.</b> En az bir ara tünel katılımcısının bulunduğu bir tünel (yukarıdaki şekilde biri Alice'den giden, biri Bob'a gelen iki tane 2 sıçramalı tünel bulunuyor)

source: <b>Tunnel ID</b> - A <a href="%(commonstructures)s#type_TunnelId">4 byte integer</a> different for each hop in a tunnel, and unique among all tunnels on a router. Chosen randomly by the tunnel creator.
pt: <b>ID do túnel</b> - Um <a href="%(commonstructures)s#type_TunnelId">inteiro de 4 bytes</a> diferente para cada salto em um túnel e único entre todos os túneis em um roteador. Escolhido aleatoriamente pelo criador do túnel.
tr: <b>Tünel kodu.</b> Bir tüneldeki her sıçrama için farklı ve yöneltciideki tüm tüneller arasında benzersiz olan <a href="%(commonstructures)s#type_TunnelId">4 baytlık bir tamsayı</a>. Tünel oluşturucu tarafından rastgele seçilir.

source: Tunnel Build Information
pt: Informações sobre a construção do túnel
tr: Tünel Oluşturma Bilgileri

source: Routers performing the three roles (gateway, participant, endpoint) are given different pieces of data in the initial <a href="%(tunnelcreation)s">Tunnel Build Message</a> to accomplish their tasks:
pt: Os roteadores que desempenham as três funções (gateway, participante, ponto de extremidade) recebem diferentes pedaços de dados na <a href="%(tunnelcreation)s">Mensagem de construção de túnel inicial</a> para realizar suas tarefas:
tr: Üç rolü (ağ geçidi, katılımcı, uç nokta) gerçekleştiren yönelticilere, görevlerini yerine getirmeleri için ilk <a href="%(tunnelcreation)s">Tünel oluşturma iletisinde</a> farklı veri parçaları iletilir:

source: The tunnel gateway gets:
pt: O gateway do túnel obtém:
tr: Tünel ağ geçidine şunlar iletilir:

source: <b>tunnel encryption key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for encrypting messages and instructions to the next hop
pt: <b>chave de criptografia de túnel</b> - uma <a href="%(commonstructures)s#type_SessionKey">chave privada AES</a> para criptografar mensagens e instruções para o próximo salto
tr: <b>Tünel şifreleme anahtarı</b>. Sonraki sıçramaya gönderilen iletileri ve yönergeleri şifrelemek için kullanılan <a href="%(commonstructures)s#type_SessionKey">Kişisel AES anahtarı </a>

source: <b>tunnel IV key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for double-encrypting the IV to the next hop
pt: <b>chave IV do túnel</b> - uma <a href="%(commonstructures)s#type_SessionKey">chave privada AES</a> para criptografia dupla do IV para o próximo salto
tr: <b>Tünel "Başlatma vektörü" (IV) anahtarı</b>. Sonraki sıçramaya çift "Başlatma vektörü" (IV) şifrelemesi için <a href="%(commonstructures)s#type_SessionKey">Kişisel AES anahtarı</a>

source: <b>reply key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES public key</a> for encrypting the reply to the tunnel build request
pt: <b>chave de resposta</b> - uma <a href="%(commonstructures)s#type_SessionKey">chave pública AES</a> para criptografar a resposta à solicitação de construção do túnel
tr: <b>Yanıt anahtarı</b>. Tünel oluşturma isteğinin şifrelenmesi için <a href="%(commonstructures)s#type_SessionKey">Herkese açık AES anahtarı</a>

source: <b>reply IV</b> - the IV for encrypting the reply to the tunnel build request
pt: <b>resposta IV</b> - o IV para criptografar a resposta à solicitação de construção do túnel
tr: <b>Yanıt IV</b>. Tünel oluşturma isteğinin yanıtını şifreleyen IV

source: <b>tunnel id</b> - 4 byte integer (inbound gateways only)
pt: <b>id do túnel</b> - inteiro de 4 bytes (somente gateways de entrada)
tr: <b>Tünel kodu</b>. 4 bayt tamsayı (yalnızca geliş ağ geçitleri için)

source: <b>next hop</b> - what router is the next one in the path (unless this is a 0-hop tunnel, and the gateway is also the endpoint)
pt: <b>próximo salto</b> - qual roteador é o próximo no caminho (a menos que este seja um túnel de 0 saltos e o gateway também seja o ponto final)
tr: <b>Sonraki sıçrama</b>. Yoldaki bir sonraki yönelticinin hangisi olduğu (bu bir 0 sıçramalı tünel değilse ve ağ geçidi aynı zamanda uç nokta değilse)

source: <b>next tunnel id</b> - The tunnel ID on the next hop
pt: <b>próximo id do túnel</b> - O ID do túnel no próximo salto
tr: <b>Sonraki tünel kodu</b>. Sonraki sıçramanın tünel kodu

source: All intermediate tunnel participants get:
pt: Todos os participantes do túnel intermediário recebem:
tr: Tüm ara tünel katılımcılarına şunlar iletilir:

source: <b>tunnel id</b> - 4 byte integer
pt: <b>id do túnel</b> - inteiro de 4 bytes
tr: <b>Tünel kodu</b>. 4 bayt tamsayı

source: <b>next hop</b> - what router is the next one in the path
pt: <b>próximo salto</b> - qual roteador é o próximo no caminho
tr: <b>Sonraki sıçrama</b>. Yoldaki bir sonraki yönelticinin hangisi olduğu

source: The tunnel endpoint gets:
pt: O ponto final do túnel obtém:
tr: Tünel uç noktasına şunlar iletilir:

source: <b>tunnel encryption key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for encrypting messages and instructions to the the endpoint (itself)
pt: <b>chave de criptografia de túnel</b> - uma <a href="%(commonstructures)s#type_SessionKey">chave privada AES</a> para criptografar mensagens e instruções para o ponto final (ele mesmo)
tr: <b>Tünel şifreleme anahtarı</b>. Uç noktaya (kendisi) gönderilen iletileri ve yönergeleri şifrelemek için kullanılan <a href="%(commonstructures)s#type_SessionKey">Kişisel AES anahtarı </a>

source: <b>tunnel IV key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for double-encrypting the IV to the endpoint (itself)
pt: <b>chave IV do túnel</b> - uma <a href="%(commonstructures)s#type_SessionKey">chave privada AES</a> para criptografia dupla do IV para o ponto final (ele mesmo)
tr: <b>Tünel "Başlatma vektörü" (IV) anahtarı</b>. Uç noktaya (kendisine) çift "Başlatma vektörü" (IV) şifrelemesi için <a href="%(commonstructures)s#type_SessionKey">Kişisel AES anahtarı</a>

source: <b>reply key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES public key</a> for encrypting the reply to the tunnel build request (outbound endpoints only)
pt: <b>chave de resposta</b> - uma <a href="%(commonstructures)s#type_SessionKey">chave pública AES</a> para criptografar a resposta à solicitação de construção do túnel (somente endpoints de saída)
tr: <b>Yanıt anahtarı</b>. Tünel oluşturma isteğinin şifrelenmesi için <a href="%(commonstructures)s#type_SessionKey">Herkese açık AES anahtarı</a> (yalnızca gidiş uç noktaları için)

source: <b>reply IV</b> - the IV for encrypting the reply to the tunnel build request (outbound endpoints only)
pt: <b>resposta IV</b> - o IV para criptografar a resposta à solicitação de construção do túnel (somente endpoints de saída)
tr: <b>Yanıt IV</b>. Tünel oluşturma isteğinin yanıtını şifreleyen IV (yalnızca gidiş uç noktaları için)

source: <b>tunnel id</b> - 4 byte integer (outbound endpoints only)
pt: <b>id do túnel</b> - inteiro de 4 bytes (somente pontos de extremidade de saída)
tr: <b>Tünel kodu</b>. 4 bayt tamsayı (yalnızca gidiş uç noktaları için)

source: <b>reply router</b> - the inbound gateway of the tunnel to send the reply through (outbound endpoints only)
pt: <b>roteador de resposta</b> - o gateway de entrada do túnel para enviar a resposta (somente pontos de extremidade de saída)
tr: <b>Yanıt yönelticisi</b>. Yanıtın gönderileceği tünelin geliş ağ geçidi (yalnızca gidiş uç noktaları için)

source: <b>reply tunnel id</b> - The tunnel ID of the reply router (outbound endpoints only)
pt: <b>ID do túnel de resposta</b> - O ID do túnel do roteador de resposta (somente pontos de extremidade de saída)
tr: <b>Yanıt tüneli kodu</b>. Yanıt yönelticisinin tünel kimliği (yalnızca gidiş uç noktaları için)

source: Details are in the <a href="%(tunnelcreation)s">tunnel creation specification</a>.
pt: Os detalhes estão na especificação de criação de túnel <a href="%(tunnelcreation)s"></a>.
tr: Ayrıntılı bilgi almak için <a href="%(tunnelcreation)s">tünel oluşturma teknik özellikleri</a> bölümüne bakabilirsiniz.

source: Tunnel pooling
pt: Túnel de agrupamento
tr: Tünel havuzu

source: Several tunnels for a particular purpose may be grouped into a "tunnel pool", as described in the <a href="%(tunnelimpl)s#tunnel.pooling">tunnel specification</a>. This provides redundancy and additional bandwidth. The pools used by the router itself are called "exploratory tunnels". The pools used by applications are called "client tunnels".
pt: Vários túneis para uma finalidade específica podem ser agrupados em um "pool de túneis", conforme descrito na especificação de túneis <a href="%(tunnelimpl)s#tunnel.pooling"></a>. Isso fornece redundância e largura de banda adicional. Os pools usados pelo próprio roteador são chamados de "túneis exploratórios". Os pools usados por aplicativos são chamados de "túneis de cliente".
tr: Belirli bir amaç için birkaç tünel, <a href="%(tunnelimpl)s#tunnel.pooling">tünel teknik özellikleri</a> bölümünde açıklandığı gibi bir "tünel havuzu" olarak gruplandırılabilir. Bu özellik, yedeklilik ve ek bant genişliği sağlar. Yönelticinin kendisi tarafından kullanılan havuzlar "keşif tünelleri" olarak adlandırılır. Uygulamaların kullandığı havuzlar "istemci tünelleri" olarak adlandırılır.

source: Tunnel length
pt: Comprimento do túnel
tr: Tünel uzunluğu

source: As mentioned above, each client requests that their router provide tunnels to include at least a certain number of hops. The decision as to how many routers to have in one's outbound and inbound tunnels has an important effect upon the latency, throughput, reliability, and anonymity provided by I2P - the more peers that messages have to go through, the longer it takes to get there and the more likely that one of those routers will fail prematurely. The less routers in a tunnel, the easier it is for an adversary to mount traffic analysis attacks and pierce someone's anonymity. Tunnel lengths are specified by clients via <a href="%(i2cp)s#options">I2CP options</a>. The maximum number of hops in a tunnel is 7.
pt: Conforme mencionado acima, cada cliente solicita que seu roteador forneça túneis para incluir pelo menos um certo número de saltos. A decisão sobre quantos roteadores ter nos túneis de entrada e saída tem um efeito importante sobre a latência, taxa de transferência, confiabilidade e anonimato fornecidos pelo I2P - quanto mais pares as mensagens têm que passar, mais tempo demora para chegar lá e mais provável que um desses roteadores falhe prematuramente. Quanto menos roteadores em um túnel, mais fácil é para um adversário montar ataques de análise de tráfego e furar o anonimato de alguém. Os comprimentos dos túneis são especificados pelos clientes por meio de <a href="%(i2cp)s#options">opções I2CP</a>. O número máximo de saltos em um túnel é 7.
tr: Yukarıda bahsedildiği gibi, her istemci, yönelticisinin en azından belirli sayıda sıçrama içerecek şekilde tüneller sağlamasını ister. Bir kişinin gidiş ve geliş tünellerinde kaç tane yönelticiye sahip olacağına ilişkin karar, I2P tarafından sağlanan gecikme, aktarım hızı, güvenilirlik ve anonimlik üzerinde önemli bir etkiye sahiptir. İletiler ne kadar çok eşten geçerse, oraya ulaşmak o kadar uzun sürer ve bu yönelticilerden birinin zamanından önce başarısız olması daha olasıdır. Bir tünelde ne kadar az yöneltici varsa, bir saldırganın trafik analizi saldırıları gerçekleştirmesi ve birinin anonimliğini delmesi o kadar kolay olur. Tünel uzunlukları istemciler tarafından <a href="%(i2cp)s#options">I2CP seçenekleri</a> ile belirlenir. Bir tünelde en fazla 7 sıçrama olabilir.

source: 0-hop tunnels
pt: túneis de 0-pulo
tr: 0 sıçramalı tüneller

source: With no remote routers in a tunnel, the user has very basic plausible deniability (since no one knows for sure that the peer that sent them the message wasn't simply just forwarding it on as part of the tunnel). However, it would be fairly easy to mount a statistical analysis attack and notice that messages targeting a specific destination are always sent through a single gateway. Statistical analysis against outbound 0-hop tunnels are more complex, but could show similar information (though would be slightly harder to mount).
pt: Sem roteadores remotos em um túnel, o usuário tem uma negação plausível muito básica (já que ninguém sabe ao certo se o peer que enviou a mensagem não estava simplesmente encaminhando-a como parte do túnel). No entanto, seria bastante fácil montar um ataque de análise estatística e perceber que mensagens direcionadas a um destino específico são sempre enviadas por um único gateway. A análise estatística contra túneis de saída de 0 saltos é mais complexa, mas poderia mostrar informações semelhantes (embora fosse um pouco mais difícil de montar).
tr: Bir tünelde uzak yönelticiler olmadığında, kullanıcının çok temel bir makul reddedilebilirliği vardır (çünkü kimse onlara ileti gönderen eşin yalnızca tünelin bir parçası olarak iletmediğine emin değildir). Ancak, istatistiksel bir analiz saldırısı başlatmak ve belirli bir hedefe yönelik iletilerin her zaman tek bir ağ geçidi üzerinden gönderildiğini fark etmek oldukça kolay olacaktır. 0 sıçramalı gidiş tünellerinde istatistiksel analiz yapmak daha karmaşıktır. Ancak benzer bilgileri gösterebilir (ancak bir araya getirmek biraz daha zor olacaktır).

source: 1-hop tunnels
pt: túneis de 1-pulo
tr: 1 sıçramalı tüneller

source: With only one remote router in a tunnel, the user has both plausible deniability and basic anonymity, as long as they are not up against an internal adversary (as described on <a href="%(threatmodel)s">threat model</a>). However, if the adversary ran a sufficient number of routers such that the single remote router in the tunnel is often one of those compromised ones, they would be able to mount the above statistical traffic analysis attack.
pt: Com apenas um roteador remoto em um túnel, o usuário tem tanto uma negação plausível de quanto um anonimato básico, desde que não esteja enfrentando um adversário interno de (conforme descrito no modelo de ameaça de <a href="%(threatmodel)s"></a>). No entanto, se o adversário executasse um número suficiente de roteadores de modo que o único roteador remoto de no túnel fosse frequentemente um desses comprometidos, ele seria capaz de montar o ataque de análise estatística de tráfego acima.
tr: Tünelde yalnızca bir uzak yöneltici ile kullanıcı, bir iç saldırgana karşı olmadığı sürece (<a href="%(threatmodel)s"> tehdit modeli</a> bölümünde açıklandığı gibi) hem makul reddedilebilirliğe hem de temel anonimliğe sahiptir. Ancak, saldırgan, tüneldeki tek uzak yönelticinin genellikle güvenliği ihlal edilenlerden biri olmasını sağlamaya yetecek kadar sayıda yöneltici işletiyorsa, yukarıdaki istatistiksel trafik analizi saldırısını gerçekleştirebilir.

source: 2-hop tunnels
pt: túnel de 2-pulos
tr: 2 sıçramalı tüneller

source: With two or more remote routers in a tunnel, the costs of mounting the traffic analysis attack increases, since many remote routers would have to be compromised to mount it.
pt: Com dois ou mais roteadores remotos, o custo da montagem de ataque de análise de tráfego aumenta, uma vez que vários roteadores remotos devem ser comprometidos para montar isto.
tr: Bir tünelde iki ya da daha fazla uzak yöneltici olduğunda, trafik analizi saldırısını bir araya getirme maliyetleri artar. Bu saldırıyı yapabilmek için birçok uzak yönelticisinin güvenliğinin ihlal edilmesi gerekir.

source: 3-hop (or more) tunnels
pt: túnel de 3-nós (ou mais)
tr: 3 (ya da daha fazla) sıçramalı tüneller
