Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: If Alice receives Bob's PeerTest message and both of Charlie's PeerTest messages but the enclosed IP and port numbers in Bob's and Charlie's second messages don't match, she knows that she is behind a symmetric NAT, rewriting all of her outbound packets with different 'from' ports for each peer contacted. She will need to explicitly forward a port and always have that port exposed for remote connectivity, ignoring further port discovery.
pt: Se Alice receber a mensagem PeerTest de Bob e ambas as mensagens PeerTest de Charlie, mas os números de IP e porta incluídos nas mensagens de Bob e Charlie não corresponderem, ela sabe que está atrás de um NAT simétrico, reescrevendo todos os seus pacotes de saída com portas 'de' diferentes para cada peer contatado. Ela precisará encaminhar explicitamente uma porta e sempre ter essa porta exposta para conectividade remota, ignorando a descoberta de portas posteriores.
tr: Alice, Bob ve Charli'den iki eş sınaması (PeerTest) iletisini de alırsa, ancak Bob'un ve Charlie'nin ikinci iletilerindeki ekteki IP adresi ve bağlantı noktası numaraları eşleşmiyorsa, Alice simetrik bir NAT arkasında olduğunu ve tüm giden paketlerinin iletişim kurduğu her eşe farklı 'kaynak' bağlantı noktalarından gönderilecek şekilde yeniden yazdığını anlar. Bir bağlantı noktasını açıkça iletmesi ve daha fazla bağlantı noktası keşfini göz ardı ederek bu bağlantı noktasını her zaman uzaktan bağlantı için açıkta tutması gerekir.

source: If Alice receives Charlie's first message but not his second, she will retransmit her PeerTest message to Charlie up to a certain number of times, but if no response is received she knows that Charlie is either confused or no longer online.
pt: Se Alice receber a primeira mensagem de Charlie, mas não a segunda, ela retransmitirá sua mensagem PeerTest para Charlie até um certo número de vezes, mas se nenhuma resposta for recebida, ela saberá que Charlie está confuso ou não está mais online.
tr: Alice, Charlie'nin ilk iletisini alır ancak ikinci iletisini almazsa, eş sınaması (PeerTest) iletisini belirli bir sayıya ulaşana kadar Charlie'ye yeniden iletir. Yanıt alamazsa, Charlie'nin kafasının karıştığını veya artık çevrimiçi olmadığını bilir.

source: Alice should choose Bob arbitrarily from known peers who seem to be capable of participating in peer tests. Bob in turn should choose Charlie arbitrarily from peers that he knows who seem to be capable of participating in peer tests and who are on a different IP from both Bob and Alice. If the first error condition occurs (Alice doesn't get PeerTest messages from Bob), Alice may decide to designate a new peer as Bob and try again with a different nonce.
pt: Alice deve escolher Bob arbitrariamente entre pares conhecidos que parecem ser capazes de participar de testes de pares. Bob, por sua vez, deve escolher Charlie arbitrariamente entre pares que ele conhece que parecem ser capazes de participar de testes de pares e que estão em um IP diferente de Bob e Alice. Se a primeira condição de erro ocorrer (Alice não recebe mensagens PeerTest de Bob), Alice pode decidir designar um novo par como Bob e tentar novamente com um nonce diferente.
tr: Alice, Bob'u eş sınamalarına katılabilecek gibi görünen tanıdık eşleri arasından keyfi olarak seçmelidir. Bob sırayla Charlie'yi eş sınamalarına katılabilecek gibi görünen ve hem Bob hem de Alice'den farklı bir IP adresinde bulunan eşleri arasından keyfi olarak seçmelidir. İlk hata koşulu oluşursa (Alice, Bob'dan eş sınaması (PeerTest) iletilerini almaz), Alice, Bob olarak yeni bir eş atamaya ve farklı bir belirteç (nonce) ile yeniden denemeye karar verebilir.

source: Alice's introduction key is included in all of the PeerTest messages so that Charlie can contact her without knowing any additional information. As of release 0.9.15, Alice must have an established session with Bob, to prevent spoofing attacks. Alice must not have an established session with Charlie for the peer test to be valid. Alice may go on to establish a session with Charlie, but it is not required.
pt: A chave de introdução de Alice está incluída em todas as mensagens do PeerTest para que Charlie possa contatá-la sem saber nenhuma informação adicional. A partir da versão 0.9.15, Alice deve ter uma sessão estabelecida com Bob, para evitar ataques de falsificação. Alice não deve ter uma sessão estabelecida com Charlie para que o teste de pares seja válido. Alice pode estabelecer uma sessão com Charlie, mas isso não é obrigatório.
tr: Alice'in tanıtım anahtarı, Charlie'nin herhangi bir ek bilgi bilmeden onunla iletişim kurabilmesi için tüm "Eş sınaması" (PeerTest) iletilerinde bulunur. <br>0.9.15 sürümünden başlayarak, sızdırma saldırılarını önlemek için Alice'in Bob ile kurulmuş bir oturumu olması gerekir.<br>Eş sınamasının geçerli olması için Alice'in Charlie ile kurulmuş bir oturumu olmamalıdır.<br>Alice, Charlie ile bir oturum kurabilir, ancak bu şart değildir.

source: Transmission window, ACKs and Retransmissions
pt: Janela de transmissão, ACKs e retransmissões
tr: İletim penceresi, onaylar (ACK) ve yeniden iletimler

source: The DATA message may contain ACKs of full messages and partial ACKs of individual fragments of a message. See the data message section of <a href="%(ssuspec)s">the protocol specification page</a> for details.
pt: A mensagem DATA pode conter ACKs de mensagens completas e ACKs parciais de fragmentos individuais de uma mensagem. Veja a seção de mensagem de dados de <a href="%(ssuspec)s">a página de especificação do protocolo</a> para detalhes.
tr: DATA iletisinde, tam iletilerin onayları (ACK) ve bir iletinin bireysel parçalarının onay bölümleri bulunabilir. Ayrıntılu bilgi almak için <a href="%(ssuspec)s">iletişim kuralı teknik özellikleri sayfası</a> veri iletisi bölümüne bakabilirsiniz.

source: The details of windowing, ACK, and retransmission strategies are not specified here. See the Java code for the current implementation. During the establishment phase, and for peer testing, routers should implement exponential backoff for retransmission. For an established connection, routers should implement an adjustable transmission window, RTT estimate and timeout, similar to TCP or <a href="%(streaming)s">streaming</a>. See the code for initial, min and max parameters.
pt: Os detalhes das estratégias de janelamento, ACK e retransmissão não são especificados aqui. Veja o código Java para a implementação atual. Durante a fase de estabelecimento, e para testes de pares, os roteadores devem implementar o backoff exponencial para retransmissão. Para uma conexão estabelecida, os roteadores devem implementar uma janela de transmissão ajustável, estimativa de RTT e tempo limite, semelhante ao TCP ou <a href="%(streaming)s">streaming</a>. Veja o código para parâmetros inicial, mínimo e máximo.
tr: Pencere kullanımı, onay (ACK) ve yeniden iletim stratejilerinin ayrıntıları burada belirtilmemiştir. Geçerli uygulama için Java koduna bakabilirsiniz. Kuruluş aşamasında ve eş sınaması için yönelticiler yeniden iletim için üstel geri çekilme uygulamalıdır. Kurulan bir bağlantı için yönelticiler, TCP veya <a href="%(streaming)s">streaming</a> benzeri ayarlanabilir bir iletim penceresi, RTT öngörüsü ve zaman aşımı uygulamalıdır. Parametrelerin başlangıçtaki, en küçük ve en büyük değerleri için koda bakın.

source: Security
pt: Segurança
tr: Güvenlik

source: UDP source addresses may, of course, be spoofed. Additionally, the IPs and ports contained inside specific SSU messages (RelayRequest, RelayResponse, RelayIntro, PeerTest) may not be legitimate. Also, certain actions and responses may need to be rate-limited.
pt: Endereços de origem UDP podem, é claro, ser falsificados. Além disso, os IPs e portas contidos em mensagens SSU específicas (RelayRequest, RelayResponse, RelayIntro, PeerTest) podem não ser legítimos. Além disso, certas ações e respostas podem precisar de limitação de taxa.
tr: UDP kaynak adresleri tabi ki sahte olabilir. Ayrıca, belirli SSU iletilerinde (RelayRequest, RelayResponse, RelayIntro, PeerTest) bulunan IP adresleri ve bağlantı noktaları doğru olmayabilir. Bunun yanında belirli işlemler ve yanıtlar için hız sınırlandırması uygulanması gerekebilir.

source: The details of validation are not specified here. Implementers should add defenses where appropriate.
pt: Os detalhes da validação não são especificados aqui. Os implementadores devem adicionar defesas quando apropriado.
tr: Doğrulamanın ayrıntıları burada açıklanmamıştır. Uygulayıcılar uygun yerlere savunmalar eklemelidir.

source: Peer capabilities
pt: Capacidades do Par
tr: Eş yetenekleri

source: If the peer address contains the 'B' capability, that means they are willing and able to participate in peer tests as a 'Bob' or 'Charlie'.
pt: Se o endereço do par contiver a capacidade 'B', isso significa que eles estão dispostos e são capazes de participar de testes de pares como um 'Bob' ou 'Charlie'.
tr: Eş adresinde 'B' yeteneği bulunuyorsa, bu, eş sınamalarına 'Bob' veya 'Charlie' olarak katılmaya istekli oldukları ve katılabilecekleri anlamına gelir.

source: Analysis of current SSU performance, including assessment of window size adjustment and other parameters, and adjustment of the protocol implementation to improve performance, is a topic for future work.
pt: A análise do desempenho atual do SSU, incluindo a avaliação do ajuste do tamanho da janela e outros parâmetros, e o ajuste da implementação do protocolo para melhorar o desempenho , é um tópico para trabalho futuro.
tr: Pencere boyutu ayarının ve diğer parametrelerin değerlendirilmesi ve başarımı artırmak için iletişim kuralı uygulamasının ayarlanması ile birlikte mevcut SSU başarımının analizi, gelecekte yapılabilecek bir çalışma konusudur.

source: The current implementation repeatedly sends acknowledgments for the same packets, which unnecessarily increases overhead.
pt: A implementação atual envia repetidamente confirmações para os mesmos pacotes, o que aumenta desnecessariamente a sobrecarga.
tr: Geçerli uygulama aynı paketler için yeniden ve yeniden onay gönderir. Bu durum yükü gereksiz yere artırır.

source: The default small MTU value of 620 should be analyzed and possibly increased. The current MTU adjustment strategy should be evaluated. Does a streaming lib 1730-byte packet fit in 3 small SSU packets? Probably not.
pt: O valor padrão de MTU pequeno de 620 deve ser analisado e possivelmente aumentado. A estratégia atual de ajuste de MTU deve ser avaliada. Um pacote de 1730 bytes de streaming lib cabe em 3 pacotes SSU pequenos? Provavelmente não.
tr: Varsayılan küçük MTU değeri olan 620 analiz edilmeli ve büyük olasılıkla artırılmalıdır. Geçerli MTU ayarlama stratejisi değerlendirilmelidir. 1730 baytlık bir akış lib paketi 3 küçük SSU paketine sığar mı? Büyük olasılıkla hayır.

source: The protocol should be extended to exchange MTUs during the setup.
pt: O protocolo deve ser estendido para trocar MTUs durante a configuração.
tr: İletişim kuralı, kurulum sırasında MTU değerlerini alıp verecek şekilde geliştirilmelidir.

source: Rekeying is currently unimplemented and will never be.
pt: A recodificação não está implementada no momento e nunca estará.
tr: Yeniden anahtarlama şu anda uygulanmıyor ve asla uygulanamayacak.

source: The potential use of the 'challenge' fields in RelayIntro and RelayResponse, and use of the padding field in SessionRequest and SessionCreated, is undocumented.
pt: O uso potencial dos campos 'challenge' em RelayIntro e RelayResponse, e o uso do campo padding em SessionRequest e SessionCreated, não são documentados.
tr: Yöneltici girişi (RelayIntro) ve yöneltici yanıtı (RelayResponse) iletilerindeki 'soru (challenge)' alanlarının olası kullanımı ve oturum isteği (SessionRequest) ve oturum oluşturuldu (SessionCreated) iletilerindeki dolgu ekleme (padding) alanının kullanımı belgelenmemiştir.

source: A set of fixed packet sizes may be appropriate to further hide the data fragmentation to external adversaries, but the tunnel, garlic, and end to end padding should be sufficient for most needs until then.
pt: Um conjunto de tamanhos de pacotes fixos pode ser apropriado para ocultar ainda mais a fragmentação de dados para adversários externos, mas o túnel, o alho e o preenchimento de ponta a ponta devem ser suficientes para a maioria das necessidades até então.
tr: Verilerin parçalanmasını dış saldırganlardan daha fazla gizlemek için bir dizi sabit paket boyutu uygun olabilir. Ancak tünel, Garlic ve uçtan uca dolgu ekleme o zamana kadar çoğu gereksinim için yeterli olmalıdır.

source: Signed-on times in SessionCreated and SessionConfirmed appear to be unused or unverified.
pt: Os horários de login em SessionCreated e SessionConfirmed parecem não ser utilizados ou não foram verificados.
tr: Oturum oluşturuldu (SessionCreated) ve oturum onaylandı (SessionConfirmed) iletilerinde oturum açma süreleri kullanılmamış veya doğrulanmamış görünüyor.

source: Implementation Diagram
pt: Diagrama de Implementação
tr: Uygulama Şeması

source: This diagram should accurately reflect the current implementation, however there may be small differences.
pt: Este diagrama deve refletir com precisão a implementação atual, no entanto pode haver pequenas diferenças.
tr: Bu şema, geçerli uygulamayı doğru bir şekilde yansıtıyor olmalı, ancak küçük farklılıklar olabilir.

source: Now on the SSU specification page
pt: Agora na página de especificações do SSU
tr: Şimdi SSU teknik özellikleri sayfasında

source: Tunnel Implementation
pt: Implementação do Túnel
tr: Tünel Uygulaması

source: This page documents the current tunnel implementation.
pt: Esta página documenta a implementação atual do túnel.
tr: Bu sayfada geçerli tünel uygulaması açıklanmaktadır.

source: Tunnel overview
pt: Visão geral do túnel
tr: Tünel özeti

source: Within I2P, messages are passed in one direction through a virtual tunnel of peers, using whatever means are available to pass the message on to the next hop. Messages arrive at the tunnel's </i>gateway</i>, get bundled up and/or fragmented into fixed-size tunnel messages, and are forwarded on to the next hop in the tunnel, which processes and verifies the validity of the message and sends it on to the next hop, and so on, until it reaches the tunnel endpoint. That <i>endpoint</i> takes the messages bundled up by the gateway and forwards them as instructed - either to another router, to another tunnel on another router, or locally.
pt: Dentro do I2P, as mensagens são passadas em uma direção através de um túnel virtual de pares, usando quaisquer meios disponíveis para passar a mensagem para o próximo salto. As mensagens chegam ao gateway </i></i>do túnel, são agrupadas e/ou fragmentadas em mensagens de túnel de tamanho fixo, e são encaminhadas para o próximo salto no túnel, que processa e verifica a validade da mensagem e a envia para o próximo salto, e assim por diante, até atingir o ponto final do túnel. O ponto de extremidade <i></i> pega as mensagens agrupadas pelo gateway e as encaminha conforme as instruções - para outro roteador, para outro túnel em outro roteador ou localmente.
tr: I2P içinde, iletiler bir sonraki sıçramaya iletilirken var olan her türlü araç kullanılarak sanal bir eşler tüneli aracılığıyla bir yönde aktarılır. İletiler tünelin <i>ağ geçidine</i> ulaşır, gruplanır ve/veya sabit boyutlu tünel iletilerine bölünerek tüneldeki bir sonraki sıçramaya aktarılır. Bu sıçrama iletinin geçerliliğini işleyip doğrular ve bir sonraki sıçramaya gönderir. Bu şekilde tünel uç noktasına ulaşılana kadar sürer. Bu <i>uç nokta</i> ağ geçidi tarafından bir araya getirilmiş iletileri alır ve verilen yönergelere uygun olarak, başka bir yönelticiye, başka bir yönelticideki başka bir tünele ya da yerele aktarır.

source: Tunnels all work the same, but can be segmented into two different groups - inbound tunnels and outbound tunnels. The inbound tunnels have an untrusted gateway which passes messages down towards the tunnel creator, which serves as the tunnel endpoint. For outbound tunnels, the tunnel creator serves as the gateway, passing messages out to the remote endpoint.
pt: Os túneis funcionam todos da mesma forma, mas podem ser segmentados em dois grupos diferentes - túneis de entrada e túneis de saída. Os túneis de entrada têm um gateway não confiável que passa mensagens para o criador do túnel , que serve como ponto final do túnel. Para túneis de saída , o criador do túnel serve como gateway, passando mensagens para o ponto final remoto.
tr: Tünellerin tümü aynı şekilde çalışır. Ancak geliş ve gidiş tünelleri olmak üzere iki farklı gruba ayrılabilir. Geliş tünelleri, iletileri tünel uç noktası olarak hizmet eden tünel oluşturucuya doğru aktaran güvenilmeyen bir ağ geçidine sahiptir. Gidiş tünellerinde, tünel oluşturucu, iletileri uzak uç noktaya ileterek ağ geçidi görevi görür.

source: The tunnel's creator selects exactly which peers will participate in the tunnel, and provides each with the necessary configuration data. They may have any number of hops. It is the intent to make it hard for either participants or third parties to determine the length of a tunnel, or even for colluding participants to determine whether they are a part of the same tunnel at all (barring the situation where colluding peers are next to each other in the tunnel).
pt: O criador do túnel seleciona exatamente quais pares participarão do túnel e fornece a cada um os dados de configuração necessários. Eles podem ter qualquer número de saltos. A intenção é tornar difícil para os participantes ou terceiros determinarem o comprimento de um túnel, ou mesmo para os participantes em conluio determinarem se eles são uma parte do mesmo túnel (exceto na situação em que os pares em conluio estão próximos um do outro no túnel).
tr: Tünel oluşturucu, tünele tam olarak hangi eşlerin katılacağını seçer ve her birine gerekli yapılandırma verilerini sağlar. Herhangi bir sayıda sıçramaya sahip olabilirler. Katılımcıların veya üçüncü tarafların bir tünelin uzunluğunu belirlemesi veya hatta ortak katılımcıların aynı tünelin bir parçası olup olmadıklarının belirlemesinin zorlaştırılması amaçlanmıştır (uzlaşmış eşlerin tünelde birbirine yakın olduğu durumlar dışında).

source: In practice, a series of tunnel pools are used for different purposes - each local client destination has its own set of inbound tunnels and outbound tunnels, configured to meet its anonymity and performance needs. In addition, the router itself maintains a series of pools for participating in the network database and for managing the tunnels themselves.
pt: Na prática, uma série de pools de túneis são usados para diferentes propósitos - cada destino de cliente local tem seu próprio conjunto de túneis de entrada e túneis de saída, configurados para atender às suas necessidades de anonimato e desempenho. Além disso, o próprio roteador mantém uma série de pools para participar do banco de dados da rede e para gerenciar os próprios túneis.
tr: Uygulamada, farklı amaçlar için bir dizi tünel havuzu kullanılır. Her yerel istemci hedefinin, kendi anonimlik ve başarım gereksinimlerini karşılamak üzere yapılandırılmış kendi geliş ve gidiş tünelleri vardır. Ek olarak, yönelticinin kendisi, ağ veri tabanına (netDB) katılmak ve tünelleri yönetmek için bir dizi havuz bulundurur.

source: I2P is an inherently packet switched network, even with these tunnels, allowing it to take advantage of multiple tunnels running in parallel, increasing resilience and balancing load. Outside of the core I2P layer, there is an optional end to end streaming library available for client applications, exposing TCP-esque operation, including message reordering, retransmission, congestion control, etc.
pt: I2P é uma rede inerentemente comutada por pacotes, mesmo com esses túneis , permitindo que ela aproveite múltiplos túneis rodando em paralelo, aumentando a resiliência e balanceando a carga. Fora da camada I2P principal, há uma biblioteca de streaming ponta a ponta opcional disponível para aplicativos clientes, expondo operação TCP-esque, incluindo reordenação de mensagens, retransmissão, controle de congestionamento, etc.
tr: I2P doğası gereği paket anahtarlamalı bir ağdır. Böylece tünellerde bile paralel olarak çalışan çoklu tünellerden faydalanarak esnekliği arttırır ve yükü dengeler. Çekirdek I2P katmanının dışında, istemci uygulamaları için isteğe bağlı bir uçtan uca streaming kitaplığı vardır ve iletileri yeniden sıralama, yeniden iletme, tıkanıklık denetimi gibi TCP benzeri özellikler sunar.

source: An overview of I2P tunnel terminology is <a href="%(tunnelrouting)s">on the tunnel overview page</a>.
pt: Uma visão geral da terminologia do túnel I2P está em <a href="%(tunnelrouting)s">na página de visão geral do túnel</a>.
tr: I2P tünel terminolojisini <a href="%(tunnelrouting)s">tünel özeti sayfasında</a> bulabilirsiniz.

source: Tunnel Operation (Message Processing)
pt: Operação de Túnel (Processamento de Mensagens)
tr: Tünelin Çalışması (İletilerin İşlenmesi)

source: After a tunnel is built, <a href="%(i2np)s">I2NP messages</a> are processed and passed through it. Tunnel operation has four distinct processes, taken on by various peers in the tunnel.
pt: Após a construção de um túnel, <a href="%(i2np)s">mensagens I2NP</a> são processadas e passadas por ele. A operação do túnel tem quatro processos distintos, assumidos por vários pares no túnel.
tr: Bir tünel oluşturulduktan sonra, <a href="%(i2np)s">I2NP iletileri</a> işlenir ve aktarılır. Tünel çalışırken, tüneldeki çeşitli eşler tarafından üstlenilen dört farklı süreç gerçekleştirilir.

source: First, the tunnel gateway accumulates a number of I2NP messages and preprocesses them into tunnel messages for delivery.
pt: Primeiro, o gateway de túnel acumula um número de mensagens I2NP e as pré-processa em mensagens de túnel para entrega .
tr: İlk olarak, tünel ağ geçidi bir dizi I2NP iletisi biriktirir ve bunları aktarmak için tünel iletilerini ön işler.

source: Next, that gateway encrypts that preprocessed data, then forwards it to the first hop.
pt: Em seguida, esse gateway criptografa os dados pré-processados e, então, os encaminha para o primeiro salto.
tr: Sonra, bu ağ geçidi ön işlenmiş verileri şifreler ve ilk sıçramaya iletir.

source: That peer, and subsequent tunnel participants, unwrap a layer of the encryption, verifying that it isn't a duplicate, then forward it on to the next peer.
pt: Esse peer e os participantes subsequentes do túnel desvendam uma camada de criptografia, verificando se não é uma duplicata e, então, a encaminham para o próximo peer.
tr: Bu eş ve sonraki tünel katılımcıları, şifreleme katmanını açar, bunun bir kopya olmadığını doğrular ve ardından bir sonraki eşe iletir.

source: Eventually, the tunnel messages arrive at the endpoint where the I2NP messages originally bundled by the gateway are reassembled and forwarded on as requested.
pt: Por fim, as mensagens do túnel chegam ao ponto final, onde as mensagens I2NP originalmente agrupadas pelo gateway são remontadas e encaminhadas conforme solicitado.
tr: Sonunda tünel iletileri ağ geçidi tarafından özgün şekilde paketlenen I2NP iletilerinin yeniden bir araya getirildiği ve istendiği gibi aktarıldığı uç noktaya ulaşır.
