Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: A LeaseSet for a destination used only for outgoing connections is <i>unpublished</i>. It is never sent for publication to a floodfill router. "Client" tunnels, such as those for web browsing and IRC clients, are unpublished. Servers will still be able to send messages back to those unpublished destinations, because of <a href="#lsp">I2NP storage messages</a>.
pt: Um LeaseSet para um destino usado apenas para conexões de saída é <i>não publicado</i>. Ele nunca é enviado para publicação em um roteador floodfill. Túneis "clientes", como aqueles para navegação na web e clientes IRC, não são publicados. Os servidores ainda poderão enviar mensagens de volta para esses destinos não publicados, por causa das <a href="#lsp">mensagens de armazenamento I2NP</a>.
tr: Yalnızca gidiş bağlantıları için kullanılan bir hedef için "Kiralama kümesi" (LeaseSet) <i>yayından kaldırıldı</i>. Hiçbir zaman yayınlanmak için bir otomatik doldurma yönelticisine gönderilmez. İnternet üzerinde gezinme ve IRC istemcileri için olanlar gibi "istemci" tünelleri yayınlanmaz. Sunucular, <a href="#lsp">I2NP depolama iletileri</a> nedeniyle, bu yayınlanmamış hedeflere ileti göndermeyi sürdürebilir.

source: Revoked LeaseSets
pt: Conjuntos de arrendamento revogados
tr: Geçersiz kılınmış "Kiralama kümeleri" (LeaseSets)

source: A LeaseSet may be <i>revoked</i> by publishing a new LeaseSet with zero leases. Revocations must be signed by the additional signing key in the LeaseSet. Revocations are not fully implemented, and it is unclear if they have any practical use. This is the only planned use for that signing key, so it is currently unused.
pt: Um LeaseSet pode ser <i>revogado</i> publicando um novo LeaseSet com zero leases. As revogações devem ser assinadas pela chave de assinatura adicional no LeaseSet. As revogações não são totalmente implementadas e não está claro se elas têm algum uso prático. Este é o único uso planejado para essa chave de assinatura, então ela não é usada no momento.
tr: Bir "Kiralama kümesi" (LeaseSet), sıfır kiralama yapan yeni bir "Kiralama kümesi" (LeaseSet) yayınlayarak <i>geçersiz kılınabilir</i>. Geçersiz kılmalar, "Kiralama kümesi" tarafından kullanılan ek imzalama anahtarı ile imzalanmalıdır. Geçersiz kılma tam olarak kullanıma alınmadı ve herhangi bir pratik kullanımı olup olmadığı belirsiz. Söz konusu imzalama anahtarı yalnızca bunun için planlandığından şu anda kullanılmıyor.

source: As of release 0.9.38, floodfills support a new LeaseSet2 structure. This structure is very similar to the old LeaseSet structure, and serves the same purpose. The new structure provides the flexibility required to support new encryption types, multiple encryption types, options, offline signing keys, and other features. See proposal 123 for details.
pt: A partir da versão 0.9.38, os floodfills oferecem suporte a uma nova estrutura LeaseSet2. Essa estrutura é muito semelhante à antiga estrutura LeaseSet e atende ao mesmo propósito. A nova estrutura fornece a flexibilidade necessária para oferecer suporte a novos tipos de criptografia, vários tipos de criptografia, opções, chaves de assinatura offline, e outros recursos. Consulte a proposta 123 para obter detalhes.
tr: 0.9.38 sürümünden başlayarak otomatik dolgular yeni "Kiralama kümesi" (LeaseSet) LS2 yapısını destekliyor. Bu yapı eski "Kiralama kümesi" (LeaseSet) yapısına çok benzer ve aynı amaca hizmet eder. Yeni yapı, yeni şifreleme türlerini, çoklu şifreleme türlerini, seçenekleri, çevrimdışı imzalama anahtarlarını ve diğer özellikleri destekleyecek esnekliği sağlar. Ayrıntılı bilgi almak için 123 numaralı öneriye bakabilirsiniz.

source: As of release 0.9.38, floodfills support a new Meta LeaseSet structure. This structure provides a tree-like structure in the DHT, to refer to other LeaseSets. Using Meta LeaseSets, a site may implement large multihomed services, where several different Destinations are used to provide a common service. The entries in a Meta LeaseSet are Destinations or other Meta LeaseSets, and may have long expirations, up to 18.2 hours. Using this facility, it should be possible to run hundreds or thousands of Destinations hosting a common service. See proposal 123 for details.
pt: A partir da versão 0.9.38, os floodfills suportam uma nova estrutura Meta LeaseSet. Esta estrutura fornece uma estrutura semelhante a uma árvore no DHT, para se referir a outros LeaseSets. Usando Meta LeaseSets, um site pode implementar grandes serviços multihomed, onde vários Destinos diferentes são usados para fornecer um serviço comum. As entradas em um Meta LeaseSet são Destinos ou outros Meta LeaseSets, e podem ter expirações longas, de até 18,2 horas. Usando este recurso, deve ser possível executar centenas ou milhares de Destinos hospedando um serviço comum. Veja a proposta 123 para detalhes.
tr: 0.9.38 sürümünden başlayarak, otomatik doldurmalar yeni bir "Üst kiralama kümesi" (MetaLeaseSet) yapısını destekler. Bu yapı, diğer "Kiralama kümelerine" (LeaseSets) atıfta bulunmak için "Dağıtılmış karma tablosu" (DHT) üzerinde ağaç benzeri bir yapı sağlar. Bir site, "Üst kiralama kümesini" (MetaLeaseSet) kullanarak, ortak bir hizmet sağlamak için birkaç farklı hedefin kullanıldığı büyük, çoklu barındırma hizmetlerini uygulayabilir. Bir "Üst kiralama kümesindeki" (MetaLeaseSet) kayıtlar, hedefler veya diğer "Üst kiralama kümeleridir" ve 18,2 saate kadar uzun geçerlilik süreleri olabilir. Bu yapıyı kullanılarak, ortak bir hizmeti barındıran yüzlerce veya binlerce hedef çalıştırılabilmelidir. Ayrıntılı bilgi almak için 123 numaralı öneriye bakabilirsiniz.

source: Encrypted LeaseSets
pt: LeaseSets criptografados
tr: "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets)

source: This section describes the old, insecure method of encrypting LeaseSets using a fixed symmetric key. See below for the LS2 version of Encrypted LeaseSets.
pt: Esta seção descreve o método antigo e inseguro de criptografar LeaseSets usando uma chave simétrica fixa. Veja abaixo a versão LS2 de LeaseSets criptografados.
tr: Bu bölümde, sabit bir simetrik anahtar kullanarak eski, güvenli olmayan "Kiralama kümesi" (LeaseSet) şifreleme yöntemi açıklanır. "Şifrelenmiş kiralama kümelerinin" (EncryptedLeaseSets) LS2 sürümü için aşağıya bakın.

source: In an <i>encrypted</i> LeaseSet, all Leases are encrypted with a separate key. The leases may only be decoded, and thus the destination may only be contacted, by those with the key. There is no flag or other direct indication that the LeaseSet is encrypted. Encrypted LeaseSets are not widely used, and it is a topic for future work to research whether the user interface and implementation of encrypted LeaseSets could be improved.
pt: Em um <i>LeaseSet criptografado</i> , todos os Leases são criptografados com uma chave separada. Os leases só podem ser decodificados e, portanto, o destino só pode ser contatado, por aqueles com a chave. Não há nenhum sinalizador ou outra indicação direta de que o LeaseSet está criptografado. LeaseSets criptografados não são amplamente utilizados, e é um tópico para trabalho futuro pesquisar se a interface do usuário e a implementação de LeaseSets criptografados podem ser melhoradas.
tr: Bir "<i>Şifrelenmiş</i> kiralama kümesi" (EncryptedLeaseSet) içinde, tüm kiralamalar ayrı bir anahtarla şifrelenir. Kiralamaların kodu yalnızca çözülebilir ve bu nedenle hedefle yalnızca anahtara sahip olanlar bağlantı kurabilir. "Kiralama kümesinin" (LeaseSet) şifrelenmiş olduğuna hakkında bir işaret veya başka bir doğrudan gösterge yoktur. "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) yaygın olarak kullanılmıyor. Kullanıcı arayüzünün ve "Şifrelenmiş kiralama kümelerinin" (EncryptedLeaseSets) uygulanmasının geliştirilmesi geleceğe dönük bir araştırma konusudur.

source: As of release 0.9.38, floodfills support a new, EncryptedLeaseSet structure. The Destination is hidden, and only a blinded public key and an expiration are visible to the floodfill. Only those that have the full Destination may decrypt the structure. The structure is stored at a DHT location based on the hash of the blinded public key, not the hash of the Destination. See proposal 123 for details.
pt: A partir da versão 0.9.38, os floodfills oferecem suporte a uma nova estrutura EncryptedLeaseSet. O destino fica oculto, e apenas uma chave pública oculta e uma expiração são visíveis para o floodfill. Somente aqueles que têm o destino completo podem descriptografar a estrutura. A estrutura é armazenada em um local DHT com base no hash da chave pública oculta, não no hash do destino. Veja a proposta 123 para obter detalhes.
tr: 0.9.38 sürümünden başlayarak, otomatik doldurma yeni bir "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) yapısını destekler. Hedef gizlidir ve otomatik doldurmada yalnızca körleştirilmiş bir herkese açık anahtar ve bir geçerlilik süresi görünür. Yalnızca tam hedefe sahip olanlar yapının şifresini çözebilir. Yapı, hedefin karma değerine değil, körleştirilmiş herkese açık anahtarın karma değerine dayalı olarak bir "Dağıtılmış karma tablosu" (DHT) konumunda depolanır. Ayrıntılar için 123 numaralı öneriye bakabilirsiniz.

source: LeaseSet Expiration
pt: Vencimento do LeaseSet
tr: "Kiralama kümesi" (LeaseSet) geçerlilik süresi

source: For regular LeaseSets, the expiration is the time of the latest expiration of its leases. For the new LeaseSet2 data structures, the expiration is specified in the header. For LeaseSet2, the expiration should match the latest expiration of its leases. For EncryptedLeaseSet and MetaLeaseSet, the expiration may vary, and maximum expiration may be enforced, to be determined.
pt: Para LeaseSets regulares, a expiração é o momento da última expiração de seus leases. Para as novas estruturas de dados LeaseSet2, a expiração é especificada no cabeçalho. Para LeaseSet2, a expiração deve corresponder à última expiração de seus leases. Para EncryptedLeaseSet e MetaLeaseSet, a expiração pode variar, e a expiração máxima pode ser imposta, a ser determinada.
tr: Normal "Kiralama kümeleri" (LeaseSets) için geçerlilik süresi, kiralamalarının sona erme zamanıdır. Yeni LS2 "Kiralama kümesi" (LeaseSet) veri yapıları için geçerlilik süresi üst bilgilerde belirtilir. LS2 için geçerlilik süresi, kiralamaların sona erme zamanlarıyla eşleşmelidir. "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) ve "Üst kiralama kümesi" (MetaLeaseSet) için geçerlilik süresi değişebilir ve belirlenmek üzere en uzun geçerlilik süresi dayatılabilir.

source: LeaseSet Persistent Storage
pt: Armazenamento persistente LeaseSet
tr: "Kiralama kümesi" (LeaseSet) kalıcı depolaması

source: No persistent storage of LeaseSet data is required, since they expire so quickly. Howewver, persistent storage of EncryptedLeaseSet and MetaLeaseSet data with long expirations may be advisable.
pt: Não é necessário armazenamento persistente de dados do LeaseSet, pois eles expiram muito rapidamente. No entanto, o armazenamento persistente de dados do EncryptedLeaseSet e do MetaLeaseSet com expirações longas pode ser aconselhável.
tr: "Kiralama kümesi" (LeaseSet) verilerinin kalıcı olarak depolanması gerekmez, çünkü bu veriler çok hızlı bir şekilde geçersiz olur. Ancak, "Şifrelenmiş kiralama kümesi" (EncryptedLeaseSet) ve "Üst kiralama kümesi" (MetaLeaseSet) verilerinin uzun geçerlilik süresiyle kalıcı olarak saklanması önerilebilir.

source: Encryption Key Selection
pt: Seleção de chave de criptografia
tr: Şifreleme Anahtarı Seçimi

source: LeaseSet2 may contain multiple encryption keys. The keys are in order of server preference, most-preferred first. Default client behavior is to select the first key with a supported encryption type. Clients may use other selection algorithms based on encryption support, relative performance, and other factors.
pt: LeaseSet2 pode conter várias chaves de criptografia. As chaves estão em ordem de preferência do servidor, a mais preferida primeiro. O comportamento padrão do cliente é selecionar a primeira chave com um tipo de criptografia suportado. Os clientes podem usar outros algoritmos de seleção com base no suporte à criptografia, desempenho relativo e outros fatores.
tr: 2. "Kiralama kümesi" (LeaseSet2) birden çok şifreleme anahtarı içerebilir. Anahtarlar, en çok yeğlenen sunucu sırasına göredir. Varsayılan istemci davranışı, desteklenen bir şifreleme türüne sahip ilk anahtarın seçilmesidir. İstemciler, şifreleme desteğine, göreli başarıma ve diğer faktörlere dayalı diğer seçim algoritmalarını kullanabilir.

source: Bootstrapping
pt: Inicialização
tr: Ön yükleme

source: The netDb is decentralized, however you do need at least one reference to a peer so that the integration process ties you in. This is accomplished by "reseeding" your router with the RouterInfo of an active peer - specifically, by retrieving their <code>routerInfo-$hash.dat</code> file and storing it in your <code>netDb/</code> directory. Anyone can provide you with those files - you can even provide them to others by exposing your own netDb directory. To simplify the process, volunteers publish their netDb directories (or a subset) on the regular (non-i2p) network, and the URLs of these directories are hardcoded in I2P. When the router starts up for the first time, it automatically fetches from one of these URLs, selected at random.
pt: O netDb é descentralizado, no entanto, você precisa de pelo menos uma referência a um peer para que o processo de integração o vincule. Isso é feito "reseeding" seu roteador com o RouterInfo de um peer ativo - especificamente, recuperando seu arquivo <code>routerInfo-$hash.dat</code> e armazenando-o em seu diretório <code>netDb/</code> . Qualquer um pode fornecer esses arquivos a você - você pode até mesmo fornecê-los a outros expondo seu próprio diretório netDb. Para simplificar o processo, voluntários publicam seus diretórios netDb (ou um subconjunto) na rede regular (não i2p), e as URLs desses diretórios são codificadas em I2P. Quando o roteador é inicializado pela primeira vez, ele busca automaticamente em uma dessas URLs, selecionada aleatoriamente.
tr: "Ağ veri tabanı" (NetDB) merkezi değildir, ancak bütünleştirme sürecinin sizi bağlaması için en az bir eş referansına gerek duyarsınız. Bunun için, yönelticinizi etkin bir eşin "Yöneltici bilgileri" (RouterInfo) ile "yeniden tohumlar", özellikle de <code>routerInfo-$hash.dat</code> dosyalarını alıp <code>netDB/</code> klasörünüze kaydedersiniz. Bu dosyaları size herhangi biri sağlayabilir. Hatta kendi netDb klasörünüzü görünür kılarak bunları başkalarına da sunabilirsiniz. Süreci basitleştirmek için, gönüllüler netDb klasörlerini (veya bir alt kümesini) normal (i2p olmayan) ağda yayınlar ve bu klasör adresleri I2P içinde sabit kodlanmıştır. Yöneltici ilk kez başlatıldığında, otomatik olarak bu adreslerden biri rastgele seçilerek alınır.

source: The floodfill netDb is a simple distributed storage mechanism. The storage algorithm is simple: send the data to the closest peer that has advertised itself as a floodfill router. When the peer in the floodfill netDb receives a netDb store from a peer not in the floodfill netDb, they send it to a subset of the floodfill netDb-peers. The peers selected are the ones closest (according to the <a href="#kad">XOR-metric</a>) to a specific key.
pt: O floodfill netDb é um mecanismo simples de armazenamento distribuído. O algoritmo de armazenamento é simples: envie os dados para o peer mais próximo que anunciou a si mesmo como um roteador floodfill. Quando o peer no floodfill netDb recebe um netDb store de um peer que não está no floodfill netDb, ele o envia para um subconjunto de os floodfill netDb-peers. Os peers selecionados são os mais próximos (de acordo com a <a href="#kad">métrica XOR</a>) de uma chave específica.
tr: Otomatik doldurma "Ağ veri tabanı" (NetDB), basit bir dağıtılmış depolama mekanizmasıdır. Depolama algoritması basittir: Verileri, kendisini bir otomatik doldurma yönelticisi olarak tanıtan en yakın eşe gönderir. Otomatik doldurma "Ağ veri tabanı" (NetDB) üzerinde bulunan bir eş, otomatik doldurma "Ağ veri tabanı" (NetDB) üzerinde bulunmayan bir eşten bir "Ağ veri tabanı" (NetDB) deposu aldığında, onu otomatik doldurma "Ağ veri tabanı" (NetDB) eşlerinin bir alt kümesine gönderir. Seçilen eşler, belirli bir anahtara (<a href="#kad">XOR ölçüsü ile</a>) en yakın olanlardır.

source: Determining who is part of the floodfill netDb is trivial - it is exposed in each router's published routerInfo as a capability.
pt: Determinar quem faz parte do floodfill netDb é trivial - ele é exposto em cada routerInfo publicado do roteador como um recurso.
tr: Otomatik doldurma "Ağ veri tabanı" (NetDB) için kimin parçası olduğunu belirlemek önemsizdir. Her yönelticinin yayınlanan "Yöneltici bilgileri" (RouterInfo) içinde bir yetenek olarak ortaya çıkar.

source: Floodfills have no central authority and do not form a "consensus" - they only implement a simple DHT overlay.
pt: Os floodfills não têm autoridade central e não formam um "consenso" - eles apenas implementam uma sobreposição DHT simples.
tr: Otomatik doldurmaların merkezi bir yöneticisi yoktur ve bir "uzlaşma" oluşturmazlar. Yalnızca basit bir "Dağıtılmış karma tablosu" (DHT) kapsaması sağlarlar.

source: Floodfill Router Opt-in
pt: Opt-in do roteador Floodfill
tr: Otomatik doldurma yöneltici aboneliği

source: Unlike Tor, where the directory servers are hardcoded and trusted, and operated by known entities, the members of the I2P floodfill peer set need not be trusted, and change over time.
pt: Ao contrário do Tor, onde os servidores de diretório são codificados e confiáveis, e operados por entidades conhecidas, os membros do conjunto de pares de floodfill I2P não precisam ser confiáveis, e mudam ao longo do tempo.
tr: Dizin sunucularının sabit kodlandığı ve güvenilir olduğu ve bilinen varlıklar tarafından işletildiği Tor ağının aksine, I2P otomatik doldurma eş kümesinin üyelerinin güvenilir olması gerekmez ve zaman içinde değişebilir.

source: To increase reliability of the netDb, and minimize the impact of netDb traffic on a router, floodfill is automatically enabled only on routers that are configured with high bandwidth limits. Routers with high bandwidth limits (which must be manually configured, as the default is much lower) are presumed to be on lower-latency connections, and are more likely to be available 24/7. The current minimum share bandwidth for a floodfill router is 128 KBytes/sec.
pt: Para aumentar a confiabilidade do netDb e minimizar o impacto do tráfego netDb em um roteador, o floodfill é habilitado automaticamente somente em roteadores configurados com altos limites de largura de banda. Roteadores com altos limites de largura de banda (que devem ser configurados manualmente, já que o padrão é muito menor) são presumidos como estando em conexões de latência mais baixa e têm mais probabilidade de estar disponíveis 24 horas por dia, 7 dias por semana. A largura de banda mínima de compartilhamento atual para um roteador floodfill é de 128 KBytes/seg.
tr: "Ağ veri tabanı" (NetDB) güvenilirliğini artırmak ve ağ veri tabanı trafiğinin yöneltici üzerindeki etkisini en aza indirmek için, otomatik doldurma yalnızca yüksek bant genişliği sınırlarıyla yapılandırılmış yönelticilerde otomatik olarak etkinleştirilir. Yüksek bant genişliği sınırlarına sahip yönelticilerin (varsayılan çok daha düşük olduğu için el ile yapılandırılması gerekir) daha düşük gecikmeli bağlantılarda olduğu varsayılır ve 7/24 kullanılabilir olma olasılıkları daha yüksektir. Otomatik doldurma yönelticisi için geçerli en az paylaşım bant genişliği: 128 KBytes/sn.

source: In addition, a router must pass several additional tests for health (outbound message queue time, job lag, etc.) before floodfill operation is automatically enabled.
pt: Além disso, um roteador deve passar por vários testes adicionais de integridade (tempo de fila de mensagens de saída, atraso de trabalho, etc.) antes que a operação de floodfill seja habilitada automaticamente.
tr: Ek olarak, bir yöneltici, otomatik doldurma işlemi otomatik olarak etkinleştirilmeden önce sistem durumu (gidiş ileti kuyruğu süresi, görev gecikmesi vb.) için birkaç ek sınamadan geçmelidir.

source: With the current rules for automatic opt-in, approximately 6&#37; of the routers in the network are floodfill routers.
pt: Com as regras atuais para opt-in automático, aproximadamente 6&#37; de roteadores na rede são roteadores floodfill.
tr: Otomatik katılım için geçerli kurallarla, ağdaki yönelticilerin yaklaşık 6&37; kadarı otomatik doldurma yönelticileridir.

source: While some peers are manually configured to be floodfill, others are simply high-bandwidth routers who automatically volunteer when the number of floodfill peers drops below a threshold. This prevents any long-term network damage from losing most or all floodfills to an attack. In turn, these peers will un-floodfill themselves when there are too many floodfills outstanding.
pt: Enquanto alguns pares são configurados manualmente para serem floodfill, outros são simplesmente roteadores de alta largura de banda que automaticamente voluntariam quando o número de pares floodfill cai abaixo de um limite. Isso evita qualquer dano de rede de longo prazo, perdendo a maioria ou todos os floodfills para um ataque. Por sua vez, esses pares deixarão de fazer o floodfill quando houver muitos floodfills pendentes.
tr: Bazı eşler, otomatik doldurma için el ile yapılandırılırken, diğerleri, otomatik doldurma eşlerinin sayısı bir eşik değerinin altına düştüğünde otomatik olarak gönüllü olan yüksek bant genişliğine sahip yönelticilerdir. Böylece herhangi bir saldırı olduğunda, otomatik doldurma yönelticilerinin kaybedilmesi ve uzun vadeli bir ağ hasarı önlenir. Ters durumda, bekleyen çok fazla otomatik doldurma yönelticisi olduğunda, bu eşler kendilerini otomatik doldurma rolünden çıkarır.

source: Floodfill Router Roles
pt: Funções do roteador Floodfill
tr: Otomatik Doldurma Yöneltici Rolleri

source: A floodfill router's only services that are in addition to those of non-floodfill routers are in accepting netDb stores and responding to netDb queries. Since they are generally high-bandwidth, they are more likely to participate in a high number of tunnels (i.e. be a "relay" for others), but this is not directly related to their distributed database services.
pt: Os únicos serviços de um roteador floodfill que são adicionais aos de roteadores não floodfill são aceitar armazenamentos netDb e responder a consultas netDb. Como eles geralmente têm alta largura de banda, é mais provável que participem de um grande número de túneis (ou seja, sejam um "retransmissor" para outros), mas isso não está diretamente relacionado aos seus serviços de banco de dados distribuídos.
tr: Otomatik doldurma yönelticilerinin, otomatik doldurma olmayan yönelticilerin hizmetlerine ek olan tek hizmetleri, "Ağ veri tabanı" (NetDB) depolarını kabul etmek ve ağ veri tabanı sorgularına yanıt vermektir. Genellikle yüksek bant genişlikleri olduğunda, çok sayıda tünele katkıda bulunma olasılıkları daha yüksektir (diğer bir deyişle, diğerleri için bir "aktarıcı" olur). Ancak bu onların dağıtılmış veri tabanı hizmetleriyle doğrudan ilgili değildir.

source: Kademlia Closeness Metric
pt: Métrica de proximidade Kademlia
tr: Kademlia Yakınlık Ölçümü
