Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: If I could somehow convince you to change the destination associated with some name, I'd successfully "take over" the site, and under no circumstances is that acceptable. Instead, what we do is make names <b>locally unique</b>: they are what <i>you</i> use to call a site, just as how you can call things whatever you want when you add them to your browser's bookmarks, or your IM client's buddy list. Who you call "Boss" may be who someone else calls "Sally".
pt: Se eu pudesse de alguma forma convencê-lo a mudar o destino associado a algum nome , eu "assumiria" o site com sucesso, e sob nenhuma circunstância isso é aceitável. Em vez disso, o que fazemos é tornar os nomes <b>localmente únicos</b>: eles são o que <i>você</i> usa para chamar um site, assim como você pode chamar as coisas do que quiser quando as adiciona aos favoritos do seu navegador ou à lista de amigos do seu cliente de MI . Quem você chama de "Chefe" pode ser quem outra pessoa chama de "Sally".
tr: Bir şekilde sizi bir adla ilişkili hedefi değiştirmeye ikna edebilseydim, siteyi "devralırdım" ve bu durum hiçbir koşulda kabul edilemez. Bunun yerine, biz adları <b>yerel olarak eşsiz</b> kılarız: Bunlar, bir siteyi bulmak için <i>sizin</i> kullandığınız şeydir. Tıpkı şeyleri tarayıcınızın yer imlerine veya IM istemcinizin arkadaş listesine eklediğinizde nasıl her istediğinizi arayabiliyorsanız ona benzer. "Patron" dediğiniz kişi, başka birinin "Ali" dediği kişi olabilir.

source: Names will not, ever, be securely human readable and globally unique.
pt: Os nomes nunca serão legíveis por humanos de forma segura e globalmente únicos.
tr: Adlar asla güvenli bir şekilde okunabilir ve küresel olarak eşsiz olmayacak.

source: The following from zzz is a review of several common complaints about I2P's naming system.
pt: O texto a seguir, do zzz, é uma análise de várias reclamações comuns sobre o sistema de nomenclatura do I2P.
tr: Aşağıda I2P adlandırma sistemiyle ilgili yaygın şikayetlerin zzz tarafından derlenmiş sonuçlarını görebilirsiniz.

source: <b>Inefficiency:</b> The whole hosts.txt is downloaded (if it has changed, since eepget uses the etag and last-modified headers). It's about 400K right now for almost 800 hosts.
pt: <b>Ineficiência:</b> Todo o hosts.txt é baixado (se tiver sido alterado, já que o eepget usa o etag e os cabeçalhos da última modificação). São cerca de 400K agora para quase 800 hosts.
tr: <b>Verimsizlik:</b> Hosts.txt dosyasının tümü indirilir (eepget etag ve son değiştirilen üst bilgileri kullandığından, dosya değiştiyse). Şu anda neredeyse 800 sunucu için yaklaşık 400K boyutunda.

source: True, but this isn't a lot of traffic in the context of i2p, which is itself wildly inefficient (floodfill databases, huge encryption overhead and padding, garlic routing, etc.). If you downloaded a hosts.txt file from someone every 12 hours it averages out to about 10 bytes/sec.
pt: Verdade, mas isso não é muito tráfego no contexto do i2p, que é extremamente ineficiente (bancos de dados de inundação, enorme sobrecarga de criptografia e preenchimento, roteamento garlic, etc.). Se você baixasse um arquivo hosts.txt de alguém a cada 12 horas, a média seria de cerca de 10 bytes/seg.
tr: Doğru, ancak bu, kendisi çılgınca verimsiz olan i2p bağlamında çok büyük bir trafik oluşturmaz (otomatik doldurma veri tabanları, büyük şifreleme ek yükü ve dolgu ekleme, garlic yöneltme, vb.). Her 12 saatte bir, hosts.txt dosyasını birinden indirsenize, ortalama 10 bayt/sn trafik oluşur.

source: As is usually the case in i2p, there is a fundamental tradeoff here between anonymity and efficiency. Some would say that using the etag and last-modified headers is hazardous because it exposes when you last requested the data. Others have suggested asking for specific keys only (similar to what jump services do, but in a more automated fashion), possibly at a further cost in anonymity.
pt: Como geralmente é o caso no i2p, há uma compensação fundamental aqui entre anonimato e eficiência. Alguns diriam que usar os cabeçalhos etag e last-modified é perigoso porque expõe quando você solicitou os dados pela última vez. Outros sugeriram solicitar apenas chaves específicas (semelhante ao que os serviços de salto fazem, mas de uma forma mais automatizada), possivelmente com um custo adicional em anonimato.
tr: Genellikle i2p üzerinde olduğu gibi, burada anonimlik ve verimlilik arasında temel bir uzlaşma vardır. Bazı kişiler, verileri en son ne zaman istediğinizi ortaya çıkardığı için etag ve son değiştirilen üst bilgileri kullanmanın tehlikeli olduğunu söyleyebilir. Başka kişiler, büyük olasılıkla daha fazla anonimlik maliyetine yol açacak şekilde, yalnızca belirli anahtarların istenmesini önerdi (atlama hizmetlerinin yaptığına benzer, ancak daha otomatik bir şekilde).

source: Possible improvements would be a replacement or supplement to address book (see <a href="http://%(i2host)s/">%(i2host)sp</a>), or something simple like subscribing to http://example.i2p/cgi-bin/recenthosts.cgi rather than http://example.i2p/hosts.txt. If a hypothetical recenthosts.cgi distributed all hosts from the last 24 hours, for example, that could be both more efficient and more anonymous than the current hosts.txt with last-modified and etag.
pt: Possíveis melhorias seriam uma substituição ou suplemento ao catálogo de endereços (veja <a href="http://%(i2host)s/">%(i2host)sp</a>), ou algo simples como assinar http://example.i2p/cgi-bin/recenthosts.cgi em vez de http://example.i2p/hosts.txt. Se um hipotético recenthosts.cgi distribuísse todos os hosts das últimas 24 horas, por exemplo, isso poderia ser mais eficiente e mais anônimo do que o hosts.txt atual com last-modified e etag.
tr: Olası iyileştirmeler, adres defterinin değiştirilmesi veya geliştirilmesi (<a href="http://%(i2host)s/">%(i2host)sp</a> gibi) ya da http://ornek.i2p/hosts.txt yerine http://ornek.i2p/cgi bin/recenthosts.cgi adresine abone olmak gibi basit bir şey olabilir. Varsayımsal olarak son 24 saatteki tüm sunucuları dağıtan bir lasthosts.cgi kullanmak, son değiştirilme ve etag bilgileri ile var olan bir hosts.txt dosyasını kullanmaktan daha verimli ve daha anonim olabilir.

source: A sample implementation is on stats.i2p at <a href="%(url)s">%(url)s</a>. This script returns an Etag with a timestamp. When a request comes in with the If-None-Match etag, the script ONLY returns new hosts since that timestamp, or 304 Not Modified if there are none. In this way, the script efficiently returns only the hosts the subscriber does not know about, in an address book-compatible manner.
pt: Uma implementação de exemplo está em stats.i2p em <a href="%(url)s">%(url)s</a>. Este script retorna uma Etag com um registro de data e hora. Quando uma solicitação chega com a etag If-None-Match, o script SOMENTE retorna novos hosts desde aquele registro de data e hora, ou 304 Not Modified se não houver nenhum. Dessa forma, o script retorna eficientemente apenas os hosts que o assinante não conhece, de forma compatível com o catálogo de endereços.
tr: Örneğin stats.i2p üzerindeki <a href="%(url)s">%(url)s</a> uygulaması. Bu betik, zaman damgalı bir Etag sonucu döndürür. If-None-Match etag bilgisi ile bir istek yapıldığında, betik YALNIZ bu zaman damgasından sonraki yeni sunucuları ya da yoksa 304 Not Modified sonucunu döndürür. Böylece, betik, yalnızca abonenin bilmediği sunucuları adres defterine uyumlu ve verimli bir şekilde döndürür.

source: So the inefficiency is not a big issue and there are several ways to improve things without radical change.
pt: Portanto, a ineficiência não é um grande problema e há várias maneiras de melhorar as coisas sem mudanças radicais.
tr: Dolayısıyla verimsizlik büyük bir sorun değil ve radikal değişiklikler yapmadan durumu iyileştirmenin birkaç yolu var.

source: <b>Not Scalable:</b> The 400K hosts.txt (with linear search) isn't that big at the moment and we can probably grow by 10x or 100x before it's a problem.
pt: <b>Não escalável:</b> O arquivo hosts.txt de 400K (com pesquisa linear) não é tão grande no momento e provavelmente podemos aumentar em 10x ou 100x antes que se torne um problema.
tr: <b>Ölçeklenebilir değil:</b> 400K boyutundaki hosts.txt (doğrusal arama ile) dosyası şu anda o kadar da büyük değil ve büyük olasılıkla bir soruna yol açmadan 10 ya da 100 katına çıkarabiliriz.

source: As far as network traffic see above. But unless you're going to do a slow real-time query over the network for a key, you need to have the whole set of keys stored locally, at a cost of about 500 bytes per key.
pt: Quanto ao tráfego de rede, veja acima. Mas, a menos que você vá fazer uma consulta lenta em tempo real pela rede para uma chave, você precisa ter todo o conjunto de chaves armazenado localmente, a um custo de cerca de 500 bytes por chave.
tr: Ağ trafiği açısından, yukarıya bakabilirsiniz. Ancak, bir anahtar için ağ üzerinden yavaş bir gerçek zamanlı sorgu yapmayacaksanız, tüm anahtar kümesini, anahtar başına yaklaşık 500 bayt maliyetle yerel olarak depolamanız gerekir.

source: <b>Requires configuration and "trust":</b> Out-of-the-box address book is only subscribed to http://www.i2p2.i2p/hosts.txt, which is rarely updated, leading to poor new-user experience.
pt: <b>Requer configuração e "confiança":</b> O catálogo de endereços pronto para uso é assinado apenas em http://www.i2p2.i2p/hosts.txt, que raramente é atualizado, levando a uma experiência ruim para novos usuários.
tr: <b>Yapılandırma ve "güvenmeyi" gerektirir:</b> Kullanıma hazır adres defteri yalnızca http://www.i2p2.i2p/hosts.txt adresine abonedir ve nadiren güncellenir. Bu durum yeni kullanıcı deneyiminin kötüleşmesine neden olur.

source: This is very much intentional. jrandom wants a user to "trust" a hosts.txt provider, and as he likes to say, "trust is not a boolean". The configuration step attempts to force users to think about issues of trust in an anonymous network.
pt: Isso é muito intencional. jrandom quer que um usuário "confie" em um provedor hosts.txt e, como ele gosta de dizer, "confiança não é um booleano". A etapa de configuração tenta forçar os usuários a pensar sobre questões de confiança em uma rede anônima.
tr: Bu durum çok kasıtlı olarak düşünülmüştür. jrandom, bir kullanıcının bir hosts.txt hizmeti sağlayıcısına "güvenmesini" ister ve kendisinin de söylemeyi sevdiği gibi, "güvenmek bir evet/hayır konusu değildir". Yapılandırma adımı, kullanıcıların anonim bir ağdaki güven sorunları hakkında düşünmesini sağlar.

source: As another example, the "I2P Site Unknown" error page in the HTTP Proxy lists some jump services, but doesn't "recommend" any one in particular, and it's up to the user to pick one (or not). jrandom would say we trust the listed providers enough to list them but not enough to automatically go fetch the key from them.
pt: Como outro exemplo, a página de erro "I2P Site Unknown" no proxy HTTP lista alguns serviços de salto, mas não "recomenda" nenhum em particular, e cabe ao usuário escolher um (ou não). jrandom diria que confiamos nos provedores listados o suficiente para listá-los, mas não o suficiente para buscar automaticamente a chave deles.
tr: Başka bir örnek olarak, HTTP vekil sunucusundaki "I2P Sitesi Bilinmiyor" hata sayfası bazı atlama hizmetlerini listeler. Ancak özellikle herhangi birini "önermez" ve birini seçmek (ya da seçmemek) kullanıcıya bağlıdır. jrandom, listelenen hizmet sağlayıcılara onları listeleyecek kadar güvendiğimizi ancak anahtarı onlardan otomatik olarak alacak kadar güvenmediğimizi söylerdi.

source: How successful this is, I'm not sure. But there must be some sort of hierarchy of trust for the naming system. To treat everyone equally may increase the risk of hijacking.
pt: Não tenho certeza do sucesso disso. Mas deve haver algum tipo de hierarquia de confiança para o sistema de nomenclatura. Tratar todos igualmente pode aumentar o risco de sequestro.
tr: Bu uygulama ne kadar başarılı, emin değilim. Ancak adlandırma sistemi için bir tür güven hiyerarşisi olmalıdır. Herkese eşit davranmak, hırsızlık riskini artırabilir.

source: <b>It isn't DNS</b>
pt: <b>Não é DNS</b>
tr: <b>Bu bir DNS değildir</b>

source: Unfortunately real-time lookups over i2p would significantly slow down web browsing.
pt: Infelizmente, pesquisas em tempo real via i2p tornariam a navegação na web significativamente mais lenta.
tr: Ne yazık ki, i2p üzerinden gerçek zamanlı arama yapmak, internet üzerinde gezinmeyi önemli ölçüde yavaşlatır.

source: Also, DNS is based on lookups with limited caching and time-to-live, while i2p keys are permanent.
pt: Além disso, o DNS é baseado em pesquisas com cache limitado e tempo de vida, enquanto as chaves i2p são permanentes.
tr: Ayrıca DNS, aramalarda sınırlı ön belleğe alma ve ayrılma süresi temelinde işlerken i2p anahtarları kalıcıdır.

source: Sure, we could make it work, but why? It's a bad fit.
pt: Claro, poderíamos fazer funcionar, mas por quê? Não é um bom ajuste.
tr: Tabi ki bunu işletecek bir yol bulabiliriz, ama neden? Bu kötü bir uyum olur.

source: <b>Not reliable:</b> It depends on specific servers for address book subscriptions.
pt: <b>Não confiável:</b> Depende de servidores específicos para assinaturas de catálogo de endereços.
tr: <b>Güvenilir değil:</b> Adres defteri abonelikleri için belirli sunuculara bağlı olur.

source: Yes it depends on a few servers that you have configured. Within i2p, servers and services come and go. Any other centralized system (for example DNS root servers) would have the same problem. A completely decentralized system (everybody is authoritative) is possible by implementing an "everybody is a root DNS server" solution, or by something even simpler, like a script that adds everybody in your hosts.txt to your address book.
pt: Sim, depende de alguns servidores que você configurou. Dentro do i2p, servidores e serviços vêm e vão. Qualquer outro sistema centralizado (por exemplo, servidores raiz DNS) teria o mesmo problema. Um sistema completamente descentralizado (todos são autoritativos) é possível implementando uma solução "todos são servidores DNS raiz" ou algo ainda mais simples, como um script que adiciona todos em seu hosts.txt ao seu catálogo de endereços.
tr: Evet, yapılandırdığınız birkaç sunucuya bağlı olur. i2p üzerinde ise sunucular ve hizmetler bugün var yarın yok olabilir. Diğer herhangi bir merkezi sistem (örneğin, DNS kök sunucuları) aynı sorunu yaşayacaktır. Tamamen merkezi olmayan bir sistem (herkesin yetkili olduğu) ile "herkes bir kök DNS sunucusudur" çözümünü uygulayarak ya da hosts.txt dosyanızdaki herkesi adres defterinize ekleyen bir betik gibi daha da basit bir şeyle oluşturulabilir.

source: People advocating all-authoritative solutions generally haven't thought through the issues of conflicts and hijacking, however.
pt: No entanto, as pessoas que defendem soluções totalmente autoritativas geralmente não pensaram nas questões de conflitos e sequestros.
tr: Bununla birlikte, merkezi ve tam yetkili çözümleri savunan kişiler, genellikle çatışmalar ve uçak kaçırma gibi konuları düşünmediler.

source: <b>Awkward, not real-time:</b> It's a patchwork of hosts.txt providers, key-add web form providers, jump service providers, I2P Site status reporters. Jump servers and subscriptions are a pain, it should just work like DNS.
pt: <b>Estranho, não em tempo real:</b> É uma colcha de retalhos de provedores hosts.txt, provedores de formulários web de adição de chaves, provedores de serviços de jump, repórteres de status de sites I2P. Servidores de jump e assinaturas são um problema, deveriam funcionar como DNS.
tr: <b>Garip ama gerçek zamanlı değil:</b> Bu yapı, hosts.txt sağlayıcıları, anahtar ekleme internet formu hizmeti sağlayıcıları, atlama hizmeti sağlayıcıları, I2P sitesi durumu bildirme hizmetlerinden oluşan bir yamalı bohçadır. Atlama sunucuları ve abonelikler bir sorundur, yalnızca DNS gibi çalışmalıdır.

source: See the reliability and trust sections.
pt: Veja as seções de confiabilidade e confiança.
tr: Güvenilirlik ve güven bölümlerine bakın.

source: So, in summary, the current system is not horribly broken, inefficient, or un-scalable, and proposals to "just use DNS" aren't well thought-through.
pt: Então, em resumo, o sistema atual não está terrivelmente quebrado, ineficiente ou não escalável, e as propostas de "apenas usar DNS" não são bem pensadas.
tr: Özetle, var olan sistem korkunç bir şekilde bozuk, verimsiz veya ölçeklenemez değil ve "yalnızca DNS kullanma" önerileri üzerinde de iyice düşünülmüş değil.

source: Alternatives
pt: Alternativas
tr: Alternatifler

source: The I2P source contains several pluggable naming systems and supports configuration options to enable experimentation with naming systems.
pt: A fonte I2P contém vários sistemas de nomenclatura plugáveis e suporta opções de configuração para permitir a experimentação com sistemas de nomenclatura.
tr: I2P kaynağında, birkaç değiştirilebilir adlandırma sistemi bulunur ve adlandırma sistemleriyle denemeyi etkinleştiren yapılandırma seçeneklerini destekler.

source: <b>Meta</b> - calls two or more other naming systems in order. By default, calls PetName then HostsTxt.
pt: <b>Meta</b> - chama dois ou mais outros sistemas de nomenclatura em ordem. Por padrão, chama PetName e depois HostsTxt.
tr: <b>Meta</b> - Sırayla iki veya daha fazla başka adlandırma sistemini çağırır. Varsayılan olarak, PetName ve ardından HostsTxt çağrılır.

source: <b>PetName</b> - Looks up in a petnames.txt file. The format for this file is NOT the same as hosts.txt.
pt: <b>PetName</b> - Procura em um arquivo petnames.txt. O formato deste arquivo NÃO é o mesmo que hosts.txt.
tr: <b>PetName</b> - Bir petnames.txt dosyasında arar. Bu dosyanın biçimi hosts.txt ile aynı DEĞİLDİR.

source: <b>HostsTxt</b> - Looks up in the following files, in order:
pt: <b>HostsTxt</b> - Procura nos seguintes arquivos, em ordem:
tr: <b>HostsTxt</b> - Sırasıyla aşağıdaki dosyalara bakar:

source: <b>AddressDB</b> - Each host is listed in a separate file in a addressDb/ directory.
pt: <b>AddressDB</b> - Cada host é listado em um arquivo separado em um diretório addressDb/.
tr: <b>AddressDB</b> - Her sunucu, bir addressDb/ klasöründe ayrı bir dosyada listelenir.

source: <b>Eepget</b> - does an HTTP lookup request from an external server - must be stacked after the HostsTxt lookup with Meta. This could augment or replace the jump system. Includes in-memory caching.
pt: <b>Eepget</b> - faz uma solicitação de pesquisa HTTP de um servidor externo - deve ser empilhado após a pesquisa HostsTxt com Meta. Isso pode aumentar ou substituir o sistema de salto. Inclui cache na memória.
tr: <b>Eepget</b> - Bir dış sunucudan bir HTTP arama isteği yapar - Meta ile HostsTxt aramasından sonra gelmelidir. Bu, atlama sistemini artırabilir veya değiştirebilir. Bellek içi ön belleğe alma özelliği vardır.

source: <b>Exec</b> - calls an external program for lookup, allows additional experimentation in lookup schemes, independent of java. Can be used after HostsTxt or as the sole naming system. Includes in-memory caching.
pt: <b>Exec</b> - chama um programa externo para pesquisa, permite experimentação adicional em esquemas de pesquisa, independente de Java. Pode ser usado após HostsTxt ou como o único sistema de nomenclatura. Inclui cache na memória.
tr: <b>Exec</b> - arama için bir dış program çağırır, Java dışında bağımsız arama şemalarında ek deneylere izin verir. HostsTxt aramasından sonra veya tek adlandırma sistemi olarak kullanılabilir. Bellek içi ön belleğe alma özelliği vardır.

source: <b>Dummy</b> - used as a fallback for Base64 names, otherwise fails.
pt: <b>Dummy</b> - usado como fallback para nomes Base64, caso contrário falha.
tr: <b>Dummy</b> - Base64 adları için yedek olarak kullanılır. Yoksa başarısız olur.

source: The current naming system can be changed with the advanced config option 'i2p.naming.impl' (restart required). See core/java/src/net/i2p/client/naming for details.
pt: O sistema de nomenclatura atual pode ser alterado com a opção de configuração avançada 'i2p.naming.impl' (reinicialização necessária). Consulte core/java/src/net/i2p/client/naming para obter detalhes.
tr: Geçerli adlandırma sistemi, gelişmiş yapılandırma seçeneği 'i2p.naming.impl' ile değiştirilebilir (yeniden başlatma gerekir). Ayrıntılar için core/java/src/net/i2p/client/names bölümüne bakabilirsiniz.

source: Any new system should be stacked with HostsTxt, or should implement local storage and/or the address book subscription functions, since address book only knows about the hosts.txt files and format.
pt: Qualquer novo sistema deve ser empilhado com HostsTxt, ou deve implementar o armazenamento local e/ou as funções de assinatura do catálogo de endereços, já que o catálogo de endereços só conhece os arquivos hosts.txt e o formato.
tr: Adres defteri yalnızca hosts.txt dosyalarını ve biçimini bildiğinden, herhangi bir yeni sistem HostsTxt ardından gelmelidir veya yerel depolama ve/veya adres defteri abonelik işlevlerini uygulamalıdır.

source: Certificates
pt: Certificados
tr: Sertifikalar

source: I2P destinations contain a certificate, however at the moment that certificate is always null. With a null certificate, base64 destinations are always 516 bytes ending in "AAAA", and this is checked in the address book merge mechanism, and possibly other places. Also, there is no method available to generate a certificate or add it to a destination. So these will have to be updated to implement certificates.
pt: Destinos I2P contêm um certificado, no entanto, no momento em que o certificado é sempre nulo. Com um certificado nulo, destinos base64 são sempre 516 bytes terminando em "AAAA", e isso é verificado no mecanismo de mesclagem do catálogo de endereços e possivelmente em outros lugares. Além disso, não há método disponível para gerar um certificado ou adicioná-lo a um destino . Portanto, eles terão que ser atualizados para implementar certificados.
tr: I2P hedeflerinde bir sertifika bulunur. Ancak şu anda sertifika her zaman Null değerindedir. Bir null sertifika ile, base64 hedefleri her zaman "AAAA" ile biten 516 bayttır Sertifika, bu adres defteri birleştirme yöntemi ile ve başka yerlerde de kontrol ediliyor olabilir. Ayrıca, bir sertifika oluşturmak veya bir hedefe eklemek için kullanılabilecek bir yöntem yoktur. Bu nedenle, sertifikaları uygulamak için bunların güncellenmesi gerekecek.

source: One possible use of certificates is for <a href="%(todo)s#hashcash">proof of work</a>.
pt: Um uso possível de certificados é para <a href="%(todo)s#hashcash">prova de trabalho</a>.
tr: Sertifikaların olası bir kullanımı <a href="%(todo)s#hashcash">çalışma kanıtıdır</a>.

source: Another is for "subdomains" (in quotes because there is really no such thing, i2p uses a flat naming system) to be signed by the 2nd level domain's keys.
pt: Outra é que "subdomínios" (entre aspas porque não existe tal coisa, i2p usa um sistema de nomenclatura simples) sejam assinados pelas chaves do domínio de 2º nível.
tr: Bir diğeri "alt etki alanları" içindir (tırnak içinde çünkü gerçekte böyle bir şey yoktur, i2p düz bir adlandırma sistemi kullanır) 2. düzey etki alanının anahtarları tarafından imzalanacak.
