Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: For those who are concerned, the gitlab-ce Docker image is built using only Ubuntu Docker images as a parent, which are built from scratch images. Since there are no third-party images involved here, updates should come as soon as they are available in the host images. To review the Dockerfile for yourself, visit the <a href="https://gitlab.com/gitlab-org/omnibus-gitlab/-/blob/master/docker/Dockerfile">Gitlab source code</a>.
pt: Para aqueles que estão preocupados, a imagem Docker gitlab-ce é construída usando apenas imagens Docker do Ubuntu como pai, que são construídas a partir de imagens do zero. Como não há imagens de terceiros envolvidas aqui, as atualizações devem vir assim que estiverem disponíveis nas imagens do host. Para revisar o Dockerfile por si mesmo, visite o <a href="https://gitlab.com/gitlab-org/omnibus-gitlab/-/blob/master/docker/Dockerfile">código-fonte do Gitlab</a>.
tr: İlgilenenler için gitlab-ce Docker kalıbı, sıfırdan ve üst öge olarak Ubuntu Docker kalıpları kullanılarak oluşturulmuştur. Burada üçüncü taraf kalıpları bulunmadığından, güncellemeler sunucu kalıplarına eklenir eklenmez gelmelidir. Dockerfile kalıbını kendiniz incelemek isterseniz <a href="https://gitlab.com/gitlab-org/omnibus-gitlab/-/blob/master/docker/Dockerfile">GitLab kaynak kodu</a> bölümüne bakabilirsiniz.

source: Set up an I2P HTTP Proxy for Gitlab to use(Important information, optional steps)
pt: Configurar um proxy HTTP I2P para uso do Gitlab (informações importantes, etapas opcionais)
tr: GitLab kullanımı için bir I2P HTTP vekil sunucusu kurun (önemli bilgiler, isteğe bağlı adımlar)

source: Gitlab servers inside of I2P can be run with or without the ability to interact with servers on the internet outside of I2P. In the case where the Gitlab server is <em>not allowed</em> to interact with servers outside of I2P, they cannot be de-anonymized by cloning a git repository from a git server on the internet outside of I2P. They can, however, export and mirror repositories from other git services inside of I2P.
pt: Os servidores Gitlab dentro do I2P podem ser executados com ou sem a capacidade de interagir com servidores na internet fora do I2P. No caso em que o servidor Gitlab <em>não tem permissão</em> para interagir com servidores fora do I2P, eles não podem ser desanonimizados clonando um repositório git de um servidor git na internet fora do I2P. Eles podem, no entanto, exportar e espelhar repositórios de outros serviços git dentro do I2P.
tr: I2P içindeki GitLab sunucuları, I2P dışındaki İnternet üzerindeki sunucularla etkileşime girme yeteneği olarak ya da olmayarak işletilebilir. GitLab sunucusunun I2P dışındaki sunucularla etkileşimine <em>izin verilmediği</em> bir durumda, I2P dışındaki İnternet üzerindeki bir Git sunucusundan bir Git deposunu kopyalayarak anonim hale getiremezler. Bununla birlikte, I2P içindeki diğer Git hizmetlerinden depoları dışa aktarabilir ve yansıtabilirler.

source: In the case where the Gitlab server is <em>allowed</em> to interact with servers outside of I2P, it can act as a “Bridge” for the users, who can use it to mirror content outside I2P to an I2P-accessible source, however it <em>is not anonymous</em> in this case. Git services on the non-anonymous internet will be connected to directly.
pt: No caso em que o servidor Gitlab tem <em>permissão</em> para interagir com servidores fora do I2P, ele pode atuar como uma “Ponte” para os usuários, que podem usá-lo para espelhar conteúdo fora do I2P para uma fonte acessível ao I2P, no entanto, ele <em>não é anônimo</em> neste caso. Os serviços Git na internet não anônima serão conectados diretamente.
tr: GitLab sunucusunun I2P dışındaki sunucularla etkileşimine <em>izin verildiği</em> durumlarda, I2P dışındaki içeriği I2P ile erişilebilir bir kaynağa yansıtmak için kullanıcılar tarafından kullanılabilen bir "Köprü" görevi görebilir. Ancak <em>bu kullanım anonim değildir</em>. Anonim olmayan İnternet üzerindeki Git hizmetleri ile doğrudan bağlantı kurulacaktır.

source: <strong>If you want to have a bridged, non-anonymous Gitlab instance with access to</strong> <strong>web repositories,</strong> no further modification is necessary.
pt: <strong>Se você quiser ter uma instância Gitlab não anônima e em ponte com acesso a</strong> <strong>repositórios web,</strong> nenhuma modificação adicional é necessária.
tr: <strong>İnternet depolarına</strong> erişmek için <strong>köprülenmiş, anonim olmayan bir GitLab kopyası işletmek istiyorsanız</strong> daha fazla değişiklik yapmanız gerekmez.

source: <strong>If you want to have an I2P-Only Gitlab instance with no access to Web-Only</strong> <strong>Repositories</strong>, you will need to configure Gitlab to use an I2P HTTP Proxy. Since the default I2P HTTP proxy only listens on <code>127.0.0.1</code>, you will need to set up a new one for Docker that listens on the Host/Gateway address of the Docker network, which is usually <code>172.17.0.1</code>. I configure mine on port <code>4446</code>.
pt: <strong>Se você quiser ter uma instância Gitlab somente I2P sem acesso aos repositórios somente Web</strong> <strong></strong>, você precisará configurar o Gitlab para usar um proxy HTTP I2P. Como o proxy HTTP I2P padrão escuta apenas em <code>127.0.0.1</code>, você precisará configurar um novo para o Docker que escuta no endereço Host/Gateway da rede Docker, que geralmente é <code>172.17.0.1</code>. Eu configuro o meu na porta <code>4446</code>.
tr: <strong>Depolara</strong> erişmek için <strong>yalnızca internet erişimi olmayan bir I2P GitLab kopyası işletmek istiyorsanız</strong>, GitLab yapılandırmasını bir I2P HTTP vekil sunucusu kullanacak şekilde ayarlamanız gerekir. Varsayılan I2P HTTP vekil sunucusu yalnızca <code>127.0.0.1</code> adresinden dinlediğinden, Docker ağının sunucu/ağ geçidi adresini dinleyen Docker için genellikle <code>172.17.0.1</code> olan yeni bir arayüz ayarlamanız gerekecektir. Benimkini <code>4446</code> bağlantı noktası için yapılandırıyorum.

source: Start the Container Locally
pt: Inicie o contêiner localmente
tr: Kapsayıcıyı Yerel Olarak Başlatın

source: Once you have that set up, you can start the container and publish your Gitlab instance locally.
pt: Depois de configurar isso, você pode iniciar o contêiner e publicar sua instância do Gitlab localmente.
tr: Bu kurulumu yaptıktan sonra kapsayıcıyı başlatabilir ve GitLab kopyanızı yerel olarak yayınlayabilirsiniz.

source: Visit your Local Gitlab instance and set up your admin account. Choose a strong password, and configure user account limits to match your resources.
pt: Visite sua instância do Gitlab local e configure sua conta de administrador. Escolha uma senha forte e configure os limites da conta de usuário para corresponder aos seus recursos.
tr: Yerel GitLab kopyanızı ziyaret edin ve yönetici hesabınızı ayarlayın. Güçlü bir parola seçin ve kaynaklarınıza uygun kullanıcı hesabı sınırlamalarını yapılandırın.

source: Modify gitlab.rb(Optional, but a good idea for “Bridged non-anonymous” hosts)
pt: Modifique gitlab.rb (opcional, mas uma boa ideia para hosts “Bridged non-anonymous”)
tr: gitlab.rb dosyasını değiştirin (isteğe bağlı, ama "köprülenmiş anonim olmayan" sunucular için iyi bir fikir)

source: It’s also possible to apply your HTTP Proxy settings in a more granular way, so that you can only allow users to mirror repositories from the domains that you choose. Since the domain is presumably operated by an organization, you can use this to ensure that repositories that are mirrorable follow a reasonable set of policies. After all, there is far more abusive content on the non-anonymous internet than there is on I2P, we wouldn’t want to make it too easy to introduce abusive content from such a nefarious place.
pt: Também é possível aplicar suas configurações de Proxy HTTP de uma forma mais granular, para que você possa permitir que usuários espelhem repositórios somente dos domínios que você escolher. Como o domínio é presumivelmente operado por uma organização, você pode usar isso para garantir que repositórios que são espelháveis sigam um conjunto razoável de políticas. Afinal, há muito mais conteúdo abusivo na internet não anônima do que no I2P, não gostaríamos de tornar muito fácil introduzir conteúdo abusivo de um lugar tão nefasto.
tr: HTTP vekil sunucu ayarlarınızı daha ayrıntılı bir şekilde de uygulayabilirsiniz. Böylece kullanıcıların yalnızca seçtiğiniz etki alanlarındaki depoları yansıtmasını sağlayabilirsiniz. Etki alanı muhtemelen bir kuruluş tarafından işletildiğinden, yansıtılabilir depoların makul bir ilke kümesine uymasını sağlamak için bunu kullanabilirsiniz. Ne de olsa, anonim olmayan İnternet üzerinde I2P üzerindekinden çok daha fazla taciz edici içerik var. Bu kadar kötü bir yerden taciz edici içeriğin sunulmasını çok kolaylaştırmak istemeyiz.

source: Add the following lines to your gitlab.rb file inside the /src/gitlab/config container. These settings will take effect when you restart in a moment.
pt: Adicione as seguintes linhas ao seu arquivo gitlab.rb dentro do contêiner /src/gitlab/config. Essas configurações entrarão em vigor quando você reiniciar em um momento.
tr: /src/gitlab/config kapsayıcısının içindeki gitlab.rb dosyanıza aşağıdaki satırları ekleyin. Bu ayarlar, biraz sonra yeniden başlattığınızda geçerlilik kazanacak.

source: Set up your Service tunnels and sign up for a Hostname
pt: Configure seus túneis de serviço e inscreva-se para um nome de host
tr: Hizmet tünellerinizi kurun ve bir sunucu adı kaydı yapın

source: Once you have Gitlab set up locally, go to the I2P Router console. You will need to set up two server tunnels, one leading to the Gitlab web(HTTP) interface on TCP port 8080, and one to the Gitlab SSH interface on TCP Port 8022.
pt: Depois que você tiver o Gitlab configurado localmente, vá para o console do I2P Router. Você precisará configurar dois túneis de servidor, um levando à interface web (HTTP) do Gitlab na porta TCP 8080, e um para a interface SSH do Gitlab na porta TCP 8022.
tr: GitLab yerel olarak kurulduktan sonra, I2P yöneltici panosuna gidin. Biri 8080 TCP bağlantı noktası üzerindeki GitLab internet (HTTP) arabirimine ve diğeri 802 TCP bağlantı noktası üzerindeki GitLab SSH arabirimine gidişte iki sunucu tüneli kurmanız gerekecek.

source: Gitlab Web(HTTP) Interface
pt: Interface Web (HTTP) do Gitlab
tr: GitLab internet (HTTP) arabirimi

source: For the Web interface, use an “HTTP” server tunnel. From <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> launch the “New Tunnel Wizard” and enter the following values at each step:
pt: Para a interface Web, use um túnel de servidor “HTTP”. De <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> inicie o “New Tunnel Wizard” e insira os seguintes valores em cada etapa:
tr: İnternet arayüzü için bir “HTTP” sunucu tüneli kullanın. <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> adresinden “Yeni tünel yardımcısını” başlatın ve her adımda aşağıdaki şekilde ilerleyin:

source: Select “Server Tunnel”
pt: Selecione “Túnel do Servidor”
tr: “Sunucu tüneli" seçin

source: Select “HTTP Server”
pt: Selecione “Servidor HTTP”
tr: “HTTP sunucu” seçin

source: Fill in “Gitlab Web Service” or otherwise describe the tunnel
pt: Preencha “Gitlab Web Service” ou descreva o túnel de outra forma
tr: “GitLab internet hizmetini” doldurun veya tüneli başka bir şekilde tanımlayın

source: Fill in <code>127.0.0.1</code> for the host and <code>8080</code> for the port.
pt: Preencha <code>127.0.0.1</code> para o host e <code>8080</code> para a porta.
tr: Sunucu olarak <code>127.0.0.1</code> ve bağlantı noktası olarak <code>8080</code> yazın.

source: Select “Automatically start tunnel when Router Starts”
pt: Selecione “Iniciar túnel automaticamente quando o roteador iniciar”
tr: “Yöneltici başlatıldığında tünel de otomatik olarak başlatılsın” olarak seçin

source: Confirm your selections.
pt: Confirme suas seleções.
tr: Seçimlerinizi doğrulayın

source: Register a Hostname(Optional)
pt: Registre um nome de host (opcional)
tr: Bir sunucu adı kaydedin (isteğe bağlı)

source: Web services on I2P can register hostnames for themselves by providing an authentication string to a jump service provider like <a href="http://stats.i2p">stats.i2p</a>. To do this, open the <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> again and click on the “Gitlab Web Service” item you just set up. Scroll to the bottom of the “Edit Server Settings” section and click Registration Authentication. Copy the field that says “Authentication for adding Hostname” and visit <a href="http://stats.i2p/i2p/addkey.html">stats.i2p</a> to add your hostname. Note that if you want to use a subdomain(Like git.idk.i2p) then you will have to use the correct authentication string for your subdomain, which is a little bit more complicated and merits it’s own instructions.
pt: Os serviços da Web no I2P podem registrar nomes de host para si mesmos fornecendo uma sequência de autenticação para um provedor de serviços de salto como <a href="http://stats.i2p">stats.i2p</a>. Para fazer isso, abra o <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> novamente e clique no item “Gitlab Web Service” que você acabou de configurar. Role até o final da seção “Edit Server Settings” e clique em Registration Authentication. Copie o campo que diz “Authentication for adding Hostname” e visite <a href="http://stats.i2p/i2p/addkey.html">stats.i2p</a> para adicionar seu nome de host. Observe que se você quiser usar um subdomínio (como git.idk.i2p), você terá que usar a sequência de autenticação correta para seu subdomínio, o que é um pouco mais complicado e merece suas próprias instruções.
tr: I2P üzerindeki internet hizmetleri,<a href="http://stats.i2p">stats.i2p</a> gibi bir atlama hizmeti sağlayıcısına bir kimlik doğrulama dizgesi göndererek kendilerinin sunucu adlarını kaydedebilir. Bunun için <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> dosyasını yeniden açın ve az önce kurduğunuz “GitLab internet hizmeti” ögesine tıklayın. "Sunucu ayarlarını düzenle" bölümünün en altına gidin ve kayıt kimlik doğrulaması üzerine tıklayın. Sunucu adı eklemek için kimlik doğrulaması yazan alanı kopyalayın ve sunucu adınızı eklemek için <a href="http://stats.i2p/i2p/addkey.html">stats.i2p</a> adresine gidin. Bir alt etki alanı kullanmak istiyorsanız (git.idk.i2p gibi) alt etki alanınız için doğru kimlik doğrulama dizgesini kullanmanız gerektiğini unutmayın. Bu işlem biraz daha karmaşıktır ve ayrı yönergeler yazılması gerekir.

source: Gitlab SSH Interface
pt: Interface SSH do Gitlab
tr: GitLab SSH Arayüzü

source: For the SSH interface, use a “Standard” server tunnel. From <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> launch the “New Tunnel Wizard” and enter the following values at each step:
pt: Para a interface SSH, use um túnel de servidor “Standard”. De <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> inicie o “New Tunnel Wizard” e insira os seguintes valores em cada etapa:
tr: SSH arayüzü için bir “Standart” sunucu tüneli kullanın. <a href="http://127.0.0.1:7657/i2ptunnelmgr">http://127.0.0.1:7657/i2ptunnelmgr</a> adresinden “Yeni tünel yardımcısını” başlatın ve her adımda aşağıdaki şekilde ilerleyin:

source: Select “Standard Server”
pt: Selecione “Servidor Padrão”
tr: “Standart sunucu” seçin

source: Fill in “Gitlab SSH Service” or otherwise describe the tunnel
pt: Preencha “Gitlab SSH Service” ou descreva o túnel de outra forma
tr: “GitLab SSH hizmeti” yazın veya tünele başka bir ad yazın

source: Fill in <code>127.0.0.1</code> for the host and <code>8022</code> for the port.
pt: Preencha <code>127.0.0.1</code> para o host e <code>8022</code> para a porta.
tr: Sunucu olarak <code>127.0.0.1</code> ve bağlantı noktası olarak <code>8022</code> yazın.

source: Re-start the Gitlab Service with the new Hostname
pt: Reinicie o serviço Gitlab com o novo nome de host
tr: GitLab hizmetini yeni sunucu adı ile yeniden başlatın

source: Finally, if you either modified <code>gitlab.rb</code> or you registered a hostname, you will need to re-start the gitlab service for the settings to take effect.
pt: Por fim, se você modificou <code>gitlab.rb</code> ou registrou um nome de host, será necessário reiniciar o serviço gitlab para que as configurações entrem em vigor.
tr: Son olarak, <code>gitlab.rb</code> dosyasını değiştirdiyseniz veya bir sunucu adı kaydettiyseniz, ayarların geçerli olması için GitLab hizmetini yeniden başlatmanız gerekir.

source: Configuring IRC Software
pt: Configurando o software IRC
tr: IRC Uygulamasını Yapılandırmak

source: IRC Software
pt: Software IRC
tr: IRC Uygulaması

source: Clients
pt: Clientes
tr: İstemciler

source: There are many IRC clients that can be used with I2P. In fact, all IRC clients can be connected to the Irc2P Service by connecting them to the IRC Tunnel.
pt: Existem muitos clientes IRC que podem ser usados com I2P. Na verdade, todos os clientes IRC podem ser conectados ao serviço Irc2P conectando-os ao túnel IRC.
tr: I2P ile kullanılabilecek birçok IRC istemcisi var. Aslında, tüm IRC istemcileri, IRC tüneli ile bağlantı kurarak Irc2P hizmetine bağlanabilir.

source: To configure any IRC client to chat on Irc2P, first, make sure that your IRC tunnel is available. Visit the <a href="http://127.0.0.1:7657/i2ptunnel/">Hidden Services Manager</a> and look for Irc2P in your "Client Tunnels" section. If the "Status" indicator on the right-hand side is yellow or green, your Irc2P tunnel is ready and you should proceed to the next step.
pt: Para configurar qualquer cliente IRC para conversar no Irc2P, primeiro, certifique-se de que seu túnel IRC esteja disponível. Visite o <a href="http://127.0.0.1:7657/i2ptunnel/">Hidden Services Manager</a> e procure por Irc2P na sua seção "Client Tunnels". Se o indicador "Status" no lado direito estiver amarelo ou verde, seu túnel Irc2P está pronto e você deve prosseguir para a próxima etapa.
tr: Herhangi bir IRC istemcisini Irc2P üzerinde sohbet edecek şekilde yapılandırmak için önce IRC tünelinizin kullanılabilir olduğundan emin olun. <a href="http://127.0.0.1:7657/i2ptunnel/">Gizli hizmet yönetimi</a> bölümüne gidin ve "İstemci tünelleri" bölümünde Irc2P seçeneğini arayın. Sağ taraftaki "Durum" göstergesi sarı ya da yeşil ise Irc2P tüneliniz hazırdır ve bir sonraki adıma geçebilirsiniz.

source: IRC Tunnel Check
pt: Verificação do túnel IRC
tr: IRC Tünel Denetimi

source: Any IRC client can be connected to this IRC tunnel, but detailed instructions for several popular clients are provided below.
pt: Qualquer cliente IRC pode ser conectado a este túnel IRC, mas instruções detalhadas para vários clientes populares são fornecidas abaixo.
tr: Bu IRC tüneline herhangi bir IRC istemcisi bağlanabilir. Sık kullanılan birkaç istemci için ayrıntılı yönergeleri aşağıda bulabilirsiniz.

source: Pidgin is a very popular Instant Messaging client with built-in IRC support. It is also possible to use it with many other kinds of chat service, and it supports using multiple accounts at once and has a variety of plugin-ins. There is a similar application for OSX called "Adium." The instructions for Pidgin are similar in Adium.
pt: O Pidgin é um cliente de mensagens instantâneas muito popular com suporte IRC integrado. Também é possível usá-lo com muitos outros tipos de serviço de bate-papo e ele suporta o uso de várias contas ao mesmo tempo e tem uma variedade de plug-ins. Há um aplicativo semelhante para OSX chamado "Adium". As instruções para o Pidgin são semelhantes no Adium.
tr: Pidgin, yerleşik IRC desteği bulunan çok kullanılan bir anında ileti istemcisidir. Diğer birçok sohbet hizmeti ile de kullanılabilir. Aynı anda birden fazla hesap kullanılabilir. Çeşitli uygulama eklerine sahiptir. OSX için "Adium" adında benzer bir uygulama var. Pidgin yönergeleri Adium ile benzerdir.

source: Open the menu
pt: Abra o menu
tr: Menüyü açın

source: Pidgin Step One
pt: Pidgin Passo Um
tr: Pidgin birinci adım

source: After launching Pidgin, you should see a "Buddy List" window. From that window, open the "Accounts" menu from the toolbar. Select "Manage Accounts" to begin configuring your I2P account.
pt: Após iniciar o Pidgin, você deverá ver uma janela "Buddy List". A partir de essa janela, abra o menu "Accounts" na barra de ferramentas. Selecione "Manage Accounts" para começar a configurar sua conta I2P.
tr: Pidgin uygulamasını başlattıktan sonra bir "Arkadaş listesi" penceresi görmelisiniz. Bu penceredeki araç çubuğundan "Hesaplar" menüsünü açın. I2P hesabınızı yapılandırmaya başlamak için "Hesap yönetimi" üzerine tıklayın.

source: Add the account
pt: Adicionar a conta
tr: Hesabı ekleyin

source: Pidgin Step Two
pt: Pidgin Passo Dois
tr: Pidgin ikinci adım

source: Click the "Add" button. In the window that opens, select "IRC" under "Protocol," and set the "Host" to 127.0.0.1. Then pick a username and password. IRC does not require you to register a nickname to join, but you may if you wish, after you connect to Irc2P.
pt: Clique no botão "Adicionar". Na janela que se abre, selecione "IRC" em "Protocolo" e defina o "Host" para 127.0.0.1. Em seguida, escolha um nome de usuário e uma senha. O IRC não exige que você registre um apelido para entrar, mas você pode, se desejar, depois de você se conectar ao Irc2P.
tr: "Ekle" düğmesine tıklayın. Açılan pencerede, "İletişim kuralı" altından "IRC" seçin ve "Sunucu" olarak 127.0.0.1 yazın. Ardından bir kullanıcı adı ve parola seçin. IRC, üzerine katılmanız için bir takma ad kaydetmeniz zorunlu değildir. Ancak dilerseniz Irc2P bağlantısı kurduktan sonra bunu yapabilirsiniz.

source: Configure username, hostname, password
pt: Configurar nome de usuário, nome do host, senha
tr: Kullanıcı adını, sunucu adını, parolayı yapılandırın

source: Pidgin Step Three
pt: Pidgin Passo Três
tr: Pidgin üçüncü adım

source: Navigate to the "Advanced" tab and set the "Port" field to 6668 and make sure that SSL is <em>disabled</em>, since your tunnel has encryption provided by I2P.
pt: Navegue até a aba "Avançado" e defina o campo "Porta" como 6668 e certifique-se de que o SSL esteja <em>desabilitado</em>, já que seu túnel tem criptografia fornecida pelo I2P.
tr: "Gelişmiş" sekmesine gidin ve "Bağlantı noktası" alanına 6668 yazın. Tüneliniz I2P tarafından sağlanan şifrelemeyi kullandığından SSL seçeneğinin <em>devre dışı</em> bırakılmış olduğundan emin olun.

source: Configure port
pt: Configurar porta
tr: Bağlantı noktasını yapılandırın

source: Pidgin Step Four
pt: Pidgin Passo Quatro
tr: Pidgin dördüncü adım

source: Open the Server List menu of XChat and click the "Add" button.
pt: Abra o menu Lista de Servidores do XChat e clique no botão "Adicionar".
tr: XChat sunucu listesi menüsünü açın ve "Ekle" düğmesine tıklayın.

source: Add a server
pt: Adicionar um servidor
tr: Bir sunucu ekleyin

source: XChat Step One
pt: XChat Etapa Um
tr: XChat birinci adım

source: Create a new network named "Irc2P" to configure for I2P IRC. Click the "Edit" button on the right-hand side.
pt: Crie uma nova rede chamada "Irc2P" para configurar para I2P IRC. Clique no botão "Editar" no lado direito.
tr: I2P IRC için yapılandırmak üzere "Irc2P" adında yeni bir ağ oluşturun. Sağ taraftaki "Düzenle" düğmesine tıklayın.

source: XChat Step Two
pt: XChat Etapa Dois
tr: XChat ikinci adım
