Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Hoping that we can simply strap an arbitrary client on top of I2P without auditing both its behavior and its exposed protocols for security and anonymity is naive. Pretty much *every* application and protocol violates anonymity, unless it was designed for it specifically, and even then, most of those do too. That's the reality. End users are better served with systems designed for anonymity and security. Modifying existing systems to work in anonymous environments is no small feat, orders of magnitude more work that simply using the existing I2P APIs.
pt: Esperar que possamos simplesmente amarrar um cliente arbitrário em cima do I2P sem auditar tanto seu comportamento quanto seus protocolos expostos para segurança e anonimato é ingênuo. Praticamente *todos* os aplicativos e protocolos violam o anonimato, a menos que tenham sido projetados para isso especificamente, e mesmo assim, a maioria deles também o faz. Essa é a realidade. Usuários finais são mais bem atendidos com sistemas projetados para anonimato e segurança. Modificar sistemas existentes para funcionar em ambientes anônimos não é pouca coisa, ordens de magnitude mais funcionam do que simplesmente usar as APIs I2P existentes.
tr: Hem davranışını hem de güvenlik ve anonimlik için açık iletişim kurallarını denetlemeden keyfi bir istemciyi I2P ağına bağlayabileceğimizi ummak saflık olur. Hemen hemen *her* uygulama ve iletişim kuralı, özellikle bunun için tasarlanmadıkça anonimliği bozar. Ona göre tasarlanmış olanlar bile bunu yapar. Gerçek bu. Hizmetler, son kullanıcılara, anonimlik ve güvenlik için tasarlanmış sistemlerle daha iyi verilir. Var olan sistemleri anonim ortamlarda çalışacak şekilde değiştirmek az buz bir iş değil. Var olan I2P API yazılımlarını kullanmaktan çok daha büyük bir iş.

source: The SOCKS proxy supports standard address book names, but not Base64 destinations. Base32 hashes should work as of release 0.7. It supports outgoing connections only, i.e. an I2PTunnel Client. UDP support is stubbed out but not working yet. Outproxy selection by port number is stubbed out.
pt: O proxy SOCKS suporta nomes de catálogo de endereços padrão, mas não destinos Base64. Hashes Base32 devem funcionar a partir da versão 0.7. Ele suporta apenas conexões de saída, ou seja, um cliente I2PTunnel. O suporte a UDP foi desativado, mas ainda não está funcionando. A seleção de proxy de saída por número de porta foi desativada.
tr: SOCKS vekil sunucusu standart adres defteri adlarını destekler, ancak Base64 hedeflerini desteklemez. Base32 karmaları, 0.7 sürümünden başlayarak çalışır. Yalnızca gidiş bağlantılarını, yani bir I2PTunnel İstemcisini destekler. UDP desteği eklendi ancak henüz çalışmıyor. Bağlantı noktasına göre çıkış vekil sunucusu seçimi eklendi.

source: See Also
pt: Ver também
tr: Şunlara da bakabilirsiniz

source: The notes for <a href="%(meeting81)s">Meeting 81</a> and <a href="%(meeting82)s">Meeting 82</a> in March 2004.
pt: As notas para <a href="%(meeting81)s">Reunião 81</a> e <a href="%(meeting82)s">Reunião 82</a> em março de 2004.
tr: 2004 Mart ayındaki <a href="%(meeting81)s">81. toplantı</a> ve <a href="%(meeting82)s">82. toplantı</a> notları.

source: If You Do Get Something Working
pt: Se você conseguir fazer algo funcionar
tr: İşe yarayan bir şey bulursanız

source: Please let us know. And please provide substantial warnings about the risks of socks proxies.
pt: Por favor, nos avise. E por favor, forneça avisos substanciais sobre os riscos dos proxies de meias.
tr: Lütfen bize bildirin. Ve lütfen socks vekil sunucularının riskleri hakkında gerekli uyarıları yapın.

source: Streaming Protocol
pt: Protocolo de streaming
tr: Streaming iletişim kuralı

source: The streaming library is technically part of the "application" layer, as it is not a core router function. In practice, however, it provides a vital function for almost all existing I2P applications, by providing a TCP-like streams over I2P, and allowing existing apps to be easily ported to I2P. The other end-to-end transport library for client communication is the <a href="%(datagrams)s">datagram library</a>.
pt: A biblioteca de streaming é tecnicamente parte da camada de "aplicativo", pois não é uma função central do roteador. Na prática, no entanto, ela fornece uma função vital para quase todos os aplicativos I2P existentes, fornecendo fluxos semelhantes a TCP sobre I2P e permitindo que aplicativos existentes sejam facilmente portados para I2P. A outra biblioteca de transporte de ponta a ponta para comunicação com o cliente é a <a href="%(datagrams)s">biblioteca de datagramas</a>.
tr: Streaming kitaplığı, bir çekirdek yöneltici işlevi olmadığından teknik olarak "uygulama" katmanının bir parçasıdır. Ancak pratikte, I2P üzerinden TCP benzeri bir akış sağlayarak ve var olan uygulamaların kolayca I2P üzerine taşınmasını sağladığından, neredeyse var olan tüm I2P uygulamaları için hayati bir işlev sağlar. İstemci iletişimi için kullanılan diğer uçtan uca taşıyıcı kitaplığı <a href="%(datagrams)s">veri şeması kitaplığıdır</a>.

source: The streaming library is a layer on top of the core <a href="%(i2cp)s">I2CP API</a> that allows reliable, in-order, and authenticated streams of messages to operate across an unreliable, unordered, and unauthenticated message layer. Just like the TCP to IP relationship, this streaming functionality has a whole series of tradeoffs and optimizations available, but rather than embed that functionality into the base I2P code, it has been factored off into its own library both to keep the TCP-esque complexities separate and to allow alternative optimized implementations.
pt: A biblioteca de streaming é uma camada sobre o núcleo <a href="%(i2cp)s">I2CP API</a> que permite que fluxos confiáveis, ordenados e autenticados de mensagens operem em uma camada de mensagem não confiável, não ordenada e não autenticada . Assim como o relacionamento TCP para IP, essa funcionalidade de streaming tem uma série de compensações e otimizações disponíveis, mas em vez de incorporar essa funcionalidade no código I2P base, ela foi fatorada em sua própria biblioteca para manter as complexidades do TCP separadas e para permitir implementações otimizadas alternativas.
tr: Streaming kitaplığı, güvenilir, düzenli ve kimliği doğrulanmış ileti akışlarının güvenilir olmayan, sıralanmamış ve kimliği doğrulanmamış bir ileti katmanında çalışmasını sağlayan ve <a href="%(i2cp)s">I2CP API</a> çekirdeği üstünde bulunan bir katmandır. TCP ile IP ilişkisinde olduğu gibi, bu akış işlevselliğinde karşılıklı bazı özveriler ve iyileştirmeler vardır. Ancak bu işlevsellik temel I2P koduna yerleştirilmek yerine, TCP benzeri karmaşıklıkların ayrı tutulması ve farklı uygulamalara uygun şekilde eklenebilmesi için kendi kitaplığını kullanacak şekilde hazırlanmıştır.

source: In consideration of the relatively high cost of messages, the streaming library's protocol for scheduling and delivering those messages has been optimized to allow individual messages passed to contain as much information as is available. For instance, a small HTTP transaction proxied through the streaming library can be completed in a single round trip - the first messages bundle a SYN, FIN, and the small HTTP request payload, and the reply bundles the SYN, FIN, ACK, and the HTTP response payload. While an additional ACK must be transmitted to tell the HTTP server that the SYN/FIN/ACK has been received, the local HTTP proxy can often deliver the full response to the browser immediately.
pt: Considerando o custo relativamente alto das mensagens, o protocolo da biblioteca de streaming para agendamento e entrega dessas mensagens foi otimizado para permitir que mensagens individuais passadas contenham o máximo de informações disponíveis. Por exemplo, uma pequena transação HTTP com proxy através da biblioteca de streaming pode ser concluída em uma única viagem de ida e volta - as primeiras mensagens agrupam um SYN, FIN e a pequena carga útil da solicitação HTTP, e a resposta agrupa o SYN, FIN, ACK e a carga útil da resposta HTTP. Enquanto um ACK adicional deve ser transmitido para informar ao servidor HTTP que o SYN/FIN/ACK foi recebido, o proxy HTTP local pode frequentemente entregar a resposta completa ao navegador imediatamente.
tr: İletilerin nispeten yüksek maliyeti göz önüne alındığında, Streaming kitaplığının bu iletileri programlamak ve iletmek için kullandığı iletişim kuralı, iletilen bireysel iletilerin olabildiğince çok bilgi içermesini sağlayacak şekilde iyileştirilmiştir. Örneğin, Streaming kitaplığı aracılığıyla vekil sunucu üzerinden geçirilen küçük bir HTTP işlemi tek bir gidiş-dönüşte tamamlanabilir. İlk iletiler bir SYN, FIN komutları ve küçük bir HTTP isteği yükünü birleştirir ve yanıt SYN, FIN, ACK komutları ile HTTP yanıt yükü olur. HTTP sunucusuna SYN/FIN/ACK komutlarının alındığını söylemek için ek bir ACK komutu iletilmesi gerekirken, yerel HTTP vekil sunucusu genellikle tarayıcıya tam yanıtı hemen teslim edebilir.

source: The streaming library bears much resemblance to an abstraction of TCP, with its sliding windows, congestion control algorithms (both slow start and congestion avoidance), and general packet behavior (ACK, SYN, FIN, RST, rto calculation, etc).
pt: A biblioteca de streaming tem muita semelhança com uma abstração do TCP, com suas janelas deslizantes, algoritmos de controle de congestionamento (início lento e prevenção de congestionamento) e comportamento geral dos pacotes (ACK, SYN, FIN, RST, cálculo de rto, etc.).
tr: Streaming kitaplığı, kayan pencereleri, tıkanıklık kontrol algoritmaları (hem yavaş başlatma hem de tıkanıklıktan kaçınma) ve genel paket davranışı (ACK, SYN, FIN, RST, rto hesaplama, vb.) ile bir TCP soyutlamasına çok benzer.

source: The streaming library is a robust library which is optimized for operation over I2P. It has a one-phase setup, and it contains a full windowing implementation.
pt: A biblioteca de streaming é uma biblioteca robusta que é otimizada para operação sobre I2P. Ela tem uma configuração de uma fase e contém uma implementação de janela completa.
tr: Streaming kitaplığı, I2P üzerinde çalışması için iyileştirilmiş sağlam bir kitaplıktır. Kurulumu tek aşamalıdır ve tam bir pencereleme uygulaması içerir.

source: The streaming library API provides a standard socket paradigm to Java applications. The lower-level <a href="%(i2cp)s">I2CP</a> API is completely hidden, except that applications may pass <a href="%(i2cp)s#options">I2CP parameters</a> through the streaming library, to be interpreted by I2CP.
pt: A API da biblioteca de streaming fornece um paradigma de soquete padrão para aplicativos Java. A API de nível inferior <a href="%(i2cp)s">I2CP</a> é completamente oculta, exceto que aplicativos podem passar <a href="%(i2cp)s#options">parâmetros I2CP</a> pela biblioteca de streaming, para serem interpretados pelo I2CP.
tr: Streaming kitaplığı API yazılımı, Java uygulamalarına standart bir soket paradigması sağlar. Alt düzey <a href="%(i2cp)s">I2CP</a> API, uygulamaların <a href="%(i2cp)s#options">I2CP parametrelerini</a> Streaming kitaplığı üzerinden I2CP tarafından yorumlanmak üzere geçirebilmesi dışında tamamen gizlidir.

source: The standard interface to the streaming lib is for the application to use the <a href="%(i2psktmf)s">I2PSocketManagerFactory</a> to create an <a href="%(i2psktm)s">I2PSocketManager</a>. The application then asks the socket manager for an <a href="%(i2psess)s">I2PSession</a>, which will cause a connection to the router via <a href="%(i2cp)s">I2CP</a>. The application can then setup connections with an <a href="%(i2pskt)s">I2PSocket</a> or receive connections with an <a href="%(i2psskt)s">I2PServerSocket</a>.
pt: A interface padrão para a biblioteca de streaming é para o aplicativo usar o <a href="%(i2psktmf)s">I2PSocketManagerFactory</a> para criar um <a href="%(i2psktm)s">I2PSocketManager</a>. O aplicativo então solicita ao gerenciador de soquetes uma <a href="%(i2psess)s">I2PSession</a>, o que causará uma conexão com o roteador via <a href="%(i2cp)s">I2CP</a>. O aplicativo pode então configurar conexões com um <a href="%(i2pskt)s">I2PSocket</a> ou receber conexões com um <a href="%(i2psskt)s">I2PServerSocket</a>.
tr: Streaming kitaplığının standart arabirimi, uygulamanın <a href="%(i2psktmf)s">I2PSocketManagerFactory</a> kullanarak bir <a href="%(i2psktm)s">I2PSocketManager</a> oluşturmak içindir. Uygulama daha sonra soket yöneticisinden <a href="%(i2psess)s">I2PSession</a> ister ve bu da yöneltici ile <a href="%(i2cp)s">I2CP</a> üzerinden bağlantı kurulmasına neden olur. Uygulama daha sonra bir <a href="%(i2pskt)s">I2PSocket</a> ile bağlantılar kurabilir ya da bir <a href="%(i2psskt)s">I2PServerSocket</a> üzerinden bağlantılar alabilir.

source: Here are the <a href="%(url)s">full streaming library Javadocs</a>.
pt: Eis aqui o <a href="%(url)s">Javadoc completo da biblioteca de streaming</a>.
tr: Buradan <a href="%(url)s">tam Streaming kitaplığı Javadocs belgelerine</a> bakabilirsiniz .

source: For a good example of usage, see the i2psnark code.
pt: Para um bom exemplo de uso, olhe o código do i2psnark.
tr: İyi bir kullanım örneği için i2psnark koduna bakabilirsiniz.

source: Options and Defaults
pt: Opções e Padrões
tr: Ayarlar ve Varsayılanlar

source: The options and current default values are listed below. Options are case-sensitive and may be set for the whole router, for a particular client, or for an individual socket on a per-connection basis. Many values are tuned for HTTP performance over typical I2P conditions. Other applications such as peer-to-peer services are strongly encouraged to modify as necessary, by setting the options and passing them via the call to <a href="%(i2psktmf)s">I2PSocketManagerFactory</a>.createManager(_i2cpHost, _i2cpPort, opts). Time values are in ms.
pt: As opções e valores padrões atuais estão listados abaixo. As opções diferenciam maiúsculas de minúsculas e podem ser definidas para todo o roteador, para um cliente específico ou para um soquete individual em uma base de por conexão. Muitos valores são ajustados para desempenho HTTP em condições I2P típicas. Outros aplicativos, como serviços ponto a ponto, são fortemente encorajados a modificar conforme necessário, definindo as opções e passando-as por meio da chamada para <a href="%(i2psktmf)s">I2PSocketManagerFactory</a>.createManager(_i2cpHost, _i2cpPort, opts). Os valores de tempo estão em ms.
tr: Seçenekler ve var olan varsayılan değerler aşağıda listelenmiştir. Seçenekler büyük/küçük harfe duyarlıdır ve yöneltici genelinde, belirli bir istemci için ya da bağlantı bazında ayrı bir soket için ayarlanabilir. Tipik I2P koşulları üzerinde HTTP başarımı için birçok değer ayarlanmıştır. Eşler arası hizmetler gibi diğer uygulamaların, seçenekleri ayarlayarak ve <a href="%(i2psktmf)s">I2PSocketManagerFactory</a>.createManager(_i2cpHost, _i2cpPort, opts) çağrısı yoluyla ileterek gerektiği şekilde değiştirmeleri önemle önerilir. Zaman değerleri ms cinsindendir.

source: Note that higher-layer APIs, such as <a href="%(samv3)s">SAM</a>, <a href="%(bob)s">BOB</a>, and <a href="%(i2ptunnel)s">I2PTunnel</a>, may override these defaults with their own defaults. Also note that many options only apply to servers listening for incoming connections.
pt: Observe que APIs de camada superior, como <a href="%(samv3)s">SAM</a>, <a href="%(bob)s">BOB</a>e <a href="%(i2ptunnel)s">I2PTunnel</a>, podem substituir esses padrões por seus próprios padrões. Observe também que muitas opções se aplicam apenas a servidores que escutam conexões de entrada.
tr: <a href="%(samv3)s">SAM</a>, <a href="%(bob)s">BOB</a> ve <a href="%(i2ptunnel)s">I2PTunnel</a> gibi daha yüksek katman API yazılımlarının bu varsayılanları kendi varsayılan ayarları ile değiştirebileceğini unutmayın. Ayrıca, birçok seçeneğin yalnızca geliş bağlantılarını dinleyen sunucular için geçerli olduğunu unutmayın.

source: As of release 0.9.1, most, but not all, options may be changed on an active socket manager or session. See the javadocs for details.
pt: A partir da versão 0.9.1, a maioria, mas não todas, as opções podem ser alteradas em um gerenciador de soquete ou sessão ativa. Veja os javadocs para mais detalhes.
tr: 0.9.1 sürümünden başlayarak, seçeneklerin tümü olmasa da çoğu etkin bir soket yöneticisi veya oturumda değiştirilebilir. Ayrıntılı bilgi almak için javadocs belgelerine bakabilirsiniz.

source: Option
pt: Opção
tr: Seçenek

source: Default
pt: Predefinição
tr: Varsayılan

source: Notes
pt: Notas
tr: Notlar

source: Comma- or space-separated list of Base64 peer Hashes used for either access list or blacklist.
pt: Lista separada por vírgulas ou espaços de hashes de pares Base64 usados para lista de acesso ou lista negra.
tr: Erişim listesi veya kara liste için kullanılan Base64 eş karmalarının virgül ya da boşluk ile ayrılmış listesi.

source: As of release %(release)s.
pt: A partir do lançamento %(release)s.
tr: %(release)s sürümündeki gibi.

source: Use the access list as a whitelist for incoming connections.
pt: Use a lista de acesso como uma lista de permissões para conexões de entrada.
tr: Geliş bağlantıları için erişim listesi beyaz liste olarak kullanılsın.

source: The name or number of the signature type for a transient destination.
pt: O nome ou número do tipo de assinatura para um destino temporário.
tr: Geçici bir hedef için imza türünün adı veya numarası.

source: Use the access list as a blacklist for incoming connections.
pt: Use a lista de acesso como uma lista negra para conexões de entrada.
tr: Geliş bağlantıları için erişim listesi kara liste olarak kullanılsın.

source: Whether to respond to incoming pings
pt: Se deve responder a pings recebidos
tr: Gelen ping paketlerine yanıt verilip verilmeyeceği

source: Comma- or space-separated list of Base64 peer Hashes to be blacklisted for incoming connections to ALL destinations in the context. This option must be set in the context properties, NOT in the createManager() options argument. Note that setting this in the router context will not affect clients outside the router in a separate JVM and context.
pt: Lista separada por vírgula ou espaço de hashes de pares Base64 a serem colocados na lista negra para conexões de entrada para TODOS os destinos no contexto. Esta opção deve ser definida nas propriedades do contexto, NÃO no argumento de opções createManager(). Observe que definir isso no contexto do roteador não afetará clientes fora do roteador em uma JVM e contexto separados.
tr: Bağlamdaki TÜM hedeflerin geliş bağlantıları için kara listeye alınacak Base64 eş karmalarının virgül ya da boşluk ile ayrılmış listesi. Bu seçenek, createManager() options argümanında DEĞİL, bağlam özelliklerinden ayarlanmalıdır. Bunu yöneltici bağlamında ayarlamanın, ayrı bir JVM içindeki ve bağlamdaki yöneltici dışındaki istemcileri etkilemeyeceğini unutmayın.

source: How much transmit data (in bytes) will be accepted that hasn't been written out yet.
pt: Quantos dados de transmissão (em bytes) serão aceitos e ainda não foram gravados.
tr: Henüz yazılmamış ne kadar iletim verisinin (bayt cinsinden) kabul edileceği.

source: When we're in congestion avoidance, we grow the window size at the rate of <code>1/(windowSize*factor)</code>. In standard TCP, window sizes are in bytes, while in I2P, window sizes are in messages. A higher number means slower growth.
pt: Quando estamos em prevenção de congestionamento, aumentamos o tamanho da janela na taxa de <code>1/(windowSize*factor)</code>. No TCP padrão, os tamanhos das janelas estão em bytes, enquanto no I2P, os tamanhos das janelas estão em mensagens. Um número maior significa crescimento mais lento.
tr: Tıkanıklıktan kaçınma durumundayken pencere boyutunu <code>1/(windowSize*factor)</code> oranında büyütürüz. Standart TCP için pencere boyutları bayt cinsindendir, I2P üzerinde ise pencere boyutları iletilerdedir. Daha yüksek bir sayı, daha yavaş büyüme anlamına gelir.

source: How long to wait after instantiating a new con before actually attempting to connect. If this is &lt;= 0, connect immediately with no initial data. If greater than 0, wait until the output stream is flushed, the buffer fills, or that many milliseconds pass, and include any initial data with the SYN.
pt: Quanto tempo esperar após instanciar um novo con antes de realmente tentar conectar. Se for &lt;= 0, conecte imediatamente sem dados iniciais. Se for maior que 0, espere até que o fluxo de saída seja liberado, o buffer seja preenchido, ou tantos milissegundos passem, e inclua quaisquer dados iniciais com o SYN.
tr: Yeni bir bağlantı başlattıktan sonra gerçekten bağlantı kurmaya çalışmadan önce ne kadar bekleneceği. Bu değer &lt;= 0 ise, başlangıç verisi olmadan hemen bağlantı kurulur. Değer 0 üzerindeyse, çıktı akışı temizlenene, ara bellek dolana veya bu kadar milisaniye geçene kadar bekleyin ve SYN komutuna herhangi bir başlangıç verisi ekleyin.

source: How long to block on connect, in milliseconds. Negative means indefinitely. Default is 5 minutes.
pt: Quanto tempo bloquear na conexão, em milissegundos. Negativo significa indefinidamente. O padrão é 5 minutos.
tr: Milisaniye cinsinden, bağlantının kurulurken ne kadar süreyle bloke edileceği. Negatif süresiz anlamına gelir. Varsayılan değer 5 dakikadır.

source: Whether to disable warnings in the logs when an incoming connection is rejected due to connection limits.
pt: Se deseja desabilitar avisos nos logs quando uma conexão de entrada é rejeitada devido aos limites de conexão.
tr: Bağlantı sınırları nedeniyle bir geliş bağlantısı reddedildiğinde günlüklerdeki uyarıların devre dışı bırakılıp bırakılmayacağı.

source: Comma- or space-separated list of Base64 peer Hashes or host names to be contacted using an alternate DSA destination. Only applies if multisession is enabled and the primary session is non-DSA (generally for shared clients only). This option must be set in the context properties, NOT in the createManager() options argument. Note that setting this in the router context will not affect clients outside the router in a separate JVM and context.
pt: Lista separada por vírgula ou espaço de Hashes de pares Base64 ou nomes de host a serem contatados usando um destino DSA alternativo. Aplica-se somente se a multissessão estiver habilitada e a sessão primária não for DSA (geralmente somente para clientes compartilhados). Esta opção deve ser definida nas propriedades de contexto, NÃO no argumento de opções createManager(). Observe que definir isso no contexto do roteador não afetará clientes fora do roteador em uma JVM e contexto separados.
tr: Alternatif bir DSA hedefi kullanılarak iletişim kurulacak Base64 eş karmalarının ya da ana bilgisayar adlarının virgül ya da boşluk ile ayrılmış listesi. Yalnızca çoklu oturum etkinleştirildiyse ve birincil oturum DSA değilse geçerlidir (genellikle yalnızca paylaşılan istemciler için). Bu seçenek, createManager() options argümanında DEĞİL, bağlam özelliklerinde ayarlanmalıdır. Bunu yöneltici bağlamında ayarlamanın, ayrı bir JVM içindeki ve bağlamdaki yöneltici dışındaki istemcileri etkilemeyeceğini unutmayın.

source: Whether to listen only for the streaming protocol. Setting to true will prohibit communication with Destinations earlier than release 0.7.1 (released March 2009). Set to true if running multiple protocols on this Destination.
pt: Se deve escutar somente o protocolo de streaming. Definir como true proibirá a comunicação com Destinos anteriores à versão 0.7.1 (lançada em março de 2009). Defina como true se estiver executando vários protocolos neste Destino.
tr: Yalnızca Streaming iletişim kuralının dinlenip dinlenmeyeceği. True olarak ayarlamak, Hedeflerle 0.7.1 sürümünden (Mart 2009 tarihinde yayınlandı) önceki iletişimleri yasaklar. Bu hedefte birden çok iletişim kuralı çalıştırıyorsanız true olarak ayarlayın.
