Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: If you plan to use or link to other common I2P services (news feeds, hosts.txt subscriptions, trackers, outproxies, etc.), make sure you aren't overloading them, and talk to the people who are running them to make sure it's ok.
pt: Se você planeja usar ou vincular a outros serviços I2P comuns (feeds de notícias, assinaturas hosts.txt, rastreadores, outproxies, etc.), certifique-se de não sobrecarregá-los, e converse com as pessoas que os executam para ter certeza de que está tudo bem.
tr: Diğer yaygın I2P hizmetlerini (haber akışları, hosts.txt abonelikleri, izleyiciler, dış vekil sunucular gibi) kullanmayı ya da bunlara bağlantı vermeyi planlıyorsanız, bu hizmetleri aşırı yüklemediğinizden emin olun. Sorun çıkmayacağından emin olmak için bu hizmetleri işleten kişilerle görüşün.

source: Time / NTP Issues
pt: Problemas de tempo/NTP
tr: Zaman / NTP Sorunları

source: I2P includes an SNTP client. I2P requires correct time to operate. It will compensate for a skewed system clock but this may delay startup. You may disable I2P's SNTP queries, but this isn't advised unless your application makes sure the system clock is correct.
pt: O I2P inclui um cliente SNTP. O I2P requer o horário correto para operar. Ele compensará um relógio de sistema distorcido, mas isso pode atrasar a inicialização. Você pode desabilitar as consultas SNTP do I2P, mas isso não é aconselhável a menos que seu aplicativo certifique-se de que o relógio do sistema esteja correto.
tr: I2P içinde bir SNTP istemcisi bulunur. I2P uygulamasının çalışması için doğru zaman gerekir. Hatalı bir sistem saatini dengeler ancak bu, başlatmayı geciktirebilir. I2P uygulamasının SNTP sorgularını devre dışı bırakabilirsiniz. Ancak uygulamanız sistem saatinin doğru olduğundan emin olmadıkça bu önerilmez.

source: Choose What and How you Bundle
pt: Escolha o que e como você deseja agrupar
tr: Neyi Nasıl Paketleyeceğinizi Seçin

source: At a minimum you will need i2p.jar, router.jar, streaming.jar, and mstreaming.jar. You may omit the two streaming jars for a datagram-only app. Some apps may need more, e.g. i2ptunnel.jar or addressbook.jar. Don't forget jbigi.jar, or a subset of it for the platforms you support, to make the crypto much faster. Java 7 or higher is required to build. If you're building Debian / Ubuntu packages, you should require the I2P package from our PPA instead of bundling it. You almost certainly do not need susimail, susidns, the router console, and i2psnark, for example.
pt: No mínimo, você precisará de i2p.jar, router.jar, streaming.jar e mstreaming.jar. Você pode omitir os dois jars de streaming para um aplicativo somente de datagrama. Alguns aplicativos podem precisar de mais, por exemplo, i2ptunnel.jar ou addressbook.jar. Não se esqueça do jbigi.jar, ou de um subconjunto dele para as plataformas que você suporta, para tornar a criptografia muito mais rápida. Java 7 ou superior é necessário para compilar. Se você estiver compilando pacotes Debian / Ubuntu, você deve exigir o pacote I2P do nosso PPA em vez de agrupá-lo. Você quase certamente não precisa de susimail, susidns, o console do roteador e i2psnark, por exemplo.
tr: En azından i2p.jar, router.jar, stream.jar ve mstreaming.jar dosyalarına gerek duyacaksınız. Yalnızca veri şeması uygulaması için iki akış jar dosyasını atlayabilirsiniz. Bazı uygulamalar daha fazlasına gerek duyabilir, i2ptunnel.jar veya addressbook.jar gibi. Şifrelemeyi çok daha hızlandırmak için jbigi.jar veya desteklediğiniz platformlar için bir alt kümesini unutmayın. Oluşturmak için Java 7 veya üstü gereklidir. Debian / Ubuntu paketleri oluşturuyorsanız, I2P paketini derlemek yerine PPA üzerinden isteyin. Örneğin susimail, susidns, yöneltici panosu ve i2psnark uygulamalarına neredeyse hiç gerek duymazsınız.

source: The following files should be included in the I2P installation directory, specified with the "i2p.dir.base" property. Don't forget the certificates/ directory, which is required for reseeding, and blocklist.txt for IP validation. The geoip directory is optional, but recommended so the router can make decisions based on location. If including geoip, be sure to put the file GeoLite2-Country.mmdb in that directory (gunzip it from installer/resources/GeoLite2-Country.mmdb.gz). The hosts.txt file may be necessary, you may modify it to include any hosts your application uses. You may add a router.config file to the base directory to override initial defaults. Review and edit or remove the clients.config and i2ptunnel.config files.
pt: Os seguintes arquivos devem ser incluídos no diretório de instalação do I2P, especificados com a propriedade "i2p.dir.base". Não se esqueça do diretório certificates/, que é necessário para a nova propagação, e blocklist.txt para validação de IP. O diretório geoip é opcional, mas recomendado para que o roteador possa tomar decisões com base na localização. Se incluir geoip, certifique-se de colocar o arquivo GeoLite2-Country.mmdb nesse diretório (compacte-o em installer/resources/GeoLite2-Country.mmdb.gz). O arquivo hosts.txt pode ser necessário, você pode modificá-lo para incluir quaisquer hosts que seu aplicativo use. Você pode adicionar um arquivo router.config ao diretório base para substituir os padrões iniciais. Revise e edite ou remova os arquivos clients.config e i2ptunnel.config.
tr: Aşağıdaki dosyalar "i2p.dir.base" özelliği ile belirtilen I2P kurulum klasörüne eklenmelidir. Yeniden tohumlama için gerekli olan sertifikaları / klasörü ve IP doğrulaması için blocklist.txt dosyasını unutmayın. Geoip klasörü isteğe bağlıdır, ancak yönelticinin konuma göre kararlar alabilmesi için önerilir. Geoip bulunuyorsa, GeoLite2-Country.mmdb dosyasını bu klasöre eklediğinizden emin olun (installer/resources/GeoLite2-Country.mmdb.gz dosyasından ayıklayın). hosts.txt dosyası gerekli olabilir. Uygulamanızın kullandığı tüm sunucuları içerecek şekilde değiştirebilirsiniz. Başlangıç varsayılanlarını değiştirmek için temel klasöre bir router.config dosyası ekleyebilirsiniz. Client.config ve i2ptunnel.config dosyalarını gözden geçirin ve düzenleyin ya da kaldırın.

source: License requirements may require you to include the LICENSES.txt file and the licenses directory.
pt: Os requisitos de licença podem exigir que você inclua o arquivo LICENSES.txt e o diretório de licenças.
tr: Lisans gereksinimleri, LICENSES.txt dosyasını ve licenses klasörünü eklemenizi gerektirebilir.

source: You may also wish to bundle a hosts.txt file.
pt: Você também pode querer agrupar um arquivo hosts.txt.
tr: Ayrıca bir hosts.txt dosyasını eklemek isteyebilirsiniz.

source: Be sure to specify a Java 7 bootclasspath if compiling with Java 8.
pt: Certifique-se de especificar um bootclasspath do Java 7 se estiver compilando com o Java 8.
tr: Java 8 ile derliyorsanız, bir Java 7 önyükleme sınıfı yolu belirttiğinizden emin olun.

source: Android considerations
pt: Considerações sobre Android
tr: Android değerlendirmeleri

source: Our Android router app may be shared by multiple clients. If it is not installed, the user will be prompted when he starts a client app.
pt: Nosso aplicativo de roteador Android pode ser compartilhado por vários clientes. Se não estiver instalado, o usuário será avisado quando iniciar um aplicativo cliente.
tr: Android yöneltici uygulamamız birden fazla istemci tarafından paylaşılabilir. Kurulu değilse, kullanıcı bir istemci uygulamasını başlattığında kullanıcıya sorulur.

source: Some developers have expressed concern that this is a poor user experience, and they wish to embed the router in their app. We do have an Android router service library on our roadmap, which could make embedding easier. More information needed.
pt: Alguns desenvolvedores expressaram preocupação de que esta seja uma experiência ruim para o usuário, e desejam incorporar o roteador em seu aplicativo. Temos uma biblioteca de serviços de roteador Android em nosso roteiro, o que pode facilitar a incorporação. Mais informações necessárias.
tr: Bazı geliştiriciler, bunun kötü bir kullanıcı deneyimi olduğu konusundaki endişelerini dile getirdiler ve yönelticiyi uygulamalarına yerleştirmek istiyorlar. Yol haritamızda, yerleştirmeyi kolaylaştırabilecek bir Android yöneltici hizmet kitaplığımız var. Daha fazla bilgi gerekli.

source: If you require assistance, please contact us.
pt: Se precisar de ajuda, entre em contato conosco.
tr: Yardıma gerek duyarsanız lütfen bizimle görüşün.

source: Maven jars
pt: Potes Maven
tr: Maven jar dosyaları

source: We have a limited number of our jars on <a href="http://search.maven.org/#search%7Cga%7C1%7Cg%3A%22net.i2p%22">Maven Central</a>. There are numerous trac tickets for us to address that will improve and expand the released jars on Maven Central.
pt: Temos um número limitado de nossos jars no <a href="http://search.maven.org/#search%7Cga%7C1%7Cg%3A%22net.i2p%22">Maven Central</a>. Há vários tickets de rastreamento para resolvermos que melhorarão e expandirão os jars lançados no Maven Central.
tr: <a href="http://search.maven.org/#search%7Cga%7C1%7Cg%3A%22net.i2p%22">Maven Central</a> üzerinde sınırlı sayıda jar dosyamız var. Maven Central üzerinde yayınlanan jar dosyalarını iyileştirmek ve genişletmek için ele almamız gereken çok sayıda sorun bildirimi kaydı var.

source: Datagram (DHT) considerations
pt: Considerações sobre datagrama (DHT)
tr: Veri şeması ("Dağıtılmış karma tablosu", DHT) değerlendirmeleri

source: If your application is using I2P datagrams, e.g. for a DHT, there's lots of advanced options available to reduce overhead and increase reliability. This may take some time and experimentation to get working well. Be aware of size/reliability tradeoffs. Talk to us for help. It is possible - and recommended - to use Datagrams and Streaming on the same Destination. Don't create separate Destinations for this. Don't try to store your unrelated data in the existing network DHTs (iMule, bote, bittorrent, and router). Build your own. If you are hardcoding seed nodes, we recommend that you have several.
pt: Se seu aplicativo estiver usando datagramas I2P, por exemplo, para um DHT, há muitas opções avançadas disponíveis para reduzir a sobrecarga e aumentar a confiabilidade. Isso pode levar algum tempo e experimentação para funcionar bem. Esteja ciente das compensações de tamanho/confiabilidade. Fale conosco para obter ajuda. É possível - e recomendado - usar datagramas e streaming no mesmo destino. Não crie destinos separados para isso. Não tente armazenar seus dados não relacionados nos DHTs de rede existentes (iMule, bote, bittorrent e roteador). Crie o seu próprio. Se você estiver codificando nós de semente, recomendamos que tenha vários.
tr: Uygulamanız bir "Dağıtılmış karma tablosu" (DHT) için olduğu gibi I2P veri şemaları kullanıyorsa, ek yükü azaltmak ve güvenilirliği artırmak için birçok gelişmiş seçenek vardır. Bunun, iyi çalışmaya başlaması için biraz zaman ve deneme gerekebilir. Boyut / güvenilirlik denkliklerinin farkında olun. Yardım almak için bizimle görüşün. Aynı hedefte veri şemaları ve akış kullanılabilir ve yapılması önerilir. Bunun için ayrı hedefler oluşturmayın. İlgisiz verilerinizi var olan ağ "Dağıtılmış karma tablosu" (DHT) ögelerinde (iMule, bote, bittorrent ve yöneltici) depolamayın. Kendi ögenizi oluşturun. Çekirdek düğümleri sabit kodluyorsanız, birkaç tane olmasını öneririz.

source: Comarketing
tr: Pazarlama desteği

source: Let's work together. Don't wait until it's done. Give us your Twitter handle and start tweeting about it, we will return the favor.
pt: Vamos trabalhar juntos. Não espere até que esteja pronto. Dê-nos seu identificador do Twitter e comece a tuitar sobre isso, nós retribuiremos o favor.
tr: Birlikte çalışalım. Projenizi tamamlayana kadar beklemeyin. Bize Twitter kullanıcı adınızı verin ve projenizle ilgili tweet atmaya başlayın, iyiliğin karşılığını vereceğiz.

source: Malware
tr: Zararlı yazılım

source: Please don't use I2P for evil. It could cause great harm both to our network and our reputation.
pt: Por favor, não use o I2P para o mal. Isso pode causar grandes danos à nossa rede e à nossa reputação.
tr: Lütfen I2P ağını kötü niyetler için kullanmayın. Hem ağımıza hem de itibarımıza büyük zarar verebilir.

source: Join Us
pt: Junte-se a nós
tr: Bize Katılın

source: This may be obvious, but join the community. Run I2P 24/7. Start an I2P Site about your project. Hang out in IRC #i2p-dev. Post on the forums. Spread the word. We can help get you users, testers, translators, or even coders.
pt: Isso pode ser óbvio, mas junte-se à comunidade. Execute o I2P 24/7. Inicie um site I2P sobre seu projeto. Participe do IRC #i2p-dev. Poste nos fóruns. Espalhe a palavra. Podemos ajudar você a obter usuários, testadores, tradutores ou até mesmo codificadores.
tr: Bu açık olabilir, ancak topluluğa katılın. I2P uygulamasını 7/24 çalıştırın. Projeniz için bir I2P aitesi açın. IRC #i2p-dev kanalında takılın. Forumlara yazın. Duyulmasına yardımcı olun. Kullanıcılar, test edenler, çevirmenler ve hatta kodlayıcılar edinmenize yardımcı olabiliriz.

source: Application Examples
pt: Exemplos de aplicação
tr: Uygulama Örnekleri

source: You may wish to install and play with the I2P Android app, and look at its code, for an example of an application that bundles the router. See what we expose to the user and what we hide. Look at the state machine we use to start and stop the router. Other examples are: Vuze, the Nightweb Android app, iMule, TAILS, iCloak, and Monero.
pt: Talvez você queira instalar e brincar com o aplicativo I2P para Android e observar seu código, para ver um exemplo de um aplicativo que agrupa o roteador. Veja o que expomos ao usuário e o que ocultamos. Observe a máquina de estado que usamos para iniciar e parar o roteador. Outros exemplos são: Vuze, o aplicativo Nightweb para Android, iMule, TAILS, iCloak e Monero.
tr: Yönelticiyi paketleyen bir uygulama örneği için I2P Android uygulamasını kurup kurcalamak ve koduna bakmak isteyebilirsiniz. Kullanıcıya neyi gösterdiğimizi ve neyi gizlediğimizi görün. Yönelticiyi başlatmak ve durdurmak için kullandığımız durum makinesine bakın. Bazı örnekler: Vuze, Nightweb Android uygulaması, iMule, TAILS, iCloak ve Monero.

source: Code Example
pt: Exemplo de Código
tr: Kod Örneği

source: None of the above actually tells you how to write your code to bundle the Java router, so following is a brief example.
pt: Nenhum dos itens acima realmente informa como escrever seu código para agrupar o roteador Java, então a seguir está um breve exemplo.
tr: Yukarıdakilerin hiçbiri size Java yönelticiyi paketlemek için kodunuzu nasıl yazacağınızı söylemez. Bu nedenle aşağıda kısa bir örnek verilmiştir.

source: This code is for the case where your application starts the router, as in our Android app. You could also have the router start the application via the clients.config and i2ptunnel.config files, together with Jetty webapps, as is done in our Java packages. As always, state management is the difficult part.
pt: Este código é para o caso em que seu aplicativo inicia o roteador, como em nosso aplicativo Android. Você também pode fazer com que o roteador inicie o aplicativo por meio dos arquivos clients.config e i2ptunnel.config, junto com os webapps Jetty, como é feito em nossos pacotes Java. Como sempre, o gerenciamento de estado é a parte difícil.
tr: Bu kod, Android uygulamamızda olduğu gibi uygulamanızın yönelticiyi başlattığı durum içindir. Yönelticinin, Java paketlerimizde olduğu gibi, Jetty internet uygulamaları ile birlikte client.config ve i2ptunnel.config dosyaları aracılığıyla uygulamayı başlatmasını da sağlayabilirsiniz. Her zaman olduğu gibi, durum yönetimi zor olan kısımdır.

source: Setting up Gitlab with I2P
pt: Configurando o Gitlab com o I2P
tr: I2P ile GitLab Kurmak

source: Using a git bundle to fetch the I2P source code
pt: Usando um pacote git para buscar o código-fonte I2P
tr: I2P kaynak kodunu almak için Git paketi kullanmak

source: Cloning large software repositories over I2P can be difficult, and using git can sometimes make this harder. Fortunately, it can also sometimes make it easier. Git has a <code>git bundle</code> command which can be used to turn a git repository into a file which git can then clone, fetch, or import from a location on your local disk. By combining this capability with bittorrent downloads, we can solve our remaining problems with <code>git clone</code>.
pt: Clonar grandes repositórios de software sobre I2P pode ser difícil, e usar o git às vezes pode tornar isso mais difícil. Felizmente, às vezes também pode tornar isso mais fácil. O Git tem um comando <code>git bundle</code> que pode ser usado para transformar um repositório git em um arquivo que o git pode então clonar, buscar ou importar de um local no seu disco local. Ao combinar essa capacidade com downloads de bittorrent, podemos resolver nossos problemas restantes com <code>git clone</code>.
tr: Büyük yazılım depolarını I2P üzerinden kopyalamak zor olabilir ve bazen Git kullanmak bunu zorlaştırabilir. Neyse ki, bazen de kolaylaştırabilir. Git üzerindeki <code>git bundle</code> komutu ile bir Git deposunu bir dosyaya dönüştürerek yerel diskinize alabilirsiniz. Ardından yerel diskinizdeki bu dosyadaki bulunan depoyu Git üzerine kopyalayabilir, alabilir veya içe aktarabilirsiniz. Bu özelliği Bittorrent indirmeleri ile birleştirerek kalan sorunlarımızı <code>git clone</code> komutu ile çözebiliriz.

source: Before you Start
pt: Antes de começar
tr: Başlamadan önce

source: If you intend to generate a git bundle, you <strong>must</strong> already possess a full copy of the <strong>git</strong> repository, not the mtn repository. You can get it from github or from git.idk.i2p, but a shallow clone(a clone done to –depth=1) <em>will not</em> <em>work</em>. It will fail silently, creating what looks like a bundle, but when you try to clone it it will fail. If you are just retrieving a pre-generated git bundle, then this section does not apply to you.
pt: Se você pretende gerar um pacote git, você <strong>deve</strong> já possuir uma cópia completa do repositório <strong>git</strong> , não do repositório mtn. Você pode obtê-lo do github ou do git.idk.i2p, mas um clone raso (um clone feito para –depth=1) <em>não</em> <em>funcionará</em>. Ele falhará silenciosamente, criando o que parece ser um pacote, mas quando você tentar cloná-lo, ele falhará. Se você estiver apenas recuperando um pacote git pré-gerado, esta seção não se aplica a você.
tr: Bir Git paketi oluşturmayı düşünüyorsanız, MTN deposunun değil, <strong>Git</strong> deposunun tam bir kopyasına zaten <strong>sahip olmalısınız</strong>. Bunu GitHub ya da git.idk.i2p üzerinden alabilirsiniz. Ancak sığ bir kopya (–depth=1 ile oluşturulan bir kopya) <em>hiç</em> <em>çalışmaz</em>. Sessizce başarısız olur ve bir dal gibi görünen bir şey oluşturur. Ancak onu kopyalamaya çalıştığınızda başarısız olur. Bu bölüm yalnızca önceden oluşturulmuş bir Git paketi alıyorsanız sizin için geçerli değildir.

source: Fetching I2P Source via Bittorrent
pt: Obtendo a fonte I2P via Bittorrent
tr: I2P Kaynağını Bittorrent ile Almak

source: Someone will need to supply you with a torrent file or a magnet link corresponding to an existing <code>git bundle</code> that they have already generated for you. A recent, correctly-generated bundle of the mainline i2p.i2p source code as-of Wednesday, March 18, 2020, can be found inside of I2P at my pastebin <a href="http://paste.idk.i2p/f/4h137i">paste.idk.i2p/f/4hq37i</a>.
pt: Alguém precisará fornecer a você um arquivo torrent ou um link magnet correspondente a um pacote git <code></code> existente que eles já geraram para você. Um pacote recente e corretamente gerado do código-fonte principal i2p.i2p de quarta-feira, 18 de março de 2020, pode ser encontrado dentro do I2P no meu pastebin <a href="http://paste.idk.i2p/f/4h137i">paste.idk.i2p/f/4hq37i</a>.
tr: Birinin, sizin için önceden oluşturduğu var olan bir <code>Git paketine</code> karşı gelen bir torrent dosyası ya da bir magnet bağlantısı sunması gerekir. 18 Mart 2020 Çarşamba tarihinde, ana hat i2p.i2p kaynak kodunun yeni, doğru şekilde oluşturulmuş bir paketini, benim pastebin <a href="http://paste.idk.i2p/f/4h137i">paste.idk.i2p/f/4hq37i</a> adresimde I2P içinde bulabilirsiniz.

source: Once you have a bundle, you will need to use git to create a working repository from it. If you’re using GNU/Linux and i2psnark, the git bundle should be located in $HOME/.i2p/i2psnark or, as a service on Debian, /var/lib/i2p/i2p-config/i2psnark. If you are using BiglyBT on GNU/Linux, it is probably at “$HOME/BiglyBT Downloads/” instead. The examples here assume I2PSnark on GNU/Linux, if you use something else, replace the path to the bundle with the download directory preferred by your client and platform.
pt: Depois de ter um pacote, você precisará usar o git para criar um repositório funcional a partir dele. Se estiver usando GNU/Linux e i2psnark, o pacote git deve estar localizado em $HOME/.i2p/i2psnark ou, como um serviço no Debian, /var/lib/i2p/i2p-config/i2psnark. Se estiver usando o BiglyBT no GNU/Linux, provavelmente ele estará em “$HOME/BiglyBT Downloads/”. Os exemplos aqui assumem o I2PSnark no GNU/Linux, se você usar outra coisa, substitua o caminho para o pacote pelo diretório de download preferido pelo seu cliente e plataforma.
tr: Bir paketiniz olduğunda, ondan çalışan bir depo oluşturmak için Git kullanmanız gerekir. GNU/Linux ve i2psnark kullanıyorsanız, git paketi $HOME/.i2p/i2psnark içinde veya Debian üzerinde bir hizmet olarak /var/lib/i2p/i2p-config/i2psnark içinde bulunmalıdır. GNU/Linux üzerinde BiglyBT kullanıyorsanız, bunun yerine büyük olasılıkla “$HOME/BiglyBT Downloads/” konumundadır. Buradaki örnekler, GNU/Linux üzerinde I2PSnark kullandığınızı varsayıyor. Başka bir şey kullanıyorsanız, paketin yolunu istemciniz ve platformunuz tarafından yeğlenen indirme klasörü ile değiştirin.

source: Using <code>git clone</code>
pt: Usando <code>git clone</code>
tr: <code>Git kopyası</code> kullanmak

source: Cloning from a git bundle is easy, just:
pt: A clonagem de um pacote git é fácil, basta:
tr: Git paketinden kopyalamak kolaydır:

source: If you get the following error, try using git init and git fetch manually instead.
pt: Se você receber o seguinte erro, tente usar git init e git fetch manualmente.
tr: Aşağıdaki hatayı alırsanız, bunun yerine el ile ``git init`` ve ``git fetch`` komutlarını kullanmayı deneyin.

source: Using <code>git init</code> and <code>git fetch</code>
pt: Usando <code>git init</code> e <code>git fetch</code>
tr: <code>git init</code> ve <code>git fetch</code> kullanmak

source: First, create an i2p.i2p directory to turn into a git repository.
pt: Primeiro, crie um diretório i2p.i2p para transformá-lo em um repositório git.
tr: Öncelikle Git deposuna dönüştürmek için bir i2p.i2p klasörü oluşturun.

source: Next, initialize an empty git repository to fetch changes back into.
pt: Em seguida, inicialize um repositório git vazio para buscar as alterações novamente.
tr: Ardından, değişiklikleri geri almak için boş bir Git deposu hazırlayın.

source: Finally, fetch the repository from the bundle.
pt: Por fim, busque o repositório do pacote.
tr: Son olarak, paketten depoyu alın.

source: Replace the bundle remote with the upstream remote
pt: Substitua o controle remoto do pacote pelo controle remoto upstream
tr: Paket uzak sürümünü yukarı akış uzak sürümüyle değiştirin

source: Now that you have a bundle, you can keep up with changes by setting the remote to the upstream repository source.
pt: Agora que você tem um pacote, pode acompanhar as alterações configurando o controle remoto para a origem do repositório upstream.
tr: Artık bir paketiniz olduğuna göre, uzaktaki sürümü yukarı akış deposu kaynağına ayarlayarak değişikliklere ayak uydurabilirsiniz.
