Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Generating a Bundle
pt: Gerando um pacote
tr: Paket Oluşturmak

source: First, follow the <a href="GIT.md">Git guide for Users</a> until you have a successfully <code>--unshallow</code>ed clone of clone of the i2p.i2p repository. If you already have a clone, make sure you run <code>git fetch --unshallow</code> before you generate a torrent bundle.
pt: Primeiro, siga o guia do Git <a href="GIT.md">para usuários</a> até que você tenha um clone <code>--unshallow</code>editado com sucesso do clone do repositório i2p.i2p. Se você já tem um clone, certifique-se de executar <code>git fetch --unshallow</code> antes de gerar um pacote torrent.
tr: İlk olarak, i2p.i2p deposunun başarılı bir <code>--unshallow</code> klonunu elde edene kadar <a href="GIT.md">Kullanıcılar için Git rehberini</a> izleyin. Zaten bir kopyanız varsa, bir torrent paketi oluşturmadan önce <code>git fetch --unshallow</code> komutunu yürüttüğünüzden emin olun.

source: Once you have that, simply run the corresponding ant target:
pt: Depois de ter isso, basta executar o alvo ant correspondente:
tr: Bundan sonra, ilgili ant hedefini çalıştırmanız yeterlidir:

source: and copy the resulting bundle into your I2PSnark downloads directory. For instance:
pt: e copie o pacote resultante para o seu diretório de downloads do I2PSnark. Por exemplo:
tr: ve ortaya çıkan paketi I2PSnark indirme kalsörünüze kopyalayın. Örneğin:

source: In a minute or two, I2PSnark will pick up on the torrent. Click on the “Start” button to begin seeding the torrent.
pt: Em um ou dois minutos, o I2PSnark vai pegar o torrent. Clique no botão “Start” para começar a semear o torrent.
tr: Bir veya iki dakika içinde I2PSnark torrenti alır. Torrenti tohumlamaya başlamak için “Başlat” düğmesine tıklayın.

source: Tutorial for setting up git access through an I2P Tunnel. This tunnel will act as your access point to a single git service on I2P.
pt: Tutorial para configurar acesso git por meio de um túnel I2P. Este túnel atuará como seu ponto de acesso a um único serviço git no I2P.
tr: I2P tüneli üzerinden Git erişimini ayarlama eğitimi. Bu tünel, I2P üzerindeki tek bir Git hizmetine erişim noktanız olarak davranır.

source: If you intend to use the service at i2pgit.org/git.idk.i2p, then you probably already have a tunnel configured and much of this tutorial will not apply to you.
pt: Se você pretende usar o serviço em i2pgit.org/git.idk.i2p, provavelmente já tem um túnel configurado e grande parte deste tutorial não se aplicará a você.
tr: Hizmeti i2pgit.org/git.idk.i2p adresinden kullanmayı düşünüyorsanız, büyük olasılıkla önceden yapılandırılmış bir tüneliniz vardır ve bu öğreticinin çoğu sizin için geçerli olmayacaktır.

source: First: Set up an account at a Git service
pt: Primeiro: crie uma conta em um serviço Git
tr: Bir: Git hizmetinde bir hesap açın

source: To create your repositories on a remote git service, sign up for a user account at that service. Of course it’s also possible to create repositories locally and push them to a remote git service, but most will require an account and for you to create a space for the repository on the server. Gitlab has a very simple sign-up form:
pt: Para criar seus repositórios em um serviço git remoto, inscreva-se para uma conta de usuário naquele serviço. Claro que também é possível criar repositórios localmente e enviá-los para um serviço git remoto, mas a maioria exigirá uma conta e que você crie um espaço para o repositório no servidor. O Gitlab tem um formulário de inscrição muito simples:
tr: Uzak bir Git hizmetinde depolarınızı oluşturmak için o hizmette bir kullanıcı hesabı açın. Elbette, yerel depolar oluşturarak bunları uzak bir Git hizmetine gönderme seçeneğiniz de vardır. Ancak çoğu durumda bir hesap açılması ve sunucuda kendiniz için bir depo alanı oluşturmanız gerekir. GitLab hesap açma formu çok basittir:

source: These are generic instructions for any in-i2p Git instance with HTTP and SSH gateways. If you intend to contribute to I2P, you should create an account at the I2P gitlab, which is open to the community. Account registration may take a few days to complete, as the admin needs to sort through a large number of spam registrations. You can help this by getting in touch with the admin to confirm you are human using the instructions on the home page.
pt: Estas são instruções genéricas para qualquer instância Git in-i2p com gateways HTTP e SSH. Se você pretende contribuir para o I2P, você deve criar uma conta no gitlab do I2P, que é aberto para a comunidade . O registro da conta pode levar alguns dias para ser concluído, pois o administrador precisa classificar um grande número de registros de spam. Você pode ajudar entrando em contato com o administrador para confirmar que você é humano usando as instruções na página inicial.
tr: Bunlar, HTTP ve SSH ağ geçitlerini kullanan herhangi bir i2p Git kopyası için genel bilgilerdir. I2P projesine katkıda bulunmayı düşünüyorsanız, topluluğa açık olan I2P GitLab üzerinde bir hesap açmalısınız. Yöneticinin çok sayıda spam kaydını ayırması gerektiğinden, hesap kaydının tamamlanması birkaç gün sürebilir. Ana sayfadaki açıklamaları kullanarak insan olduğunuzu onaylamak için yönetici ile iletişime geçebilir ve süreci hızlandırabilirsiniz.

source: Inside I2P - (http://git.idk.i2p)
pt: Dentro do I2P - (http://git.idk.i2p)
tr: I2P içinden - (http://git.idk.i2p)

source: Outside I2P - (https://i2pgit.org)
pt: Fora do I2P - (https://i2pgit.org)
tr: I2P dışından - (https://i2pgit.org)

source: To make sure the setup process works, it helps to make a repository to test with from the server, and for the sake of this tutorial, we’re going to use a fork of the I2P router. First, browse to the i2p-hackers/i2p.i2p repository:
pt: Para garantir que o processo de configuração funcione, ajuda criar um repositório para testar com o servidor e, para o propósito deste tutorial, usaremos um fork do roteador I2P. Primeiro, navegue até o repositório i2p-hackers/i2p.i2p:
tr: Kurulum işleminin çalıştığından emin olmak için sunucudan bir deneme havuzu oluşturmanızı sağlar. Bu eğitimin amacına yönelik olarak I2P yöneltici dalını kullanacağız. İlk olarak, i2p-hackers/i2p.i2p deposuna gidin:

source: Then, fork it to your account.
pt: Depois, bifurque-o para sua conta.
tr: Ardından, hesabınızda bir dalını oluşturun.

source: To have read-write access to my server, you’ll need to set up a tunnel for your SSH client. As an example, we’re going to use the HTTP tunnel instead, but if all you need is read-only, HTTP/S cloning, then you can skip all this and just use the http_proxy environment variable to configure git to use the pre-configured I2P HTTP Proxy. For example:
pt: Para ter acesso de leitura e gravação ao meu servidor, você precisará configurar um túnel para seu cliente SSH. Como exemplo, usaremos o túnel HTTP, mas se tudo o que você precisa é somente leitura, clonagem HTTP/S, então você pode pular tudo isso e usar apenas a variável de ambiente http_proxy para configurar o git para usar o Proxy HTTP I2P pré-configurado. Por exemplo:
tr: Sunucuma okuma-yazma erişimine sahip olmak için SSH istemciniz için bir tünel kurmanız gerekecek. Örnek olarak, bunun yerine HTTP tünelini kullanacağız. Ancak yalnızca salt okunur erişime, HTTP/S kopyalamaya gerek duyuyorsanız, tüm bunları atlayabilir ve Git yapılandırması için önceden hazırlanmış I2P HTTP vekil sunucusunu kullanmak amacıyla http_proxy ortam değişkenini kullanabilirsiniz. Örneğin:

source: Then, add the address you will be pushing and pulling from. Note that this example address is for Read-Only HTTP-over-I2P clones, if your admin does not allow the git HTTP(Smart HTTP) protocol, then you will need to get the SSH clone base32 from them. If you have an SSH clone base32, substitute it for the base32 in this step, which will fail.
pt: Em seguida, adicione o endereço do qual você fará push e pull. Observe que este endereço de exemplo é para clones HTTP-over-I2P somente leitura, se seu administrador não permitir o protocolo git HTTP (Smart HTTP), então você precisará obter o clone SSH base32 deles. Se você tiver um clone SSH base32, substitua-o pelo base32 nesta etapa, o que falhará.
tr: Ardından, itme ve çekme istekleri için kullanacağınız adresi ekleyin. Bu örnek adresin I2P üzerinden salt okunur HTTP kopyaları için olduğunu unutmayın. Yöneticiniz Git HTTP (Akıllı HTTP) iletişim kuralına izin vermiyorsa, SSH kopyasının base32 adresini almanız gerekecektir. Bir SSH klonu base32 adresiniz varsa, bu adımda başarısız olan base32 adresi yerine onu kullanın.

source: Pick a port to forward the I2P service to locally.
pt: Escolha uma porta para encaminhar o serviço I2P localmente.
tr: I2P hizmetinin yerel olarak iletileceği bir bağlantı noktası seçin.

source: I use it alot, so I start my client tunnel automatically, but it’s up to you.
pt: Eu o uso muito, então inicio meu túnel de cliente automaticamente, mas fica a seu critério.
tr: Çok kullandığım için istemci tünelimi otomatik olarak başlatıyorum ama bu size kalmış.

source: When you’re all done, it should look alot like this.
pt: Quando terminar, deve ficar parecido com isso.
tr: Her şey bittiğinde, buna çok benzemeli.

source: Fourth: Attempt a clone
pt: Quarto: Tente um clone
tr: Dört: Bir kopya oluşturmayı deneyin

source: Now your tunnel is all set up, you can attempt a clone over SSH.
pt: Agora que seu túnel está configurado, você pode tentar uma clonagem via SSH.
tr: Artık tüneliniz hazır, SSH üzerinden kopyalamayı deneyebilirsiniz.

source: Git Privacy: Committing to git adds a timestamp to git commit messages, which may be configured to reflect your local time zone. To enforce the use of UTC for all commits, you are advised to use a git alias, such as:
pt: Privacidade do Git: Comprometer-se com o git adiciona um timestamp às mensagens de commit do git, que podem ser configuradas para refletir seu fuso horário local. Para impor o uso do UTC para todos os commits, é aconselhável usar um alias do git, como:
tr: Git kişisel gizliliği: Git gönderileri, Git gönderi iletilerine yerel saat diliminizi yansıtacak şekilde yapılandırılabilen bir zaman damgası ekler. Tüm gönderilerde UTC saat diliminin kullanılmasını zorlamak için bir Git takma adı kullanmanız önerilir. Örnek:

source: which will allow you to substitute
pt: que lhe permitirá substituir
tr: değiştirmenizi sağlayacak

source: for
pt: durante
tr: şunun için

source: in order to obscure your local time zone.
pt: para ocultar seu fuso horário local.
tr: yerel saat diliminizi gizlemek için.

source: You might get an error where the remote end hangs up unexpectedly. Unfortunately git still doesn’t support resumable cloning. Until it does, there are a couple fairly easy ways to handle this. The first and easiest is to try and clone to a shallow depth:
pt: Você pode receber um erro em que o terminal remoto desliga inesperadamente. Infelizmente, o git ainda não suporta clonagem retomável. Até que isso aconteça, há algumas maneiras bem fáceis de lidar com isso. A primeira e mais fácil é tentar clonar para uma profundidade rasa:
tr: Uzak ucun beklenmedik bir şekilde kapandığı ile ilgili bir hata görebilirsiniz. Ne yazık ki Git hala sürdürülebilir kopyalamayı desteklemiyor. Bunu yapana kadar, bu sorunu aşmanın oldukça kolay birkaç yolu var. İlk ve en kolayı, sığ bir derinliğe kopyalamaya çalışmaktır:

source: Once you’ve performed a shallow clone, you can fetch the rest resumably by changing to the repo directory and running:
pt: Depois de executar uma clonagem superficial, você pode buscar o restante de forma contínua, alterando para o diretório do repositório e executando:
tr: Sığ bir kopyalama gerçekleştirdikten sonra, depo klasörüne geçerek ve aşağıdakileri çalıştırarak geri kalanını sürdürerek alabilirsiniz:

source: At this point, you still don’t have all your branches yet. You can get them by running the following commands:
pt: Neste ponto, você ainda não tem todos os seus branches. Você pode obtê-los executando os seguintes comandos:
tr: Bu noktada, henüz tüm dallarınıza sahip değilsiniz. Aşağıdaki komutları çalıştırarak onları alabilirsiniz:

source: Which tells git to alter the repository configuration so that fetching from origin fetches all branches.
pt: O que diz ao git para alterar a configuração do repositório para que a busca na origem busque todos os branches.
tr: Bu komutlar, Git yazılımına kaynaktan alma sırasında tüm dallar alınacak şekilde depo yapılandırmasını değiştirmesini söyler.

source: If that doesn’t work, you can try opening the tunnel configuration menu and adding some backup tunnels.
pt: Se isso não funcionar, você pode tentar abrir o menu de configuração do túnel e adicionar alguns túneis de backup.
tr: Bu işe yaramazsa, tünel yapılandırma menüsünü açarak bazı yedek tüneller eklemeyi deneyebilirsiniz.

source: If that doesn’t work, then the next easy thing to try is to decrease the tunnel length. Don’t do this if you believe you are at risk of your code-contribution activity being de-anonymized by a well-resourced attacker seeking to run many malicious nodes and control your whole path. If that sounds unlikely to you then you can probably do it safely.
pt: Se isso não funcionar, a próxima coisa fácil a tentar é diminuir o comprimento do túnel. Não faça isso se você acredita que corre o risco de sua atividade de contribuição de código ser desanonimizada por um invasor bem-recursos buscando executar muitos nós maliciosos e controlar todo o seu caminho. Se isso parece improvável para você, então você provavelmente pode fazer isso com segurança.
tr: Bu da işe yaramazsa, denenmesi gereken bir sonraki kolay şey tünel uzunluğunu azaltmaktır. Ancak koda katkıda bulunma çalışmalarınızın, birçok kötü amaçlı düğüm işleterek tüm yolunuzu denetlemeye çalışan ve bol kaynağı olan bir saldırgan tarafından izlendiğini ve anonimliğinizin bozulması riskiyle karşı karşıya olduğunu düşünüyorsanız, bunu yapmayın. Bu durum size pek olası gelmiyorsa güvenle yapabilirsiniz.

source: <em>Suggested Workflow for Developers!</em>
pt: <em>Fluxo de trabalho sugerido para desenvolvedores!</em>
tr: <em>Geliştiriciler için Önerilen İş Akışı!</em>

source: Revision control can make your life easier, but it works best if you use it well! In light of this, we strongly suggest a fork-first, feature-branch workflow as many are familiar with from Github. In such a workflow, the master branch is used as a sort of “Trunk” for updates and is never touched by the programmmer, instead, all changes to the master are merged from branches. In order to do set up your workspace for this, take the following steps:
pt: O controle de revisão pode facilitar sua vida, mas funciona melhor se você usá-lo bem! Em vista disso, sugerimos fortemente um fluxo de trabalho fork-first, feature-branch, como muitos estão familiarizados no Github. Em tal fluxo de trabalho, o branch master é usado como uma espécie de “Trunk” para atualizações e nunca é tocado pelo programador, em vez disso, todas as alterações no master são mescladas dos branches. Para configurar seu espaço de trabalho para isso, siga os seguintes passos:
tr: Sürüm denetimi hayatınızı kolaylaştırabilir, ancak en iyi sonucu alabilmek için onu iyi kullanmanız gerekir! Bunun ışığında, birçoğunun GitHub üzerinden aşina olduğu, önce dallandır, özelliği dalda geliştir şeklinde bir iş akışı öneriyoruz. Böyle bir iş akışında, ana dal, güncellemeler için bir tür "Gövde" olarak kullanılır ve programcı tarafından asla dokunulmaz. Bunun yerine ana dalda yapılan tüm değişiklikler diğer dallardan birleştirilir. Çalışma alanınızı buna göre kurmak için aşağıdaki adımları izleyin:

source: <strong>Never make changes to the Master Branch</strong>. You will be using the master branch to periodially obtain updates to the official source code. All changes should be made in feature branches.
pt: <strong>Nunca faça alterações no Master Branch</strong>. Você usará o master branch para obter atualizações periódicas do código-fonte oficial. Todas as alterações devem ser feitas em feature branches.
tr: <strong>Asla ana dalda değişiklik yapmayın</strong>. Resmi kaynak kodundaki güncellemeleri düzenli olarak almak için ana dalı kullanacaksınız. Tüm değişiklikler özellik dallarında yapılmalıdır.

source: Set up a second remote in your local repository using the upstream source code.
pt: Configure um segundo controle remoto no seu repositório local usando o código-fonte upstream.
tr: Yukarı akış kaynak kodunu kullanarak yerel deponuzda ikinci bir uzak depo kurun.

source: Pull in any upstream changes on your current master:
pt: Puxe quaisquer alterações upstream no seu master atual:
tr: Var olan ana daldaki tüm yukarı akış değişikliklerini çekin:

source: Before making any changes to the source code, check out a new feature branch to develop on:
pt: Antes de fazer qualquer alteração no código-fonte, confira um novo branch de recurso para desenvolver:
tr: Kaynak kodunda herhangi bir değişiklik yapmadan önce, üzerinde geliştirme çalışmalarının yapılacağı yeni özellik dalını denetleyin:

source: When you’re done with your changes, commit them and push them to your branch
pt: Quando terminar suas alterações, confirme-as e envie-as para sua ramificação
tr: Değişikliklerinizi tamamladığınızda bunları gönderin ve dalınıza itme isteğinde bulunun

source: Submit a merge request. When the merge request is approved and brought into the upstream master, check out the master locally and pull in the changes:
pt: Envie uma solicitação de mesclagem. Quando a solicitação de mesclagem for aprovada e trazida para o master upstream, faça check-out do master localmente e puxe as alterações:
tr: Bir birleştirme isteğinde bulunun. Birleştirme isteği onaylandığında ve yukarı akış ana dalına getirildiğinde, ana dalı yerel olarak denetleyin ve değişiklikleri alın:

source: Whenever a change to the upstream master(i2p-hackers/i2p.i2p) is made, you can update your master code using this procedure as well.
pt: Sempre que uma alteração no master upstream (i2p-hackers/i2p.i2p) for feita, você também pode atualizar seu código master usando este procedimento.
tr: Yukarı akış ana dalında (i2p-hackers/i2p.i2p) bir değişiklik yapıldığında da, bu akışı kullanarak ana kodunuzu güncelleyebilirsiniz.

source: The git utccommit alias solution to git timestamp issue was arrived at from the information first published here
pt: A solução do alias git utccommit para o problema do git timestamp foi obtida a partir das informações publicadas aqui
tr: Git zaman damgası sorununa yönelik Git utccommit takma adı çözümüne, burada ilk kez yayınlanan bilgilerden ulaşıldı

source: Gitlab over I2P Setup
pt: Configuração do Gitlab sobre I2P
tr: I2P Üzerinden GitLab Kurulumu

source: Mirror I2P Git repositories and Bridge Non-private internet.repositories for others.
pt: Espelhe repositórios Git I2P e Bridge Non-private internet.repositories para outros.
tr: Başkaları için I2P Git depolarını yansıtın ve herkese açık İnternet depolarını köprüleyin.

source: This is the setup process I use for configuring Gitlab and I2P, with Docker in place to manage the service itself. Gitlab is very easy to host on I2P in this fashion, it can be administered by one person without much difficulty. In my configuration, I use a Debian VM to host docker containers and an I2P router, on a Debian Host system, however, this may be more than necessary for some people. These instructions should work on any Debian-based system, regardless of whether it is in a VM or not, and should easily translate to any system where Docker and an I2P router are available. This guide starts at Docker and does not assume any VM underneath.
pt: Este é o processo de configuração que eu uso para configurar o Gitlab e o I2P, com o Docker instalado para gerenciar o serviço em si. O Gitlab é muito fácil de hospedar no I2P dessa forma, ele pode ser administrado por uma pessoa sem muita dificuldade. Na minha configuração, eu uso uma VM Debian para hospedar contêineres docker e um roteador I2P, em um sistema Debian Host, no entanto, isso pode ser mais do que necessário para algumas pessoas. Essas instruções devem funcionar em qualquer sistema baseado em Debian, independentemente de estar em uma VM ou não, e devem ser facilmente traduzidas para qualquer sistema onde o Docker e um roteador I2P estejam disponíveis. Este guia começa no Docker e não assume nenhuma VM abaixo.
tr: Bu bölümde hizmetin kendisini yönetmek için Docker ile GitLab ve I2P yapılandırmaları için kullandığım kurulum sürecini anlatacağım. Bu şekilde I2P üzerinde GitLab barındırmak çok kolaydır ve tek kişi tarafından çok zorlanmadan yönetilebilir. Yapılandırmamda, bir Debian sunucu sisteminde docker kapsayıcılarını ve bir I2P yönelticisini barındırmak için bir Debian sanal makinesi kullanıyorum. Ancak bu kurulum bazı insanlar için gereğinden fazla olabilir. Bu yönergeler, bir sanal makinede olsun veya olmasın, herhangi bir Debian tabanlı sistemde çalışmalı ve Docker ile bir I2P yönelticisinin bulunduğu herhangi bir sisteme kolayca dönüştürülebilmelidir. Bu rehber Docker ile başlar ve altında herhangi bir sanal makine olmadığını varsayar.

source: Dependencies and Docker
pt: Dependências e Docker
tr: Bağımlılıklar ve Docker

source: Because Gitlab runs in a container, we only need to install the dependencies required for the container on our main system. Conveniently, you can install everything you need with:
pt: Como o Gitlab roda em um contêiner, precisamos instalar apenas as dependências necessárias para o contêiner em nosso sistema principal. Convenientemente, você pode instalar tudo o que precisa com:
tr: GitLab bir kapsayıcı içinde çalıştığı için ana sistemimize yalnızca kapsayıcı için gerekli olan bağımlılıkları kurmanız gerekir. Uygun bir şekilde, gerek duyduğunuz her şeyi aşağıdaki komutlarla kurabilirsiniz:

source: on an otherwise unmodified Debian system, or if you have added Docker’s own “Community” Debian repository, you may use:
pt: em um sistema Debian não modificado, ou se você adicionou o repositório Debian “Community” do próprio Docker, você pode usar:
tr: başka şekilde değiştirilmemiş bir Debian sistemi veya Docker uygulamasının kendi "Topluluk" Debian deposunu eklediyseniz, şunları kullanabilirsiniz:

source: instead.
pt: em vez de.
tr: onun yerine.

source: Fetch the Docker Containers
pt: Obter os contêineres do Docker
tr: Docker Kapsayıcılarını Alın

source: Once you have docker installed, you can fetch the docker containers required for gitlab. <em>Don’t run them yet.</em>
pt: Depois de instalar o docker, você pode buscar os contêineres do docker necessários para o gitlab. <em>Não os execute ainda.</em>
tr: Docker kurduktan sonra GitLab için gerekli Docker kapsayıcılarını getirebilirsiniz. <em>Henüz çalıştırmayın.</em>
