Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: I2PTunnel is a tool for interfacing with and providing services on I2P. Destination of an I2PTunnel can be defined using a <a href="%(naming)s">hostname</a>, <a href="%(naming)s#base32">Base32</a>, or a full 516-byte destination key. An established I2PTunnel will be available on your client machine as localhost:port. If you wish to provide a service on I2P network, you simply create I2PTunnel to the appropriate ip_address:port. A corresponding 516-byte destination key will be generated for the service and it will become avaliable throughout I2P. A web interface for I2PTunnel management is avaliable on <a href="http://localhost:7657/i2ptunnel/">localhost:7657/i2ptunnel/</a>.
pt: O I2PTunnel é uma ferramenta para interagir e fornecer serviços no I2P. O destino de um I2PTunnel pode ser definido usando um <a href="%(naming)s">nome de host</a>, <a href="%(naming)s#base32">Base32</a>ou uma chave de destino completa de 516 bytes. Um I2PTunnel estabelecido estará disponível na sua máquina cliente como localhost:port. Se você deseja fornecer um serviço na rede I2P, basta criar o I2PTunnel para o ip_address:port apropriado. Uma chave de destino correspondente de 516 bytes será gerada para o serviço e ficará disponível em todo o I2P. Uma interface web para gerenciamento do I2PTunnel está disponível em <a href="http://localhost:7657/i2ptunnel/">localhost:7657/i2ptunnel/</a>.
tr: I2PTunnel, I2P ile arayüz oluşturan ve üzerinden hizmet sunan bir araçtır. Bir I2PTunnel hedefi, <a href="%(naming)s">sunucu adı</a>, <a href="%(naming)s#base32">Base32</a> ya da 516 baytlık bir tam hedef anahtarı kullanılarak tanımlanabilir. Kurulan bir I2PTunnel, istemci bilgisayarınızda localhost:bağlantı noktası üzerinden erişilebilir olur. I2P ağı üzerinde bir hizmet sunmak istiyorsanız, uygun ip_addresi:bağlantı noktasına bir I2PTunnel oluşturmanız yeterlidir. Hizmete karşılık gelen 516 baytlık bir hedef anahtar oluşturulur ve I2P ağında kullanılabilir olur. I2PTunnel yönetimi internet arayüzüne <a href="http://localhost:7657/i2ptunnel/">localhost:7657/i2ptunnel/</a> adresinden erişilebilir.

source: Default Services
pt: Serviços Padrões
tr: Varsayılan Hizmetler

source: Server tunnels
pt: Tuneis de servidor
tr: Sunucu tünelleri

source: <b>I2P Webserver</b> - A tunnel pointed to a Jetty webserver run on <a href="http://localhost:7658">localhost:7658</a> for convenient and quick hosting on I2P. <br>The document root is:
pt: <b>Servidor Web I2P</b> - Um túnel apontado para um servidor web Jetty executado em <a href="http://localhost:7658">localhost:7658</a> para hospedagem rápida e conveniente no I2P. <br>A raiz do documento é:
tr: <b>I2P site sunucusu</b> - I2P ağında uygun ve hızlı bir barındırma sağlamak için <a href="http://localhost:7658">localhost:7658</a> üzerindeki bir Jetty site sunucusuna yönlenen bir tünel. <br>Belge kökü şurasıdır:

source: Client tunnels
pt: Túneis de cliente
tr: İstemci tünelleri

source: A HTTP proxy used for browsing I2P and the regular internet anonymously through I2P. Browsing internet through I2P uses a random proxy specified by the "Outproxies:" option.
pt: Um proxy HTTP usado para navegar no I2P e na Internet normal anonimamente através do I2P. Navegar na Internet através do I2P usa um proxy aleatório especificado pela opção "Outproxies:".
tr: I2P ağı ve normal İnternet ağında I2P ile anonim olarak gezinmek için kullanılan bir HTTP vekil sunucusu. I2P kullanarak İnternet gezinmesi, "Outproxies:" seçeneği ile belirtilen rastgele bir vekil sunucu kullanır.

source: An IRC tunnel to the default anonymous IRC network, Irc2P.
pt: Um túnel IRC para a rede IRC anônima padrão, Irc2P.
tr: Varsayılan anonim IRC ağı olan Irc2P için bir IRC tüneli.

source: A SMTP service provided by postman at <a href="http://%(postman)s/?page_id=16">%(postman)s</a>
pt: Um serviço SMTP fornecido pelo carteiro em <a href="http://%(postman)s/?page_id=16">%(postman)s</a>
tr: Postman için <a href="http://%(postman)s/?page_id=16">%(postman)s</a> üzerinden sunulan SMTP hizmeti

source: The accompanying POP sevice of postman at <a href="http://%(postman)s/?page_id=16">%(postman)s</a>
pt: O serviço POP de acompanhamento do carteiro em <a href="http://%(postman)s/?page_id=16">%(postman)s</a>
tr: Postman için <a href="http://%(postman)s/?page_id=16">%(postman)s</a> üzerindeki ilgili POP hizmeti

source: Configuration
pt: Configuração
tr: Yapılandırma

source: Client Modes
pt: Modos de Clientes
tr: İstemci Kipleri

source: Standard
pt: Padrão
tr: Standart

source: Opens a local TCP port that connects to a service (like HTTP, FTP or SMTP) on a destination inside of I2P. The tunnel is directed to a random host from the comma seperated (", ") list of destinations.
pt: Abre uma porta TCP local que se conecta a um serviço (como HTTP, FTP ou SMTP) em um destino dentro do I2P. O túnel é direcionado para um host aleatório da lista de destinos separados por vírgulas (", ").
tr: I2P ağındaki bir hedefte bulunan bir hizmete (HTTP, FTP veya SMTP gibi) bağlanan yerel bir TCP bağlantı noktası açar. Tünel, virgül ile ayrılmış (", ") hedef listesinden rastgele bir sunucuya yönlendirilir.

source: A HTTP-client tunnel. The tunnel connects to the destination specified by the URL in a HTTP request. Supports proxying onto internet if an outproxy is provided. Strips HTTP connections of the following headers:
pt: Um túnel cliente HTTP. O túnel se conecta ao destino especificado pela URL em uma solicitação HTTP. Suporta proxy na internet se um outproxy for fornecido. Retira as conexões HTTP dos seguintes cabeçalhos:
tr: Bir HTTP istemci tüneli. Tünel, bir HTTP isteğinde adres tarafından belirtilen hedefe bağlanır. Bir çıkış vekil sunucusu belirtilmişse, İnternet üzerinden vekil sunucu oluşturulmasını destekler. Aşağıdaki üst bilgilerin HTTP bağlantılarını ayıklar:

source: Depending on if the tunnel is using an outproxy or not it will append the following User-Agent:
pt: Dependendo se o túnel estiver usando um outproxy ou não, ele anexará o seguinte User-Agent:
tr: Tünelin bir çıkış vekil sunucusu kullanıp kullanmadığına bağlı olarak, aşağıdaki User-Agent değerini ekler:

source: Outproxy:
pt: Proxy de saída:
tr: Çıkış vekil sunucusu:

source: Internal I2P use:
pt: Uso interno do I2P:
tr: I2P içi kullanım:

source: Creates a connection to a random IRC server specified by the comma seprated (", ") list of destinations. Only a whitelisted subset of IRC commands are allowed due to anonymity concerns.
pt: Cria uma conexão com um servidor IRC aleatório especificado pela lista de destinos separados por vírgulas (", ") . Apenas um subconjunto de comandos IRC na lista de permissões é permitido devido a preocupações com anonimato.
tr: Virgül ile ayrılmış (", ") hedef listesiyle belirtilen rastgele bir IRC sunucusuna bağlantı oluşturur. Anonimlik endişeleri nedeniyle yalnızca beyaz listeye alınmış bir IRC komut alt kümesine izin verilir.

source: Enables using the I2P router as a SOCKS proxy.
pt: Permite usar o roteador I2P como um proxy SOCKS.
tr: I2P yönelticinin bir SOCKS vekil sunucusu olarak kullanılmasını sağlar.

source: Enables using the I2P router as a SOCKS proxy with the command whitelist specified by <a href="#client-mode-irc">IRC</a> client mode.
pt: Habilita o uso do roteador I2P como um proxy SOCKS com a lista de permissões de comandos especificada pelo modo cliente <a href="#client-mode-irc">IRC</a> .
tr: <a href="#client-mode-irc">IRC</a> istemci kipi tarafından belirtilen komut beyaz listesiyle I2P yönelticisinin bir SOCKS vekil sunucusu olarak kullanılmasını sağlar.

source: Creates a HTTP tunnel and uses the HTTP request method "CONNECT" to build a TCP tunnel that usually is used for SSL and HTTPS.
pt: Cria um túnel HTTP e usa o método de solicitação HTTP "CONNECT" para construir um túnel TCP que geralmente é usado para SSL e HTTPS.
tr: Bir HTTP tüneli oluşturur ve genellikle SSL ve HTTPS için kullanılan bir TCP tüneli oluşturmak için "CONNECT" HTTP isteği yöntemini kullanır.

source: Creates a UDP-server attached to a Streamr client I2PTunnel. The streamr client tunnel will subscribe to a streamr server tunnel.
pt: Cria um servidor UDP anexado a um I2PTunnel de cliente Streamr. O túnel de cliente streamr irá assinar um túnel de servidor streamr.
tr: Streamr istemcisi I2PTunnel bağlantılı bir UDP sunucusu oluşturur. Streamr istemci tüneli, bir streamr sunucu tüneline abone olacaktır.

source: Server Modes
pt: Modos de Servidor
tr: Sunucu Kipleri

source: Creates a destination to a local ip:port with an open TCP port.
pt: Cria um destino para um ip:porta local com uma porta TCP aberta.
tr: Açık bir TCP bağlantı noktası ile yerel bir ip:bağlantı noktası için bir hedef oluşturur.

source: Creates a destination to a local HTTP server ip:port. Supports gzip for requests with Accept-encoding: x-i2p-gzip, replies with Content-encoding: x-i2p-gzip in such a request.
pt: Cria um destino para um servidor HTTP local ip:port. Suporta gzip para solicitações com Accept-encoding: x-i2p-gzip, responde com Content-encoding: x-i2p-gzip em tal solicitação.
tr: Yerel bir HTTP sunucusu ip:bağlantı noktası için bir hedef oluşturur. Accept-encoding: x-i2p-gzip istekleri için gzip destekler. Böyle bir isteğe Content-encoding: x-i2p-gzip ile yanıt verir.

source: Functions as both a I2PTunnel HTTP Server, and a I2PTunnel HTTP client with no outproxying capabilities. An example application would be a web application that does client-type requests, or loopback-testing an I2P Site as a diagnostic tool.
pt: Funciona tanto como um I2PTunnel HTTP Server, quanto como um I2PTunnel HTTP client sem capacidades de outproxying . Um exemplo de aplicação seria uma aplicação web que faz requisições do tipo cliente , ou loopback-testing de um I2P Site como uma ferramenta de diagnóstico.
tr: Çıkış vekil sunucusu yetenekleri olmadan hem I2PTunnel HTTP sunucusu hem de I2PTunnel HTTP istemcisi olarak çalışır. Örnek bir uygulama, istemci türü istekler yapan ya da bir tanılama aracı olarak I2P sitesi geri döngü sınaması yapan bir internet uygulaması olabilir.

source: Creates a destination that filters the reqistration sequence of a client and passes the clients destination key as a hostname to the IRC-server.
pt: Cria um destino que filtra a sequência de solicitação de um cliente e passa a chave de destino do cliente como um nome de host para o servidor IRC.
tr: İstemcinin istek sırasını süzen ve istemci hedef anahtarını sunucu adı olarak IRC sunucusuna ileten bir hedef oluşturur.

source: A UDP-client that connects to a media server is created. The UDP-Client is coupled with a Streamr server I2PTunnel.
pt: Um cliente UDP que se conecta a um servidor de mídia é criado. O cliente UDP é acoplado a um servidor Streamr I2PTunnel.
tr: Bir ortam sunucusuna bağlanan bir UDP-istemcisi oluşturur. UDP istemcisi, bir Streamr sunucu I2PTunnel tüneli ile birleştirilmiştir.

source: Ministreaming Library
pt: Biblioteca de ministreaming
tr: Ministreaming Kitaplığı

source: Note
pt: Nota
tr: Not

source: The ministreaming library has been enhanced and extended by the "full" <a href="%(streaming)s">streaming library</a>. Ministreaming is deprecated and is incompatible with today's applications. The following documentation is old. Also note that streaming extends ministreaming in the same Java package (net.i2p.client.streaming), so the current <a href="%(api)s">API documentation</a> contains both. Obsolete ministreaming classes and methods are clearly marked as deprecated in the Javadocs.
pt: A biblioteca ministreaming foi aprimorada e estendida pela biblioteca de streaming "completa" <a href="%(streaming)s"></a>. O ministreaming está obsoleto e é incompatível com os aplicativos atuais. A documentação a seguir é antiga. Observe também que o streaming estende o ministreaming no mesmo pacote Java (net.i2p.client.streaming), então a atual <a href="%(api)s">documentação da API</a> contém ambos. Classes e métodos ministreaming obsoletos são claramente marcados como obsoletos nos Javadocs.
tr: Ministreaming kitaplığı, "tam" <a href="%(streaming)s">streaming kitaplığı</a> kullanılarak geliştirildi ve genişletildi . Ministreaming kullanımdan kaldırılmıştır ve günümüz uygulamalarıyla uyumlu değildir. İlgili belgeler eskidir. Ayrıca streaming, ministreaming kitaplığını aynı Java paketi (net.i2p.client.streaming) ile genişletir, dolayısıyla var olan <a href="%(api)s">API belgeleri</a> her ikisini de kapsar. Eski ministreaming sınıf ve yöntemlerinin kullanımdan kaldırıldığı, Javadocs üzerinde açıkça belirtilmiştir.

source: The ministreaming library is a layer on top of the core <a href="%(i2cp)s">I2CP</a> that allows reliable, in order, and authenticated streams of messages to operate across an unreliable, unordered, and unauthenticated message layer. Just like the TCP to IP relationship, this streaming functionality has a whole series of tradeoffs and optimizations available, but rather than embed that functionality into the base I2P code, it has been factored off into its own library both to keep the TCP-esque complexities separate and to allow alternative optimized implementations.
pt: A biblioteca ministreaming é uma camada sobre o núcleo <a href="%(i2cp)s">I2CP</a> que permite que fluxos confiáveis, ordenados e autenticados de mensagens operem em uma camada de mensagem não confiável, desordenada e não autenticada . Assim como o relacionamento TCP para IP, essa funcionalidade de streaming tem uma série de compensações e otimizações disponíveis, mas em vez de incorporar essa funcionalidade no código I2P base, ela foi fatorada em sua própria biblioteca para manter as complexidades do TCP separadas e para permitir implementações otimizadas alternativas.
tr: Ministreaming kitaplığı, güvenilir, düzenli ve kimliği doğrulanmış ileti akışlarının güvenilir olmayan, sıralanmamış ve kimliği doğrulanmamış bir ileti katmanında çalışmasını sağlayan ve <a href="%(i2cp)s">I2CP</a> çekirdeği üstünde bulunan bir katmandır. TCP ile IP ilişkisinde olduğu gibi, bu akış işlevselliğinde karşılıklı bazı özveriler ve iyileştirmeler vardır. Ancak bu işlevsellik temel I2P koduna yerleştirilmek yerine, TCP benzeri karmaşıklıkların ayrı tutulması ve farklı uygulamalara uygun şekilde eklenebilmesi için kendi kitaplığını kullanacak şekilde hazırlanmıştır.

source: The ministreaming library was written by mihi as a part of his <a href="%(i2ptunnel)s">I2PTunnel</a> application and then factored out and released under the BSD license. It is called the "mini"streaming library because it makes some simplifications in the implementation, while a more robust streaming library could be further optimized for operation over I2P. The two main issues with the ministreaming library are its use of the traditional TCP two phase establishment protocol and the current fixed window size of 1. The establishment issue is minor for long lived streams, but for short ones, such as quick HTTP requests, the impact can be <a href="%(minwww)s">significant</a>. As for the window size, the ministreaming library doesn't maintain any ID or ordering within the messages sent (or include any application level ACK or SACK), so it must wait on average twice the time it takes to send a message before sending another.
pt: A biblioteca ministreaming foi escrita por mihi como parte de seu aplicativo <a href="%(i2ptunnel)s">I2PTunnel</a> e então fatorada e lançada sob a licença BSD. Ela é chamada de biblioteca "mini"streaming porque faz algumas simplificações na implementação, enquanto uma biblioteca de streaming mais robusta poderia ser otimizada ainda mais para operação sobre I2P. Os dois principais problemas com a biblioteca de ministreaming são o uso do protocolo de estabelecimento tradicional TCP de duas fases e o tamanho de janela fixo atual de 1. O problema de estabelecimento é menor para fluxos de longa duração, mas para os curtos, como solicitações HTTP rápidas, o impacto pode ser <a href="%(minwww)s">significativo</a>. Quanto ao tamanho da janela , a biblioteca de ministreaming não mantém nenhuma ID ou ordenação dentro das mensagens enviadas (ou inclui qualquer ACK ou SACK de nível de aplicativo), então ela deve esperar em média o dobro do tempo que leva para enviar uma mensagem antes de enviar outra.
tr: Ministreaming kitaplığı, mihi tarafından <a href="%(i2ptunnel)s">I2PTunnel</a> uygulamasının bir parçası olarak yazılmış ve daha sonra ayrılarak BSD lisansı altında yayınlanmıştır. Uygularken bazı kolaylıklar sağladığından "mini" streaming kitaplığı olarak adlandırmıştı. I2P üzerine işlem yapmak için daha karmaşık olan streaming kitaplığı uygulanabilir. Ministreaming kitaplığıyla ilgili iki temel sorun, geleneksel TCP iki aşamalı kuruluş iletişim kuralını kullanması ve var olan sabit pencere boyutunun 1 olmasıdır. Kuruluş sorunu, uzun ömürlü akışlar için önemsizdir, ancak hızlı HTTP istekleri gibi kısa olanlar için, etki <a href="%(minwww)s">önemli</a> olabilir. Pencere boyutuna gelince, ministreaming kitaplığı gönderilen iletilerde herhangi bir kimlik veya sıralama tutmaz (veya herhangi bir uygulama düzeyinde ACK veya SACK içermez). Bu nedenle başka bir ileti göndermeden önce, bir ileti göndermek için geçen sürenin ortalama iki katı beklemesi gerekir. .

source: Even with those issues, the ministreaming library performs quite well in many situations, and its <a href="%(api)s">API</a> is both quite simple and capable of remaining unchanged as different streaming implementations are introduced. The library is deployed in its own ministreaming.jar. Developers in Java who would like to use it can access the API directly, while developers in other languages can use it through <a href="%(samv3)s">SAM</a>'s streaming support.
pt: Mesmo com esses problemas, a biblioteca ministreaming tem um desempenho muito bom em muitas situações , e sua <a href="%(api)s">API</a> é bastante simples e capaz de permanecer inalterada conforme diferentes implementações de streaming são introduzidas. A biblioteca é implantada em seu próprio ministreaming.jar. Desenvolvedores em Java que gostariam de usá-la podem acessar a API diretamente, enquanto desenvolvedores em outras linguagens podem usá-la por meio do suporte de streaming do <a href="%(samv3)s">SAM</a>.
tr: Ministreaming kitaplığı, bu sorunlarla bile birçok durumda oldukça iyi başarım sergiliyor. <a href="%(api)s">API</a> yazılımı oldukça basit ve farklı akış uygulamaları geliştirildikçe değişmeden kalabiliyor. Kitaplık ministreaming.jar dosyasında bulunur. Java üzerinde kullanmak isteyen geliştiriciler API yazılımına doğrudan erişebilirken, diğer dillerdeki geliştiriciler <a href="%(samv3)s">SAM</a> akış desteği üzerinden kullanabilir.

source: Library Name
pt: Nome da biblioteca
tr: Kitaplık Adı

source: Language
pt: Idioma
tr: Dil

source: STREAM
pt: FLUXO
tr: AKIŞ

source: DGRAM
tr: VERİ ŞEMASI

source: RAW
pt: CRU
tr: HAM

source: SOCKS and SOCKS proxies
pt: SOCKS e proxies SOCKS
tr: SOCKS ve SOCKS vekil sunucuları

source: The SOCKS proxy is working as of release 0.7.1. SOCKS 4/4a/5 are supported. Enable SOCKS by creating a SOCKS client tunnel in i2ptunnel. Both shared-clients and non-shared are supported. There is no SOCKS outproxy so it is of limited use.
pt: O proxy SOCKS está funcionando desde a versão 0.7.1. SOCKS 4/4a/5 são suportados. Habilite o SOCKS criando um túnel de cliente SOCKS no i2ptunnel. Clientes compartilhados e não compartilhados são suportados. Não há proxy externo SOCKS, portanto, seu uso é limitado.
tr: SOCKS vekil sunucusu, 0.7.1 sürümünden beri işlevseldir. SOCKS 4/4a/5 desteklenir. i2ptunnel üzerinde bir SOCKS istemci tüneli oluşturarak SOCKS kullanılabilir. Paylaşılan ve paylaşılmayan istemciler desteklenir. Bir SOCKS çıkış vekil sunucusu bulunmadığından kullanımı sınırlıdır.

source: As it says on the <a href="%(faq)s#socks">FAQ</a>:
pt: Como diz no <a href="%(faq)s#socks">FAQ</a>:
tr: <a href="%(faq)s#socks">SSS</a> bölümünde anlatıldığı gibi:

source: Many applications leak sensitive information that could identify you on the Internet. I2P only filters connection data, but if the program you intend to run sends this information as content, I2P has no way to protect your anonymity. For example, some mail applications will send the IP address of the machine they are running on to a mail server. There is no way for I2P to filter this, thus using I2P to 'socksify' existing applications is possible, but extremely dangerous.
pt: Muitos aplicativos vazam informações sensíveis que podem identificá-lo na Internet. O I2P filtra apenas dados de conexão, mas se o programa que você pretende executar enviar essas informações como conteúdo, o I2P não tem como proteger seu anonimato. Por exemplo, alguns aplicativos de e-mail enviarão o endereço IP da máquina em que estão sendo executados para um servidor de e-mail. Não há como o I2P filtrar isso, portanto, usar o I2P para 'socksify' aplicativos existentes é possível, mas extremamente perigoso.
tr: Birçok uygulama, İnternet üzerinde kim olduğunuzun belirlenebilmesini sağlayacak hassas bilgileri sızdırır. I2P yalnızca bağlantı verilerini süzer, ancak çalıştırmayı düşündüğünüz uygulama bu bilgileri içerik olarak gönderirse, I2P anonimliğinizi korumak için bir şey yapamaz. Örneğin, bazı e-posta uygulamaları, üzerinde çalıştıkları bilgisayarın IP adresini bir e-posta sunucusuna gönderir. I2P bu bilgiyi süzemez. Bu nedenle var olan uygulamalar 'socks' ile I2P üzerinde kullanılabilir, ancak son derece tehlikelidir.

source: And quoting from a 2005 email:
pt: E citando um email de 2005:
tr: 2005 tarihli bir e-postadan alıntı:

source: ... there is a reason why human and others have both built and abandoned the SOCKS proxies. Forwarding arbitrary traffic is just plain unsafe, and it behooves us as developers of anonymity and security software to have the safety of our end users foremost in our minds.
pt: ... há uma razão pela qual humanos e outros construíram e abandonaram os proxies SOCKS. Encaminhar tráfego arbitrário é simplesmente inseguro, e cabe a nós, como desenvolvedores de software de anonimato e segurança, ter a segurança de nossos usuários finais em primeiro lugar em nossas mentes.
tr: ... insanların ve diğerlerinin SOCKS vekil sunucularını önce kurup sonra terk etmesinin bir nedeni var. Rastgele trafiği yöneltmek kesinlikle güvenli değildir ve son kullanıcılarımızın güvenliğini akılımızdaki her şeyden önde tutmak, anonimlik ve güvenlik yazılımı geliştiricileri olarak bize düşüyor.
