Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: (0=noop, 1=disconnect) What to do on an inactivity timeout - do nothing, disconnect, or send a duplicate ack.
pt: (0=noop, 1=desconectar) O que fazer em um tempo limite de inatividade - não fazer nada, desconectar ou enviar uma confirmação duplicada.
tr: (0=bir şey yapma, 1=bağlantıyı kes) Hareketsizlik zaman aşımında yapılması gerekenler - bir şey yapmayın, bağlantıyı kesin ya da yinelenen bir onay gönderin.

source: Idle time before sending a keepalive
pt: Tempo ocioso antes de enviar um keepalive
tr: Canlı tut komutu gönderilmeden önce beklenecek süre

source: Delay before sending an ack
pt: Atraso antes de enviar um ack
tr: ACK komutu gönderilmeden önceki gecikme

source: The initial value of the resend delay field in the packet header, times 1000. Not fully implemented; see below.
pt: O valor inicial do campo de atraso de reenvio no cabeçalho do pacote, vezes 1000. Não totalmente implementado; veja abaixo.
tr: Paket üst bilgisindeki yeniden gönderme gecikmesi alanının ilk değeri, çarpı 1000. Tam olarak kullanılmıyor. Aşağıya bakın.

source: Initial timeout (if no <a href="#sharing">sharing data</a> available).
pt: Tempo limite inicial (se nenhum <a href="#sharing">compartilhamento de dados</a> estiver disponível).
tr: Başlangıç zaman aşımı (kullanılabilecek <a href="#sharing">paylaşılan veri</a> yoksa).

source: Initial round trip time estimate (if no <a href="#sharing">sharing data</a> available). Disabled as of release 0.9.8; uses actual RTT.
pt: Estimativa inicial de tempo de ida e volta (se nenhum <a href="#sharing">compartilhamento de dados</a> estiver disponível). Desativado a partir da versão 0.9.8; usa RTT real.
tr: İlk gidiş dönüş süresi öngörüsü kullanılabilecek <a href="#sharing">paylaşılan veri</a> yoksa). 0.9.8 sürümünden beri devre dışı bırakıldı; gerçek RTT kullanır.

source: if no <a href="#sharing">sharing data</a> available
pt: Se nenhum <a href="#sharing">dado de compartilhamento</a> disponível
tr: kullanılabilecek <a href="#sharing">paylaşılan veri</a> yoksa

source: In standard TCP, window sizes are in bytes, while in I2P, window sizes are in messages.
pt: No TCP padrão, os tamanhos das janelas estão em bytes, enquanto no I2P, os tamanhos das janelas estão em mensagens.
tr: Standart TCP için pencere boyutları bayt cinsindendir, I2P üzerinde ise pencere boyutları iletilerdedir.

source: (0 or negative value means unlimited) This is a total limit for incoming and outgoing combined.
pt: (0 ou valor negativo significa ilimitado) Este é um limite total para entradas e saídas combinadas.
tr: (0 veya negatif değer sınırsız anlamına gelir) Geliş ve gidiş için birleşik toplam sınırdır.

source: Incoming connection limit (per peer; 0 means disabled)
pt: Limite de conexão de entrada (por par; 0 significa desabilitado)
tr: Geliş bağlantısı sınırı (per peer; 0, devre dışı anlamına gelir)

source: (per peer; 0 means disabled)
pt: (por par; 0 significa desabilitado)
tr: (per peer; 0 devre dışı anlamına gelir)

source: The maximum size of the payload, i.e. the MTU in bytes.
pt: O tamanho máximo da carga útil, ou seja, a MTU em bytes.
tr: Yükün en fazla boyutu, yani bayt cinsinden MTU.

source: Maximum number of retransmissions before failure.
pt: Número máximo de retransmissões antes da falha.
tr: Başarısız sayılmadan önce en fazla yeniden aktarım sayısı.

source: Incoming connection limit (all peers; 0 means disabled)
pt: Limite de conexão de entrada (todos os pares; 0 significa desabilitado)
tr: Geliş bağlantısı sınırı (all peers; 0, devre dışı anlamına gelir)

source: (all peers; 0 means disabled) Use with caution as exceeding this will disable a server for a long time.
pt: (todos os pares; 0 significa desabilitado) Use com cuidado, pois exceder isso desabilitará o servidor por um longo tempo.
tr: (all peers; 0 devre dışı anlamına gelir) Bunu aşmak bir sunucuyu uzun süre devre dışı bırakacağından dikkatli kullanın.

source: (2=interactive not supported) This doesn't currently do anything, but setting it to a value other than 1 will cause an error.
pt: (2=interativo não suportado) Isso não faz nada no momento, mas defini-lo para um valor diferente de 1 causará um erro.
tr: (2=etkileşimli desteklenmiyor) Bu şu anda hiçbir şey yapmıyor, ancak 1 değerinden farklı bir değere ayarlamak hataya neden olur.

source: How long to block on read, in milliseconds. Negative means indefinitely.
pt: Quanto tempo bloquear na leitura, em milissegundos. Negativo significa indefinidamente.
tr: Milisaniye cinsinden, okunurken ne kadar süreyle bloke edileceği. Negatif süresiz anlamına gelir.

source: When we're in slow start, we grow the window size at the rate of 1/(factor). In standard TCP, window sizes are in bytes, while in I2P, window sizes are in messages. A higher number means slower growth.
pt: Quando estamos em início lento, aumentamos o tamanho da janela na taxa de 1/(fator). No TCP padrão, os tamanhos das janelas estão em bytes, enquanto no I2P, os tamanhos das janelas estão em mensagens. Um número maior significa crescimento mais lento.
tr: Yavaş başlatma durumundayken pencere boyutunu <code>1/(factor)</code> oranında büyütürüz. Standart TCP için pencere boyutları bayt cinsindendir, I2P üzerinde ise pencere boyutları iletilerdedir. Daha yüksek bir sayı, daha yavaş büyüme anlamına gelir.

source: Ref: RFC 2140. Floating point value. May be set only via context properties, not connection options.
pt: Ref: RFC 2140. Valor de ponto flutuante. Pode ser definido somente por meio de propriedades de contexto, não de opções de conexão.
tr: Ref: RFC 2140. Kayan nokta değeri. Bağlantı seçenekleriyle değil, yalnızca bağlam özellikleriyle ayarlanabilir.

source: How long to block on write/flush, in milliseconds. Negative means indefinitely.
pt: Quanto tempo bloquear em write/flush, em milissegundos. Negativo significa indefinidamente.
tr: Milisaniye cinsinden, yazılırken/boşaltılırken ne kadar süreyle bloke edileceği. Negatif süresiz anlamına gelir.

source: Protocol Specification
pt: Especificação de Protocolo
tr: İletişim Kuralı Teknik Özellikleri

source: See the Streaming Library Specification page.
pt: Ver a página da especificação da biblioteca de streaming.
tr: Streaming kitaplığı teknik özellikleri sayfasına bakın.

source: Implementation Details
pt: Detalhes da implementação
tr: Uygulama Ayrıntıları

source: Setup
pt: Configurar
tr: Kurulum

source: The initiator sends a packet with the SYNCHRONIZE flag set. This packet may contain the initial data as well. The peer replies with a packet with the SYNCHRONIZE flag set. This packet may contain the initial response data as well.
pt: O iniciador envia um pacote com o sinalizador SYNCHRONIZE definido. Este pacote pode conter os dados iniciais também. O peer responde com um pacote com o sinalizador SYNCHRONIZE definido. Este pacote pode conter os dados de resposta inicial também.
tr: Başlatıcı, SYNCHRONIZE işaret kümesi ile bir paket gönderir. Bu pakette ilk veriler de bulunabilir.<br> Karşıdaki eş, SYNCHRONIZE işaret kümesi ile bir paketle yanıt verir. Bu pakette ilk yanıt verileri de bulunabilir.

source: The initiator may send additional data packets, up to the initial window size, before receiving the SYNCHRONIZE response. These packets will also have the send Stream ID field set to 0. Recipients must buffer packets received on unknown streams for a short period of time, as they may arrive out of order, in advance of the SYNCHRONIZE packet.
pt: O iniciador pode enviar pacotes de dados adicionais, até o tamanho da janela inicial, antes de receber a resposta SYNCHRONIZE. Esses pacotes também terão o campo ID do fluxo de envio definido como 0. Os destinatários devem armazenar em buffer os pacotes recebidos em fluxos desconhecidos por um curto período de tempo, pois eles podem chegar fora de ordem, antes do pacote SYNCHRONIZE.
tr: Başlatıcı, SYNCHRONIZE yanıtını almadan önce ilk pencere boyutuna kadar ek veri paketleri gönderebilir. Bu paketler ayrıca gönderme akış kimliği alanını 0 olarak ayarlar. Alıcılar, bilinmeyen akışlarda alınan paketleri, SYNCHRONIZE paketinden önce düzensiz sırada alabileceğinden kısa bir süre için ara belleğe almalıdır.

source: MTU Selection and Negotiation
pt: Seleção e Negociação da MTU
tr: MTU Seçimi ve Uzlaşma

source: The maximum message size (also called the MTU / MRU) is negotiated to the lower value supported by the two peers. As tunnel messages are padded to 1KB, a poor MTU selection will lead to a large amount of overhead. The MTU is specified by the option i2p.streaming.maxMessageSize. The current default MTU of 1730 was chosen to fit precisely into two 1K I2NP tunnel messages, including overhead for the typical case.
pt: O tamanho máximo da mensagem (também chamado de MTU / MRU) é negociado para o menor valor suportado por os dois pares. Como as mensagens de túnel são preenchidas para 1 KB, uma seleção de MTU ruim levará a uma grande quantidade de sobrecarga. A MTU é especificada pela opção i2p.streaming.maxMessageSize. A MTU padrão atual de 1730 foi escolhida para caber precisamente em duas mensagens de túnel I2NP de 1K, incluindo sobrecarga para o caso típico.
tr: En büyük ileti boyutu (MTU / MRU olarak da adlandırılır), iki eş arasında desteklenen daha düşük değere göre belirlenir. Tünel iletileri 1 KB olarcak şekilde doldurulduğundan, zayıf bir MTU seçimi büyük miktarda ek yüke yol açar. MTU, i2p.streaming.maxMessageSize seçeneğiyle belirtilir. Var olan varsayılan 1730 MTU değeri, tipik durum için ek yük ile birlikte iki 1K I2NP tünel iletisine tam olarak uyacak şekilde seçilmiştir.

source: The first message in a connection includes a 387 byte (typical) Destination added by the streaming layer, and usually a 898 byte (typical) LeaseSet, and Session keys, bundled in the Garlic message by the router. (The LeaseSet and Session Keys will not be bundled if an ElGamal Session was previously established). Therefore, the goal of fitting a complete HTTP request in a single 1KB I2NP message is not always attainable. However, the selection of the MTU, together with careful implementation of fragmentation and batching strategies in the tunnel gateway processor, are important factors in network bandwidth, latency, reliability, and efficiency, especially for long-lived connections.
pt: A primeira mensagem em uma conexão inclui um Destino de 387 bytes (típico) adicionado pela camada de streaming, e geralmente um LeaseSet de 898 bytes (típico) e chaves de Sessão, agrupados na mensagem Garlic pelo roteador. (O LeaseSet e as Chaves de Sessão não serão agrupados se uma Sessão ElGamal tiver sido estabelecida anteriormente). Portanto, o objetivo de encaixar uma solicitação HTTP completa em uma única mensagem I2NP de 1 KB nem sempre é atingível. No entanto, a seleção da MTU, juntamente com a implementação cuidadosa de estratégias de fragmentação e de loteamento no processador de gateway de túnel, são fatores importantes na largura de banda da rede, latência, confiabilidade e eficiência, especialmente para conexões de longa duração.
tr: Bir bağlantıdaki ilk iletide, akış katmanı tarafından eklenen 387 baytlık (tipik) bir hedef ve genellikle yöneltici tarafından Garlic iletisinde paketlenmiş 898 baytlık (tipik) bir "Kiralama kümesi" (LeaseSet) ile oturum anahtarları bulunur. (Daha önce bir ElGamal oturumu kurulmuşsa, "Kiralama kümesi" (LeaseSet) ve oturum anahtarları paketlenmez). Bu nedenle, her zaman tam bir HTTP isteğini tek bir 1KB I2NP iletisine uydurma hedefine ulaşılamaz. Bununla birlikte, tünel ağ geçidi işlemcisinde parçalanma ve gruplama stratejilerinin dikkatli bir şekilde uygulanmasıyla birlikte MTU değerinin seçimi, özellikle uzun ömürlü bağlantılar için ağ bant genişliği, gecikme süresi, güvenilirlik ve verimlilik açısından önemli faktörlerdir.

source: Data integrity is assured by the gzip CRC-32 checksum implemented in <a href="%(i2cp)s#format">the I2CP layer</a>. There is no checksum field in the streaming protocol.
pt: A integridade dos dados é garantida pela soma de verificação CRC-32 gzip implementada em <a href="%(i2cp)s#format">na camada I2CP</a>. Não há campo de soma de verificação no protocolo de streaming.
tr: Veri bütünlüğü, <a href="%(i2cp)s#format">I2CP katmanında</a> uygulanan gzip CRC-32 sağlaması kullanılarak sağlanır. Streaming iletişim kuralında sağlama alanı yoktur.

source: Each packet is sent through I2P as a single message (or as an individual clove in a <a href="%(garlicrouting)s">Garlic Message</a>). Message encapsulation is implemented in the underlying <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a>, and <a href="%(tunnelmessage)s">tunnel message</a> layers. There is no packet delimiter mechanism or payload length field in the streaming protocol.
pt: Cada pacote é enviado através do I2P como uma única mensagem (ou como um dente individual em uma <a href="%(garlicrouting)s">Mensagem de Alho</a>). O encapsulamento de mensagens é implementado nas camadas subjacentes <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a>e <a href="%(tunnelmessage)s">mensagem de túnel</a> . Não há mecanismo delimitador de pacotes ou campo de comprimento de carga útil no protocolo de streaming.
tr: Her paket, I2P aracılığıyla tek bir ileti olarak (ya da bir <a href="%(garlicrouting)s">Garlic iletisi</a> içindeki tek bir diş olarak) gönderilir. İleti kapsüllemesi için <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a> ve <a href="%(tunnelmessage)s">tünel ileti</a> katmanları kullanılır. Streaming iletişim kuralında paket sınırlayıcı bir yöntem veya uzunluk alanı yoktur.

source: Optional Delay
pt: Atraso opcional
tr: İsteğe Bağlı Gecikme

source: Data packets may include an optional delay field specifying the requested delay, in ms, before the receiver should ack the packet. Valid values are 0 to 60000 inclusive. A value of 0 requests an immediate ack. This is advisory only, and receivers should delay slightly so that additional packets may be acknowledged with a single ack. Some implementations may include an advisory value of (measured RTT / 2) in this field. For nonzero optional delay values, receivers should limit the maximum delay before sending an ack to a few seconds at most. Optional delay values greater than 60000 indicate choking, see below.
pt: Pacotes de dados podem incluir um campo de atraso opcional especificando o atraso solicitado, em ms, antes que o receptor reconheça o pacote. Os valores válidos são de 0 a 60000, inclusive. Um valor de 0 solicita um reconhecimento imediato. Isso é apenas consultivo, e os receptores devem atrasar um pouco para que pacotes adicionais possam ser reconhecidos com um único reconhecimento. Algumas implementações podem incluir um valor consultivo de (RTT medido / 2) neste campo. Para valores de atraso opcionais diferentes de zero, os receptores devem limitar o atraso máximo antes de enviar um reconhecimento para alguns segundos, no máximo. Valores de atraso opcionais maiores que 60000 indicam estrangulamento, veja abaixo.
tr: Veri paketlerinde, alıcının paketi onaylamasından önce, istenilen gecikmeyi ms cinsinden belirten bir isteğe bağlı gecikme alanı bulunabilir. Geçerli değerler 0 ile 60000 arasındadır. 0 değeri anında onay ister. Bu yalnızca bir öneridir ve alıcılar, ek paketlerin tek seferde onaylanabilmesi için biraz gecikmelidir. Bazı uygulamalarda bu alanda (ölçülen RTT/2) bir öneri değeri bulunabilir. Sıfır olmayan isteğe bağlı gecikme değerleri için, alıcılar bir onay göndermeden önce en fazla gecikmeyi en çok birkaç saniye ile sınırlamalıdır. 60000 üzerinde isteğe bağlı gecikme değerleri boğulmayı gösterir. Ayrıntılı bilgi almak için aşağıya bakın.

source: Receive Window and Choking
pt: Janela de recepção e asfixia
tr: Alma Penceresi ve Kısma

source: TCP headers include the receive window in bytes. The streaming protocol does not contain a receive window, it uses only a simple choke/unchoke indication. Each endpoint must maintain its own estimate of the far-end receive window, in either bytes or packets. The recommended minimum buffer size for receiver implementations is 128 packets or 217 KB (approximately 128x1730). Because of I2P netowrk latency, packet drops, and the resulting congestion control, a buffer of this size is rarely filled. Overflow is, however, likely to occur on high-bandwidth "local loopback" (same-router) connections.
pt: Os cabeçalhos TCP incluem a janela de recebimento em bytes. O protocolo de streaming não contém uma janela de recebimento, ele usa apenas uma indicação simples de choke/unchoke. Cada ponto final deve manter sua própria estimativa da janela de recebimento do ponto final, em bytes ou pacotes. O tamanho mínimo de buffer recomendado para implementações de receptor é 128 pacotes ou 217 KB (aproximadamente 128x1730). Devido à latência da rede I2P, quedas de pacotes e o controle de congestionamento resultante, um buffer desse tamanho raramente é preenchido. No entanto, é provável que ocorra estouro em conexões de "loopback local" (mesmo roteador) de alta largura de banda.
tr: TCP üst bilgilerinde, bayt cinsinden alma penceresi bulunur. Streaming iletişim kuralında bir alma penceresi bulunmaz. Yalnızca basit bir kısma/açma göstergesi kullanılır. Her uç nokta, bayt veya paket olarak uzak uçtaki alma penceresine ilişkin kendi öngörüsünü korumalıdır. Alıcı uygulamaları için önerilen en az ara bellek 128 paket veya 217 KB boyutundadır (yaklaşık 128x1730). I2P ağ gecikmesi, paket kayıpları ve bunun sonucunda oluşan tıkanıklık denetimi nedeniyle, bu boyuttaki bir ara bellek nadiren doldurulur. Ancak, yüksek bant genişliğine sahip "yerel geri döngü" (aynı yöneltici) bağlantılarında taşma oluşabilir.

source: To quickly indicate and smoothly recover from overflow conditions, there is a simple mechanism for pushback in the streaming protocol. If a packet is received with an optional delay field of value of 60001 or higher, that indicates "choking" or a receive window of zero. A packet with an optional delay field of value of 60000 or less indicates "unchoking". Packets without an optional delay field do not affect the choke/unchoke state.
pt: Para indicar rapidamente e recuperar-se suavemente de condições de estouro, há um mecanismo simples para pushback no protocolo de streaming. Se um pacote for recebido com um campo de atraso opcional de valor de 60001 ou superior, isso indica "estrangulamento" ou uma janela de recebimento de zero. Um pacote com um campo de atraso opcional de valor de 60000 ou menos indica "desestrangulamento". Pacotes sem um campo de atraso opcional não afetam o estado de estrangulamento/desestrangulamento.
tr: Taşma koşullarını hızlı bir şekilde belirtmek ve sorunsuz bir şekilde kurtarmak için Streaming iletişim kuralında basit bir geri bildirim için yöntemi vardır. 60001 ya da daha yüksek değerde isteğe bağlı gecikme alanına sahip bir paket alınırsa, bu "kısma" veya alma penceresinin sıfır olduğunu gösterir. 60000 veya daha düşük değerde isteğe bağlı gecikme alanına sahip bir paket "açmayı" gösterir. İsteğe bağlı gecikme alanı olmayan paketler, kısma/açma durumunu etkilemez.

source: After being choked, no more packets with data should be sent until the transmitter is unchoked, except for occasional "probe" data packets to compensate for possible lost unchoke packets. The choked endpoint should start a "persist timer" to control the probing, as in TCP. The unchoking endpoint should send several packets with this field set, or continue sending them periodically until data packets are received again. Maximum time to wait for unchoking is implementation-dependent. Transmitter window size and congestion control strategy after being unchoked is implementation-dependent.
pt: Após ser bloqueado, nenhum outro pacote com dados deve ser enviado até que o transmissor seja desbloqueado, exceto para pacotes de dados de "sondagem" ocasionais para compensar possíveis pacotes desbloqueados perdidos. O ponto final bloqueado deve iniciar um "temporizador de persistência" para controlar a sondagem, como no TCP. O ponto final desbloqueado deve enviar vários pacotes com este campo definido, ou continuar enviando-os periodicamente até que os pacotes de dados sejam recebidos novamente. O tempo máximo de espera para o desbloqueio depende da implementação. O tamanho da janela do transmissor e a estratégia de controle de congestionamento após ser desbloqueado dependem da implementação.
tr: Tıkandıktan sonra, olası kayıp açılmamış paketleri telafi etmek için ara sıra "yoklama" veri paketleri dışında, vericinin tıkanması açılana kadar veri içeren başka paket gönderilmemelidir. Tıkanmış uç nokta, TCP üzerinde olduğu gibi araştırmayı kontrol etmek için bir "kalıcı zamanlayıcı" başlatmalıdır. Açılan uç nokta, bu alan kümesi ile birkaç paket göndermeli veya veri paketleri yeniden alınana kadar bunları belirli aralıklarla göndermeyi sürdürmelidir. Tıkanıklığın çözülmesi için beklenecek en fazla süre uygulamaya bağlıdır. Açıldıktan sonra verici penceresi boyutu ve tıkanıklık denetimi stratejisi uygulamaya bağlıdır.

source: Congestion Control
pt: Controle de Congestionamento
tr: Tıkanıklık Denetimi

source: The streaming lib uses standard slow-start (exponential window growth) and congestion avoidance (linear window growth) phases, with exponential backoff. Windowing and acknowledgments use packet count, not byte count.
pt: A biblioteca de streaming usa fases padrão de início lento (crescimento exponencial da janela) e prevenção de congestionamento (crescimento linear da janela) , com recuo exponencial. O janelamento e as confirmações usam a contagem de pacotes, não a contagem de bytes.
tr: Streaming kitaplığı, üstel geri çekilme ile standart yavaş başlangıç (üstel pencere büyümesi) ve tıkanıklıktan kaçınma (doğrusal pencere büyümesi) aşamalarını kullanır. Pencereleme ve bildirimler, bayt sayısını değil paket sayısını kullanır.

source: Close
pt: Fechar
tr: Kapatma

source: Any packet, including one with the SYNCHRONIZE flag set, may have the CLOSE flag sent as well. The connection is not closed until the peer responds with the CLOSE flag. CLOSE packets may contain data as well.
pt: Qualquer pacote, incluindo um com o sinalizador SYNCHRONIZE definido, pode ter o sinalizador CLOSE enviado também. A conexão não é fechada até que o peer responda com o sinalizador CLOSE. Os pacotes CLOSE também podem conter dados.
tr: SYNCHRONIZE işaret kümesi ile birlikte herhangi bir pakette CLOSE işareti de gönderilebilir. Eş CLOSE işaretiyle yanıt verene kadar bağlantı kapatılmaz. CLOSE paketleri de veri içerebilir.

source: There is no ping function at the I2CP layer (equivalent to ICMP echo) or in datagrams. This function is provided in streaming. Pings and pongs may not be combined with a standard streaming packet; if the ECHO option is set, then most other flags, options, ackThrough, sequenceNum, NACKs, etc. are ignored.
pt: Não há função ping na camada I2CP (equivalente ao eco ICMP) ou em datagramas. Esta função é fornecida em streaming. Pings e pongs não podem ser combinados com um pacote de streaming padrão; se a opção ECHO estiver definida, então a maioria dos outros sinalizadores, opções, ackThrough, sequenceNum, NACKs, etc. são ignorados.
tr: I2CP katmanında (ICMP echo eşdeğeri) veya veri şemalarında ping işlevi yoktur. Bu işlev akışta sağlanır. Ping ve pong standart bir akış paketiyle birleştirilemez; ECHO seçeneği ayarlanmışsa, diğer birçok işaret, seçenek, ackThrough, sequenceNum, NACK gibi şeyler yok sayılır.
