Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: <b>Starvation attack:</b> A hostile user may attempt to harm the network by creating a significant number of peers in the network who are not identified as being under control of the same entity (as with Sybil). These nodes then decide not to provide any resources to the network, causing existing peers to search through a larger network database or request more tunnels than should be necessary. Alternatively, the nodes may provide intermittent service by periodically dropping selected traffic, or refusing connections to certain peers. This behavior may be indistinguishable from that of a heavily-loaded or failing node. I2P addresses these issues by maintaining <a href="%(peerselection)s">profiles</a> on the peers, attempting to identify underperforming ones and simply ignoring them, or using them rarely. We have significantly enhanced the ability to recognize and avoid troublesome peers; however there are still significant efforts required in this area.
pt: <b>Ataque de fome:</b> Um usuário hostil pode tentar prejudicar a rede criando um número significativo de pares na rede que não são identificados como estando sob o controle da mesma entidade (como com Sybil). Esses nós então decidem não fornecer nenhum recurso para a rede, fazendo com que os pares existentes pesquisem em um banco de dados de rede maior ou solicitem mais túneis do que deveriam ser necessários. Alternativamente, os nós podem fornecer serviço intermitente periodicamente descartando tráfego selecionado ou recusando conexões com certos pares. Esse comportamento pode ser indistinguível daquele de um nó muito carregado ou com falha. O I2P aborda essas questões mantendo <a href="%(peerselection)s">perfis</a> nos pares, tentando identificar aqueles com baixo desempenho e simplesmente ignorando-os ou usando-os raramente. Melhoramos significativamente a capacidade de reconhecer e evitar pares problemáticos; no entanto, ainda são necessários esforços significativos nessa área.
tr: <b>Açlık saldırısı:</b> Kötü niyetli bir kullanıcı, ağda aynı varlığın denetimi altında olarak tanımlanmayan (Sybil için olduğu gibi) önemli sayıda eş oluşturarak ağa zarar vermeye çalışabilir. Bu düğümler daha sonra ağa herhangi bir kaynak sağlamamaya karar vererek var olan eşlerin daha büyük bir ağ veri tabanında arama yapmasına veya gerekenden daha fazla tünel isteğinde bulunmasına neden olur. Alternatif olarak, düğümler, seçilen trafiği düzenli olarak bırakarak ya da belirli eşlere bağlantıları reddederek kesintili hizmet sağlayabilir. Bu davranış, çok yüklü veya başarısız bir düğümün davranışından ayırt edilemeyebilir. I2P, eşler üzerinde <a href="%(peerselection)s">profiller</a> sağlayarak, düşük başarımlı eşleri belirlemeye çalışarak ve onları görmezden gelerek ya da nadiren kullanarak bu sorunları aşar. Sorunlu eşleri tanıma ve bunlardan kaçınma yeteneğini önemli ölçüde geliştirdik. Ancak bu alanda hala önemli çabalar harcanması gerekiyor.

source: <b>Flooding attack:</b> A hostile user may attempt to flood the network, a peer, a destination, or a tunnel. Network and peer flooding is possible, and I2P does nothing to prevent standard IP layer flooding. The flooding of a destination with messages by sending a large number to the target's various inbound tunnel gateways is possible, but the destination will know this both by the contents of the message and because the tunnel's tests will fail. The same goes for flooding just a single tunnel. I2P has no defenses for a network flooding attack. For a destination and tunnel flooding attack, the target identifies which tunnels are unresponsive and builds new ones. New code could also be written to add even more tunnels if the client wishes to handle the larger load. If, on the other hand, the load is more than the client can deal with, they can instruct the tunnels to throttle the number of messages or bytes they should pass on (once the <a href="%(todo)s#batching">advanced tunnel operation</a> is implemented).
pt: <b>Ataque de inundação:</b> Um usuário hostil pode tentar inundar a rede, um par, um destino ou um túnel. É possível a inundação de rede e de pares, e o I2P não faz nada para prevenir a inundação padrão da camada IP. A inundação de um destino com mensagens enviando um grande número para os vários gateways de túnel de entrada do alvo é possível, mas o destino saberá disso tanto pelo conteúdo da mensagem quanto porque os testes do túnel falharão. O mesmo se aplica à inundação de um único túnel. O I2P não tem defesas contra um ataque de inundação de rede. Para um ataque de inundação de destino e túnel, o alvo identifica quais túneis estão sem resposta e constrói novos. Novo código também poderia ser escrito para adicionar ainda mais túneis se o cliente desejar lidar com a carga maior. Se, por outro lado, a carga for mais do que o cliente pode lidar, ele pode instruir os túneis a limitar o número de mensagens ou bytes que devem ser transmitidos (uma vez que a <a href="%(todo)s#batching">operação avançada de túnel</a> seja implementada).
tr: <b>Taşma saldırısı:</b> Kötü niyetli bir kullanıcı ağa, bir eşe, bir hedefe ya da bir tünele taşma saldırısı girişiminde bulunabilir. Ağa ve eşlere taşma saldırısı yapılabilir ve I2P, standart IP katmanı taşmasını önlemek için herhangi bir şey yapmaz. Hedefin çeşitli geliş tüneli ağ geçitlerine çok sayıda ileti göndermesi ile bir hedefte taşma sağlanabilir. Ancak hedef bu durumu hem iletinin içeriğinden hem de tünel sınamalarının başarısız olmasından biliyor olacaktır. Aynı şey yalnızca tek bir tünelin taşması için de geçerlidir. I2P üzerinde ağ taşma saldırısına karşı bir savunma yoktur. Bir hedef ve tünel taşma saldırısı için hedef, hangi tünellerin yanıt vermediğini belirler ve yeni tüneller oluşturur. İstemci daha büyük bir yükün üstesinden gelmek isterse, daha fazla tünel eklemek için yeni bir kod yazılabilir. Öte yandan, yük istemcinin başa çıkabileceğinden fazlaysa, tünellere iletmeleri gereken ileti veya bayt sayısını azaltma komutu verebilirler (<a href="%(todo)s#batching">gelişmiş tünel işlemi</a> uygulandıktan sonra).

source: <b>CPU load attack:</b> There are currently some methods for people to remotely request that a peer perform some cryptographically expensive operation, and a hostile attacker could use these to flood that peer with a large number of them in an attempt to overload the CPU. Both using good engineering practices and potentially requiring nontrivial certificates (e.g. HashCash) to be attached to these expensive requests should mitigate the issue, though there may be room for an attacker to exploit various bugs in the implementation.
pt: <b>Ataque de carga de CPU:</b> Atualmente, existem alguns métodos para as pessoas solicitarem remotamente que um peer execute alguma operação criptograficamente cara , e um invasor hostil poderia usá-los para inundar esse peer com um grande número deles em uma tentativa de sobrecarregar a CPU. Tanto usar boas práticas de engenharia quanto potencialmente exigir que certificados não triviais (por exemplo, HashCash) sejam anexados a essas solicitações caras deve mitigar o problema, embora possa haver espaço para um invasor explorar vários bugs na implementação.
tr: <b>İşlemci yükü saldırısı:</b> Şu anda, insanların bir eşten uzaktan kriptografik olarak pahalı bir işlem gerçekleştirmesini isteyebileceği bazı yöntemler vardır ve bir saldırgan, işlemciyi aşırı yükleyerek bu eşe çok sayıda saldırı girişiminde bulunmak için bunları kullanabilir. Hem iyi mühendislik uygulamaları kullanmak hem de potansiyel olarak bu pahalı isteklere eklenecek önemsiz olmayan sertifikaları (HashCash gibi) zorunlu kılmak sorunu hafifletmelidir. Ancak hala bir saldırganın uygulamadaki çeşitli açıklardan yaralanabileceği yerler olabilir.

source: <b>Floodfill DOS attack:</b> A hostile user may attempt to harm the network by becoming a floodfill router. The current defenses against unreliable, intermittent, or malicious floodfill routers are poor. A floodfill router may provide bad or no response to lookups, and it may also interfere with inter-floodfill communication. Some defenses and <a href="%(peerselection)s">peer profiling</a> are implemented, however there is much more to do. For more information see the <a href="%(netdb)s#threat">network database page</a>.
pt: <b>Ataque DOS Floodfill:</b> Um usuário hostil pode tentar prejudicar a rede se tornando um roteador floodfill. As defesas atuais contra roteadores floodfill não confiáveis, intermitentes ou maliciosos são fracas. Um roteador floodfill pode fornecer resposta ruim ou nenhuma resposta para pesquisas e também pode interferir na comunicação entre floodfills. Algumas defesas e <a href="%(peerselection)s">criação de perfil de pares</a> são implementadas, no entanto, há muito mais a fazer. Para mais informações, consulte a página do banco de dados de rede <a href="%(netdb)s#threat"></a>.
tr: <b>Taşma DOS saldırısı:</b> Kötü niyetli bir kullanıcı, bir taşma yönelticisi olarak ağa zarar vermeye çalışabilir. Güvenilmez, kesintili ya da kötü niyetli otomatik doldurma yönelticilerine karşı var olan savunma zayıftır. Bir otomatik doldurma yönelticisi, aramalara kötü yanıt verebilir ya da hiç yanıt vermeyebilir ve ayrıca aradaki otomatik doldurma iletişimini engelleyebilir. Bazı savunmalar ve <a href="%(peerselection)s">eş profili oluşturma</a> uygulanıyor. Ancak daha yapılacak çok şey var. Ayrıntılı bilgi almak için <a href="%(netdb)s#threat">ağ veri tabanı (netDB) sayfasına</a> bakabilirsiniz.

source: Tagging attacks - modifying a message so that it can later be identified further along the path - are by themselves impossible in I2P, as messages passed through tunnels are signed. However, if an attacker is the inbound tunnel gateway as well as a participant further along in that tunnel, with collusion they can identify the fact that they are in the same tunnel (and prior to adding <a href="%(todo)s#tunnelId">unique hop ids</a> and other updates, colluding peers within the same tunnel can recognize that fact without any effort). An attacker in an outbound tunnel and any part of an inbound tunnel cannot collude however, as the tunnel encryption pads and modifies the data separately for the inbound and outbound tunnels. External attackers cannot do anything, as the links are encrypted and messages signed.
pt: Ataques de marcação - modificar uma mensagem para que ela possa ser identificada posteriormente mais adiante no caminho - são por si só impossíveis no I2P, pois as mensagens passadas pelos túneis são assinadas. No entanto, se um invasor for o gateway do túnel de entrada, bem como um participante mais adiante naquele túnel, com conluio, eles podem identificar o fato de que estão no mesmo túnel (e antes de adicionar <a href="%(todo)s#tunnelId">ids de salto exclusivos</a> e outras atualizações, pares em conluio dentro do mesmo túnel podem reconhecer esse fato sem nenhum esforço). Um invasor em um túnel de saída e qualquer parte de um túnel de entrada não pode conspirar, entretanto, já que a criptografia do túnel preenche e modifica os dados separadamente para os túneis de entrada e saída. Invasores externos não podem fazer nada, já que os links são criptografados e as mensagens assinadas.
tr: Etiketleme saldırıları: I2P ağında, tünellerden geçen iletiler imzalandığından, ileti daha sonra yol boyunca daha fazla tanımlanabilmesi için değiştirilemez. Bununla birlikte, bir saldırgan geliş tünelinin ağ geçidiyse ve aynı zamanda o tünelde daha ilerideki bir katılımcı ise, gizli anlaşma ile aynı tünelde olduğunu belirleyebilir (ve <a href="%(todo)s#tunnelId">benzersiz sıçrama kodu</a> ve diğer güncellemeler eklenmeden önce, aynı tünel bu durumu hiçbir çaba harcamadan tanıyabilir). Bununla birlikte, tünel şifrelemesi, verileri geliş ve gidiş tünelleri için ayrı ayrı doldurup değiştirdiğinden, gidiş tünelindeki ve geliş tünelinin herhangi bir parçasındaki bir saldırgan işbirliği yapamaz. Bağlantılar şifrelenmiş ve iletiler imzalanmış olduğundan dış saldırganlar hiçbir şey yapamaz.

source: Partitioning attacks - finding ways to segregate (technically or analytically) the peers in a network - are important to keep in mind when dealing with a powerful adversary, since the size of the network plays a key role in determining your anonymity. Technical partitioning by cutting links between peers to create fragmented networks is addressed by I2P's built in network database, which maintains statistics about various peers so as to allow any existing connections to other fragmented sections to be exploited so as to heal the network. However, if the attacker does disconnect all links to uncontrolled peers, essentially isolating the target, no amount of network database healing will fix it. At that point, the only thing the router can hope to do is notice that a significant number of previously reliable peers have become unavailable and alert the client that it is temporarily disconnected (this detection code is not implemented at the moment).
pt: Ataques de particionamento - encontrar maneiras de segregar (técnica ou analiticamente) os pares em uma rede - são importantes para se ter em mente ao lidar com um adversário poderoso, já que o tamanho da rede desempenha um papel fundamental na determinação do seu anonimato. O particionamento técnico cortando links entre pares para criar redes fragmentadas é abordado pelo banco de dados de rede integrado do I2P, que mantém estatísticas sobre vários pares para permitir que quaisquer conexões existentes com outras seções fragmentadas sejam exploradas para curar a rede. No entanto, se o invasor desconectar todos os links para pares não controlados, essencialmente isolando o alvo, nenhuma quantidade de cura do banco de dados de rede consertará isso. Em esse ponto, a única coisa que o roteador pode esperar fazer é perceber que um número significativo de pares anteriormente confiáveis ficaram indisponíveis e alertar o cliente que ele está temporariamente desconectado (este código de detecção não está implementado em o momento).
tr: Bölümleme saldırıları - Bir ağdaki eşleri (teknik veya analitik olarak) bölmenin yollarını ararlar. Güçlü bir düşmanla uğraşırken ağın boyutunun anonimliğinizi belirlemede önemli bir rol oynadığını akılda tutmanız önemlidir. Bölümlenmiş ağlar oluşturmak için eşler arasında bağlantıları keserek teknik bölümleme, yerleşik I2P ağ veri tabanı tarafından işlenir. Burada ağı iyileştirmek için diğer bölümlere yönelik var olan bağlantılardan yararlanılmasını sağlamak amacıyla çeşitli eşler hakkında istatistikler tutulur. Ancak, saldırgan kontrolsüz eşlere olan tüm bağlantıları keserse, hedefi yalıtmış olur ve hiçbir ağ veri tabanı iyileştirmesi bunu düzeltemez. Bu noktada, yönelticinin yapmayı umabileceği tek şey, daha önce güvenilir olan önemli sayıda eşin kullanılamaz olduğunu fark etmek ve istemciyi bağlantısının geçici olarak kesildiği konusunda uyarmak olur (bu algılama kodu şu anda kullanılmıyor).

source: Partitioning the network analytically by looking for differences in how routers and destinations behave and grouping them accordingly is also a very powerful attack. For instance, an attacker <a href="#harvesting">harvesting</a> the network database will know when a particular destination has 5 inbound tunnels in their LeaseSet while others have only 2 or 3, allowing the adversary to potentially partition clients by the number of tunnels selected. Another partition is possible when dealing with the <a href="%(todo)s#stop">nontrivial delays</a> and <a href="%(todo)s#batching">batching strategies</a>, as the tunnel gateways and the particular hops with non-zero delays will likely stand out. However, this data is only exposed to those specific hops, so to partition effectively on that matter, the attacker would need to control a significant portion of the network (and still that would only be a probabilistic partition, as they wouldn't know which other tunnels or messages have those delays).
pt: Particionar a rede analiticamente procurando por diferenças em como roteadores e destinos se comportam e agrupando-os adequadamente também é um ataque muito poderoso. Por exemplo, um invasor <a href="#harvesting">coletando</a> o banco de dados da rede saberá quando um destino específico tem 5 túneis de entrada em seu LeaseSet enquanto outros têm apenas 2 ou 3, permitindo que o adversário potencialmente particione clientes pelo número de túneis selecionados. Outra partição é possível ao lidar com os <a href="%(todo)s#stop">atrasos não triviais</a> e <a href="%(todo)s#batching">estratégias de loteamento</a>, já que os gateways de túnel e os saltos específicos com atrasos diferentes de zero provavelmente se destacarão. No entanto, esses dados são expostos apenas a esses saltos específicos, então para particionar efetivamente nessa questão, o invasor precisaria controlar uma parte significativa da rede (e ainda assim seria apenas uma partição probabilística, já que eles não saberiam quais outros túneis ou mensagens têm esses atrasos).
tr: Yönelticilerin ve hedeflerin davranış biçimlerindeki farklılıkları arayarak ağı analitik olarak bölmek ve bunları buna göre gruplamak da çok güçlü bir saldırıdır. Örneğin, "Ağ veri tabanını" (netDB) <a href="#harvesting">hasat eden</a> bir saldırgan, belirli bir hedefin "Kiralama kümelerinde" (LeaseSets) 5 gelen tünele sahipken diğerlerinin yalnızca 2 veya 3 tünele sahip olduğunu bilecek ve böylece saldırganın istemcileri seçilen tünel sayısına göre potansiyel olarak bölümlendirmesini sağlayacaktır. Tünel ağ geçitleri ve sıfır olmayan gecikmelere sahip belirli sıçramalar büyük olasılıkla öne çıkacağından, <a href="%(todo)s#stop">önemsiz gecikmeler</a> ve <a href="%(todo)s#batching">yığın oluşturma stratejileri</a> ile uğraşırken başka bir bölümleme yapılabilir. Bununla birlikte, bu veriler yalnızca belirli sıçramalara maruz kalır. Bu nedenle bu konuda etkili bir şekilde bölümleme yapmak için saldırganın ağın önemli bir bölümünü kontrol etmesi gerekir (ve yine de bu yalnızca olasılıklı bir bölümleme olacaktır, diğer tüneller veya iletiler bu gecikmelere sahip olduğundan hangisi olduğunu bilemezler).

source: Also discussed on the <a href="%(netdb)s#threat">network database page</a> (bootstrap attack).
pt: Também discutido na página do banco de dados de rede <a href="%(netdb)s#threat"></a> (ataque bootstrap).
tr: Ayrıca <a href="%(netdb)s#threat">"Ağ veri tabanı" (NetDB) sayfasında da</a> tartışılmıştır (bootstrap saldırısı).

source: The predecessor attack is passively gathering statistics in an attempt to see what peers are 'close' to the destination by participating in their tunnels and keeping track of the previous or next hop (for outbound or inbound tunnels, respectively). Over time, using a perfectly random sample of peers and random ordering, an attacker would be able to see which peer shows up as 'closer' statistically more than the rest, and that peer would in turn be where the target is located.
pt: O ataque predecessor está coletando estatísticas passivamente em uma tentativa de ver quais pares estão 'próximos' do destino participando de seus túneis e mantendo o controle do salto anterior ou seguinte (para túneis de saída ou entrada, respectivamente). Com o tempo, usando uma amostra perfeitamente aleatória de pares e ordenação aleatória , um invasor seria capaz de ver qual par aparece como 'mais próximo' estatisticamente mais do que o resto, e esse par estaria, por sua vez, onde o alvo está localizado.
tr: Önceki saldırı, tünellerine katılarak ve (sırasıyla giden veya gelen tüneller için) önceki veya sonraki sıçramayı izleyerek hedefe 'yakın' olan eşleri görmek amacıyla pasif olarak istatistik topluyor. Zamanla, tamamen rastgele bir eşler örneği ve rastgele sıralama kullanarak, bir saldırgan hangi eşin istatistiksel olarak diğerlerinden daha "yakın" olduğunu görebilecek ve bu eş de hedefin bulunduğu yerde olacaktır.

source: I2P avoids this in four ways: first, the peers selected to participate in tunnels are not randomly sampled throughout the network - they are derived from the <a href="%(peerselection)s">peer selection</a> algorithm which breaks them into tiers. Second, with <a href="%(tunnelimpl)s#ordering">strict ordering</a> of peers in a tunnel, the fact that a peer shows up more frequently does not mean they're the source. Third, with <a href="%(tunnelimpl)s#length">permuted tunnel length</a> (not enabled by default) even 0 hop tunnels can provide plausible deniability as the occasional variation of the gateway will look like normal tunnels. Fourth, with <a href="%(todo)s#fullRestrictedRoutes">restricted routes</a> (unimplemented), only the peer with a restricted connection to the target will ever contact the target, while attackers will merely run into that gateway.
pt: O I2P evita isso de quatro maneiras: primeiro, os pares selecionados para participar de túneis não são amostrados aleatoriamente em toda a rede - eles são derivados de o algoritmo de seleção de pares <a href="%(peerselection)s"></a> que os divide em camadas. Segundo, com <a href="%(tunnelimpl)s#ordering">ordenação estrita</a> de pares em um túnel, o fato de um par aparecer com mais frequência não significa que ele seja a fonte. Terceiro, com <a href="%(tunnelimpl)s#length">comprimento de túnel permutado</a> (não habilitado por padrão) até mesmo túneis de 0 saltos podem fornecer negação plausível, já que a variação ocasional do gateway se parecerá com túneis normais. Quarto, com <a href="%(todo)s#fullRestrictedRoutes">rotas restritas</a> (não implementadas), apenas o par com uma conexão restrita ao alvo entrará em contato com o alvo, enquanto os invasores simplesmente correrão para aquele gateway.
tr: I2P bunu dört şekilde önler: Birincisi, tünellere katılmak için seçilen eşler ağ boyunca rastgele örneklenmez. Bunlar, onları katmanlara ayıran <a href="%(peerselection)s">eş seçimi</a> algoritmasından türetilir. İkincisi, bir tünelde eşlerin <a href="%(tunnelimpl)s#ordering">katı sıralanmasıyla</a>, bir eşin daha sık ortaya çıkması, kaynak oldukları anlamına gelmez. Üçüncüsü, <a href="%(tunnelimpl)s#length">izin verilen tünel uzunluğu</a> (varsayılan olarak etkinleştirilmemiştir) ile 0 sıçramalı tüneller bile, ağ geçidinin ara sıra değişmesi normal tüneller gibi görüneceğinden makul bir inkar edilebilirlik sağlayabilir. Dördüncüsü, <a href="%(todo)s#fullRestrictedRoutes">kısıtlanmış rotalar</a> (uygulanmıyor) ile, yalnızca hedefle sınırlı bir bağlantısı olan eş hedefle iletişim kurarken, saldırganlar yalnızca bu ağ geçidine girer.

source: The current <a href="%(tunnelcreation)s">tunnel build method</a> was specifically designed to combat the predecessor attack. See also <a href="#intersection">the intersection attack</a>.
pt: O atual método de construção de túnel <a href="%(tunnelcreation)s"></a> foi projetado especificamente para combater o ataque anterior. Veja também <a href="#intersection">o ataque de interseção</a>.
tr: Geçerli <a href="%(tunnelcreation)s">tünel oluşturma yöntemi</a>, önceki saldırıyla mücadele etmek için özel olarak tasarlanmıştır. Ayrıca <a href="#intersection">kavşak saldırısı</a> bölümüne bakabilirsiniz.

source: References: <a href="%(pdf2008)s">%(pdf2008)s</a> which is an update to the 2004 predecessor attack paper <a href="%(pdf2004)s">%(pdf2004)s</a>.
pt: Referências: <a href="%(pdf2008)s">%(pdf2008)s</a> que é uma atualização do artigo de ataque anterior de 2004 <a href="%(pdf2004)s">%(pdf2004)s</a>.
tr: Referanslar: <a href="%(pdf2008)s">%(pdf2008)s</a> 2004 yılından önceki saldırı belgesinin güncellemesi. <a href="%(pdf2004)s">%(pdf2004)s</a>.
