Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: All destinations in I2P are 516-byte (or longer) keys. (To be more precise, it is a 256-byte public key plus a 128-byte signing key plus a 3-or-more byte certificate, which in Base64 representation is 516 or more bytes. Non-null <a href="%(namingdiscussion)s#certificates">Certificates</a> are in use now for signature type indication. Therefore, certificates in recently-generated destinations are more than 3 bytes.
pt: Todos os destinos em I2P são chaves de 516 bytes (ou mais). (Para ser mais preciso, é uma chave pública de 256 bytes mais uma chave de assinatura de 128 bytes mais um certificado de 3 ou mais bytes, que na representação Base64 é de 516 ou mais bytes. Não nulo <a href="%(namingdiscussion)s#certificates">Certificados</a> estão em uso agora para indicação do tipo de assinatura. Portanto, os certificados em destinos gerados recentemente têm mais de 3 bytes.
tr: I2P üzerindeki tüm hedefler 516 bayt (veya daha uzun) anahtarlardır. (Daha kesin olmak gerekirse, 256 baytlık bir herkese açık anahtar artı 128 baytlık bir imzalama anahtarı artı 3 veya daha fazla baytlık bir sertifikadır. Base64 yapısında 516 veya daha fazla bayttır. Boş olmayan <a href="%(namingdiscussion)s#certificates">Sertifikalar</a> artık imza türü gösteriminde kullanılıyor. Bu nedenle, yakın zamanda oluşturulan hedeflerdeki sertifikalar 3 bayttan fazladır.

source: If an application (i2ptunnel or the HTTP proxy) wishes to access a destination by name, the router does a very simple local lookup to resolve that name.
pt: Se um aplicativo (i2ptunnel ou proxy HTTP) deseja acessar um destino pelo nome, o roteador faz uma pesquisa local muito simples para resolver esse nome.
tr: Bir uygulama (i2ptunnel ya da HTTP vekil sunucusu) bir hedefe adına göre erişmek isterse, yöneltici bu adı çözmek için çok basit bir yerel arama yapar.

source: Hosts.txt Naming Service
pt: Serviço de Nomeação de Hosts.txt
tr: Hosts.txt Adlandırma Hizmeti

source: The hosts.txt Naming Service does a simple linear search through text files. This naming service was the default until release 0.8.8 when it was replaced by the Blockfile Naming Service. The hosts.txt format had become too slow after the file grew to thousands of entries.
pt: O serviço de nomenclatura hosts.txt faz uma busca linear simples por arquivos de texto. Esse serviço de nomenclatura era o padrão até release 0.8.8 quando foi substituído pelo serviço de nomenclatura Blockfile. O formato hosts.txt ficou muito lento depois que o arquivo cresceu para milhares de entradas.
tr: Hosts.txt adlandırma hizmeti, metin dosyalarında basit bir doğrusal arama yapar. Bu adlandırma hizmeti, 0.8.8 sürümünde Blockfile adlandırma hizmeti ile değiştirilene kadar 0.8.8 varsayılan hizmetti. Dosya binlerce kayda ulaştığından hosts.txt biçimi çok yavaşlamıştı.

source: It does a linear search through three local files, in order, to look up host names and convert them to a 516-byte destination key. Each file is in a simple <a href="%(configuration)s">configuration file format</a>, with hostname=base64, one per line. The files are:
pt: Ele faz uma busca linear em três arquivos locais, em ordem, para procurar nomes de host e convertê-los em uma chave de destino de 516 bytes. Cada arquivo está em um formato de arquivo de configuração simples <a href="%(configuration)s"></a>, com hostname=base64, um por linha. Os arquivos são:
tr: Sunucu adlarını aramak ve bunları 516 baytlık bir hedef anahtara dönüştürmek için üç yerel dosya arasında doğrusal bir arama yapar. Her dosya, her satırda bir tane olmak üzere sunucu adı=base64 olacak şekilde basit bir <a href="%(configuration)s">yapılandırma dosyası biçimi</a> kullanır. Dosyalar şunlardır:

source: Blockfile Naming Service
pt: Serviço de nomenclatura de Blockfile
tr: Blockfile Adlandırma Hizmeti

source: The Blockfile Naming Service stores multiple "address books" in a single database file named hostsdb.blockfile. This Naming Service is the default since release 0.8.8.
pt: O Blockfile Naming Service armazena vários "catálogos de endereços" em um único arquivo de banco de dados chamado hostsdb.blockfile. Este Naming Service é o padrão desde a versão 0.8.8.
tr: Blockfile adlandırma hizmeti, birden çok "adres defterini" hostsdb.blockfile adlı tek bir veri tabanı dosyasında saklar. 0.8.8 sürümünden başlayarak bu adlandırma hizmeti varsayılan olarak kullanılıyor.

source: A blockfile is simply on-disk storage of multiple sorted maps (key-value pairs), implemented as skiplists. The blockfile format is specified on the <a href="%(blockfile)s">Blockfile page</a>. It provides fast Destination lookup in a compact format. While the blockfile overhead is substantial, the destinations are stored in binary rather than in Base 64 as in the hosts.txt format. In addition, the blockfile provides the capability of arbitrary metadata storage (such as added date, source, and comments) for each entry to implement advanced address book features. The blockfile storage requirement is a modest increase over the hosts.txt format, and the blockfile provides approximately 10x reduction in lookup times.
pt: Um blockfile é simplesmente um armazenamento em disco de vários mapas classificados (pares chave-valor), implementados como skiplists. O formato do blockfile é especificado na <a href="%(blockfile)s">página Blockfile</a>. Ele fornece uma rápida pesquisa de destino em um formato compacto. Embora a sobrecarga do blockfile seja substancial, os destinos são armazenados em binário em vez de em Base 64 como no formato hosts.txt. Além disso, o blockfile fornece a capacidade de armazenamento de metadados arbitrários (como data adicionada, fonte e comentários) para cada entrada para implementar recursos avançados do catálogo de endereços. O requisito de armazenamento do blockfile é um aumento modesto em relação ao formato hosts.txt, e o blockfile fornece aproximadamente 10x de redução nos tempos de pesquisa.
tr: Bir blockfile, atlama listeleri olarak hazırlanmış birden çok sıralanmış haritanın (anahtar/değer çiftleri) basitçe disk üzerinde depolanmasıdır. Blockfile biçimi, <a href="%(blockfile)s">Blockfile sayfasında</a> açıklanmıştır. Küçük bir paketle hızlı hedef araması sağlar. Blockfile tarafından oluşturulan ek yük önemli olsa da, hedefler hosts.txt biçiminde olduğu gibi Base 64 yerine binary olarak depolanır. Ek olarak, blockfile, gelişmiş adres defteri özelliklerini uygulamak için her kayda isteğe bağlı olarak üst veri kaydetme (eklenme tarihi, kaynak ve yorumlar gibi) olanağı sağlar. Blockfile depolama gereksinimi, hosts.txt biçimine göre küçük bir artış getirirken, arama sürelerinin yaklaşık 10 kat hızlanmasını sağlar.

source: On creation, the naming service imports entries from the three files used by the hosts.txt Naming Service. The blockfile mimics the previous implementation by maintaining three maps that are searched in-order, named privatehosts.txt, userhosts.txt, and hosts.txt. It also maintains a reverse-lookup map to implement rapid reverse lookups.
pt: Na criação, o serviço de nomenclatura importa entradas dos três arquivos usados pelo serviço de nomenclatura hosts.txt. O arquivo de bloco imita a implementação anterior, mantendo três mapas que são pesquisados em ordem, chamados privatehosts.txt, userhosts.txt e hosts.txt. Ele também mantém um mapa de pesquisa reversa para implementar pesquisas reversas rápidas.
tr: Adlandırma hizmeti, oluşturulması sırasında hosts.txt adlandırma hizmeti tarafından kullanılan üç dosyadaki kayıtları içe aktarır. Blockfile, privatehosts.txt, userhosts.txt ve hosts.txt adıyla sırayla aranan üç haritalamayı koruyarak önceki uygulamanın davranışını taklit eder. Ayrıca, geriye doğru hızlı arama yapabilmek için geriye doğru arama haritası tutar.

source: Other Naming Service Facilities
pt: Outras instalações de serviços de nomenclatura
tr: Diğer Adlandırma Hizmeti Yapıları

source: The lookup is case-insensitive. The first match is used, and conflicts are not detected. There is no enforcement of naming rules in lookups. Lookups are cached for a few minutes. Base 32 resolution is <a href="#base32">described below</a>. For a full description of the Naming Service API see the <a href="%(nsjavadocs)s">Naming Service Javadocs</a>. This API was significantly expanded in release 0.8.7 to provide adds and removes, storage of arbitrary properties with the hostname, and other features.
pt: A pesquisa não diferencia maiúsculas de minúsculas. A primeira correspondência é usada e conflitos não são detectados. Não há imposição de regras de nomenclatura em pesquisas. As pesquisas são armazenadas em cache por alguns minutos. A resolução base 32 é <a href="#base32">descrita abaixo</a>. Para uma descrição completa da API do Serviço de Nomenclatura, consulte os <a href="%(nsjavadocs)s">Javadocs do Serviço de Nomenclatura</a>. Esta API foi significativamente expandida na versão 0.8.7 para fornecer adições e remoções, armazenamento de propriedades arbitrárias com o nome do host, e outros recursos.
tr: Arama büyük-küçük harfe duyarsızdır. İlk eşleşme kullanılır ve çakışmalar algılanmaz. Aramalarda adlandırma kuralları dayatılmaz. Aramalar birkaç dakika süreyle ön belleğe alınır. Base32 çözünürlüğü <a href="#base32">aşağıda açıklanmıştır</a>. Adlandırma Hizmeti API yazılımının tam açıklaması için <a href="%(nsjavadocs)s">Adlandırma hizmeti Java belgeleri</a> bölümüne bakabilirsiniz. Bu API 0.8.7 sürümünde, ekleme ve kaldırma, sunucu adıyla rastgele özelliklerin depolanması ve diğer özellikleri sağlamak için önemli ölçüde genişletildi.

source: Alternatives and Experimental Naming Services
pt: Serviços de nomes alternativos e experimentais
tr: Alternatifler ve Deneysel Adlandırma Hizmetleri

source: The naming service is specified with the configuration property <tt>i2p.naming.impl=class</tt>. Other implementations are possible. For example, there is an experimental facility for real-time lookups (a la DNS) over the network within the router. For more information see the <a href="%(namingdiscussion)s#alternatives">alternatives on the discussion page</a>.
pt: O serviço de nomenclatura é especificado com a propriedade de configuração <tt>i2p.naming.impl=class</tt>. Outras implementações são possíveis. Por exemplo, há um recurso experimental para pesquisas em tempo real (a la DNS) pela rede dentro do roteador. Para mais informações, veja as alternativas <a href="%(namingdiscussion)s#alternatives">na página de discussão</a>.
tr: Adlandırma hizmeti, <tt>i2p.naming.impl=class</tt> yapılandırma özelliğiyle belirtilir. Diğer uygulamalar kullanılabilir. Örneğin, yöneltici içindeki ağ üzerinden gerçek zamanlı aramalar (bir DNS) için deneysel bir yapı vardır. Ayrıntılı bilgi almak için <a href="%(namingdiscussion)s#alternatives">tartışma sayfasındaki alternatiflere</a> bakabilirsiniz.

source: The HTTP proxy does a lookup via the router for all hostnames ending in '.i2p'. Otherwise, it forwards the request to a configured HTTP outproxy. Thus, in practice, all HTTP (I2P Site) hostnames must end in the pseudo-Top Level Domain '.i2p'.
pt: O proxy HTTP faz uma pesquisa por meio do roteador para todos os nomes de host que terminam em '.i2p'. Caso contrário, ele encaminha a solicitação para um proxy HTTP configurado. Assim, na prática, todos os nomes de host HTTP (Site I2P) devem terminar no pseudo-Domínio de Nível Superior '.i2p'.
tr: HTTP vekil sunucusu, '.i2p' ile biten tüm sunucu adları için yöneltici aracılığıyla bir arama yapar. Diğer durumlarda, isteği yapılandırılmış bir HTTP çıkış vekil sunucusuna iletir. Bu nedenle, pratikte, tüm HTTP (I2P sitesi) sunucu adları, sözde üst düzey etki alanı '.i2p' ile bitmelidir.

source: We have <a href="%(i2ptld)s">applied to reserve the .i2p TLD</a> following the procedures specified in <a href="%(rfc6761)s">RFC 6761</a>.
pt: Solicitamos <a href="%(i2ptld)s">a reserva do TLD .i2p</a> seguindo os procedimentos especificados em <a href="%(rfc6761)s">RFC 6761</a>.
tr: <a href="%(rfc6761)s">RFC 67612</a> yönergelerine uyarak <a href="%(i2ptld)s">.i2p üst düzey etki alanını almak için başvuruda bulunduk</a>.

source: If the router fails to resolve the hostname, the HTTP proxy returns an error page to the user with links to several "jump" services. See below for details.
pt: Se o roteador não conseguir resolver o nome do host, o proxy HTTP retornará uma página de erro ao usuário com links para vários serviços de "jump". Veja abaixo os detalhes.
tr: Yöneltici sunucu adını çözümleyemezse, HTTP vekil sunucusu kullanıcıya birkaç "atlama" hizmetine bağlantılar içeren bir hata sayfası görüntüler. Ayrıntılar için aşağıya bakın.

source: Address Book
pt: Lista de Endereços
tr: Adres Defteri

source: Incoming Subscriptions and Merging
pt: Assinaturas de entrada e fusão
tr: Geliş Abonelikleri ve Birleştirme

source: The address book application periodically retrieves other users' hosts.txt files and merges them with the local hosts.txt, after several checks. Naming conflicts are resolved on a first-come first-served basis.
pt: O aplicativo de catálogo de endereços periodicamente recupera os arquivos hosts.txt de outros usuários e os mescla com o hosts.txt local, após várias verificações. Os conflitos de nomenclatura são resolvidos por ordem de chegada .
tr: Adres defteri uygulaması, düzenli aralıklarla diğer kullanıcıların hosts.txt dosyalarını alır ve birkaç kontrolden sonra bunları yerel hosts.txt dosyası ile birleştirir. Adlandırma çakışmaları, ilk gelen ilk alır ilkesiyle çözülür.

source: Subscribing to another user's hosts.txt file involves giving them a certain amount of trust. You do not want them, for example, 'hijacking' a new site by quickly entering in their own key for a new site before passing the new host/key entry to you.
pt: Assinar o arquivo hosts.txt de outro usuário envolve dar a ele uma certa quantidade de confiança. Você não quer que eles, por exemplo, 'sequestrem' um novo site inserindo rapidamente sua própria chave para um novo site antes de passar a nova entrada de host/chave para você.
tr: Başka bir kullanıcının hosts.txt dosyasına abone olmak, onlara belirli bir miktarda güven vermeyi gerektirir. Örneğin, yeni sunucu/anahtar girişini size iletmeden önce yeni bir site için kendi anahtarlarını hızla yazarak yeni bir siteyi 'ele geçirmelerini' istemezsiniz.

source: For this reason, the only subscription configured by default is <code>http://i2p-projekt.i2p/hosts.txt (http://udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p/hosts.txt)</code>, which contains a copy of the hosts.txt included in the I2P release. Users must configure additional subscriptions in their local address book application (via subscriptions.txt or <a href="#susidns">SusiDNS</a>).
pt: Por esse motivo, a única assinatura configurada por padrão é <code>http://i2p-projekt.i2p/hosts.txt (http://udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p/hosts.txt)</code>, que contém uma cópia do hosts.txt incluído na versão I2P. Os usuários devem configurar assinaturas adicionais em seu aplicativo de catálogo de endereços local (via subscriptions.txt ou <a href="#susidns">SusiDNS</a>).
tr: Bu nedenle, varsayılan olarak yapılandırılan tek abonelik, sunucuların bir kopyasını içeren ve I2P paketine katılmış <code>http://i2p-projekt.i2p/hosts.txt (http://udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p/hosts.txt)</code> dosyasıdır. Kullanıcılar, yerel adres defteri uygulamalarında ek abonelikler yapılandırmalıdır (subscriptions.txt veya <a href="#susidns">SusiDNS</a> ile).

source: Some other public address book subscription links:
pt: Alguns outros links de assinatura do catálogo de endereços público:
tr: Bazı diğer genel adres defteri abonelik bağlantıları:

source: The operators of these services may have various policies for listing hosts. Presence on this list does not imply endorsement.
pt: Os operadores desses serviços podem ter várias políticas para listar hosts. A presença nesta lista não implica endosso.
tr: Bu hizmetlerin işletmecilerinin, çeşitli sunucuları listeleme ilkeleri olabilir. Bu listede bulunması, onaylandığı anlamına gelmez.

source: Naming Rules
pt: Regras de atribuição de nomes
tr: Adlandırma Kuralları

source: While there are hopefully not any technical limitations within I2P on host names, the address book enforces several restrictions on host names imported from subscriptions. It does this for basic typographical sanity and compatibility with browsers, and for security. The rules are essentially the same as those in RFC2396 Section 3.2.2. Any hostnames violating these rules may not be propagated to other routers.
pt: Embora não haja nenhuma limitação técnica no I2P em nomes de host, o catálogo de endereços impõe várias restrições em nomes de host importados de assinaturas. Ele faz isso para sanidade tipográfica básica e compatibilidade com navegadores, e por segurança. As regras são essencialmente as mesmas da Seção 3.2.2 do RFC2396. Quaisquer nomes de host que violem essas regras não podem ser propagados para outros roteadores.
tr: I2P üzerinde sunucu adlarında herhangi bir teknik sınırlama olmamasını ummakla birlikte, adres defteri aboneliklerden içe aktarılan sunucu adları üzerinde çeşitli kısıtlamalar uygular. Bunu temel tipografi koruması ve tarayıcılarla uyumluluk ve güvenlik sağlamak için yapar. Kurallar temelde RFC2396 3.2.2 bölümündekilerle aynıdır. Bu kuralları ihlal eden sunucu adları diğer yönelticilere dağıtılmayabilir.

source: Names are converted to lower case on import.
pt: Nomes são convertidos para caixa baixa na importação.
tr: İçe aktarma sırasında adlar küçük harfe dönüştürülür

source: Names are checked for conflict with existing names in the existing userhosts.txt and hosts.txt (but not privatehosts.txt) after conversion to lower case.
pt: Os nomes são verificados quanto a conflitos com nomes existentes nos arquivos userhosts.txt e hosts.txt (mas não privatehosts.txt) após a conversão para letras minúsculas.
tr: Adlar, küçük harfe dönüştürüldükten sonra var olan userhosts.txt ve hosts.txt dosyalarındaki (privatehosts.txt değil) var olan adlarla çakışmaları denetlenir.

source: Must contain only [a-z] [0-9] '.' and '-' after conversion to lower case.
pt: Deve conter apenas [a-z] [0-9] '.' e '-' após conversão para caixa baixa
tr: Yalnızca [a-z] [0-9] '.' ve '-' karakterleri küçük harfe dönüştürüldükten sonra kullanılmalıdır.

source: Must not start with '.' or '-'.
pt: Não pode começar com '.' ou '-'
tr: '.' ya da '-' ile başlamamalıdır.

source: Must end with '.i2p'.
pt: Deve terminar com '.i2p'.
tr: '.i2p' ile bitmelidir.

source: 67 characters maximum, including the '.i2p'.
pt: No máximo 67 caractéres, incluindo o '.i2p'.
tr: '.i2p ile birlikte en fazla 67 karakterden oluşmalıdır.

source: Must not contain '..'.
pt: Não pode conter '..'.
tr: '..' içermemelidir.

source: Must not contain '.-' or '-.' (as of 0.6.1.33).
pt: Não pode conter '.-' ou '-.' (tal como 0.6.1.33).
tr: '.-' ya da '-.' bulunmamalıdır (0.6.1.33 gibi).

source: Must not contain '--' except in 'xn--' for IDN.
pt: Não pode conter '--' exceto em 'xn--' para IDN.
tr: IDN için 'xn--' dışında '--' bulunmamalıdır.

source: Base32 hostnames (*.b32.i2p) are reserved for base 32 use and so are not allowed to be imported.
pt: Nomes de host Base32 (*.b32.i2p) são reservados para uso em base 32 e, portanto, não podem ser importados.
tr: Base32 sunucu adları (*.b32.i2p), Base32 kullanımı için ayrılmıştır ve bu nedenle içe aktarılmasına izin verilmez.

source: Certain hostnames reserved for project use are not allowed (proxy.i2p, router.i2p, console.i2p, *.proxy.i2p, *.router.i2p, *.console.i2p, and others)
pt: Alguns nomes de hosts reservados para uso do projeto não são permitidos (proxy.i2p, router.i2p, console.i2p, *.proxy.i2p, *.router.i2p, *.console.i2p, and others)
tr: Proje kullanımı için ayrılmış belirli sunucu adlarına izin verilmez (proxy.i2p, router.i2p, console.i2p, *.proxy.i2p, *.router.i2p, *.console.i2p ve diğerleri)

source: Keys are checked for base64 validity.
pt: Chaves são verificadas para validação base64.
tr: Anahtarların Base64 geçerliliği denetlenir.

source: Keys are checked for conflict with existing keys in hosts.txt (but not privatehosts.txt).
pt: As chaves são verificadas quanto a conflitos com chaves existentes em hosts.txt (mas não em privatehosts.txt).
tr: Anahtarların hosts.txt dosyasında var olan anahtarlarla çakışıp çakışmadığı denetlenir (privatehosts.txt denetlenmez).

source: Minimum key length 516 bytes.
pt: Tamanho mínimo da chave é 516 bytes.
tr: En az anahtar uzunluğu 516 bayt.

source: Maximum key length 616 bytes (to account for certs up to 100 bytes).
pt: Comprimento máximo da chave: 616 bytes (para contabilizar certificados de até 100 bytes).
tr: En fazla anahtar uzunluğu 616 bayt (100 bayta kadar olan sertifikaları katmak için).

source: Any name received via subscription that passes all the checks is added via the local naming service.
pt: Qualquer nome recebido por assinatura que passe em todas as verificações é adicionado por meio do serviço de nomenclatura local.
tr: Tüm denetimleri geçen abonelik yoluyla alınan herhangi bir ad, yerel adlandırma hizmeti ile eklenir.

source: Note that the '.' symbols in a host name are of no significance, and do not denote any actual naming or trust hierarchy. If the name 'host.i2p' already exists, there is nothing to prevent anybody from adding a name 'a.host.i2p' to their hosts.txt, and this name can be imported by others' address book. Methods to deny subdomains to non-domain 'owners' (certificates?), and the desirability and feasibility of these methods, are topics for future discussion.
pt: Observe que os símbolos '.' em um nome de host não têm importância, e não denotam nenhuma nomenclatura real ou hierarquia de confiança. Se o nome 'host.i2p' já existir, não há nada que impeça alguém de adicionar um nome 'a.host.i2p' ao seu hosts.txt, e esse nome pode ser importado pelo catálogo de endereços de outras pessoas. Métodos para negar subdomínios a 'proprietários' não pertencentes ao domínio (certificados?), e a conveniência e viabilidade desses métodos, são tópicos para discussão futura.
tr: Bir sunucu adındaki '.' karakterlerinin herhangi bir önemi yoktur ve herhangi bir gerçek adlandırma veya güven hiyerarşisini göstermez. 'Host.i2p' adı zaten varsa, herhangi birinin hosts.txt dosyasına 'a.host.i2p' adını eklemesini engelleyen bir şey yoktur ve bu ad başkalarının adres defteri tarafından alınabilir. Etki alanı olmayan 'sahiplere' (sertifikalar?) alt etki alanlarını reddetme yöntemleri ve bu yöntemlerin istenilebilirliği ve uygulanabilirliği, gelecekteki tartışma konularıdır.

source: International Domain Names (IDN) also work in i2p (using punycode 'xn--' form). To see IDN .i2p domain names rendered correctly in Firefox's location bar, add 'network.IDN.whitelist.i2p (boolean) = true' in about:config.
pt: Nomes de Domínio Internacionais (IDN) também funcionam em i2p (usando o formato punycode 'xn--'). Para ver nomes de domínio IDN .i2p renderizados corretamente na barra de localização do Firefox, adicione 'network.IDN.whitelist.i2p (boolean) = true' em about:config.
tr: Uluslararası etki alanı adları (IDN) i2p üzerinde de çalışır (punnycode 'xn--' biçimiyle). Firefox konum çubuğunda IDN .i2p alan adlarının doğru şekilde oluşturulduğunu görmek için about:config adresinden 'network.IDN.whitelist.i2p (boolean) = true' yapılandırmasını ayarlayın.
