Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Included are some attacks that may be unique to I2P. We do not have good answers for all these attacks, however we continue to do research and improve our defenses.
pt: Estão incluídos alguns ataques que podem ser exclusivos do I2P. Não temos boas respostas para todos esses ataques, no entanto continuamos pesquisando e melhorando nossas defesas.
tr: I2P ağına özgü olabilecek bazı saldırılar da vardır. Bu saldırıların tümüne bir yanıtımız yok. Ancak araştırmayı ve savunmamızı geliştirmeyi sürdürüyoruz.

source: In addition, many of these attacks are significantly easier than they should be, due to the modest size of the current network. While we are aware of some limitations that need to be addressed, I2P is designed to support hundreds of thousands, or millions, of participants. As we continue to spread the word and grow the network, these attacks will become much harder.
pt: Além disso, muitos desses ataques são significativamente mais fáceis do que deveriam ser, devido ao tamanho modesto da rede atual. Embora estejamos cientes de algumas limitações que precisam ser abordadas, o I2P foi projetado para suportar centenas de milhares, ou milhões, de participantes. À medida que continuamos a espalhar a palavra e a expandir a rede, esses ataques se tornarão muito mais difíceis.
tr: Ayrıca, var olan ağın mütevazı boyutu nedeniyle bu saldırıların çoğu olması gerekenden çok daha kolay yapılabiliyor. Ele alınması gereken bazı sınırlamaların farkında olsak da, I2P yüz binlerce veya milyonlarca katılımcıyı desteklemek için tasarlanmıştır. İnsanları bilgilendirmeyi ve ağı büyütmeyi sürdürdükçe, bu saldırıları yapmak çok daha zor hale gelecek.

source: The <a href="%(comparisons)s">network comparisons</a> and <a href="%(garlicrouting)s">"garlic" terminology</a> pages may also be helpful to review.
pt: As páginas de comparação de redes <a href="%(comparisons)s"></a> e <a href="%(garlicrouting)s">"alho"</a> também podem ser úteis para revisão.
tr: <a href="%(comparisons)s">Ağ karşılaştırmaları</a> ve <a href="%(garlicrouting)s">"garlic" terminolojisi</a> sayfalarını gözden geçirmenin yardımı olabilir.

source: A brute force attack can be mounted by a global passive or active adversary, watching all the messages pass between all of the nodes and attempting to correlate which message follows which path. Mounting this attack against I2P should be nontrivial, as all peers in the network are frequently sending messages (both end to end and network maintenance messages), plus an end to end message changes size and data along its path. In addition, the external adversary does not have access to the messages either, as inter-router communication is both encrypted and streamed (making two 1024 byte messages indistinguishable from one 2048 byte message).
pt: Um ataque de força bruta pode ser montado por um adversário global passivo ou ativo, observando todas as mensagens passando entre todos os nós e tentando correlacionar qual mensagem segue qual caminho. Montar esse ataque contra I2P deve ser não trivial, já que todos os pares na rede estão enviando mensagens com frequência (tanto mensagens de ponta a ponta quanto de manutenção de rede), além de uma mensagem de ponta a ponta mudar de tamanho e dados ao longo de seu caminho. Além disso, o adversário externo também não tem acesso às mensagens, já que a comunicação entre roteadores é criptografada e transmitida (tornando duas mensagens de 1024 bytes indistinguíveis de uma mensagem de 2048 bytes ).
tr: Tüm düğümler arasında aktarılan tüm iletileri izleyerek ve hangi iletinin hangi yolu izlediğini ilişkilendirmeye çalışarak, küresel bir pasif veya aktif saldırgan tarafından bir kaba kuvvet saldırısı yapılabilir. Ağdaki tüm eşler sık sık ileti gönderdiğinden (hem uçtan uca hem de ağ bakım iletileri), ayrıca bir uçtan uca iletinin yolu boyunca boyutu ve verileri değiştiğinden, bu saldırıyı I2P ağına yüklemek önemsiz olmalıdır. Ek olarak, yönelticiler arası iletişim hem şifrelemiş hem de akışkan olduğundan (iki tane 1024 baytlık ileti bir tane 2048 baytlık iletiden ayırt edilemez kılındığından), dış saldırganın iletilere de erişimi yoktur.

source: However, a powerful attacker can use brute force to detect trends - if they can send 5GB to an I2P destination and monitor everyone's network connection, they can eliminate all peers who did not receive 5GB of data. Techniques to defeat this attack exist, but may be prohibitively expensive (see: <a href="http://citeseer.ist.psu.edu/freedman02tarzan.html">Tarzan</a>'s mimics or constant rate traffic). Most users are not concerned with this attack, as the cost of mounting it are extreme (and often require illegal activity). However, the attack is still possible, for example by an observer at a large ISP or an Internet exchange point. Those who want to defend against it would want to take appropriate countermeasures, such as setting low bandwidth limits, and using unpublished or encrypted leasesets for I2P Sites. Other countermeasures, such as nontrivial delays and restricted routes, are not currently implemented.
pt: No entanto, um invasor poderoso pode usar força bruta para detectar tendências - se eles podem enviar 5 GB para um destino I2P e monitorar a conexão de rede de todos, eles podem eliminar todos os pares que não receberam 5 GB de dados. Técnicas para derrotar esse ataque existem, mas podem ser proibitivamente caras (veja: <a href="http://citeseer.ist.psu.edu/freedman02tarzan.html">Tarzan</a>imita ou tráfego de taxa constante). A maioria dos usuários não está preocupada com esse ataque, pois o custo de montá-lo é extremo (e geralmente requer atividade ilegal). No entanto, o ataque ainda é possível, por exemplo, por um observador em um grande ISP ou um ponto de troca de Internet. Aqueles que querem se defender contra isso gostariam de tomar contramedidas apropriadas, como definir limites baixos de largura de banda e usar conjuntos de arrendamento não publicados ou criptografados para sites I2P. Outras contramedidas, como atrasos não triviais e rotas restritas, não estão implementadas atualmente.
tr: Bununla birlikte, güçlü bir saldırgan eğilimleri belirlemek için kaba kuvvet kullanabilir. Bir I2P hedefine 5 GB veri gönderebilir ve herkesin ağ bağlantısını izleyebilirse, 5 GB veri almayan tüm eşleri ortadan kaldırabilir. Bu saldırıyı yenmek için teknikler vardır ancak maliyeti aşırı derecede yüksek olabilir (<a href="http://citeseer.ist.psu.edu/freedman02tarzan.html">Tarzan</a> taklitleri veya sabit oranlı trafik gibi). Çoğu kullanıcı bu saldırıyla ilgilenmez, çünkü onu yapmanın maliyeti aşırı yüksektir (ve genellikle yasa dışı bir faaliyet gerektirir). Ancak, örneğin büyük bir internet hizmeti sağlayıcısındaki veya bir internet alıp verme noktasındaki bir gözlemci hala bu saldırıyı yapabilir. Buna karşı savunma yapmak isteyenler, düşük bant genişliği sınırları belirlemek ve I2P siteleri için yayınlanmamış veya "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) kullanmak gibi uygun karşı önlemleri almak isteyeceklerdir. Önemsiz gecikmeler ve kısıtlanmış rotalar gibi diğer karşı önlemler şu anda uygulanmamaktadır.

source: As a partial defense against a single router or group of routers trying to route all the network's traffic, routers contain limits as to how many tunnels can be routed through a single peer. As the network grows, these limits are subject to further adjustment. Other mechanisms for peer rating, selection and avoidance are discussed on the <a href="%(peerselection)s">peer selection page</a>.
pt: Como uma defesa parcial contra um único roteador ou grupo de roteadores tentando rotear todo o tráfego da rede, os roteadores contêm limites quanto à quantidade de túneis que podem ser roteados por um único peer. À medida que a rede cresce, esses limites estão sujeitos a ajustes adicionais. Outros mecanismos para classificação, seleção e prevenção de peers são discutidos na página de seleção de peers <a href="%(peerselection)s"></a>.
tr: Tüm ağ trafiğini yöneltmeye çalışan tek bir yönelticiye veya yöneltici grubuna karşı kısmi bir savunma olarak, yönelticiler, tek bir eş üzerinden kaç tünelin yöneltilebileceği ile ilgili sınırlamalar içerir. Ağ büyüdükçe, bu sınırlamalar üzerinde yeni ayarlamalar yapılabilir. Eş değerlendirmesi, seçme ve kaçınma ile ilgili diğer mekanizmalar, <a href="%(peerselection)s">eş seçimi sayfasında</a> tartışılmaktadır.

source: I2P's messages are unidirectional and do not necessarily imply that a reply will be sent. However, applications on top of I2P will most likely have recognizable patterns within the frequency of their messages - for instance, an HTTP request will be a small message with a large sequence of reply messages containing the HTTP response. Using this data as well as a broad view of the network topology, an attacker may be able to disqualify some links as being too slow to have passed the message along.
pt: As mensagens do I2P são unidirecionais e não necessariamente implicam que uma resposta será enviada. No entanto, os aplicativos sobre o I2P provavelmente terão padrões reconhecíveis dentro da frequência de suas mensagens - por exemplo, uma solicitação HTTP será uma pequena mensagem com uma grande sequência de mensagens de resposta contendo a resposta HTTP. Usando esses dados, bem como uma visão ampla da topologia de rede, um invasor pode ser capaz de desqualificar alguns links como sendo muito lentos para terem passado a mensagem adiante.
tr: I2P iletileri tek yönlüdür ve mutlaka bir yanıt gönderileceği anlamına gelmez. Bununla birlikte, I2P ağı üzerindeki uygulamaların büyük olasılıkla iletilerinin sıklığına bakılarak tanınabilir kalıpları olacaktır. Örneğin, bir HTTP isteği, HTTP yanıtını içeren büyük bir yanıt iletisi dizisine sahip küçük bir ileti olacaktır. Bir saldırgan, bu verileri ve ağ topolojisinin geniş bir görünümünü kullanarak, iletiyi aktarmak için çok yavaş olan bazı bağlantıları diskalifiye edebilir.

source: This sort of attack is powerful, but its applicability to I2P is non obvious, as the variation on message delays due to queuing, message processing, and throttling will often meet or exceed the time of passing a message along a single link - even when the attacker knows that a reply will be sent as soon as the message is received. There are some scenarios which will expose fairly automatic replies though - the streaming library does (with the SYN+ACK) as does the message mode of guaranteed delivery (with the DataMessage+DeliveryStatusMessage).
pt: Esse tipo de ataque é poderoso, mas sua aplicabilidade ao I2P não é óbvia, já que a variação nos atrasos de mensagens devido ao enfileiramento, processamento de mensagens e limitação frequentemente atenderá ou excederá o tempo de passagem de uma mensagem por um único link - mesmo quando o invasor sabe que uma resposta será enviada assim que a mensagem for recebida. Existem alguns cenários que exporão razoavelmente respostas automáticas - a biblioteca de streaming faz (com SYN+ACK) assim como o modo de mensagem de entrega garantida (com DataMessage+DeliveryStatusMessage).
tr: Bu tür bir saldırı güçlüdür. Ancak I2P üzerinde uygulanabilirliği net değildir. Sıraya alma, ileti işleme ve kısıtlama nedeniyle ileti gecikmelerindeki çeşitlilik genellikle bir iletinin tek bir bağlantı üzerinden geçirilme süresini karşılar veya aşar Hatta saldırgan, ileti alınır alınmaz bir yanıt gönderileceğini bilir. Yine de otomatik yanıtları ortaya çıkaracak bazı senaryolar vardır. Streaming kitaplığı (SYN+ACK ile), garantili teslimat ileti kipini ("Veri iletisi" + "Aktarım durumu iletisi" DataMessage+DeliveryStatusMessage ile) sağlar.

source: Without protocol scrubbing or higher latency, global active adversaries can gain substantial information. As such, people concerned with these attacks could increase the latency (using <a href="%(todo)s#stop">nontrivial delays</a> or <a href="%(todo)s#batching">batching strategies</a>), include protocol scrubbing, or other advanced tunnel routing <a href="%(todo)s#batching">techniques</a>, but these are unimplemented in I2P.
pt: Sem a depuração de protocolo ou latência mais alta, adversários ativos globais podem obter informações substanciais. Como tal, as pessoas preocupadas com esses ataques poderiam aumentar a latência (usando <a href="%(todo)s#stop">atrasos não triviais</a> ou <a href="%(todo)s#batching">estratégias de loteamento</a>), incluir depuração de protocolo ou outras técnicas avançadas de roteamento de túnel <a href="%(todo)s#batching"></a>, mas estas não são implementadas em I2P.
tr: İletişim kuralı temizleme veya daha yüksek gecikme olmadan, küresel aktif saldırganlar önemli bilgiler elde edebilir. Bu nedenle, bu saldırılarla ilgilenen kişiler gecikmeyi artırabilir (<a href="%(todo)s#stop">önemsiz gecikmeler</a> ya da <a href="%(todo)s#batching">gruplama stratejileri</a> kullanarak), iletişim kuralı temizlemeyi veya diğer gelişmiş tünel yöneltme <a href="%(todo)s#batching">tekniklerini</a> içerebilir. Ancak bunlar I2P ağında uygulanmaz.

source: References: <a href="%(pdf)s">Low-Resource Routing Attacks Against Anonymous Systems</a>
pt: Referências: <a href="%(pdf)s">Ataques de roteamento de poucos recursos contra sistemas anônimos</a>
tr: Referanslar: <a href="%(pdf)s">Anonim Sistemlere Karşı Düşük Kaynaklı Yöneltme Saldırıları</a>

source: Intersection attacks against low latency systems are extremely powerful - periodically make contact with the target and keep track of what peers are on the network. Over time, as node churn occurs the attacker will gain significant information about the target by simply intersecting the sets of peers that are online when a message successfully goes through. The cost of this attack is significant as the network grows, but may be feasible in some scenarios.
pt: Ataques de interseção contra sistemas de baixa latência são extremamente poderosos - periodicamente fazem contato com o alvo e rastreiam quais pares estão na rede. Com o tempo, conforme a rotatividade de nós ocorre, o invasor obterá informações significativas sobre o alvo simplesmente cruzando os conjuntos de pares que estão online quando uma mensagem passa com sucesso. O custo desse ataque é significativo conforme a rede cresce, mas pode ser viável em alguns cenários.
tr: Düşük gecikmeli sistemlere yönelik kesişme saldırıları son derece güçlüdür. Hedefle periyodik olarak iletişim kurulur ve ağda hangi eşlerin olduğu izlenir. Zamanla, düğüm kayması gerçekleştikçe, saldırgan, bir ileti başarıyla geçtiğinde çevrimiçi olan eş kümelerini basitçe keserek hedef hakkında önemli bilgiler elde eder. Ağ büyüdükçe bu saldırının maliyeti önemli olmaya başlar. Ancak bazı senaryolarda gene de yapılabilir.

source: In summary, if an attacker is at both ends of your tunnel at the same time, he may be successful. I2P does not have a full defense to this for low latency communication. This is an inherent weakness of low-latency onion routing. Tor provides a <a href="%(url)s">similar disclaimer</a>.
pt: Em resumo, se um invasor estiver em ambas as extremidades do seu túnel ao mesmo tempo, ele pode ter sucesso. O I2P não tem uma defesa completa para isso para comunicação de baixa latência. Esta é uma fraqueza inerente do roteamento onion de baixa latência. O Tor fornece uma <a href="%(url)s">isenção de responsabilidade semelhante</a>.
tr: Özetle, bir saldırgan aynı anda tünelinizin her iki ucunday bulunuyorsa başarılı olabilir. I2P uygulaması, düşük gecikmeli iletişim ile buna karşı tam bir savunma sağlamaz. Bu durum, düşük gecikmeli onion yöneltmenin doğal bir zayıflığıdır. Tor, <a href="%(url)s">benzer bir sorumluluk reddi beyanı</a> verir.

source: Partial defenses implemented in I2P:
pt: Defesas parciais implementadas no I2P:
tr: I2P üzerinde uygulanan kısmi savunmalar:

source: <a href="%(tunnelimpl)s#ordering">strict ordering</a> of peers
pt: <a href="%(tunnelimpl)s#ordering">ordenação estrita</a> de pares
tr: eşlerin <a href="%(tunnelimpl)s#ordering">katı sıralanması</a>

source: <a href="%(peerselection)s">peer profiling and selection</a> from a small group that changes slowly
pt: <a href="%(peerselection)s">perfil e seleção de pares</a> de um pequeno grupo que muda lentamente
tr: yavaşça değişen küçük bir gruptan <a href="%(peerselection)s">eş profilinin belirlenmesi ve seçimi</a>

source: Limits on the number of tunnels routed through a single peer
pt: Limites no número de túneis roteados por um único peer
tr: Tek bir eş üzerinden yöneltilen tünel sayısının sınırlandırılması

source: Prevention of peers from the same /16 IP range from being members of a single tunnel
pt: Prevenção de pares do mesmo intervalo de IP /16 de serem membros de um único túnel
tr: Aynı /16 IP aralığındaki eşlerin tek bir tünelin üyesi olmasının önlenmesi

source: For I2P Sites or other hosted services, we support simultaneous hosting on multiple routers, or <a href="#intersection">multihoming</a>
pt: Para sites I2P ou outros serviços hospedados, oferecemos suporte para hospedagem simultânea em vários roteadores ou <a href="#intersection">multihoming</a>
tr: I2P siteleri veya diğer barındırılan hizmetler için, birden çok yönelticide eşzamanlı barındırmayı veya <a href="#intersection">birden çok barındırmayı</a> destekliyoruz.

source: Even in total, these defenses are not a complete solution. Also, we have made some design choices that may significantly increase our vulnerability:
pt: Mesmo no total, essas defesas não são uma solução completa. Além disso, fizemos algumas escolhas de design que podem aumentar significativamente nossa vulnerabilidade:
tr: Toplamda bile, bu savunmalar tam bir çözüm değildir. Ayrıca, güvenlik açığımızı önemli ölçüde artırabilecek bazı tasarım seçimleri yaptık:

source: We do not use low-bandwidth "guard nodes"
pt: Nós não utilizamos "nodos de proteção" de baixa largura de banda
tr: Düşük bant genişliği olan "koruyucu düğümler" kullanmıyoruz

source: We use tunnel pools comprised of several tunnels, and traffic can shift from tunnel to tunnel.
pt: Usamos pools de túneis compostos por vários túneis, e o tráfego pode mudar de túnel para túnel.
tr: Birkaç tünelden oluşan tünel havuzları kullanıyoruz ve trafik tünelden tünele kayabiliyor.

source: Tunnels are not long-lived; new tunnels are built every 10 minutes.
pt: Os túneis não duram muito; novos túneis são construídos a cada 10 minutos.
tr: Tüneller uzun ömürlü değildir; Her 10 dakikada bir yeni tüneller inşa edilir.

source: Tunnel lengths are configurable. While 3-hop tunnels are recommended for full protection, several applications and services use 2-hop tunnels by default.
pt: Os comprimentos dos túneis são configuráveis. Embora túneis de 3 saltos sejam recomendados para proteção total, vários aplicativos e serviços usam túneis de 2 saltos por padrão.
tr: Tünel uzunlukları yapılandırılabilir. Tam koruma için 3 sıçramalı tüneller önerilirken, birçok uygulama ve hizmet varsayılan olarak 2 sıçramalı tünelleri kullanır.

source: In the future, it could for peers who can afford significant delays (per <a href="%(todo)s#stop">nontrivial delays</a> and <a href="%(todo)s#batching">batching strategies</a>). In addition, this is only relevant for destinations that other people know about - a private group whose destination is only known to trusted peers does not have to worry, as an adversary can't "ping" them to mount the attack.</p>
pt: No futuro, isso poderia para pares que podem arcar com atrasos significativos (por <a href="%(todo)s#stop">atrasos não triviais </a> e <a href="%(todo)s#batching">estratégias de agrupamento</a>). Além disso, isso só é relevante para destinos que outras pessoas conhecem - um grupo privado cujo destino é conhecido apenas por pares confiáveis não precisa se preocupar, pois um adversário não pode "pingá-los" para montar o ataque.</p>
tr: Gelecekte, önemli gecikmeleri karşılayabilen eşler için olabilir (<a href="%(todo)s#stop">önemsiz gecikmeler</a> ve <a href="%(todo)s#batching">toplu işlem stratejileri</a>). Ek olarak, bu yalnızca diğer insanların bildiği hedefler için geçerlidir. Hedefi yalnızca güvenilir eşler tarafından bilinen özel bir grubun endişelenmesi gerekmez, çünkü bir saldırgan saldırıyı başlatmak için onlara "ping" gönderemez.</p>

source: Reference: <a href="%(oce)s">One Cell Enough</a>
pt: Referência: <a href="%(oce)s">Uma célula é suficiente</a>
tr: Referans: <a href="%(oce)s">Bir hücre yeterlidir</a>

source: There are a whole slew of denial of service attacks available against I2P, each with different costs and consequences:
pt: Há uma série de ataques de negação de serviço disponíveis contra I2P, cada um com custos e consequências diferentes:
tr: I2P ağına karşı her birinin farklı maliyet ve sonuçları olan bir dizi hizmet reddi saldırısı yapılabilir:

source: <b>Greedy user attack:</b> This is simply people trying to consume significantly more resources than they are willing to contribute. The defense against this is:
pt: <b>Ataque de usuário ganancioso:</b> Isso é simplesmente pessoas tentando consumir significativamente mais recursos do que estão dispostas a contribuir. A defesa contra isso é:
tr: <b>Açgözlü kullanıcı saldırısı:</b> Basit olarak, katkıda bulunmak istediklerinden çok daha fazla kaynak tüketmeye çalışan kişiler yapar. Buna karşı şu savunma yapılır:

source: Set defaults so that most users provide resources to the network. In I2P, users route traffic by default. In sharp distinction to <a href="%(comparisons)s">other networks</a>, over 95&#37; of I2P users relay traffic for others.
pt: Defina padrões para que a maioria dos usuários forneça recursos para a rede. No I2P, os usuários roteiam o tráfego por padrão. Em nítida distinção de <a href="%(comparisons)s">outras redes</a>, mais de 95&#37; dos usuários do I2P retransmitem o tráfego para outros.
tr: Varsayılanları, çoğu kullanıcının ağa kaynak sağlayacağı şekilde ayarlayın. I2P ağında varsayılan olarak trafiği kullanıcılar yöneltir. <a href="%(comparisons)s">Diğer ağlardan</a> keskin bir farkla, I2P kullanıcıları &#37;95 oranında başkalarının trafiğini aktarır.

source: Provide easy configuration options so that users may increase their contribution (share percentage) to the network. Display easy-to-understand metrics such as "share ratio" so that users may see what they are contributing.
pt: Forneça opções de configuração fáceis para que os usuários possam aumentar sua contribuição de (porcentagem de compartilhamento) para a rede. Exiba métricas de fáceis de entender, como "taxa de compartilhamento", para que os usuários possam ver o que estão contribuindo.
tr: Kullanıcıların ağa katkılarını (paylaşım yüzdesini) artırabilmeleri için kolay yapılandırma seçenekleri sağlayın. Kullanıcıların neye katkıda bulunduklarını görebilmeleri için "paylaşma oranı" gibi anlaşılması kolay ölçümleri görüntüleyin.

source: Maintain a strong community with blogs, forums, IRC, and other means of communication.
pt: Mantenha uma comunidade forte com blogs, fóruns, IRC e outros meios de comunicação.
tr: Bloglar, forumlar, IRC ve diğer iletişim araçlarıyla güçlü bir topluluk oluşturun.
