Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Both the initial message and the subsequent reply use the introKey of the responder (Bob) - the responder does not need to know the introKey of the requester (Alice). The DSA signing key used by Bob should already be known to Alice when she contacts him, though Alice's DSA key may not already be known by Bob.
pt: Tanto a mensagem inicial quanto a resposta subsequente usam a introKey do respondente (Bob) - o respondente não precisa saber a introKey do solicitante (Alice). A chave de assinatura DSA usada por Bob já deve ser conhecida por Alice quando ela o contata, embora a chave DSA de Alice possa não ser conhecida por Bob.
tr: Hem ilk ileti hem de sonraki yanıt, yanıtlayanın (Bob) giriş anahtarını kullanır. Yanıtlayanın, istekte bulunanın (Alice) giriş anahtarını bilmesi gerekmez. Bob tarafından kullanılan DSA imzalama anahtarı, Alice'in DSA anahtarı Bob tarafından bilinmemesine rağmen, onunla iletişim kurduğunda Alice tarafından zaten bilinmelidir.

source: Upon receiving a message, the receiver checks the "from" IP address and port with all established sessions - if there are matches, that session's MAC keys are tested in the HMAC. If none of those verify or if there are no matching IP addresses, the receiver tries their introKey in the MAC. If that does not verify, the packet is dropped. If it does verify, it is interpreted according to the message type, though if the receiver is overloaded, it may be dropped anyway.
pt: Ao receber uma mensagem, o receptor verifica o endereço IP "de" e a porta com todas as sessões estabelecidas - se houver correspondências, as chaves MAC dessa sessão são testadas no HMAC. Se nenhuma delas verificar ou se não houver endereços IP correspondentes, o receptor tenta sua introKey no MAC. Se isso não verificar, o pacote é descartado. Se verificar, ele é interpretado de acordo com o tipo de mensagem, embora se o receptor estiver sobrecarregado, ele pode ser descartado de qualquer maneira.
tr: Alıcı bir iletiyi aldıktan sonra, "kimden" IP adresini ve kurulu tüm oturumlarla bağlantı noktasını denetler. Eşleşmeler varsa, bu oturumun MAC anahtarları HMAC ile sınanır. Bunların hiçbiri doğrulamazsa veya eşleşen IP adresi yoksa, alıcı MAC üzerinde introKey değerlerini dener. Bu da doğrulamazsa, paket atılır. Doğrulanırsa, ileti türüne göre yorumlanır, ancak alıcı aşırı yüklenirse yine de atılabilir.

source: If Alice and Bob have an established session, but Alice loses the keys for some reason and she wants to contact Bob, she may at any time simply establish a new session through the SessionRequest and related messages. If Bob has lost the key but Alice does not know that, she will first attempt to prod him to reply, by sending a DataMessage with the wantReply flag set, and if Bob continually fails to reply, she will assume the key is lost and reestablish a new one.
pt: Se Alice e Bob tiverem uma sessão estabelecida, mas Alice perder as chaves por algum motivo e quiser contatar Bob, ela pode a qualquer momento simplesmente estabelecer uma nova sessão por meio do SessionRequest e mensagens relacionadas. Se Bob perdeu a chave, mas Alice não sabe disso, ela primeiro tentará incitá-lo a responder, enviando uma DataMessage com o sinalizador wantReply definido, e se Bob continuamente falhar em responder, ela assumirá que a chave está perdida e restabelecerá uma nova.
tr: Alice ve Bob'un yerleşik bir oturumu varsa, ancak Alice herhangi bir nedenle anahtarları kaybederse ve Bob ile iletişim kurmak isterse, istediği zaman oturum isteği (SessionRequest) ve ilgili iletileri kullanarak yeni bir oturum oluşturabilir. Bob anahtarı kaybetmişse ama Alice bunu bilmiyorsa, ilk önce yanıt istiyor (WantReply) işareti ayarlanmış bir veri iletisi (DataMessage) göndererek onu yanıt vermeye zorlar ve Bob yanıt vermemeyi sürdürürse anahtarın kaybolduğunu varsayarak yeniden yeni bir tane kurar.

source: For the DH key agreement, <a href="%(rfc3526)s">RFC3526</a> 2048bit MODP group (#14) is used:
pt: Para o acordo de chave DH, <a href="%(rfc3526)s">RFC3526</a> 2048 bits grupo MODP (#14) é usado:
tr: Diffie-Hellman anahtarı uzlaşması için, <a href="%(rfc3526)s">RFC3526</a> 2048bit MODP grubu (#14) kullanılır:

source: These are the same p and g used for I2P's <a href="%(cryptography)s#elgamal">ElGamal encryption</a>.
pt: Esses são os mesmos p e g usados para criptografia ElGamal <a href="%(cryptography)s#elgamal">do I2P</a>.
tr: Bunlar I2P <a href="%(cryptography)s#elgamal">ElGamal şifrelemesi</a> ile kullanılan aynı q ve q değerleridir.

source: Replay prevention
pt: Prevenção de repetição
tr: Yinelenmeyi engelleme

source: Replay prevention at the SSU layer occurs by rejecting packets with exceedingly old timestamps or those which reuse an IV. To detect duplicate IVs, a sequence of Bloom filters are employed to "decay" periodically so that only recently added IVs are detected.
pt: A prevenção de repetição na camada SSU ocorre pela rejeição de pacotes com timestamps excessivamente antigos ou aqueles que reutilizam um IV. Para detectar IVs duplicados, uma sequência de filtros Bloom é empregada para "decair" periodicamente para que apenas IVs adicionados recentemente sejam detectados.
tr: SSU katmanında yinelenme, aşırı eski zaman damgaları taşıyan veya bir IV değerini yeniden kullanan paketlerin reddedilmesi ile engellenir. Yinelenen IV değerlerini saptamak için, düzenli olarak "eskitme" yapan bir dizi Bloom süzgeci ile yalnızca yeni eklenen IV değerleri ayıklanır.

source: The messageIds used in DataMessages are defined at layers above the SSU transport and are passed through transparently. These IDs are not in any particular order - in fact, they are likely to be entirely random. The SSU layer makes no attempt at messageId replay prevention - higher layers should take that into account.
pt: Os messageIds usados em DataMessages são definidos em camadas acima de o transporte SSU e são passados transparentemente. Esses IDs não estão em nenhuma ordem específica - na verdade, eles provavelmente são inteiramente aleatórios. A camada SSU não faz nenhuma tentativa de messageId prevenção de repetição - camadas mais altas devem levar isso em consideração.
tr: Veri iletilerinde (DataMessage) kullanılan ileti kimlikleri, SSU taşıyıcısının üzerindeki katmanlarda tanımlanır ve şeffaf bir şekilde geçirilir. Bu kimlikler belirli bir sırada değildir. Aslında tamamen rastgele olaiblirler. SSU katmanı, messageId için yinelenmeyi engellleme girişiminde bulunmaz. Bu durumu daha yüksek katmanlar hesaba katmalıdır.

source: Addressing
pt: Endereçamento
tr: Adresleme

source: To contact an SSU peer, one of two sets of information is necessary: a direct address, for when the peer is publicly reachable, or an indirect address, for using a third party to introduce the peer. There is no restriction on the number of addresses a peer may have.
pt: Para entrar em contato com um peer SSU, um dos dois conjuntos de informações é necessário: um endereço direto, para quando o peer estiver publicamente acessível, ou um endereço indireto, para usar um terceiro para apresentar o peer. Não há restrição quanto ao número de endereços que um peer pode ter.
tr: Bir SSU eşi ile iletişim kurmak için iki bilgi grubundan biri gereklidir: Eşe herkesin erişebildiği durumlarda doğrudan adres veya Eşi tanıtmak için üçüncü bir tarafın kullanılacağı dolaylı bir adres. Bir eşin sahip olabileceği adres sayısında herhangi bir kısıtlama yoktur.

source: Each of the addresses may also expose a series of options - special capabilities of that particular peer. For a list of available capabilities, see <a href="#capabilities">below</a>.
pt: Cada um dos endereços também pode expor uma série de opções - capacidades especiais daquele peer em particular. Para uma lista de capacidades disponíveis, veja <a href="#capabilities">abaixo</a>.
tr: Adreslerin her biri, bir dizi seçeneği de ortaya çıkarabilir. O belirli eşin özel yetenekleri olabilir. Kullanılabilen yeteneklerin listesi için <a href="#capabilities">aşağı</a> bakabilirsiniz.

source: The addresses, options, and capabilities are published in the <a href="%(netdb)s">network database</a>.
pt: Os endereços, opções e recursos são publicados no banco de dados de rede <a href="%(netdb)s"></a>.
tr: Adresler, seçenekler ve yetenekler <a href="%(netdb)s">"Ağ veri tabanı" (NetDB)</a> üzerinde yayınlanır.

source: Direct Session Establishment
pt: Estabelecimento de Sessão Direta
tr: Doğrudan Oturum Kuruluşu

source: Direct session establishment is used when no third party is required for NAT traversal. The message sequence is as follows:
pt: O estabelecimento de sessão direta é usado quando nenhum terceiro é necessário para a travessia do NAT. A sequência de mensagens é a seguinte:
tr: NAT geçişi için üçüncü taraf gerekmediğinde doğrudan oturum oluşturma kullanılır. İleti sıralaması aşağıdaki gibidir:

source: Connection establishment (direct)
pt: Estabelecimento de conexão (direto)
tr: Bağlantı kuruluşu (doğrudan)

source: Alice connects directly to Bob. IPv6 is supported as of version 0.9.8.
pt: Alice conecta diretamente ao Bob. IPv6 é suportado desde a versão 0.9.8.
tr: Alice doğrudan Bob ile bağlantı kurar. IPv6, 0.9.8 sürümünden başlayarak desteklenir.

source: After the SessionConfirmed message is received, Bob sends a small <a href="%(i2npspec)s#msg_DeliveryStatus">DeliveryStatus message</a> as a confirmation. In this message, the 4-byte message ID is set to a random number, and the 8-byte "arrival time" is set to the current network-wide ID, which is 2 (i.e. 0x0000000000000002).
pt: Após a mensagem SessionConfirmed ser recebida, Bob envia uma pequena mensagem <a href="%(i2npspec)s#msg_DeliveryStatus">DeliveryStatus</a> como confirmação. Nesta mensagem, o ID da mensagem de 4 bytes é definido como um número aleatório, e o "horário de chegada" de 8 bytes é definido como o ID atual de toda a rede, que é 2 (ou seja, 0x0000000000000002).
tr: "Oturum onaylandı" (SessionConfirmed) iletisi alındıktan sonra, Bob onay olarak küçük bir <a href="%(i2npspec)s#msg_DeliveryStatus">"Aktarım durumu" (DeliveryStatus) iletisi</a> gönderir. Bu iletide, 4 baytlık ileti kimliği rasgele bir sayıya ve 8 baytlık "Varış zamanı", 2 (yani 0x00000000000000002) olan geçerli ağ çapındaki kimliğe ayarlanmıştır.

source: After the status message is sent, the peers usually exchange <a href="%(i2npspec)s#msg_DatabaseStore">DatabaseStore messages</a> containing their <a href="%(commonstructures)s#struct_RouterInfo">RouterInfos</a>, however, this is not required.
pt: Após o envio da mensagem de status, os pares geralmente trocam <a href="%(i2npspec)s#msg_DatabaseStore">mensagens DatabaseStore</a> contendo seus <a href="%(commonstructures)s#struct_RouterInfo">RouterInfos</a>, no entanto, isso não é necessário.
tr: Durum iletisi gönderildikten sonra, eşler genellikle <a href="%(commonstructures)s#struct_RouterInfo">"Yöneltici bilgilerini" (RouterInfo)</a> içeren <a href="%(i2npspec)s#msg_DatabaseStore">"Veri tabanı kaydetme" (DatabaseStore) iletilerini alıp verirler. Ancak bu şart değildir.

source: It does not appear that the type of the status message or its contents matters. It was originally added becasue the DatabaseStore message was delayed several seconds; since the store is now sent immediately, perhaps the status message can be eliminated.
pt: Não parece que o tipo da mensagem de status ou seu conteúdo importem. Ela foi adicionada originalmente porque a mensagem DatabaseStore estava atrasada vários segundos; como o armazenamento agora é enviado imediatamente, talvez a mensagem de status possa ser eliminada.
tr: Durum iletisinin türü veya içeriği önemli görünmüyor. En başta veri tabanı kaydetme (DatabaseStore) iletisi birkaç saniye geciktiği için bu eklenmişti. Artık kayıt hemen gönderildiğinden, durum iletisi kaldırılabilir.

source: Introduction keys are delivered through an external channel (the network database), where they have traditionally been identical to the router Hash through release 0.9.47, but may be random as of release 0.9.48. They must be used when establishing a session key. For the indirect address, the peer must first contact the relayhost and ask them for an introduction to the peer known at that relayhost under the given tag. If possible, the relayhost sends a message to the addressed peer telling them to contact the requesting peer, and also gives the requesting peer the IP and port on which the addressed peer is located. In addition, the peer establishing the connection must already know the public keys of the peer they are connecting to (but not necessary to any intermediary relay peer).
pt: As chaves de introdução são entregues por meio de um canal externo (o banco de dados da rede), onde tradicionalmente são idênticas ao Hash do roteador até a versão 0.9.47, mas podem ser aleatórias a partir da versão 0.9.48. Elas devem ser usadas ao estabelecer uma chave de sessão. Para o endereço indireto , o peer deve primeiro entrar em contato com o relayhost e pedir a eles uma introdução ao peer conhecido naquele relayhost sob a tag fornecida. Se possível, o relayhost envia uma mensagem ao peer endereçado dizendo para entrar em contato com o peer solicitante e também fornece ao peer solicitante o IP e a porta em que o peer endereçado está localizado. Além disso, o par que estabelece a conexão deve já conhecer as chaves públicas do par ao qual está se conectando (mas não é necessário para nenhum par de retransmissão intermediário).
tr: Giriş anahtarları, geleneksel olarak 0.9.47 sürümünden başlayarak yöneltici karması ile aynı olan, ancak 0.9.48 sürümünden başlayarak rastgele olabilecekleri bir dış kanal (ağ veri tabanı (netDB)) aracılığıyla aktarılır. Bunların bir oturum anahtarı oluştururken kullanılmaları gerekir. Dolaylı adres için, eş ilk önce bir aktarıcı sunucusuyla iletişim kurmalı ve ondan, verilen etiket altında bu alktarıcı sunucusunun bildiği eşe bir giriş yapmasını istemelidir. Olabiliyorsa aktarıcı sunucu adreslenen eşe istekte bulunan eşle iletişim kurmasını söyleyen bir ileti gönderir ve ayrıca istekte bulunan eşe, adreslenen eşin bulunduğu IP adresini ve bağlantı noktasını verir. Ek olarak, bağlantıyı kuran eş, bağlandıkları eşin ortak anahtarlarını zaten bilmelidir (ancak bu durum herhangi bir aracı aktarıcı eş için gerekli değildir).

source: Indirect session establishment by means of a third party introduction is necessary for efficient NAT traversal. Charlie, a router behind a NAT or firewall which does not allow unsolicited inbound UDP packets, first contacts a few peers, choosing some to serve as introducers. Each of these peers (Bob, Bill, Betty, etc) provide Charlie with an introduction tag - a 4 byte random number - which he then makes available to the public as methods of contacting him. Alice, a router who has Charlie's published contact methods, first sends a RelayRequest packet to one or more of the introducers, asking each to introduce her to Charlie (offering the introduction tag to identify Charlie). Bob then forwards a RelayIntro packet to Charlie including Alice's public IP and port number, then sends Alice back a RelayResponse packet containing Charlie's public IP and port number. When Charlie receives the RelayIntro packet, he sends off a small random packet to Alice's IP and port (poking a hole in his NAT/firewall), and when Alice receives Bob's RelayResponse packet, she begins a new full direction session establishment with the specified IP and port.
pt: O estabelecimento indireto de sessão por meio de uma introdução de terceiros é necessário para uma travessia NAT eficiente. Charlie, um roteador atrás de um NAT ou firewall que não permite pacotes UDP de entrada não solicitados, primeiro contata alguns pares, escolhendo alguns para servir como apresentadores. Cada desses pares (Bob, Bill, Betty, etc) fornece a Charlie uma tag de introdução - um número aleatório de 4 bytes - que ele então disponibiliza ao público como métodos de contato com ele. Alice, uma roteadora que tem os métodos de contato publicados de Charlie, primeiro envia um pacote RelayRequest para um ou mais dos apresentadores, pedindo a cada um para apresentá-la a Charlie (oferecendo a tag de introdução para identificar Charlie). Bob então encaminha um pacote RelayIntro para Charlie incluindo o IP público e o número da porta de Alice, então envia Alice de volta um pacote RelayResponse contendo o IP público e o número da porta de Charlie. Quando Charlie recebe o pacote RelayIntro, ele envia um pequeno pacote aleatório para o IP e porta de Alice (abrindo um buraco em seu NAT/firewall), e quando Alice recebe o pacote RelayResponse de Bob, ela inicia um novo estabelecimento de sessão de direção completa com o IP e porta especificados.
tr: Etkin NAT geçişi için üçüncü taraf tanıtımı yoluyla dolaylı oturum kurulması gereklidir. NAT veya güvenlik duvarının arkasındaki, istenmeyen gelen UDP paketlerine izin vermeyen bir yöneltici olan Charlie, önce birkaç eşle iletişim kurar ve bazılarını tanıtıcı olarak hizmet etmek üzere seçer. Bu eşlerin (Bob, Bill, Betty, vb.) her biri Charlie'ye bir tanıtım etiketi sağlar (4 baytlık rastgele bir sayı) ve daha sonra onunla iletişim kurma yöntemleri olarak herkese açık olarak yayınlar. Charlie'nin yayınlanmış iletişim yöntemlerini bilen bir yöneltici olan Alice, önce bir ya da birkaç tanıtıcıya bir aktarıcı isteği (RelayRequest) paketi gönderir ve her birinden onu Charlie ile tanıştırmasını ister (Charlie'yi tanımlamak için giriş etiketini sunar). Bob daha sonra Alice'in genel IP adresini ve bağlantı noktası numarasını içeren bir aktarıcı girişi (RelayIntro) paketini Charlie'ye iletir, ardından Alice, Charlie'nin herkese açık IP adresini ve bağlantı noktası numarasını içeren bir aktarıcı yanıtı (RelayResponse) paketini geri alır. Charlie aktarıcı yanıtı (RelayIntro) paketini aldığında, Alice'in IP adresine ve bağlantı noktasına küçük bir rastgele paket gönderir (NAT/güvenlik duvarında bir delik açar) ve Alice Bob'un aktarıcı yanıtı (RelayResponse) paketini aldığında, belirtilen IP adresi ve bağlantı noktası numarası ile yeni bir tam yönlü oturum kurulumuna başlar.

source: Connection establishment (indirect using an introducer)
pt: Estabelecimento de conexão (indireto usando um introdutor)
tr: Bağlantı kuruluşu (bir tanıtıcı kullanarak dolaylı)

source: Alice first connects to introducer Bob, who relays the request to Charlie.
pt: Alice primeiro se conecta com o apresentador Bob, que repassa o pedido a Charlie.
tr: Alice ilk önce, isteği Charlie'ye ileten tanıtıcı Bob ile bağlantı kurar.

source: After the hole punch, the session is established between Alice and Charlie as in a direct establishment.
pt: Após o furador, a sessão é estabelecida entre Alice e Charlie como em um estabelecimento direto.
tr: Delik açıldıktan sonra, doğrudan bir kuruluşta olduğu gibi Alice ve Charlie arasında oturum kurulur.

source: Peer testing
pt: Testando o Par
tr: Eş sınaması

source: The automation of collaborative reachability testing for peers is enabled by a sequence of PeerTest messages. With its proper execution, a peer will be able to determine their own reachability and may update its behavior accordingly. The testing process is quite simple:
pt: A automação de testes de alcançabilidade colaborativa para pares é habilitada por uma sequência de mensagens PeerTest. Com sua execução adequada, um par será capaz de determinar sua própria alcançabilidade e pode atualizar seu comportamento de acordo. O processo de teste é bem simples:
tr: Eşler için işbirliğine dayalı erişilebilirlik sınamasının otomasyonu, bir dizi eş sınaması (PeerTest) iletisi ile sağlanır. Düzgün yürütülmesiyle, bir eş kendi erişilebilirliğini belirleyebilir ve davranışını buna göre güncelleyebilir. Sınama süreci oldukça basittir:

source: Each of the PeerTest messages carry a nonce identifying the test series itself, as initialized by Alice. If Alice doesn't get a particular message that she expects, she will retransmit accordingly, and based upon the data received or the messages missing, she will know her reachability. The various end states that may be reached are as follows:
pt: Cada uma das mensagens PeerTest carrega um nonce identificando a própria série de testes , conforme inicializada por Alice. Se Alice não receber uma mensagem específica que ela espera, ela retransmitirá adequadamente, e com base nos dados recebidos ou nas mensagens ausentes, ela saberá sua alcançabilidade. Os vários estados finais que podem ser alcançados são os seguintes:
tr: Eş sınaması (PeerTest) iletilerinin her biri, Alice tarafından başlatıldığı gibi, sınama serisinin kendisini tanımlayan bir belirteç (nonce) taşır. Alice, beklediği belirli bir iletiyi alamazsa, uygun şekilde yeniden iletir ve alınan verilere ya da eksik iletilere göre ulaşılabilirliğini belirler. Ulaşılabilecek çeşitli son durumlar şu şekildedir:

source: If she doesn't receive a response from Bob, she will retransmit up to a certain number of times, but if no response ever arrives, she will know that her firewall or NAT is somehow misconfigured, rejecting all inbound UDP packets even in direct response to an outbound packet. Alternately, Bob may be down or unable to get Charlie to reply.
pt: Se ela não receber uma resposta de Bob, ela retransmitirá até um certo número de vezes, mas se nenhuma resposta chegar, ela saberá que seu firewall ou NAT está de alguma forma mal configurado, rejeitando todos os pacotes UDP de entrada, mesmo em resposta direta a um pacote de saída. Alternativamente, Bob pode estar inativo ou incapaz de fazer Charlie responder.
tr: Alice, Bob'dan yanıt almazsa, belirli bir sayıya ulaşana kadar yeniden iletir. Ancak yanıt gelmezse, Alive güvenlik duvarı veya NAT yapılandırmasının bir şekilde yanlış olduğunu anlar ve bir gidiş paketinin doğrudan yanıtı olsabile tüm gelen UDP paketlerini reddeder. Alternatif olarak, Bob çalışmıyor olabilir veya Charlie'den yanıt alınmamasına yol açabilir.

source: If Alice doesn't receive a PeerTest message with the expected nonce from a third party (Charlie), she will retransmit her initial request to Bob up to a certain number of times, even if she has received Bob's reply already. If Charlie's first message still doesn't get through but Bob's does, she knows that she is behind a NAT or firewall that is rejecting unsolicited connection attempts and that port forwarding is not operating properly (the IP and port that Bob offered up should be forwarded).
pt: Se Alice não receber uma mensagem PeerTest com o nonce esperado de um terceiro (Charlie), ela retransmitirá sua solicitação inicial para Bob até um certo número de vezes, mesmo se ela já tiver recebido a resposta de Bob. Se a primeira mensagem de Charlie ainda não for enviada, mas a de Bob for, ela sabe que está atrás de um NAT ou firewall que está rejeitando tentativas de conexão não solicitadas e que o encaminhamento de porta não está operando corretamente (o IP e a porta que Bob ofereceu devem ser encaminhados).
tr: Alice, üçüncü bir taraftan (Charlie) beklenen belirteç (nonce) ile bir eş sınaması (PeerTest) iletisi almazsa, Alice, Bob'un yanıtını zaten almış olsa bile, ilk isteğini Bob'a belirli bir sayıya ulaşana kadar yeniden iletir. Charlie'nin ilk iletisi hala iletilmiyor ancak Bob'un iletisi geliyorsa, Alice istenmeyen bağlantı girişimlerini reddeden bir NAT veya güvenlik duvarı arkasında olduğunu ve bağlantı noktası yönlendirmenin düzgün çalışmadığını bilir (Bob'un sunduğu IP ve bağlantı noktası iletilmelidir).
