Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Bundled with the I2P install, I2PSnark offers a simple anonymous BitTorrent client with multitorrent capabilities, exposing all of the functionality through a plain HTML web interface.
pt: Junto com a instalação do I2P, o I2PSnark oferece um cliente BitTorrent anônimo simples com recursos multitorrent, expondo todas as funcionalidades por meio de uma interface web HTML simples.
tr: I2P kurulumuyla birlikte gelen I2PSnark, çoklu torrent özellikleri olan basit bir anonim BitTorrent istemcisidir ve tüm işlevlerin bir düz HTML internet arayüzü ile kullanılmasını sağlar.

source: Robert is a Bittorrent client written in Python. It is hosted on <a href="http://%(bob)s/Robert.html">http://%(bob)s/Robert.html</a> <!-- TODO: expand -->
pt: Robert é um cliente Bittorrent escrito em Python. Ele está hospedado em <a href="http://%(bob)s/Robert.html">http://%(bob)s/Robert.html</a> <!-- TODO: expandir -->
tr: Robert, Python ile yazılmış bir Bittorrent istemcisidir. <a href="http://%(bob)s/Robert.html">http://%(bob)s/Robert.html</a> üzerinde bulunabilir <!-- TODO: expand -->

source: PyBit is a Bittorrent client written in Python. It is hosted on <a href="%(pybit)s">%(pybit)s</a> <!-- TODO: expand -->
pt: PyBit é um cliente Bittorrent escrito em Python. Ele está hospedado em <a href="%(pybit)s">%(pybit)s</a> <!-- TODO: expandir -->
tr: PyBit, Python ile yazılmış bir Bittorrent istemcisidir. <a href="%(pybit)s">%(pybit)s</a> üzerinde bulunabilir <!-- TODO: expand -->

source: I2Phex is a fairly direct port of the Phex Gnutella filesharing client to run entirely on top of I2P. While it has disabled some of Phex's functionality, such as integration with Gnutella webcaches, the basic file sharing and chatting system is fully functional.
pt: I2Phex é uma porta bastante direta do cliente de compartilhamento de arquivos Phex Gnutella para rodar inteiramente em cima do I2P. Embora tenha desabilitado algumas das funcionalidades do Phex, como a integração com webcaches Gnutella, o sistema básico de compartilhamento de arquivos e bate-papo é totalmente funcional.
tr: I2Phex, tamamen I2P üzerinde çalışacak Phex Gnutella dosya paylaşımı istemcisinin oldukça doğrudan oluşturulmuş bir dalıdır. Gnutella internet ön bellekleriyle bütünleştirme gibi bazı Phex işlevlerini devre dışı bırakmış olsa da, temel dosya paylaşımı ve sohbet sistemi tamamen işlevseldir.

source: iMule is a fairly direct port of the aMule filesharing client running entirely inside I2P.
pt: O iMule é uma porta bastante direta do cliente de compartilhamento de arquivos aMule , executado inteiramente dentro do I2P.
tr: iMule, tamamen I2P içinde çalışan aMule dosya paylaşım istemcisinin oldukça doğrudan oluşturulmuş bir dalıdır.

source: I2Pmail is more a service than an application - postman offers both internal and external email with POP3 and SMTP service through I2PTunnel instances accessing a series of components developed with mastiejaner, allowing people to use their preferred mail clients to send and receive mail pseudonymously. However, as most mail clients expose substantial identifying information, I2P bundles susi23's web based susimail client which has been built specifically with I2P's anonymity needs in mind. The I2Pmail/mail.i2p service offers transparent virus filtering as well as denial of service prevention with hashcash augmented quotas. In addition, each user has control of their batching strategy prior to delivery through the mail.i2p outproxies, which are separate from the mail.i2p SMTP and POP3 servers - both the outproxies and inproxies communicate with the mail.i2p SMTP and POP3 servers through I2P itself, so compromising those non-anonymous locations does not give access to the mail accounts or activity patterns of the user. At the moment the developers work on a decentralized mailsystem, called "v2mail". More information can be found on the I2P Site <a href="http://%(postman)s/">%(postman)s</a>.
pt: O I2Pmail é mais um serviço do que um aplicativo - o postman oferece e-mail interno e externo com serviço POP3 e SMTP por meio de instâncias do I2PTunnel acessando uma série de componentes desenvolvidos com o mastiejaner, permitindo que as pessoas usem seus clientes de e-mail preferidos para enviar e receber e-mails de forma pseudônima. No entanto, como a maioria dos clientes de e-mail expõe informações de identificação substanciais, o I2P agrupa o cliente susimail baseado na web do susi23, que foi criado especificamente com as necessidades de anonimato do I2P em mente. O serviço I2Pmail/mail.i2p oferece filtragem de vírus transparente , bem como prevenção de negação de serviço com cotas aumentadas de hashcash . Além disso, cada usuário tem controle de sua estratégia de loteamento antes da entrega através dos outproxies mail.i2p, que são separados dos servidores SMTP e POP3 mail.i2p - tanto os outproxies quanto os inproxies se comunicam com os servidores SMTP e POP3 mail.i2p através do próprio I2P, então comprometer esses locais não anônimos não dá acesso às contas de e-mail ou padrões de atividade do usuário. No momento, os desenvolvedores trabalham em um sistema de e-mail descentralizado, chamado "v2mail". Mais informações podem ser encontradas no Site I2P <a href="http://%(postman)s/">%(postman)s</a>.
tr: I2Pmail bir uygulamadan çok bir hizmettir. postman, mastiejaner ile geliştirilmiş bir dizi bileşene erişen I2PTunnel kopyaları üzerinden POP3 ve SMTP hizmeti ile hem iç hem de dış e-posta kullanımı sunar ve insanların takma adla e-posta göndermek ve almak için kullanmayı yeğlediği e-posta istemcilerini kullanmalarını sağlar. Bununla birlikte, çoğu e-posta istemcisi önemli tanımlayıcı bilgiler açığa çıkardığından, susi23 ve özellikle I2P anonimlik gereksinimlerine göre tasarlanmış internet tabanlı susimail istemcisi oluşturulmuştur. I2Pmail/mail.i2p hizmeti, hashcash artırılmış kotalar ile şeffaf virüs süzmesinin yanı sıra hizmet himzet reddi saldırılarını önleme olanağı sunar. Ek olarak, her kullanıcı, mail.i2p SMTP ve POP3 sunucularından ayrı olan mail.i2p çıkışları üzerinden teslimattan önce toplu işlem stratejisini kontrol edebilir - Bu çıkış ve giriş vekil sunucuları, mail.i2p I2P uygulamasının kendi SMTP ve POP3 sunucuları ile iletişim kurar. Bu nedenle bunların anonim olmayan konumlarda bulunması bir soruna yol açmaz ve kullanıcının e-posta hesaplarına veya işlem modellerine erişilmesini sağlamaz. Şu anda geliştiriciler, "v2mail" adı verilen merkezi olmayan bir e-posta sistemi üzerinde çalışıyor. Ayrıntılı bilgi almak için I2P sitesi üzerinde <a href="http://%(postman)s/">%(postman)s</a> bölümüne bakabilirsiniz.

source: I2P-Bote is a distributed e-mail application. It does not use the traditional e-mail concept of sending an e-mail to a server and retrieving it from a server. Instead, it uses a Kademlia Distributed Hash Table to store mails. One user can push a mail into the DHT, while another can request the e-mail from the DHT. And all the mails sent within the I2P-Bote network are automatically encrypted end-to-end. <br> Furthermore, I2P-Bote offers a remailer function on top of I2P, for increased high-latency anonymity.
pt: O I2P-Bote é um aplicativo de e-mail distribuído. Ele não usa o conceito tradicional de e-mail de enviar um e-mail para um servidor e recuperá-lo de um servidor. Em vez disso, ele usa uma Tabela Hash Distribuída Kademlia para armazenar e-mails. Um usuário pode enviar um e-mail para o DHT, enquanto outro pode solicitar o e-mail do DHT. E todos os e-mails enviados dentro da rede I2P-Bote são criptografados automaticamente de ponta a ponta. <br> Além disso, o I2P-Bote oferece uma função de reencaminhamento sobre o I2P, para maior anonimato de alta latência.
tr: I2P-Bote dağıtılmış bir e-posta uygulamasıdır. E-postaların bir sunucuya gönderilip alındığı geleneksel e-posta yapısını kullanmaz. Bunun yerine, e-postaları kaydetmek için bir Kademlia dağıtılmış karma tablosu kullanır. Bir kullanıcı "Dağıtılmış karma tablosuna" (DHT) bir e-posta gönderebilir, diğeri ise "Dağıtılmış karma tablosundan" (DHT) bir e-posta alma isteğinde bulunabilir. I2P-Bote ağı içinde gönderilen tüm e-postalar otomatik olarak uçtan uca şifrelenir. <br> Ayrıca I2P-Bote, yüksek gecikmeli anonimlik sağlamak için I2P üzerinde e-postaları yeniden postalama özelliği ekler.

source: I2P-Messenger is an end-to-end encrypted serverless communication application. For communication between two users, they need to give each other their destination keys, to allow the other to connect. It supports file transfer and has a search for other users, based on Seedless.
pt: O I2P-Messenger é um aplicativo de comunicação sem servidor criptografado de ponta a ponta. Para comunicação entre dois usuários, eles precisam fornecer um ao outro suas chaves de destino, para permitir que o outro se conecte. Ele suporta transferência de arquivos e tem uma busca por outros usuários, com base no Seedless.
tr: I2P-Messenger, uçtan uca şifrelenmiş sunucusuz bir iletişim uygulamasıdır. İki kullanıcı arasındaki iletişimin kurulması için, bağlantı kurmayı sağlayacak hedef anahtarlarını vermeleri gerekir. Dosya aktarımını destekler ve Seedless kullanarak diğer kullanıcıları arar.

source: I2P's Threat Model
pt: Modelo de Risco da I2P
tr: I2P Tehdit Modeli

source: November 2010
pt: Novembro de 2010
tr: 2010 Kasım

source: low
pt: baixa
tr: düşük

source: medium
pt: média
tr: orta

source: high
pt: alta
tr: yüksek

source: Damage Potential
pt: Dano Potêncial
tr: Hasar Potansiyeli

source: Reliability
pt: Fiabilidade
tr: Güvenirlik

source: Exploitability
pt: Possibilidade de exploração
tr: Kötüye kullanılabilirlik

source: Affected Users
pt: Usuários afetados
tr: Etkilenen Kullanıcılar

source: Discoverability
pt: Descoberta
tr: Keşfedilebilirlik

source: Severity
pt: Severidade
tr: Önem Derecesi

source: Priority
pt: Prioridade
tr: Öncelik

source: Index of Attacks
pt: Ataques - Índice
tr: Saldırı Dizini

source: Brute force attacks
pt: Ataques de força bruta
tr: Kaba kuvvet saldırıları

source: Timing attacks
pt: Ataques de tempo
tr: Zamanlama saldırıları

source: Intersection attacks
pt: Ataques de intersecção
tr: Ara kesit saldırıları

source: Denial of service attacks
pt: Ataques de negação de serviço
tr: Hizmet reddi saldırıları

source: Tagging attacks
pt: Ataques de marcação
tr: Etiketleme saldırıları

source: Partitioning attacks
pt: Ataques de particionamento
tr: Bölümleme saldırıları

source: Predecessor attacks
pt: Ataques predecessores
tr: Önceleme saldırıları

source: Harvesting attacks
pt: Ataques de colheita
tr: Hasat saldırıları

source: Identification Through Traffic Analysis
pt: Identificação por meio de análise de tráfego
tr: Trafik İncelemesi ile Kimlik Belirleme

source: Sybil attacks
pt: Ataques de Sybil
tr: Sybil saldırıları

source: Buddy Exhaustion attacks
pt: Ataques de exaustão de amigos
tr: Arkadaş tüketme saldırıları

source: Cryptographic attacks
pt: Ataques criptográficos
tr: Şifreleme saldırıları

source: Floodfill attacks
pt: Ataques de inundação
tr: Otomatik doldurma saldırıları

source: Other Network Database attacks
pt: Outros ataques de banco de dados de rede
tr: Diğer ağ veri tabanı saldırıları

source: Attacks on centralized resources
pt: Ataques a recursos centralizados
tr: Merkezileştirilmiş kaynak saldırıları

source: Development attacks
pt: Ataques de desenvolvimento
tr: Geliştirme saldırıları

source: Implementation attacks
pt: Ataques via falhas de implementação
tr: Uygulama saldırıları

source: Other Defenses
pt: Outras defesas
tr: Diğer Savunmalar

source: What do we mean by "anonymous"?
pt: O que entendemos por "anônimo"?
tr: "Anonim" ile ne demek istiyoruz?

source: Your level of anonymity can be described as "how hard it is for someone to find out information you don't want them to know?" - who you are, where you are located, who you communicate with, or even when you communicate. "Perfect" anonymity is not a useful concept here - software will not make you indistinguishable from people that don't use computers or who are not on the Internet. Instead, we are working to provide sufficient anonymity to meet the real needs of whomever we can - from those simply browsing websites, to those exchanging data, to those fearful of discovery by powerful organizations or states.
pt: Seu nível de anonimato pode ser descrito como "quão difícil é para alguém descobrir informações que você não quer que eles saibam?" - quem você é, onde você está localizado, com quem você se comunica, ou mesmo quando você se comunica. O anonimato "perfeito" não é um conceito útil aqui - o software não tornará você indistinguível de pessoas que não usam computadores ou que não estão na Internet. Em vez disso, estamos trabalhando para fornecer anonimato suficiente para atender às necessidades reais de quem pudermos - desde aqueles que simplesmente navegam em sites, até aqueles que trocam dados, até aqueles com medo de serem descobertos por organizações ou estados poderosos.
tr: Anonimlik düzeyiniz, "birinin bilmesini istemediğiniz bilgileri öğrenmesi ne kadar zor" olduğu şeklinde tanımlanabilir. Kim olduğunuz, nerede bulunduğunuz, kiminle iletişim kurduğunuz ve ne zaman iletişim kurduğunuz gibi. "Mükemmel" anonimlik burada kullanışlı bir kavram değildir. Yazılımlar sizi bilgisayar kullanmayan veya İnternet üzerinde olmayan insanlara dönüştürmez. Bunun yerine, yalnızca sitelere göz atanlardan, veri alışverişinde bulunanlara, güçlü kuruluşlar veya devletler tarafından keşfedilmekten korkanlara kadar, olabilecek herkesin gerçek gereksinimlerini karşılamak için yeterli anonimlik sağlamaya çalışıyoruz.

source: The question of whether I2P provides sufficient anonymity for your particular needs is a hard one, but this page will hopefully assist in answering that question by exploring how I2P operates under various attacks so that you may decide whether it meets your needs.
pt: A questão de saber se o I2P fornece anonimato suficiente para suas necessidades específicas é difícil, mas esta página espera ajudar a responder a essa pergunta explorando como o I2P opera sob vários ataques para que você possa decidir se ele atende às suas necessidades.
tr: I2P tarafından özel gereksinimleriniz için yeterli anonimliğin sağlanıp sağlanamadığı sorusu zor bir sorudur. Ancak bu sayfa, gereksinimlerinizi karşılayıp karşılamadığına karar verebilmeniz için I2P uygulamasının çeşitli saldırılar altında nasıl çalıştığını keşfederek bu soruyu yanıtlanmanıza yardımcı olacaktır.

source: We welcome further research and analysis on I2P's resistance to the threats described below. More review of existing literature (much of it focused on Tor) and original work focused on I2P is needed.
pt: Agradecemos mais pesquisas e análises sobre a resistência do I2P às ameaças descritas abaixo. Mais revisões da literatura existente (grande parte dela focada no Tor) e trabalhos originais focados no I2P são necessários.
tr: I2P ağının aşağıda açıklanan tehditlere karşı direnci hakkında daha fazla araştırma ve inceleme yapılmasını memnuniyetle karşılarız. Var olan literatürün daha fazla gözden geçirilmesine (çoğu Tor ağına odaklanmıştır) ve I2P ağına odaklanan özgün çalışmalara gerek var.

source: Network Topology Summary
pt: Síntese da Topologia da Rede
tr: Ağ Topolojisi Özeti

source: I2P builds off the ideas of many <a href="%(comparisons)s">other</a> <a href="%(links)s">systems</a>, but a few key points should be kept in mind when reviewing related literature:
pt: O I2P se baseia nas ideias de muitos <a href="%(comparisons)s">outros</a> <a href="%(links)s">sistemas</a>, mas alguns pontos-chave devem ser mantidos em mente ao revisar a literatura relacionada:
tr: I2P, birçok <a href="%(comparisons)s">diğer</a> <a href="%(links)s">sistemin</a> fikrini temel alır. Ancak ilgili literatürü gözden geçirirken birkaç önemli nokta akılda tutulmalıdır:

source: <b>I2P is a free route mixnet</b> - the message creator explicitly defines the path that messages will be sent out (the outbound tunnel), and the message recipient explicitly defines the path that messages will be received on (the inbound tunnel).
pt: <b>I2P é uma mixnet de rota livre</b> - o criador da mensagem define explicitamente o caminho pelo qual as mensagens serão enviadas (o túnel de saída), e o destinatário da mensagem define explicitamente o caminho pelo qual as mensagens serão recebidas (o túnel de entrada).
tr: <b>I2P özgür bir yöneltme karma ağıdır.</b> İletiyi oluşturan kişi, iletilerin gönderileceği yolu (gidiş tüneli) açık olarak tanımlar ve ileti alıcısı, iletilerin alınacağı yolu (geliş tüneli) açık olarak tanımlar.

source: <b>I2P has no official entry and exit points</b> - all peers fully participate in the mix, and there are no network layer in- or out-proxies (however, at the application layer, a few proxies do exist)
pt: <b>I2P não tem pontos de entrada e saída oficiais</b> - todos os pares participam totalmente da mistura e não há proxies de entrada ou saída na camada de rede (no entanto, na camada de aplicação , existem alguns proxies)
tr: <b>I2P ağında resmi giriş ve çıkış noktaları yoktur.</b> Tüm eşler karışıma tam olarak katılır ve ağ katmanında giriş ya da çıkış vekil sunucuları yoktur (ancak uygulama katmanında birkaç vekil sunucu bulunur)

source: <b>I2P is fully distributed</b> - there are no central controls or authorities. One could modify some routers to operate mix cascades (building tunnels and giving out the keys necessary to control the forwarding at the tunnel endpoint) or directory based profiling and selection, all without breaking compatibility with the rest of the network, but doing so is of course not necessary (and may even harm one's anonymity).
pt: <b>O I2P é totalmente distribuído</b> - não há controles ou autoridades centrais. Alguém poderia modificar alguns roteadores para operar cascatas mistas (construindo túneis e fornecendo as chaves necessárias para controlar o encaminhamento no ponto final do túnel) ou criação de perfil e seleção baseados em diretório , tudo sem quebrar a compatibilidade com o resto da rede, mas fazer isso obviamente não é necessário (e pode até prejudicar o anonimato).
tr: <b>I2P tamamen dağıtılmıştır.</b> Merkezi denetim veya bir otorite yoktur. Bazı yönelticiler, ağın geri kalanıyla uyumluluğu bozmadan, karma basamakları (tünelleri oluşturmak ve tünel uç noktasında iletmeyi denetlemek için gerekli anahtarları vermek) veya dizin tabanlı profil oluşturmak ve seçmek için değiştirilebilir. Ancak elbette bunu yapmak şart değildir (ve hatta kişinin anonimliğine zarar verebilir).

source: We have documented plans to implement <a href="%(todo)s#stop">nontrivial delays</a> and <a href="%(todo)s#batching">batching strategies</a> whose existence is only known to the particular hop or tunnel gateway that receives the message, allowing a mostly low latency mixnet to provide cover traffic for higher latency communication (e.g. email). However we are aware that significant delays are required to provide meaningful protection, and that implementation of such delays will be a significant challenge. It is not clear at this time whether we will actually implement these delay features.
pt: Temos planos documentados para implementar <a href="%(todo)s#stop">atrasos não triviais</a> e <a href="%(todo)s#batching">estratégias de agrupamento</a> cuja existência é conhecida apenas pelo gateway de túnel ou salto específico que recebe a mensagem, permitindo que uma mixnet de latência baixa forneça cobertura tráfego para comunicação de latência mais alta (por exemplo, e-mail). No entanto, estamos cientes de que atrasos significativos são necessários para fornecer proteção significativa, e que a implementação de tais atrasos será um desafio significativo. Não está claro neste momento se realmente implementaremos esses recursos de atraso.
tr: Varlığı yalnızca ileti alan belirli bir sıçrama veya tünel ağ geçidi tarafından bilinen ve çoğunlukla düşük gecikme süreli bir karma ağın daha yüksek gecikme süreli iletişim için kapsama trafiği sağlamasına olanak tanıyan <a href="%(todo)s#stop">önemsiz gecikmeler</a> ve <a href="%(todo)s#batching">toplu işleme stratejilerini</a> uygulamaya yönelik planları belgeledik (e-posta gibi). Ancak, anlamlı bir koruma sağlamak için önemli gecikmelerin gerekli olduğunun ve bu tür gecikmelerin uygulanmasının önemli bir zorluk olacağının farkındayız. Bu gecikme özelliklerini gerçekten uygulayıp uygulayamayacağımız şu anda net değil.

source: In theory, routers along the message path may inject an arbitrary number of hops before forwarding the message to the next peer, though the current implementation does not.
pt: Em teoria, os roteadores ao longo do caminho da mensagem podem injetar um número arbitrário de saltos antes de encaminhar a mensagem para o próximo par, embora a implementação atual não o faça.
tr: Teoride, ileti yolu boyunca yönelticiler, iletiyi bir sonraki eşe iletmeden önce, var olan uygulama bunu yapmasa da, rastgele sayıda sıçrama eklenebilir.

source: The Threat Model
pt: O modelo de risco
tr: Tehdit Modeli

source: I2P design started in 2003, not long after the advent of <a href="http://www.onion-router.net">[Onion Routing]</a>, <a href="http://freenetproject.org/">[Freenet]</a>, and <a href="https://www.torproject.org/">[Tor]</a>. Our design benefits substantially from the research published around that time. I2P uses several onion routing techniques, so we continue to benefit from the significant academic interest in Tor.
pt: O design do I2P começou em 2003, pouco depois do advento do <a href="http://www.onion-router.net">[Onion Routing]</a>, <a href="http://freenetproject.org/">[Freenet]</a>e <a href="https://www.torproject.org/">[Tor]</a>. Nosso design se beneficia substancialmente da pesquisa publicada naquela época. O I2P usa várias técnicas de roteamento onion, então continuamos a nos beneficiar do significativo interesse acadêmico no Tor.
tr: I2P tasarımı, 2003 yılında, şunların ortaya çıkmasından kısa bir süre sonra başladı. <a href="http://www.onion-router.net">[Onion Routing]</a>, <a href="http://freenetproject.org/">[Freenet]</a> ve <a href="https://www.torproject.org/">[Tor]</a>. Tasarımımız, o dönemde yayınlanan araştırmalardan önemli ölçüde yararlanıyor. I2P, birkaç onion yöneltme tekniği kullanır. Bu nedenle Tor ağına yönelmiş olan önemli akademik ilgiden yararlanmayı sürdürüyoruz.

source: Taking from the attacks and analysis put forth in the <a href="http://freehaven.net/anonbib/topic.html">anonymity literature</a> (largely <a href="http://citeseer.ist.psu.edu/454354.html">Traffic Analysis: Protocols, Attacks, Design Issues and Open Problems</a>), the following briefly describes a wide variety of attacks as well as many of I2Ps defenses. We update this list to include new attacks as they are identified.
pt: Tomando como base os ataques e análises apresentados na literatura de anonimato <a href="http://freehaven.net/anonbib/topic.html"></a> (em grande parte <a href="http://citeseer.ist.psu.edu/454354.html">Análise de Tráfego: Protocolos, Ataques, Design Problemas e Problemas Abertos</a>), o seguinte descreve brevemente uma ampla variedade de ataques, bem como muitas das defesas do I2P. Atualizamos esta lista para incluir novos ataques à medida que são identificados.
tr: <a href="http://freehaven.net/anonbib/topic.html">Anonimlik literatüründe</a> (büyük ölçüde <a href="http://citeseer.ist.psu.edu/454354.html">Trafik Analizi: İletişim kuralları, saldırılar, tasarım sorunları ve açık sorunlar</a>) ortaya konulan saldırılardan ve analizlerden yola çıkarak, tanımlanmış çeşitli saldırılar ve I2P savunmaları aşağıda kısaca açıklanmıştır. Yeni saldırılar tanımlandıkça bu listeyi güncelliyoruz.
