Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: The netDb uses a simple Kademlia-style XOR metric to determine closeness. To create a Kademlia key, the SHA256 hash of the RouterIdentity or Destination is computed.
pt: O netDb usa uma métrica XOR simples no estilo Kademlia para determinar a proximidade. Para criar uma chave Kademlia, o hash SHA256 do RouterIdentity ou Destination é calculado.
tr: "Ağ veri tabanı" (NetDB), yakınlığı belirlemek için Kademlia tarzı basit bir XOR ölçümü kullanır. Bir Kademlia anahtarı oluşturmak için “Yöneltici kimliği” (RouterIdentity) veya hedefin SHA-256 karması hesaplanır.

source: A modification to this algorithm is done to increase the costs of <a href="#sybil-partial">Sybil attacks</a>. Instead of the SHA256 hash of the key being looked up of stored, the SHA256 hash is taken of the 32-byte binary search key appended with the UTC date represented as an 8-byte ASCII string yyyyMMdd, i.e. SHA256(key + yyyyMMdd). This is called the "routing key", and it changes every day at midnight UTC. Only the search key is modified in this way, not the floodfill router hashes. The daily transformation of the DHT is sometimes called "keyspace rotation", although it isn't strictly a rotation.
pt: Uma modificação neste algoritmo é feita para aumentar os custos de <a href="#sybil-partial">ataques Sybil</a>. Em vez do hash SHA256 da chave sendo pesquisada ou armazenada, o hash SHA256 é obtido da chave de pesquisa binária de 32 bytes anexada com a data UTC representada como uma string ASCII de 8 bytes aaaaMMdd, ou seja, SHA256(chave + aaaaMMdd). Isso é chamado de "chave de roteamento" e muda todos os dias à meia-noite UTC. Somente a chave de pesquisa é modificada dessa forma, não os hashes do roteador de inundação. A transformação diária do DHT às vezes é chamada de "rotação do espaço de chaves", embora não seja estritamente uma rotação.
tr: <a href="#sybil-partial">Sybil saldırılarının</a> maliyetlerini artırmak için bu algoritmada bir değişiklik yapıldı. Aranan anahtarın kaydedilmiş SHA-256 karması yerine, SHA-256 karması, 8 baytlık bir ASCII dizgesi yyyyMMdd, yani SHA256(anahtar + yyyyMMdd) olarak gösterilen UTC tarihi ile eklenen 32 baytlık ikili arama anahtarından alınır. Buna "yöneltme anahtarı" denir ve her gün UTC gece yarısında değişir. Otomatik doldurma yöneltici karmaları değil, yalnızca arama anahtarı bu şekilde değiştirilir. Günlük "Dağıtılmış karma tablosu" (DHT) döndürmesi, tam anlamıyla bir döndürme olmasa da bazen "anahtar alanı döndürme" olarak adlandırılır.

source: Routing keys are never sent on-the-wire in any I2NP message, they are only used locally for determination of distance.
pt: Chaves de roteamento nunca são enviadas na rede em nenhuma mensagem I2NP, elas são usadas apenas localmente para determinação de distância .
tr: Yöneltme anahtarları hiçbir zaman herhangi bir I2NP iletisinde kablo üzerinden gönderilmez. Yalnızca uzaklığın belirlenmesi için yerel olarak kullanılırlar.

source: Storage, Verification, and Lookup Mechanics
pt: Mecânica de armazenamento, verificação e pesquisa
tr: Depolama, doğrulama ve arama mekanizması

source: RouterInfo Storage to Peers
pt: Armazenamento RouterInfo para pares
tr: Eşlerde "Yöneltici bilgileri (RouterInfo)" depolama

source: <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages containing the local RouterInfo are exchanged with peers as a part of the initialization of a <a href="%(ntcp)s">NTCP</a> or <a href="%(ssu)s">SSU</a> transport connection.
pt: <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages contendo o RouterInfo local são trocados com pares como parte da inicialização de uma conexão de transporte <a href="%(ntcp)s">NTCP</a> ou <a href="%(ssu)s">SSU</a> .
tr: Yerel "Yöneltici bilgileri" (RouterInfo) bulunduran <a href="%(i2np)s">I2NP</a> "Veri tabanı kaydetme iletileri" (DatabaseStoreMessages), <a href="%(ntcp)s">NTCP</a> veya <a href="%(ssu)s">SSU</a> taşıyıcı bağlantısının başlatılmasının bir parçası olarak eşler arasında alınıp verilir.

source: LeaseSet Storage to Peers
pt: Armazenamento LeaseSet para pares
tr: Eşlere "Kiralama kümesi" (LeaseSet) depolama

source: <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages containing the local LeaseSet are periodically exchanged with peers by bundling them in a garlic message along with normal traffic from the related Destination. This allows an initial response, and later responses, to be sent to an appropriate Lease, without requiring any LeaseSet lookups, or requiring the communicating Destinations to have published LeaseSets at all.
pt: <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages contendo o LeaseSet local são periodicamente trocadas com pares agrupando-as em uma mensagem garlic junto com o tráfego normal do Destino relacionado. Isso permite que uma resposta inicial e respostas posteriores sejam enviadas para um Lease apropriado, sem exigir nenhuma pesquisa de LeaseSet ou exigir que os Destinos comunicantes tenham LeaseSets publicados.
tr: İçinde yerel "Kiralama kümesi" (LeaseSet) bulunan <a href="%(i2np)s">I2NP</a> "Veri tabanı kaydetme iletileri" (DatabaseStoreMessages), ilgili hedeften gelen normal trafikle birlikte bir Garlic iletisinde bir araya getirilerek eşlerle düzenli olarak alınıp verilir. Böylece, herhangi bir "Kiralama kümesi" araması gerekmeden veya iletişim halindeki hedeflerin "Kiralama kümeleri" yayınlamasına gerek kalmadan ilk yanıtın ve daha sonraki yanıtların uygun kiralamaya gönderilmesini sağlar.

source: The DatabaseStoreMessage should be sent to the floodfill that is closest to the current routing key for the RouterInfo or LeaseSet being stored. Currently, the closest floodfill is found by a search in the local database. Even if that floodfill is not actually closest, it will flood it "closer" by sending it to multiple other floodfills. This provides a high degree of fault-tolerance.
pt: O DatabaseStoreMessage deve ser enviado para o floodfill mais próximo da chave de roteamento atual para o RouterInfo ou LeaseSet que está sendo armazenado. Atualmente, o floodfill mais próximo é encontrado por uma pesquisa no banco de dados local. Mesmo que esse floodfill não esteja realmente mais próximo, ele o inundará "mais perto" enviando-o para vários outros floodfills. Isso fornece um alto grau de tolerância a falhas.
tr: "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage), tutulmakta olan "Yöneltici bilgileri" (RouterInfo) veya "Kiralama kümesi" (LeaseSet) için geçerli yöneltme anahtarına en yakın olan otomatik doldurucuya gönderilmelidir. Şu anda, en yakın otomatik doldurucu yerel veri tabanında yapılan bir aramayla bulunur. Bu otomatik doldurucu gerçekte en yakındaki olmasa bile, birden fazla otomatik doldurucuya gönderilerek "daha yakın" doldurma sağlar. Böylece, yüksek düzeyde hata toleransı sağlanır.

source: In traditional Kademlia, a peer would do a "find-closest" search before inserting an item in the DHT to the closest target. As the verify operation will tend to discover closer floodfills if they are present, a router will quickly improve its knowledge of the DHT "neighborhood" for the RouterInfo and LeaseSets it regularly publishes. While I2NP does not define a "find-closest" message, if it becomes necessary, a router may simply do an iterative search for a key with the least significant bit flipped (i.e. key ^ 0x01) until no closer peers are received in the DatabaseSearchReplyMessages. This ensures that the true closest peer will be found even if a more-distant peer had the netdb item.
pt: No Kademlia tradicional, um peer faria uma busca "find-closest" antes de inserir um item no DHT para o alvo mais próximo. Como a operação de verificação tenderá a descobrir floodfills mais próximos se eles estiverem presentes, um roteador melhorará rapidamente seu conhecimento da "vizinhança" do DHT para o RouterInfo e LeaseSets que ele publica regularmente. Embora o I2NP não defina uma mensagem "find-closest", se for necessário, um roteador pode simplesmente fazer uma busca iterativa por uma chave com o bit menos significativo invertido (ou seja, chave ^ 0x01) até que nenhum peer mais próximo seja recebido no DatabaseSearchReplyMessages. Isso garante que o verdadeiro par mais próximo será encontrado mesmo que um par mais distante tenha o item netdb.
tr: Geleneksel Kademlia üzerinde, bir eş, "Dağıtılmış karma tablosu" (DHT) verilerine en yakın hedefe bir öge eklemeden önce "en yakını bul" araması yapar. Doğrulama işlemi, varsa daha yakın otomatik doldurucuları keşfetme eğiliminde olacağından, bir yöneltici, düzenli olarak yayınladığı "Yöneltici bilgileri" (RouterInfo) ve "Kiralama kümeleri" (LeaseSets) için "Dağıtılmış karma tablosu" (DHT) "mahallesi" hakkındaki bilgisini hızla artıracaktır. I2NP bir "en yakını bul" iletisi tanımlamasa da, gerekirse, bir yöneltici, "Veri tabanı arama yanıtı iletisi" (DatabaseSearchReplyMessage) içinde daha yakın bir eş alınmayana kadar en az anlamlı bit çevrilmiş bir anahtar (yani anahtar ^ 0x01) için yinelemeli bir arama yapabilir. . Böylece, daha uzaktaki bir eş "Ağ veri tabanı" (NetDB) ögesine sahip olsa bile gerçek en yakın eşin bulunmasını sağlar.

source: RouterInfo Storage to Floodfills
pt: Armazenamento RouterInfo para Floodfills
tr: Otomatik doldurma yönelticilerinde "Yöneltici bilgileri" (RouterInfo) depolama

source: A router publishes its own RouterInfo by directly connecting to a floodfill router and sending it a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage with a nonzero Reply Token. The message is not end-to-end garlic encrypted, as this is a direct connection, so there are no intervening routers (and no need to hide this data anyway). The floodfill router replies with a <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, with the Message ID set to the value of the Reply Token.
pt: Um roteador publica seu próprio RouterInfo conectando-se diretamente a um roteador floodfill e enviando a ele um <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage com um Reply Token diferente de zero. A mensagem não é criptografada de ponta a ponta, pois esta é uma conexão direta, então não há roteadores intervenientes (e não há necessidade de ocultar esses dados de qualquer maneira). O roteador floodfill responde com um <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, com o Message ID definido para o valor do Reply Token.
tr: Bir yöneltici, doğrudan bir otomatik doldurma yönlendiricisine bağlanarak ve ona sıfır olmayan bir "Yanıt belirteci" (Reply Token) ile bir <a href="%(i2np)s">I2NP</a> bir "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) göndererek kendi "Yöneltici bilgileri" (RouterInfo) verilerini yayınlar. Bu doğrudan bir bağlantı olduğundan, ileti uçtan uca Garlic şifrelemesi kullanmaz. Bu nedenle araya giren yönelticiler yoktur (ve yine de bu verileri gizlemeye gerek yoktur). Otomatik doldurma yönelticisi, ileti kimliği "Yanıt belirteci" (Router Token) değerine ayarlanmış bir <a href="%(i2np)s">I2NP</a> "Aktarım durumu iletisi" (DeliveryStatusMessage) ile yanıt verir.

source: LeaseSet Storage to Floodfills
pt: Armazenamento LeaseSet para Floodfills
tr: Otomatik doldurma yönelticilerine "Kiralama kümesi" (LeaseSet) depolama

source: Storage of LeaseSets is much more sensitive than for RouterInfos, as a router must take care that the LeaseSet cannot be associated with the router.
pt: O armazenamento de LeaseSets é muito mais sensível do que para RouterInfos, pois um roteador deve tomar cuidado para que o LeaseSet não possa ser associado ao roteador.
tr: Bir yönelticinin "Kiralama kümelerinin" (LeaseSets) yönelticiyle ilişkilendirilememesine dikkat etmesi gerektiğinden, "Kiralama kümelerinin" depolanması "Yöneltici bilgileri" (RouterInfo) verilerine göre çok daha hassastır.

source: A router publishes a local LeaseSet by sending a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage with a nonzero Reply Token over an outbound client tunnel for that Destination. The message is end-to-end garlic encrypted using the Destination's Session Key Manager, to hide the message from the tunnel's outbound endpoint. The floodfill router replies with a <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, with the Message ID set to the value of the Reply Token. This message is sent back to one of the client's inbound tunnels.
pt: Um roteador publica um LeaseSet local enviando um <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage com um Token de Resposta diferente de zero por meio de um túnel de cliente de saída para esse Destino. A mensagem é criptografada de ponta a ponta usando o Gerenciador de Chaves de Sessão do Destino, para ocultar a mensagem do ponto de extremidade de saída do túnel. O roteador floodfill responde com um <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, com o ID da Mensagem definido como o valor do Token de Resposta. Esta mensagem é enviada de volta para um dos túneis de entrada do cliente.
tr: Bir yöneltici, o hedef için bir gidiş istemci tüneli üzerinden sıfır olmayan bir "Yanıt belirteci" (Router Token) ile bir <a href="%(i2np)s">I2NP</a> "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) göndererek yerel bir "Kiralama kümesi" (LeaseSet) yayınlar. İleti, tünelin gidiş uç noktasından iletiyi gizlemek için hedefin oturum anahtarı yöneticisi kullanılarak uçtan uca Garlic şifrelenir. Otomatik doldurma yönelticisi, ileti kimliği "Yanıt belirteci" (Router Token) değerine ayarlanmış olarak bir <a href="%(i2np)s">I2NP</a> "Aktarım durumu iletisi" (DeliveryStatusMessage) ile yanıt verir. Bu ileti, istemcinin geliş tünellerinden birine geri gönderilir.

source: Flooding
pt: Inundação
tr: Otomatik Doldurma

source: After a floodfill router receives a DatabaseStoreMessage containing a valid RouterInfo or LeaseSet which is newer than that previously stored in its local NetDb, it "floods" it. To flood a NetDb entry, it looks up several (currently %(floodsize)s) floodfill routers closest to the routing key of the NetDb entry. (The routing key is the SHA256 Hash of the RouterIdentity or Destination with the date (yyyyMMdd) appended.) By flooding to those closest to the key, not closest to itself, the floodfill ensures that the storage gets to the right place, even if the storing router did not have good knowledge of the DHT "neighborhood" for the routing key.
pt: Depois que um roteador de floodfill recebe uma DatabaseStoreMessage contendo um RouterInfo ou LeaseSet válido que é mais novo do que o armazenado anteriormente em seu NetDb local, ele o "inunda". Para inundar uma entrada NetDb, ele procura vários (atualmente %(floodsize)s) roteadores de floodfill mais próximos da chave de roteamento da entrada NetDb. (A chave de roteamento é o Hash SHA256 do RouterIdentity ou Destino com a data (aaaaMMdd) anexada.) Ao inundar aqueles mais próximos da chave, não mais próximos de si mesmo, o floodfill garante que o armazenamento chegue ao lugar certo, mesmo que o roteador de armazenamento não tenha um bom conhecimento do "bairro" DHT para a chave de roteamento.
tr: Bir otomatik doldurma yönelticisi, yerel "Ağ veri tabanında" (NetDB) önceden depolanmış olandan daha yeni olan geçerli "Yöneltici bilgileri" (RouterInfo) veya "Kiralama kümesi" (LeaseSet) içeren bir "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) aldıktan sonra, onu "otomatik doldurur". Bir "Ağ veri tabanı" (NertDB) kaydını otomatik doldurmak için, "Ağ veri tabanı" (NetDB), kaydın yöneltme anahtarına en yakın birkaç (şu anda %(floodsize)s) otomatik doldurma yönelticisini arar. (Yöneltme anahtarı, tarih (yyyyMMdd) eklenmiş olarak "Yöneltici kimliği" (RouterIdentity) veya hedefin SHA-256 karmasıdır.) Otomatik doldurma, kendisine en yakın olmayan, anahtara en yakın olan yönelticileri otomatik doldurarak, depolama yönelticisi yöneltme anahtarı için "Dağıtılmış karma tablosu" (DHT) "komşu" hakkında iyi bilgiye sahip olmasa bile depolamanın doğru yere gitmesini sağlar.

source: The floodfill then directly connects to each of those peers and sends it a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage with a zero Reply Token. The message is not end-to-end garlic encrypted, as this is a direct connection, so there are no intervening routers (and no need to hide this data anyway). The other routers do not reply or re-flood, as the Reply Token is zero.
pt: O floodfill então se conecta diretamente a cada um desses pares e envia a ele um <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage com um Token de Resposta zero. A mensagem não é criptografada de ponta a ponta, pois esta é uma conexão direta, então não há roteadores intervenientes (e não há necessidade de ocultar esses dados de qualquer maneira). Os outros roteadores não respondem ou re-flood, pois o Token de Resposta é zero.
tr: Otomatik doldurma daha sonra bu eşlerin her birine doğrudan bağlanır ve onlara sıfır "Yanıt belirteci" (Router Token) ile bir <a href="%(i2np)s">I2NP</a> "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) gönderir. Bu bağlantı doğrudan olduğundan, ileti uçtan uca Garlic şifreli değildir. Bu nedenle araya giren yönelticiler yoktur (ve yine de bu verileri gizlemeye gerek yoktur). Diğer yönelticiler, "Yanıt belirteci" (Reply Token) sıfır olduğu için yanıt vermez veya yeniden yükleme yapmaz.

source: RouterInfo and LeaseSet Lookup
pt: Pesquisa RouterInfo e LeaseSet
tr: "Yöneltici bilgileri" (RouterInfo) ve "Kiralama kümesi" (LeaseSet) arama

source: The <a href="%(i2np)s">I2NP</a> DatabaseLookupMessage is used to request a netdb entry from a floodfill router. Lookups are sent out one of the router's outbound exploratory tunnels. The replies are specified to return via one of the router's inbound exploratory tunnels.
pt: O <a href="%(i2np)s">I2NP</a> DatabaseLookupMessage é usado para solicitar uma entrada netdb de um roteador floodfill. As pesquisas são enviadas por um dos túneis exploratórios de saída do roteador. As respostas são especificadas para retornar por meio de um dos túneis exploratórios de entrada do roteador.
tr: <a href="%(i2np)s">I2NP</a> "Veri tabanı arama iletisi" (DatabaseLookupMessage), bir otomatik doldurma yönelticisinden bir "Ağ veri tabanı" (NetDB) kaydı istemek için kullanılır. Aramalar, yönelticinin gidiş keşif tünellerinden birine gönderilir. Yanıtlar, yönelticinin geliş keşif tünellerinden biri üzerinden döndürülecek şekilde belirtilir.

source: Lookups are generally sent to the two "good" (the connection doesn't fail) floodfill routers closest to the requested key, in parallel.
pt: As pesquisas geralmente são enviadas para os dois roteadores floodfill "bons" (a conexão não falha) mais próximos da chave solicitada, em paralelo.
tr: Aramalar genellikle istenilen anahtara en yakın iki "iyi" (başarısız olmayan bağlantı) otomatik doldurma aktarıcı yönelticisine paralel olarak gönderilir.

source: If the key is found locally by the floodfill router, it responds with a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage. If the key is not found locally by the floodfill router, it responds with a <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage containing a list of other floodfill routers close to the key.
pt: Se a chave for encontrada localmente pelo roteador de floodfill, ele responderá com um <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage. Se a chave não for encontrada localmente pelo roteador de floodfill, ele responderá com um <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage contendo uma lista de outros roteadores de floodfill próximos à chave.
tr: Anahtar otomatik doldurma yönelticisi tarafından yerel olarak bulunursa, <a href="%(i2np)s">I2NP</a> "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) ile yanıt verir. Anahtar otomatik doldurma yönelticisi tarafından yerel olarak bulunamazsa, anahtara yakın diğer otomatik doldurma yönelticilerinin listesini içeren bir <a href="%(i2np)s">I2NP</a> "Veri tabanı arama yanıtı iletisi" (DatabaseSearchReplyMessages) ile yanıt verir.

source: LeaseSet lookups are garlic encrypted end-to-end as of release 0.9.5. RouterInfo lookups are not encrypted and thus are vulnerable to snooping by the outbound endpoint (OBEP) of the client tunnel. This is due to the expense of the ElGamal encryption. RouterInfo lookup encryption may be enabled in a future release.
pt: As pesquisas do LeaseSet são criptografadas com garlic de ponta a ponta a partir da versão 0.9.5. As pesquisas do RouterInfo não são criptografadas e, portanto, são vulneráveis à espionagem pelo ponto de extremidade de saída (OBEP) do túnel do cliente. Isso se deve ao custo da criptografia ElGamal. A criptografia de pesquisa do RouterInfo pode ser habilitada em uma versão futura.
tr: "Kiralama kümesi" (LeaseSet) aramaları, 0.9.5 sürümünden başlayarak uçtan uca Garlic şifrelenmiştir. "Yöneltici bilgileri" (RouterInfo) aramaları şifrelenmez ve bu nedenle istemci tünelinin gidiş uç noktası (OBEP) tarafından izlenmeye karşı savunmasızdır. Bunun nedeni ElGamal şifrelemesinin maliyetidir. "Yöneltici bilgileri" (RouterInfo) arama şifrelemesi, gelecekteki bir sürümde etkinleştirilebilir.

source: As of release 0.9.7, replies to a LeaseSet lookup (a DatabaseStoreMessage or a DatabaseSearchReplyMessage) will be encrypted by including the session key and tag in the lookup. This hides the reply from the inbound gateway (IBGW) of the reply tunnel. Responses to RouterInfo lookups will be encrypted if we enable the lookup encryption.
pt: A partir da versão 0.9.7, as respostas a uma pesquisa LeaseSet (uma DatabaseStoreMessage ou uma DatabaseSearchReplyMessage) serão criptografadas incluindo a chave de sessão e a tag na pesquisa. Isso oculta a resposta do gateway de entrada (IBGW) do túnel de resposta. As respostas às pesquisas RouterInfo serão criptografadas se habilitarmos a criptografia de pesquisa.
tr: 0.9.7 sürümünden başlayarak, bir "Kiralama kümesi" (LeaseSet) aramasına (bir "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) veya bir "Veri tabanı arama yanıtı iletisi" (DatabaseSearchReplyMessages)) verilen yanıtlar, aramaya oturum anahtarı ve etiketi katılarak şifrelenir. Böylece, yanıt tünelinin geliş ağ geçidinden (IBGW) gelen yanıt gizlenir. Arama şifrelemesini etkinleştirirsek, "Yöneltici bilgileri" (RouterInfo) aramalarına verilen yanıtlar şifrelenir.

source: (Reference: <a href="%(pdf)s">Hashing it out in Public</a> Sections 2.2-2.3 for terms below in italics)
pt: (Referência: <a href="%(pdf)s">Hashing it out in Public</a> Seções 2.2-2.3 para termos abaixo em itálico)
tr: (Referans: Aşağıdaki yatık yazılmış terimler için <a href="%(pdf)s">Hashing it out in Public</a> 2.2 ve 2.3 bölümleri)
