Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Guaranteed is disabled; None implemented in 0.8.1; the streaming lib default is None as of 0.8.1, the client side default is None as of 0.9.4
pt: Garantido está desabilitado; Nenhum implementado em 0.8.1; o padrão da biblioteca de streaming é Nenhum a partir de 0.8.1, o padrão do lado do cliente é Nenhum a partir de 0.9.4
tr: Garantili olarak devre dışı bırakılmıştır. 0.8.1 sürümünde None olarak ayarlanmıştır. Streaming kitaplığı varsayılanı 0.8.1 sürümünden başlayarak, istemci tarafı varsayılanı 0.9.4 sürümünden başlayarak None olarak ayarlanmıştır.

source: For authorization, if required by the router. If the client is running in the same JVM as a router, this option is not required. Warning - username and password are sent in the clear to the router, unless using SSL (i2cp.SSL=true). Authorization is only recommended when using SSL.
pt: Para autorização, se exigido pelo roteador. Se o cliente estiver sendo executado na mesma JVM que um roteador, esta opção não será necessária. Aviso - o nome de usuário e a senha são enviados em texto simples para o roteador, a menos que esteja usando SSL (i2cp.SSL=true). A autorização só é recomendada ao usar SSL.
tr: Kimlik doğrulaması için, yöneltici tarafından isteniyorsa. İstemci bir yönelticiyle aynı JVM üzerinde çalışıyorsa bu seçenek gerekli değildir. Uyarı - SSL (i2cp.SSL=true) kullanılmadığı sürece kullanıcı adı ve parola yönelticiye düz metin olarak gönderilir. Kimlik doğrulaması yalnızca SSL kullanılırken önerilir.

source: If incoming zero hop tunnel is allowed
pt: Se a chegada de túneis de zero pulo é permitida
tr: Sıfır sıçramalı geliş tüneline izin veriliyorsa

source: If outgoing zero hop tunnel is allowed
pt: Se a saída de túneis de zero pulo é permitida
tr: Sıfır sıçramalı gidiş tüneline izin veriliyorsa

source: number from %(from)s to %(to)s
pt: número de %(from)s a %(to)s
tr: %(from)s ile %(to)s arasında bir sayı

source: No limit
pt: Sem limite
tr: Sınır yok

source: Number of redundant fail-over for tunnels in
pt: Número de failover redundantes para túneis em
tr: Geliş tünelleri için sorun durumunda yedek sayısı

source: Number of redundant fail-over for tunnels out
pt: Número de failover redundantes para túneis de saída
tr: Gidiş tünelleri için sorun durumunda yedek sayısı

source: %(from)s to %(to)s
pt: %(from)s a %(to)s
tr: %(from)s ile %(to)s

source: Number of IP bytes to match to determine if two routers should not be in the same tunnel. 0 to disable.
pt: Número de bytes IP a serem correspondidos para determinar se dois roteadores não devem estar no mesmo túnel. 0 para desabilitar.
tr: İki yönelticinin aynı tünelde olmaması gerekip gerekmediğini belirlemek için eşleştirilecek IP bayt sayısı. Devre dışı bırakmak için 0 yazın.

source: Length of tunnels in
pt: Tamanho do túnel de entrada
tr: Geliş tünellerinin uzunluğu

source: Length of tunnels out
pt: Tamanho do túnel de saída
tr: Gidiş tünellerinin uzunluğu

source: Random amount to add or subtract to the length of tunnels in. A positive number x means add a random amount from 0 to x inclusive. A negative number -x means add a random amount from -x to x inclusive. The router will limit the total length of the tunnel to 0 to 7 inclusive. The default variance was 1 prior to release 0.7.6.
pt: Quantidade aleatória para adicionar ou subtrair ao comprimento dos túneis. Um número positivo x significa adicionar uma quantidade aleatória de 0 a x, inclusive. Um número negativo -x significa adicionar uma quantidade aleatória de -x a x, inclusive. O roteador limitará o comprimento total do túnel de 0 a 7, inclusive. A variação padrão era 1 antes da versão 0.7.6.
tr: Geliş tünellerinin uzunluğuna eklenecek veya çıkarılacak rastgele miktar. Pozitif bir sayı x, 0 ile x arasında rastgele bir miktar eklemek anlamına gelir. Negatif bir sayı -x, -x ile x arasında rastgele bir miktar eklemek anlamına gelir. Yöneltici, tünelin toplam uzunluğunu 0 ile 7 (dahil) arasında sınırlar. 0.7.6 sürümünden önce varsayılan varsyans 1 idi.

source: Random amount to add or subtract to the length of tunnels out. A positive number x means add a random amount from 0 to x inclusive. A negative number -x means add a random amount from -x to x inclusive. The router will limit the total length of the tunnel to 0 to 7 inclusive. The default variance was 1 prior to release 0.7.6.
pt: Quantidade aleatória para adicionar ou subtrair do comprimento dos túneis de saída. Um número positivo x significa adicionar uma quantidade aleatória de 0 a x inclusive. Um número negativo -x significa adicionar uma quantidade aleatória de -x a x inclusive. O roteador limitará o comprimento total do túnel de 0 a 7 inclusive. A variação padrão era 1 antes da versão 0.7.6.
tr: Gidiş tünellerinin uzunluğuna eklenecek veya çıkarılacak rastgele miktar. Pozitif bir sayı x, 0 ile x arasında rastgele bir miktar eklemek anlamına gelir. Negatif bir sayı -x, -x ile x arasında rastgele bir miktar eklemek anlamına gelir. Yöneltici, tünelin toplam uzunluğunu 0 ile 7 (dahil) arasında sınırlar. 0.7.6 sürümünden önce varsayılan varsyans 1 idi.

source: Name of tunnel - generally used in routerconsole, which will use the first few characters of the Base64 hash of the destination by default.
pt: Nome do túnel - geralmente usado no console do roteador, que usará os primeiros caracteres do hash Base64 do destino por padrão.
tr: Tünelin adı. Genellikle varsayılan olarak hedefin Base64 karma değerinin ilk birkaç karakterini kullanacak olan routerconsole değerinde kullanılır.

source: Name of tunnel - generally ignored unless inbound.nickname is unset.
pt: Nome do túnel - geralmente ignorado, a menos que inbound.nickname não esteja definido.
tr: Tünelin adı. inbound.nickname ayarlanmadıkça genellikle yok sayılır.

source: Priority adjustment for outbound messages. Higher is higher priority.
pt: Ajuste de prioridade para mensagens de saída. Quanto maior, maior a prioridade.
tr: Giden iletiler için öncelik ayarlaması. Daha yüksek değer, daha yüksek önceliklidir.

source: Number of tunnels in. Limit was increased from 6 to 16 in release 0.9; however, numbers higher than 6 are incompatible with older releases.
pt: Número de túneis em. O limite foi aumentado de 6 para 16 na versão 0.9; no entanto, números maiores que 6 são incompatíveis com versões mais antigas.
tr: Geliş tüneli sayısı. 0.9 sürümünde sınır 6 yerine 16 yapıldı. Ancak 6 üzerindeki sayılar eski sürümlerle uyumlu değildir.

source: Number of tunnels out
pt: Número de túneis para fora
tr: Gidiş tüneli sayısı

source: Used for consistent peer ordering across restarts.
pt: Usado para ordenação consistente de pares em reinicializações.
tr: Yeniden başlatmalar arasında tutarlı eş sıralaması için kullanılır.

source: Any other options prefixed with "inbound." are stored in the "unknown options" properties of the inbound tunnel pool's settings.
pt: Quaisquer outras opções prefixadas com "inbound" são armazenadas nas propriedades "unknown options" das configurações do pool de túneis de entrada.
tr: Ön eki "inbound" olan diğer seçenekler. geliş tüneli havuzu ayarlarının "bilinmeyen seçenekler" özelliklerinde saklanır.

source: Any other options prefixed with "outbound." are stored in the "unknown options" properties of the outbound tunnel pool's settings.
pt: Quaisquer outras opções prefixadas com "outbound" são armazenadas nas propriedades "opções desconhecidas" das configurações do pool de túneis de saída.
tr: Ön eki "outbound" olan diğer seçenekler. gidiş tüneli havuzu ayarlarının "bilinmeyen seçenekler" özelliklerinde saklanır.

source: Set to false to disable ever bundling a reply LeaseSet. For clients that do not publish their LeaseSet, this option must be true for any reply to be possible. "true" is also recommended for multihomed servers with long connection times.
pt: Defina como falso para desabilitar o agrupamento de um LeaseSet de resposta. Para clientes que não publicam seu LeaseSet, esta opção deve ser verdadeira para que qualquer resposta seja possível. "true" também é recomendado para servidores multihomed com tempos de conexão longos.
tr: Bir yanıt "Kiralama kümesinin" (LeaseSet) paketlenmesini devre dışı bırakmak için false olarak ayarlayın. "Kiralama kümelerini" (LeaseSets) yayınlamayan istemcilerin, herhangi bir yanıt verebilmesi için bu seçeneğin "True" olması gerekir. Ayrıca uzun bağlantı süreleri olan birden çok barındırma sağlayan sunucular için de "True" ayarının kullanılması önerilir.

source: Setting to "false" may save significant outbound bandwidth, especially if the client is configured with a large number of inbound tunnels (Leases). If replies are still required, this may shift the bandwidth burden to the far-end client and the floodfill. There are several cases where "false" may be appropriate:
pt: Definir como "false" pode economizar largura de banda de saída significativa, especialmente se o cliente estiver configurado com um grande número de túneis de entrada (Leases). Se as respostas ainda forem necessárias, isso pode transferir a carga de largura de banda para o cliente remoto e o floodfill. Há vários casos em que "false" pode ser apropriado:
tr: "False" olarak ayarlamak, özellikle istemci çok sayıda geliş tüneli (kiralama) olacak şekilde yapılandırılmışsa, gidiş bant genişliğinden önemli ölçüde kazanım sağlayabilir. Yanıtlar hala gerekliyse, bu, bant genişliği yükünü uzak uçtaki istemciye ve otomatik doldurma işlemine kaydırabilir. "False" ayarının uygun olabileceği birkaç durum vardır:

source: Unidirectional communication, no reply required
pt: Comunicação unidirecional, sem necessidade de resposta
tr: Yanıt gerekmeyen tek yönlü iletişim olması durumunda

source: LeaseSet is published and higher reply latency is acceptable
pt: LeaseSet é publicado e uma latência de resposta mais alta é aceitável
tr: "Kiralama kümesi" (LeaseSet) yayınlandığında ve daha yüksek yanıt gecikmesi kabul edilebildiğinde

source: LeaseSet is published, client is a "server", all connections are inbound so the connecting far-end destination obviously has the leaseset already. Connections are either short, or it is acceptable for latency on a long-lived connection to temporarily increase while the other end re-fetches the LeaseSet after expiration. HTTP servers may fit these requirements.
pt: O LeaseSet é publicado, o cliente é um "servidor", todas as conexões são de entrada então o destino remoto da conexão obviamente já tem o leaseset. As conexões são curtas ou é aceitável que a latência em uma conexão de longa duração aumente temporariamente enquanto a outra extremidade busca novamente o LeaseSet após a expiração. Os servidores HTTP podem atender a esses requisitos.
tr: "Kiralama kümesi" (LeaseSet) yayınlandığında, istemci bir "sunucu" iken, tüm bağlantılar geliştir yani açıkça bağlantı kurulan uzak uç hedefinde "Kiralama kümesi" (LeaseSet) zaten vardır. Bağlantılar ya kısadır ya da uzun ömürlü bir bağlantıdaki gecikmenin geçici olarak artması, diğer ucun süre bitiminden sonra "Kiralama kümesini" yeniden alması kabul edilebilir. HTTP sunucuları bu gereksinimlere uyabilir.

source: Note: Large quantity, length, or variance settings may cause significant performance or reliability problems.
pt: Observação: grandes configurações de quantidade, comprimento ou variação podem causar problemas significativos de desempenho ou confiabilidade.
tr: Not: Büyük miktar, uzunluk veya varyans ayarları önemli başarım veya güvenilirlik sorunlarına neden olabilir.

source: Note: As of release 0.7.7, option names and values must use UTF-8 encoding. This is primarily useful for nicknames. Prior to that release, options with multi-byte characters were corrupted. Since options are encoded in a <a href="%(commonstructures)s#type_Mapping">Mapping</a>, all option names and values are limited to 255 bytes (not characters) maximum.
pt: Observação: a partir da versão 0.7.7, os nomes e valores das opções devem usar a codificação UTF-8. Isso é útil principalmente para apelidos. Antes dessa versão, as opções com caracteres multibyte eram corrompidas. Como as opções são codificadas em um <a href="%(commonstructures)s#type_Mapping">Mapeamento</a>, todos os nomes e valores das opções são limitados a 255 bytes (não caracteres) no máximo.
tr: Not: 0.7.7 sürümünden başlayarak, seçenek adları ve değerleri UTF-8 kodlamasını kullanmalıdır. Bu öncelikle takma adlar için kullanışlıdır. Bu sürümden önce, çok baytlı karakterlere sahip seçenekler bozuktu. Seçenekler bir <a href="%(commonstructures)s#type_Mapping">Eşleme</a> içinde kodlandığından, tüm seçenek adları ve değerleri en fazla 255 bayt (karakter değil) boyutunda olabilir.

source: Client-side Options
pt: Opções do Cliente
tr: İstemci Tarafı Ayarları

source: The following options are interpreted on the client side, and will be interpreted if passed to the I2PSession via the I2PClient.createSession() call. The streaming lib should also pass these options through to I2CP. Other implementations may have different defaults.
pt: As seguintes opções são interpretadas no lado do cliente, e serão interpretadas se passadas para o I2PSession por meio da chamada I2PClient.createSession(). A biblioteca de streaming também deve passar essas opções para o I2CP. Outras implementações podem ter padrões diferentes.
tr: Aşağıdaki seçenekler istemci tarafında yorumlanır ve I2PClient.createSession() çağrısı ile I2PSession üzerine aktarılırsa yorumlanır. Streaming kitaplığı da bu seçenekleri I2CP üzerine iletmelidir. Diğer uygulamaların varsayılanları farklı olabilir.

source: %(num)s minimum
pt: %(num)s mínimo
tr: %(num)s en az

source: (ms) Idle time required (default 30 minutes)
pt: (ms) Tempo ocioso necessário (padrão 30 minutos)
tr: (ms) boşta kalma süresi gereklidir (varsayılan değer 30 dakika)

source: Close I2P session when idle
pt: Fechar sessão I2P quando ocioso
tr: Boştayken I2P oturumu kapatılsın

source: Encrypt the lease
pt: Criptografar o arrendamento
tr: Kiralamayı şifrele

source: Gzip outbound data
pt: Dados de saída Gzip
tr: Gidiş verilerini gzip ile sıkıştır

source: For encrypted leasesets. Base 64 SessionKey (44 characters)
pt: Para leasesets criptografados. Base 64 SessionKey (44 caracteres)
tr: "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) için. Base 64 “Oturum anahtarı” (sessionKey) (44 karakter)

source: Base 64 private keys for encryption. Optionally preceded by the encryption type name or number and ':'. For LS1, only one key is supported, and only "0:" or "ELGAMAL_2048:" is supported, which is the default. As of 0.9.39, for LS2, multiple keys may be comma-separated, and each key must be a different encryption type. I2CP will generate the public key from the private key. Use for persistent leaseset keys across restarts. See proposals 123, 144, and 145. See also i2cp.leaseSetEncType.
pt: Chaves privadas de base 64 para criptografia. Opcionalmente precedido pelo nome ou número do tipo de criptografia e ':'. Para LS1, apenas uma chave é suportada, e apenas "0:" ou "ELGAMAL_2048:" é suportado, que é o padrão. A partir da versão 0.9.39, para LS2, várias chaves podem ser separadas por vírgulas, e cada chave deve ser de um tipo de criptografia diferente. O I2CP gerará a chave pública a partir da chave privada. Use para chaves de leaseset persistentes em reinicializações. Veja as propostas 123, 144 e 145. Veja também i2cp.leaseSetEncType.
tr: Şifreleme için Base 64 kişisel anahtarı. İsteğe bağlı olarak, şifreleme türü adı veya numarası ve ':' ile başlar. LS1 için yalnızca bir anahtar desteklenir ve yalnızca varsayılan olan "0:" veya "ELGAMAL_2048:" desteklenir. 0.9.39 sürümünden başlayarak, LS2 için birden çok anahtar virgül ile ayrılmış olabilir ve her bir anahtarın farklı bir şifreleme türü olması gerekir. I2CP, kişisel anahtardan herkese açık anahtarı üretecektir. Yeniden başlatmalar arasında kalıcı "Kiralama kümesi" (LeaseSet) anahtarları için kullanın. 123, 144 ve 145 numaralı önerilere bakın. Ayrıca i2cp.leaseSetEncType bilgilerine bakabilirsiniz.

source: Base 64 private key for signatures. Optionally preceded by the key type and ':'. DSA_SHA1 is the default. Key type must match the signature type in the destination. I2CP will generate the public key from the private key. Use for persistent leaseset keys across restarts.
pt: Chave privada base 64 para assinaturas. Opcionalmente precedido pelo tipo de chave e ':'. DSA_SHA1 é o padrão. O tipo de chave deve corresponder ao tipo de assinatura no destino. O I2CP gerará a chave pública a partir da chave privada. Use para chaves de leaseset persistentes em reinicializações.
tr: İmzalar için Base 64 kişisel anahtarı. İsteğe bağlı olarak önce anahtar türü ve ':' gelir. DSA_SHA1 varsayılandır. Anahtar türü, hedefteki imza türüyle eşleşmelidir. I2CP, kişisel anahtardan herkese açık anahtarı üretecektir. Yeniden başlatmalar arasında kalıcı "Kiralama kümesi" (LeaseSet) anahtarları için kullanın.

source: Guaranteed is disabled; None implemented in 0.8.1; None is the default as of 0.9.4
pt: Garantido está desabilitado; Nenhum implementado em 0.8.1; Nenhum é o padrão a partir de 0.9.4
tr: Guaranteed devre dışıdır; 0.8.1 sürümünde None eklenmiştir. 0.9.4 sürümünde None varsayılan değer olmuştur.

source: (ms) Idle time required (default 20 minutes, minimum 5 minutes)
pt: (ms) Tempo ocioso necessário (padrão 20 minutos, mínimo 5 minutos)
tr: (ms) boşta kalma süresi gereklidir (varsayılan değer 20 dakika, en az 5 dakika)

source: Reduce tunnel quantity when idle
pt: Reduzir a quantidade de túneis quando inativo
tr: Boştayken tünel sayısı azaltılsın

source: Tunnel quantity when reduced (applies to both inbound and outbound)
pt: Quantidade de túneis quando reduzida (aplica-se tanto à entrada quanto à saída)
tr: Tünel sayısı azaltıldığında (hem geliş hem de gidiş için geçerlidir)

source: Connect to the router using SSL. If the client is running in the same JVM as a router, this option is ignored, and the client connects to that router internally.
pt: Conecte-se ao roteador usando SSL. Se o cliente estiver sendo executado na mesma JVM que um roteador, esta opção será ignorada e o cliente se conectará a esse roteador internamente.
tr: Yönelticiye SSL kullanarak bağlanın. İstemci bir yöneltici ile aynı JVM üzerinde çalışıyorsa bu seçenek yok sayılır ve istemci bu yönelticiye içeriden bağlanır.

source: Router hostname. If the client is running in the same JVM as a router, this option is ignored, and the client connects to that router internally.
pt: Nome do host do roteador. Se o cliente estiver sendo executado na mesma JVM que um roteador, esta opção será ignorada e o cliente se conectará a esse roteador internamente.
tr: Yöneltici sunucu adı. İstemci bir yöneltici ile aynı JVM üzerinde çalışıyorsa bu seçenek yok sayılır ve istemci bu yönelticiye içeriden bağlanır.

source: Router I2CP port. If the client is running in the same JVM as a router, this option is ignored, and the client connects to that router internally.
pt: Porta I2CP do roteador. Se o cliente estiver sendo executado na mesma JVM que um roteador, esta opção será ignorada e o cliente se conectará a esse roteador internamente.
tr: Yöneltici I2CP bağlantı noktası. İstemci bir yöneltici ile aynı JVM üzerinde çalışıyorsa bu seçenek yok sayılır ve istemci bu yönelticiye içeriden bağlanır.

source: Note: All arguments, including numbers, are strings. True/false values are case-insensitive strings. Anything other than case-insensitive "true" is interpreted as false. All option names are case-sensitive.
pt: Nota: Todos os argumentos, incluindo números, são strings. Valores true/false são strings que não diferenciam maiúsculas de minúsculas. Qualquer coisa diferente de "true" que não diferencia maiúsculas de minúsculas é interpretada como false. Todos os nomes de opções diferenciam maiúsculas de minúsculas.
tr: Not: Sayılarla birlikte tüm bağımsız değişkenler dizgedir. True/false değerleri, büyük/küçük harfe duyarlı olmayan dizgelerdir. Büyük/küçük harfe duyarlı olmayan "true" dışındaki her şey false olarak yorumlanır. Tüm seçenek adları büyük/küçük harfe duyarlıdır.

source: I2CP Payload Data Format and Multiplexing
pt: Formato de dados de carga útil I2CP e multiplexação
tr: I2CP Yük Verileri Biçimi ve Çoklama

source: The end-to-end messages handled by I2CP (i.e. the data sent by the client in a <a href="%(i2cp)s#msg_SendMessage">SendMessageMessage</a> and received by the client in a <a href="%(i2cp)s#msg_MessagePayload">MessagePayloadMessage</a>) are gzipped with a standard 10-byte gzip header beginning with 0x1F 0x8B 0x08 as specified by <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>. As of release 0.7.1, I2P uses ignored portions of the gzip header to include protocol, from-port, and to-port information, thus supporting streaming and datagrams on the same destination, and allowing query/response using datagrams to work reliably in the presence of multiple channels.
pt: As mensagens de ponta a ponta manipuladas pelo I2CP (ou seja, os dados enviados pelo cliente em um <a href="%(i2cp)s#msg_SendMessage">SendMessageMessage</a> e recebidos pelo cliente em um <a href="%(i2cp)s#msg_MessagePayload">MessagePayloadMessage</a>) são compactadas com um cabeçalho gzip padrão de 10 bytes começando com 0x1F 0x8B 0x08 como especificado por <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>. A partir da versão 0.7.1, o I2P usa partes ignoradas do cabeçalho gzip para incluir informações de protocolo , porta de origem e porta de destino, suportando assim streaming e datagramas no mesmo destino e permitindo que consultas/respostas usando datagramas funcionem de forma confiável na presença de múltiplos canais.
tr: I2CP tarafından işlenen uçtan uca iletiler (yani, istemci tarafından <a href="%(i2cp)s#msg_SendMessage">SendMessageMessage</a> ile gönderilen ve istemci tarafından <a href="%(i2cp)s#msg_MessagePayload">MessagePayloadMessage</a> ile alınan veriler), <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a> tarafından belirtildiği gibi 0x1F 0x8B 0x08 ile başlayan standart bir 10 baytlık gzip üst bilgisi ile gzip olarak paketlenir) . 0.7.1 sürümünden başlayarak, I2P, iletişim kuralı, başlangıç bağlantı noktası ve bitiş bağlantı noktası bilgilerini katmak için gzip üst bilgilerinin yok sayılan kısımlarını kullanır. Böylece aynı hedef üzerinde akış ve veri birimlerini destekler ve veri birimlerinin güvenilir bir şekilde çalışması için birden fazla kanalın var olduğu durumlarda soru/yanıt kullanımına izin verir.

source: The gzip function cannot be completely turned off, however setting i2cp.gzip=false turns the gzip effort setting to 0, which may save a little CPU.
pt: A função gzip não pode ser completamente desativada, no entanto, definir i2cp.gzip=false transforma a configuração de esforço do gzip em 0, o que pode economizar um pouco de CPU.
tr: gzip işlevi tamamen kapatılamaz. Ancak i2cp.gzip=false ayarı, gzip efor ayarını 0 değerine döndürür, bu da biraz işlemci kazanımı sağlayabilir.

source: Bytes
tr: Bayt

source: Content
pt: Conteúdo
tr: İçerik

source: Gzip header
pt: Cabeçalho Gzip
tr: Gzip üst bilgisi

source: Gzip flags
pt: Bandeiras Gzip
tr: Gzip işaretleri

source: I2P Source port (Gzip mtime)
pt: Porta de origem I2P (Gzip mtime)
tr: I2P kaynak bağlantı noktası (gzip mtime)

source: I2P Destination port (Gzip mtime)
pt: Porta de Destino I2P (Gzip mtime)
tr: I2P hedefi bağlantı noktası (gzip mtime)

source: I2P Protocol (6 = Streaming, 17 = Datagram, 18 = Raw Datagrams) (Gzip OS)
pt: Protocolo I2P (6 = Streaming, 17 = Datagrama, 18 = Datagramas brutos) (Gzip OS)
tr: I2P İletişim Kuralı (6 = Streaming, 17 = Veri şeması, 18 = Ham veri şemaları) (Gzip OS)
