Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: While I2P is currently functional and sufficient for many scenarios, there are several areas which require further improvement to meet the needs of those facing more powerful adversaries as well as substantial user experience optimization.
pt: Embora o I2P esteja atualmente funcional e seja suficiente para muitos cenários, há diversas áreas que exigem mais melhorias para atender às necessidades daqueles que enfrentam adversários mais poderosos, bem como uma otimização substancial da experiência do usuário.
tr: I2P şu anda birçok senaryo için işlevsel ve yeterli olsa da, daha güçlü rakiplerle karşılaşanların gereksinimleri için daha fazla iyileştirme ve önemli kullanıcı deneyimi iyileştirmesi gereken birkaç alan var.

source: Restricted route operation
pt: Operação de rota restrita
tr: Kısıtlanmış yöneltme işlemi

source: I2P is an overlay network designed to be run on top of a functional packet switched network, exploiting the end to end principle to offer anonymity and security. While the Internet no longer fully embraces the end to end principle (due to the usage of NAT), I2P does require a substantial portion of the network to be reachable - there may be a number of peers along the edges running using restricted routes, but I2P does not include an appropriate routing algorithm for the degenerate case where most peers are unreachable. It would, however work on top of a network employing such an algorithm.
pt: I2P é uma rede de sobreposição projetada para ser executada em cima de um pacote funcional rede comutada, explorando o princípio de ponta a ponta para oferecer anonimato e segurança. Enquanto a Internet não abraça mais completamente o princípio de ponta a ponta (devido ao uso de NAT), I2P requer que uma porção substancial da rede seja alcançável - pode haver um número de pares ao longo das bordas executando usando rotas restritas, mas I2P não inclui um algoritmo de roteamento apropriado para o caso degenerado onde a maioria dos pares são inalcançáveis. No entanto, funcionaria em cima de uma rede empregando tal algoritmo.
tr: I2P, anonimlik ve güvenlik sunmak için uçtan uca ilkesinden yararlanan, işlevsel bir paket anahtarlamalı ağın üzerinde çalıştırılmak üzere tasarlanmış bir kaplama ağıdır. İnternet artık uçtan uca ilkesini (NAT kullanımı nedeniyle) tam olarak benimsemese de, I2P ağının erişilebilir olması için ağın önemli bir bölümünün uçtan uca olması gerekir. Kenarlarda kısıtlanmış rotalar kullanarak çalışan birkaç eş olabilir. Ancak I2P, çoğu eşin erişilemediği bozulmuş durum için uygun bir yöneltme algoritması sunmaz Bununla birlikte, böyle bir algoritmayı kullanan bir ağ üzerinde çalışacaktır.

source: Restricted route operation, where there are limits to what peers are reachable directly, has several different functional and anonymity implications, dependent upon how the restricted routes are handled. At the most basic level, restricted routes exist when a peer is behind a NAT or firewall which does not allow inbound connections. This was largely addressed in I2P 0.6.0.6 by integrating distributed hole punching into the transport layer, allowing people behind most NATs and firewalls to receive unsolicited connections without any configuration. However, this does not limit the exposure of the peer's IP address to routers inside the network, as they can simply get introduced to the peer through the published introducer.
pt: A operação de rota restrita, onde há limites para quais pares são alcançáveis diretamente, tem várias implicações funcionais e de anonimato diferentes, dependentes de como as rotas restritas são tratadas. No nível mais básico, rotas restritas existem quando um par está atrás de um NAT ou firewall que não permite conexões de entrada. Isso foi amplamente abordado no I2P 0.6.0.6 integrando perfuração distribuída na camada de transporte, permitindo que pessoas atrás da maioria dos NATs e firewalls recebam conexões não solicitadas sem nenhuma configuração. No entanto, isso não limita a exposição do endereço IP do par a roteadores dentro da rede, pois eles podem simplesmente ser introduzidos ao par por meio do introdutor publicado.
tr: Eşlerin doğrudan erişilebileceği sınırların olduğu kısıtlanmış yöneltme işlemi, kısıtlanmış yöneltmelerin nasıl işlendiğine bağlı olarak birkaç farklı işlevsellik ve anonimlik çıkarımına sahiptir. En temel düzeyde, bir eş, geliş bağlantılarına izin vermeyen bir NAT veya güvenlik duvarının arkasında olduğunda kısıtlanmış rotalar vardır. Bu sorun, I2P 0.6.0.6 sürümünde taşıyıcı katmanına dağıtılmış delik açma özelliği eklenerek büyük ölçüde çözüldü ve çoğu NAT ve güvenlik duvarı arkasındaki kişilerin herhangi bir yapılandırma olmadan ve ayrı bir istek yapmadan bağlantılar alması sağlandı. Ancak bu, eşin IP adresinin ağ içindeki yönelticiler tarafından görülmesini engellemez, çünkü bunlar yayınlanmış tanıtıcı üzerinden eşe duyurulabilir.

source: Beyond the functional handling of restricted routes, there are two levels of restricted operation that can be used to limit the exposure of one's IP address - using router-specific tunnels for communication, and offering 'client routers'. For the former, routers can either build a new pool of tunnels or reuse their exploratory pool, publishing the inbound gateways to some of them as part of their routerInfo in place of their transport addresses. When a peer wants to get in touch with them, they see those tunnel gateways in the netDb and simply send the relevant message to them through one of the published tunnels. If the peer behind the restricted route wants to reply, it may do so either directly (if they are willing to expose their IP to the peer) or indirectly through their outbound tunnels. When the routers that the peer has direct connections to want to reach it (to forward tunnel messages, for instance), they simply prioritize their direct connection over the published tunnel gateway. The concept of 'client routers' simply extends the restricted route by not publishing any router addresses. Such a router would not even need to publish their routerInfo in the netDb, merely providing their self signed routerInfo to the peers that it contacts (necessary to pass the router's public keys). Both levels of restricted route operation are planned for I2P 2.0.
pt: Além do tratamento funcional de rotas restritas, há dois níveis de operação restrita que podem ser usados para limitar a exposição do endereço IP de alguém - usando túneis específicos do roteador para comunicação e oferecendo 'roteadores cliente'. Para o primeiro, os roteadores podem construir um novo conjunto de túneis ou reutilizar seu conjunto exploratório, publicando os gateways de entrada para alguns deles como parte de seu routerInfo no lugar de seus endereços de transporte. Quando um peer quer entrar em contato com eles, eles veem esses gateways de túnel no netDb e simplesmente enviam a mensagem relevante para eles por meio de um dos túneis publicados. Se o peer por trás da rota restrita quiser responder, ele pode fazer isso diretamente (se estiver disposto a expor seu IP ao peer) ou indiretamente por meio de seus túneis de saída. Quando os roteadores com os quais o peer tem conexões diretas desejam alcançá-lo (para encaminhar mensagens de túnel, por exemplo), eles simplesmente priorizam sua conexão direta sobre o gateway de túnel publicado. O conceito de 'roteadores clientes' simplesmente estende a rota restrita ao não publicar nenhum endereço de roteador. Esse roteador nem precisaria publicar seu routerInfo no netDb, apenas fornecendo seu routerInfo autoassinado aos peers que ele contata (necessário para passar as chaves públicas do roteador). Ambos os níveis de operação de rota restrita estão planejados para I2P 2.0.
tr: Kısıtlanmış rotaların işlevsel olarak ele alınmasının ötesinde, kişinin IP adresinin açığa çıkmasını engellemek için kullanılabilecek iki sınırlı işlem düzeyi vardır - İletişim için yönelticiye özel tüneller kullanmak ve "istemci yönelticileri" sunmak. İlki için, yönelticiler yeni bir tünel havuzu oluşturabilir ya da keşif havuzlarını yeniden kullanabilir. Geliş ağ geçitlerini bazılarına taşıyıcı adresleri yerine "Yöneltici bilgilerinin" (RouterInfo) bir parçası olarak yayınlayabilir. Bir eş onlarla iletişim kurmak istediğinde, "Ağ veri tabanında" (NetDB) bu tünel ağ geçitlerini görür ve ilgili iletiyi yayınlanan tünellerden biri üzerinden onlara gönderir. Kısıtlanmış yöneltmenin arkasındaki eş yanıt vermek isterse, bunu doğrudan (IP adreslerini eşe göstermeye istekliyse) veya dolaylı olarak gidiş tünelleri üzerinden yapabilir. Eşin doğrudan bağlantısı olan yönelticiler kendisine ulaşmak (örneğin tünel iletilerini iletmek için) istediklerinde, doğrudan bağlantılarına yayınlanan tünel ağ geçidi üzerinden öncelik verirler. "İstemci yönelticileri" kavramı, herhangi bir yöneltici adresi yayınlamayarak kısıtlanmış yöneltmeyi genişletir. Böyle bir yönelticinin yöneltici bilgilerini ağ veri tabanında yayınlamasına bile gerek kalmaz. Yalnızca kendi imzalı yöneltici bilgilerini bağlantı kurduğu eşlere sağlar (yönelticinin herkese açık anahtarlarını iletmek için gereklidir). I2P 2.0 için her iki kısıtlı yöneltme işlemi düzeyinin de kullanılması planlanmıştır.

source: There are tradeoffs for those behind restricted routes, as they would likely participate in other people's tunnels less frequently, and the routers which they are connected to would be able to infer traffic patterns that would not otherwise be exposed. On the other hand, if the cost of that exposure is less than the cost of an IP being made available, it may be worthwhile. This, of course, assumes that the peers that the router behind a restricted route contacts are not hostile - either the network is large enough that the probability of using a hostile peer to get connected is small enough, or trusted (and perhaps temporary) peers are used instead.
pt: Existem compensações para aqueles que estão atrás de rotas restritas, pois eles provavelmente participarão menos frequentemente dos túneis de outras pessoas, e os roteadores aos quais estão conectados poderão inferir padrões de tráfego que não estariam expostos de outra forma. Por outro lado, se o custo dessa exposição for menor do que o custo de um IP ser disponibilizado, pode valer a pena. Isso, é claro, assume que os pares com os quais o roteador atrás de uma rota restrita entra em contato não são hostis - ou a rede é grande o suficiente para que a probabilidade de usar um par hostil para se conectar seja pequena o suficiente, ou pares confiáveis (e talvez temporários) são usados em vez disso.
tr: Kısıtlanmış rotaların ardında bulunanlar için, büyük olasılıkla diğer insanların tünellerine daha az katkıda bulunacakları ve bağlı oldukları yönelticiler, aksi durumda açığa çıkmayacak trafik kalıplarını çıkarabilecekleri için uzlaşmalar vardır. Öte yandan, bu uzlaşmanın maliyeti, bir IP adresinin kullanıma sunulmasının maliyetinden daha düşükse, buna değebilir. Bu, elbette, yönelticinin kısıtlı bir yöneltme temasının arkasındaki eşlerin düşman olmadığını varsayar. Ya ağ çok büyük olduğundan, düşman bir eşe bağlanma olasılığı çok küçüktür ya da güvenilir (ve belki de geçici) eşler kullanılır.

source: Variable latency
pt: Latência variável
tr: Değişken gecikme

source: Even though the bulk of I2P's initial efforts have been on low latency communication, it was designed with variable latency services in mind from the beginning. At the most basic level, applications running on top of I2P can offer the anonymity of medium and high latency communication while still blending their traffic patterns in with low latency traffic. Internally though, I2P can offer its own medium and high latency communication through the garlic encryption - specifying that the message should be sent after a certain delay, at a certain time, after a certain number of messages have passed, or another mix strategy. With the layered encryption, only the router that the clove exposed the delay request would know that the message requires high latency, allowing the traffic to blend in further with the low latency traffic. Once the transmission precondition is met, the router holding on to the clove (which itself would likely be a garlic message) simply forwards it as requested - to a router, to a tunnel, or, most likely, to a remote client destination.
pt: Embora a maior parte dos esforços iniciais do I2P tenham sido em comunicação de baixa latência, ele foi projetado com serviços de latência variável em mente desde o início. No nível mais básico, os aplicativos executados no topo do I2P podem oferecer o anonimato da comunicação de latência média e alta, ao mesmo tempo em que misturam seus padrões de tráfego com tráfego de baixa latência. Internamente, porém, o I2P pode oferecer sua própria comunicação de latência média e alta por meio da criptografia garlic - especificando que a mensagem deve ser enviada após um certo atraso, em um certo tempo, após um certo número de mensagens terem passado ou outra estratégia de mistura. Com a criptografia em camadas, apenas o roteador que o cravo expôs a solicitação de atraso saberia que a mensagem requer alta latência, permitindo que o tráfego se misture ainda mais com o tráfego de baixa latência. Uma vez que a pré-condição de transmissão é atendida, o roteador que mantém o cravo (que provavelmente seria uma mensagem de alho) simplesmente o encaminha conforme solicitado - para um roteador, para um túnel, ou, mais provavelmente, para um destino de cliente remoto.
tr: Başlangıçtaki I2P çabalarının çoğu düşük gecikmeli iletişim üzerine olsa da, tasarım başından beri değişken gecikmeli hizmetler düşünülerek yapıldı. En temel düzeyde, I2P üzerinde çalışan uygulamalar, trafik kalıplarını düşük gecikmeli trafikle harmanlarken orta ve yüksek gecikmeli iletişimin anonimliğini sunabilir. I2P içinde garlic şifrelemesi yoluyla kendi orta ve yüksek gecikmeli iletişimini sunabilir. İleti belirli bir gecikmeden sonra, belirli bir zamanda, belirli sayıda iletiden sonra ya da başka bir karma strateji ile gönderilebilir. Katmanlı şifrelemeyle, yöneltici yalnızca gecikme isteğini açıklayan dişin yüksek gecikme süresi gerektirdiğini bilir ve bu da trafiğin düşük gecikmeli trafikle daha fazla karışmasını sağlar. İletim ön koşulu karşılandıktan sonra, yöneltici dişi (kendisi büyük olasılıkla bir garlic iletisidir) istendiği gibi bir yönelticiye bir tünele ya da büyük olasılıkla uzak bir istemci hedefine gönderir.

source: There are a substantial number of ways to exploit this capacity for high latency comm in I2P, but for the moment, doing so has been scheduled for the I2P 3.0 release. In the meantime, those requiring the anonymity that high latency comm can offer should look towards the application layer to provide it.
pt: Há um número substancial de maneiras de explorar essa capacidade para comunicação de alta latência em I2P, mas, por enquanto, isso foi agendado para o lançamento I2P 3.0. Enquanto isso, aqueles que exigem o anonimato que a comunicação de alta latência pode oferecer devem olhar para a camada de aplicação para fornecê-lo .
tr: I2P üzerinde yüksek gecikmeli iletişim için bu kapasiteden yararlanmanın çok sayıda yolu vardır. Ancak şu anda bunun I2P 3.0 sürümünde yapılması planlanmıştır. O zamana kadar, yüksek gecikmeli iletişimin sunabileceği anonimliğe gerek duyanlar, bunu sağlamak için uygulama katmanına bakmalıdır.

source: Open questions
pt: Questões em aberto
tr: Açık sorular

source: How to get rid of the timing constraint?
pt: Como se livrar da restrição de tempo?
tr: Zamanlama kısıtlamasından nasıl kurtulunur?

source: Can we deal with the sessionTags more efficiently?
pt: Podemos lidar com as sessionTags de forma mais eficiente?
tr: Daha etkin bir sessionTags işlemesi sağlayabilir miyiz?

source: What, if any, batching/mixing strategies should be made available on the tunnels?
pt: Quais estratégias de mistura/agrupamento, se houver, devem ser disponibilizadas nos túneis?
tr: Tüneller için herhangi bir toplu işlem ya da karma stratejisi oluşturmalı mıyız?

source: What other tunnel peer selection and ordering strategies should be available?
pt: Quais outras estratégias de seleção e ordenação de pares de túnel devem estar disponíveis?
tr: Başka tünel eş seçimi ve sıralama stratejileri neler olabilir?

source: Similar systems
pt: Sistemas similares
tr: Benzer sistemler

source: I2P's architecture builds on the concepts of message oriented middleware, the topology of DHTs, the anonymity and cryptography of free route mixnets, and the adaptability of packet switched networking. The value comes not from novel concepts of algorithms though, but from careful engineering combining the research results of existing systems and papers. While there are a few similar efforts worth reviewing, both for technical and functional comparisons, two in particular are pulled out here - Tor and Freenet.
pt: A arquitetura do I2P se baseia nos conceitos de middleware orientado a mensagens, a topologia de DHTs, o anonimato e criptografia de mixnets de rota livre, e a adaptabilidade de redes comutadas por pacotes. O valor não vem de novos conceitos de algoritmos, mas de uma engenharia cuidadosa combinando os resultados de pesquisa de sistemas e artigos existentes. Embora existam alguns esforços semelhantes que valem a pena revisar, tanto para comparações técnicas quanto funcionais, dois em particular são retirados aqui - Tor e Freenet.
tr: I2P mimarisi, ileti odaklı ara yazılım kavramları, "Dağıtılmış karma tablosu" (DHT) topolojisi, serbest rota karma ağlarının anonimliği ve şifrelemesi ile paket anahtarlamalı ağların uyarlanabilirliği üzerine kuruludur. Değeri, yeni algoritma kavramlarından değil, var olan sistemlerin ve makalelerin araştırma sonuçlarını birleştiren dikkatli mühendislikten gelir. Hem teknik hem de işlevsel karşılaştırmalar için incelemeye değer birkaç benzer çaba olsa da, özellikle iki tanesi öne çıkarıldı - Tor ve Freenet.

source: See also the <a href="%(comparisons)s">Network Comparisons Page</a>.
pt: Veja também a página de comparações de redes <a href="%(comparisons)s"></a>.
tr: <a href="%(comparisons)s">Ağ karşılaştırmaları sayfasına</a> da bakın.

source: website
tr: site

source: At first glance, Tor and I2P have many functional and anonymity related similarities. While I2P's development began before we were aware of the early stage efforts on Tor, many of the lessons of the original onion routing and ZKS efforts were integrated into I2P's design. Rather than building an essentially trusted, centralized system with directory servers, I2P has a self organizing network database with each peer taking on the responsibility of profiling other routers to determine how best to exploit available resources. Another key difference is that while both I2P and Tor use layered and ordered paths (tunnels and circuits/streams), I2P is fundamentally a packet switched network, while Tor is fundamentally a circuit switched one, allowing I2P to transparently route around congestion or other network failures, operate redundant pathways, and load balance the data across available resources. While Tor offers the useful outproxy functionality by offering integrated outproxy discovery and selection, I2P leaves such application layer decisions up to applications running on top of I2P - in fact, I2P has even externalized the TCP-like streaming library itself to the application layer, allowing developers to experiment with different strategies, exploiting their domain specific knowledge to offer better performance.
pt: À primeira vista, Tor e I2P têm muitas similaridades funcionais e relacionadas ao anonimato . Embora o desenvolvimento do I2P tenha começado antes de estarmos cientes dos esforços iniciais do estágio no Tor, muitas das lições do roteamento onion original e dos esforços do ZKS foram integradas ao design do I2P. Em vez de construir um sistema essencialmente confiável e centralizado com servidores de diretório, o I2P tem um banco de dados de rede auto-organizado com cada par assumindo a responsabilidade de criar perfis de outros roteadores para determinar a melhor forma de explorar os recursos disponíveis. Outra diferença fundamental é que, enquanto I2P e Tor usam caminhos em camadas e ordenados (túneis e circuitos/fluxos), I2P é fundamentalmente uma rede comutada por pacotes, enquanto Tor é fundamentalmente uma rede comutada por circuitos, permitindo que I2P roteie de forma transparente em torno de congestionamentos ou outras falhas de rede, opere caminhos redundantes e balanceie a carga dos dados entre os recursos disponíveis. Enquanto o Tor oferece a funcionalidade outproxy útil ao oferecer descoberta outproxy integrada e seleção, o I2P deixa essas decisões da camada de aplicação para os aplicativos executados sobre o I2P - na verdade, o I2P até externalizou a própria biblioteca de streaming semelhante ao TCP para a camada de aplicação, permitindo que os desenvolvedores experimentem diferentes estratégias, explorando seu conhecimento específico de domínio para oferecer melhor desempenho.
tr: İlk bakışta Tor ve I2P, işlevsellik ve anonimlikle ilgili oldukça benzerdir. I2P gelişimi, Tor üzerindeki erken aşama çabalarını bilmeden önce başlamış olsa da, özgün onion yöneltme ve ZKS çabalarından alınan derslerin çoğu I2P tasarımı ile bütünleştirildi. Dizin sunucuları ile temelde güvenilir, merkezi bir sistem oluşturmak yerine, I2P, var olan kaynaklardan en iyi şekilde nasıl yararlanılacağını belirlemek için her bir eşin diğer yönelticilerin profilini çıkarma sorumluluğunu üstlendiği kendi kendini düzenleyen bir ağ veri tabanı kullanır. Diğer önemli bir fark, hem I2P hem de Tor katmanlı ve sıralı yollar (tüneller ve devreler/akışlar) kullanmasına rağmen, I2P temelde paket anahtarlamalı bir ağ iken, Tor ağının temelde devre anahtarlamalı olması nedeniyle I2P ağı, sorunlar ve yedekli yolları kullanarak verileri var olan kaynaklar arasında dengeler ve tıkanıklık veya diğer ağlar etrafından şeffaf bir şekilde yöneltme sağlar. Tor, bütünleşik çıkış vekil sunucusu keşfi ve seçimi sunarak faydalı çıkış vekil sunucu işlevselliği sunarken, I2P, bu tür uygulama katmanı kararlarını I2P üzerinde çalışan uygulamalara bırakır. Aslında I2P, geliştiricilere daha iyi başarım sunmak için kendi etki alanına özgü bilgilerinden yararlanarak farklı stratejiler denemeleri için TCP benzeri akış kitaplığını uygulama katmanı dışına açtı.
