Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: The choice of specific peers to pass on messages as well as their particular ordering is important to understanding both I2P's anonymity and performance characteristics. While the network database (below) has its own criteria for picking what peers to query and store entries on, tunnel creators may use any peers in the network in any order (and even any number of times) in a single tunnel. If perfect latency and capacity data were globally known, selection and ordering would be driven by the particular needs of the client in tandem with their threat model. Unfortunately, latency and capacity data is not trivial to gather anonymously, and depending upon untrusted peers to provide this information has its own serious anonymity implications.
pt: A escolha de pares específicos para passar mensagens, bem como sua ordenação particular, é importante para entender tanto o anonimato quanto as características de desempenho do I2P. Enquanto o banco de dados da rede (abaixo) tem seus próprios critérios para escolher quais pares consultar e armazenar entradas, os criadores de túneis podem usar quaisquer pares na rede em qualquer ordem (e até mesmo qualquer número de vezes) em um único túnel. Se dados de latência e capacidade perfeitos fossem conhecidos globalmente, a seleção e a ordenação seriam conduzidas pelas necessidades particulares do cliente em conjunto com seu modelo de ameaça. Infelizmente, não é fácil coletar dados de latência e capacidade anonimamente, e depender de pares não confiáveis para fornecer essas informações tem suas próprias implicações sérias de anonimato.
tr: İletileri iletmek için belirli eşlerin seçilmesi ve bunların özel sıralaması, hem I2P anonimliğini hem de başarım özelliklerini anlamak için önemlidir. Ağ veri tabanının (aşağıda) hangi eşlerin sorgulanıp kayıtları depolayacağını seçmek için kendi ölçütleri olsa da, tünel oluşturucular ağdaki herhangi bir eşi herhangi bir sırayla (ve hatta herhangi bir sayıda) tek bir tünelde kullanabilir. Mükemmel gecikme ve kapasite verileri küresel olarak biliniyor olsaydı, seçim ve sıralama, istemci tehdit modelleri ve belirli gereksinimleri tarafından yönlendirilirdi. Ne yazık ki, gecikme ve kapasite verilerinin anonim olarak toplanması önemsiz değildir ve bu bilgileri sağlamak için güvenilmeyen eşlere bağlı olmanın anonimlik üzerinde ciddi etkileri vardır.

source: From an anonymity perspective, the simplest technique would be to pick peers randomly from the entire network, order them randomly and use those peers in that order for all eternity. From a performance perspective, the simplest technique would be to pick the fastest peers with the necessary spare capacity, spreading the load across different peers to handle transparent failover, and to rebuild the tunnel whenever capacity information changes. While the former is both brittle and inefficient, the later requires inaccessible information and offers insufficient anonymity. I2P is instead working on offering a range of peer selection strategies, coupled with anonymity aware measurement code to organize the peers by their profiles.
pt: De uma perspectiva de anonimato, a técnica mais simples seria escolher pares aleatoriamente de toda a rede, ordená-los aleatoriamente e usar esses pares nessa ordem por toda a eternidade. De uma perspectiva de desempenho, a técnica mais simples seria escolher os pares mais rápidos com a capacidade extra necessária, distribuir a carga entre diferentes pares para lidar com failover transparente, e reconstruir o túnel sempre que as informações de capacidade mudarem. Enquanto o primeiro é frágil e ineficiente, o último requer informações inacessíveis e oferece anonimato insuficiente. O I2P está trabalhando para oferecer uma gama de estratégias de seleção de pares, juntamente com o código de medição com reconhecimento de anonimato para organizar os pares por seus perfis.
tr: Anonimlik açısından en basit yöntem, tüm ağdan rastgele eşler seçmek, bunları rastgele sıralamak ve bu eşleri sonsuza kadar bu sırayla kullanmak olur. Başarım açısından bakıldığında, en basit yöntem, gerekli yedek kapasiteye sahip en hızlı eşleri seçmek, yükü şeffaf olarak devretmek için yükü farklı eşler arasında dağıtmak ve kapasite bilgileri değiştiğinde tüneli yeniden oluşturmak olur. İlki hem kırılgan hem de verimsiz iken, ikincisi için erişilemez bilgiler gerekir ve yetersiz anonimlik sunar. Bunun yerine I2P, eşleri profillerine göre düzenlemek için anonimlik farkında ölçüm koduyla birleştirilmiş bir dizi eş seçim stratejisi sunmaya çalışır.

source: As a base, I2P is constantly profiling the peers with which it interacts with by measuring their indirect behavior - for instance, when a peer responds to a netDb lookup in 1.3 seconds, that round trip latency is recorded in the profiles for all of the routers involved in the two tunnels (inbound and outbound) through which the request and response passed, as well as the queried peer's profile. Direct measurement, such as transport layer latency or congestion, is not used as part of the profile, as it can be manipulated and associated with the measuring router, exposing them to trivial attacks. While gathering these profiles, a series of calculations are run on each to summarize its performance - its latency, capacity to handle lots of activity, whether they are currently overloaded, and how well integrated into the network they seem to be. These calculations are then compared for active peers to organize the routers into four tiers - fast and high capacity, high capacity, not failing, and failing. The thresholds for those tiers are determined dynamically, and while they currently use fairly simple algorithms, alternatives exist.
pt: Como base, o I2P está constantemente criando perfis dos pares com os quais interage medindo seu comportamento indireto - por exemplo, quando um par responde a uma pesquisa netDb em 1,3 segundos, essa latência de ida e volta é registrada nos perfis para todos os roteadores envolvidos nos dois túneis (entrada e saída) pelos quais a solicitação e a resposta passaram, bem como no perfil do par consultado. A medição direta, como latência ou congestionamento da camada de transporte, não é usada como parte do perfil, pois pode ser manipulada e associada ao roteador de medição, expondo-os a ataques triviais. Ao reunir esses perfis, uma série de cálculos é executada em cada um para resumir seu desempenho - sua latência, capacidade de lidar com muita atividade, se eles estão sobrecarregados no momento e quão bem integrados à rede eles parecem estar. Esses cálculos são então comparados para pares ativos para organizar os roteadores em quatro níveis - rápido e alta capacidade, alta capacidade, sem falha, e falhando. Os limites para esses níveis são determinados dinamicamente e embora eles atualmente usem algoritmos bastante simples, existem alternativas.
tr: Temel olarak, I2P etkileşimde bulunduğu eşlerin dolaylı davranışlarını sürekli olarak ölçerek profillerini oluşturur. Örneğin, bir eş 1,3 saniyede bir "Ağ veri tabanı" (NetDB) aramasına yanıt verdiğinde, bu gidiş dönüş gecikmesi tüm yönelticilerin profillerine kaydedilerek, İstek ve yanıtın geçtiği iki tünelde (geliş ve gidiş) ve sorgulanan eşin profilinde yer alır. Taşıma katmanı gecikmesi veya tıkanıklık gibi doğrudan ölçümler, manipüle edilebildiği ve ölçüm yönelticisi ile ilişkilendirilebileceğinden ve onları önemsiz saldırılara açık bırakabileceğinden profilin bir parçası olarak kullanılmaz. Bu profiller toplanırken, başarımını, gecikmesini, çok sayıda etkinliği işleme kapasitesini, şu anda aşırı yüklü olup olmadığını ve ağ ile ne kadar bütünleşmiş olduğunu özetlemek için her biri üzerinde bir dizi hesaplama yapılır. Daha sonra bu hesaplamalar, yönelticileri hızlı ve yüksek kapasiteli, yüksek kapasiteli, sorunsuz ve sorunlu olmak üzere dört düzeyde gruplamak için etkin eşleri karşılaştırmakta kullanılır. Bu düzeylerin eşikleri devingen olarak belirlenir ve şu anda oldukça basit algoritmalar kullanır. Ancak alternatifleri de vardır.

source: Using this profile data, the simplest reasonable peer selection strategy is to pick peers randomly from the top tier (fast and high capacity), and this is currently deployed for client tunnels. Exploratory tunnels (used for netDb and tunnel management) pick peers randomly from the "not failing" tier (which includes routers in 'better' tiers as well), allowing the peer to sample routers more widely, in effect optimizing the peer selection through randomized <a href="https://en.wikipedia.org/wiki/Hill_climbing">hill climbing</a>. These strategies alone do however leak information regarding the peers in the router's top tier through predecessor and netDb harvesting attacks. In turn, several alternatives exist which, while not balancing the load as evenly, will address the attacks mounted by particular classes of adversaries.
pt: Usando esses dados de perfil, a estratégia de seleção de pares razoável mais simples é escolher pares aleatoriamente da camada superior (rápido e de alta capacidade), e isso é atualmente implantado para túneis de cliente. Túneis exploratórios (usados para gerenciamento de túneis netDb e ) escolhem pares aleatoriamente da camada "não falhando" (que inclui roteadores em camadas 'melhores' também), permitindo que o par faça uma amostragem de roteadores mais amplamente, otimizando efetivamente a seleção de pares por meio de escalada aleatória de <a href="https://en.wikipedia.org/wiki/Hill_climbing"></a>. Essas estratégias sozinhas, no entanto, vazam informações sobre os pares na camada superior do roteador por meio de ataques de colheita de predecessores e netDb. Por sua vez, existem diversas alternativas que, embora não equilibrem a carga de forma tão uniforme, abordarão os ataques realizados por classes específicas de adversários.
tr: Bu profil verileri kullanılarak, en basit uygun eş seçimi stratejisi, eşleri üst düzeyden (hızlı ve yüksek kapasiteli) rastgele seçmektir. Şu anda istemci tünelleri bu şekilde dağıtılmaktadır. Keşif tünelleri ("Ağ veri tabanı" (NetDB) ve tünel yönetimi için kullanılır) "sorunsuz" düzeyinden ('daha iyi" katmanlardaki yönelticileri de içerir) rastgele eşler seçer. Eşler arası yönelticileri daha geniş bir şekilde örnekleme olanağı sağlar ve aslında rastgele <a href="https://en.wikipedia.org/wiki/Hill_climbing">tepe tırmanışı</a> ile eş seçimini iyileştirir. Ancak bu stratejiler, öncül ve "Ağ veri tabanı" (NetDB) hasat saldırıları ile yönelticinin en üst düzeyindeki eşler hakkında bilgi sızdırır. Buna karşılık, yükü eşit olarak dengelememekle birlikte, belirli düşman sınıfları tarafından düzenlenen saldırılara karşı koyacak çeşitli alternatifler vardır.

source: By picking a random key and ordering the peers according to their XOR distance from it, the information leaked is reduced in predecessor and harvesting attacks according to the peers' failure rate and the tier's churn. Another simple strategy for dealing with netDb harvesting attacks is to simply fix the inbound tunnel gateway(s) yet randomize the peers further on in the tunnels. To deal with predecessor attacks for adversaries which the client contacts, the outbound tunnel endpoints would also remain fixed. The selection of which peer to fix on the most exposed point would of course need to have a limit to the duration, as all peers fail eventually, so it could either be reactively adjusted or proactively avoided to mimic a measured mean time between failures of other routers. These two strategies can in turn be combined, using a fixed exposed peer and an XOR based ordering within the tunnels themselves. A more rigid strategy would fix the exact peers and ordering of a potential tunnel, only using individual peers if all of them agree to participate in the same way each time. This varies from the XOR based ordering in that the predecessor and successor of each peer is always the same, while the XOR only makes sure their order doesn't change.
pt: Ao escolher uma chave aleatória e ordenar os pares de acordo com sua distância XOR dela, as informações vazadas são reduzidas em ataques predecessores e de coleta de acordo com a taxa de falha dos pares e a rotatividade da camada. Outra estratégia simples para lidar com ataques de coleta de netDb é simplesmente consertar o(s) gateway(s) de túnel de entrada, mas randomizar os pares mais adiante nos túneis. Para lidar com ataques predecessores para adversários que o cliente contata, os pontos de extremidade do túnel de saída também permaneceriam fixos. A seleção de qual peer consertar no ponto mais exposto precisaria, é claro, ter um limite para a duração, já que todos os peers falham eventualmente, então poderia ser reativamente ajustado ou proativamente evitado para imitar um tempo médio medido entre falhas de outros roteadores. Essas duas estratégias podem, por sua vez, ser combinadas, usando um peer exposto fixo e uma ordenação baseada em XOR dentro dos próprios túneis. Uma estratégia mais rígida consertaria os peers exatos e a ordenação de um túnel potencial, apenas usando peers individuais se todos eles concordassem em participar da mesma forma a cada vez. Isso varia da ordenação baseada em XOR, pois o predecessor e o sucessor de cada par são sempre os mesmos, enquanto o XOR apenas garante que sua ordem não mude.
tr: Rastgele bir anahtar seçerek ve eşleri ondan XOR uzaklıklarına göre sıralayarak, eşlerin başarısızlık oranına ve düzeyin karıştırılmasına göre öncül ve hasat saldırılarında sızdırılan bilgiler azaltılır. "Ağ veri tabanı" (NetDB) hasat saldırılarıyla başa çıkmak için başka bir basit strateji, geliş tüneli ağ geçitlerini düzeltmek ve aynı zamanda tünellerdeki eşleri daha da rastgele hale getirmektir. İstemcinin bağlantı kurduğu düşmanlara yönelik önceki saldırılarla başa çıkmak için gidiş tüneli uç noktaları da sabit kalır. En çok maruz kalan noktada hangi eşin düzeltileceğinin seçiminin elbette bir süre sınırı olmalıdır. Çünkü sonunda tüm eşler başarısız olur. Böylece diğer yönelticilerin sorunları arasında ölçülen ortalama süreyi taklit etmek için tepkisel olarak ayarlanabilir ya da etkisel olarak önlenebilir. Bu iki strateji, sırayla, sabit bir açık eş ve tüneller arasında bir XOR tabanlı sıralama kullanılarak birleştirilebilir. Daha katı bir strateji, tam eşleri ve olası bir tünelin sıralamasını düzeltir. Yalnızca her biri aynı şekilde katılmayı kabul ederse tek tek eşler kullanılır. Bu yöntem, XOR tabanlı sıralamadan farklıdır, çünkü her bir eşin öncülü ve ardılı her zaman aynıdır. XOR ise yalnızca sıralarının değişmediğinden emin olur.

source: As mentioned before, I2P currently (release 0.8) includes the tiered random strategy above, with XOR-based ordering. A more detailed discussion of the mechanics involved in tunnel operation, management, and peer selection can be found in the <a href="%(tunnelimpl)s">tunnel spec</a>.
pt: Como mencionado antes, o I2P atualmente (versão 0.8) inclui a estratégia aleatória em camadas acima, com ordenação baseada em XOR. Uma discussão mais detalhada sobre a mecânica envolvida na operação, gerenciamento, e seleção de pares do túnel pode ser encontrada na <a href="%(tunnelimpl)s">especificação do túnel</a>.
tr: Daha önce belirtildiği gibi, I2P şu anda (sürüm 0.8), XOR tabanlı sıralama ile yukarıdaki düzeyli rastgele stratejiyi kullanıyor. Tünel işletimi, yönetimi ve eş seçimi ile ilgili mekanizmalar hakkında ayrıntılı bir tartışma <a href="%(tunnelimpl)s">tunnel teknik özelliklerinde</a> bulunabilir.

source: As mentioned earlier, I2P's netDb works to share the network's metadata. This is detailed in <a href="%(netdb)s">the network database</a> page, but a basic explanation is available below.
pt: Conforme mencionado anteriormente, o netDb do I2P funciona para compartilhar os metadados da rede. Isso é detalhado na página <a href="%(netdb)s">do banco de dados da rede</a> , mas uma explicação básica está disponível abaixo.
tr: Daha önce belirtildiği gibi, I2P "Ağ veri tabanı" (NetDB) ağın üst verilerini paylaşmak için çalışır. Bu konu, <a href="%(netdb)s">ağ veri tabanı (netDB)</a> sayfasında ayrıntılı olarak açıklanmıştır. Bununla birlikte basit bir açıklamayı aşağıda bulabilirsiniz.

source: A percentage of I2P users are appointed as 'floodfill peers'. Currently, I2P installations that have a lot of bandwidth and are fast enough, will appoint themselves as floodfill as soon as the number of existing floodfill routers drops too low.
pt: Uma porcentagem de usuários I2P são nomeados como 'pares de floodfill'. Atualmente, instalações I2P que têm muita largura de banda e são rápidas o suficiente, se nomearão como floodfill assim que o número de roteadores de floodfill existentes cair muito.
tr: I2P kullanıcılarının belirli bir yüzdesi 'otomatik doldurma eşleri' olarak atanır. Şu anda, çok fazla bant genişliği olan ve yeterince hızlı I2P kurulumları, var olan otomatik doldurma yönelticilerinin sayısı çok azaldığında kendilerini otomatik doldurma yönelticisi olarak atar.

source: Other I2P routers will store their data and lookup data by sending simple 'store' and 'lookup' queries to the floodfills. If a floodfill router receives a 'store' query, it will spread the information to other floodfill routers using the <a href="http://en.wikipedia.org/wiki/Kademlia">Kademlia algorithm</a>. The 'lookup' queries currently function differently, to avoid an important <a href="%(netdb)s#lookup">security issue</a>. When a lookup is done, the floodfill router will not forward the lookup to other peers, but will always answer by itself (if it has the requested data).
pt: Outros roteadores I2P armazenarão seus dados e farão consultas de pesquisa enviando consultas simples de 'armazenamento' e 'pesquisa' para os floodfills. Se um roteador floodfill receber uma consulta de 'armazenamento', ele espalhará as informações para outros roteadores floodfill usando o <a href="http://en.wikipedia.org/wiki/Kademlia">algoritmo Kademlia</a>. As consultas de 'pesquisa' atualmente funcionam de forma diferente, para evitar um importante <a href="%(netdb)s#lookup">problema de segurança</a>. Quando uma pesquisa é feita, o roteador floodfill não encaminhará a pesquisa para outros pares, mas sempre responderá sozinho (se tiver os dados solicitados).
tr: Diğer I2P yönelticileri, otomatik doldurma yönelticilerine basit "depolama" ve "arama" sorguları göndererek verilerini ve arama bilgilerini depolar. Bir otomatik doldurma yönelticisi bir "depolama" sorgusu alırsa, bilgileri <a href="http://en.wikipedia.org/wiki/Kademlia">Kademlia algoritmasını</a> kullanarak diğer otomatik doldurma yönelticilerine yayar. "Arama" sorguları, şu anda önemli bir <a href="%(netdb)s#lookup">güvenlik sorununu</a> önlemek için farklı şekilde çalışıyor. Bir arama yapıldığında, otomatik doldurma yönelticisi aramayı diğer eşlere iletmez. Ancak her zaman kendi kendine yanıt verir (istenilen verilere sahipse).

source: Two types of information are stored in the network database.
pt: Dois tipos de informações são armazenadas no banco de dados da rede.
tr: Ağ veri tabanında iki türde bilgi depolanır.

source: A <b>RouterInfo</b> stores information on a specific I2P router and how to contact it
pt: Um <b>RouterInfo</b> armazena informações sobre um roteador I2P específico e como contatá-lo
tr: <b>"Yöneltici bilgileri" (RouterInfo)</b> belirli bir I2P yönelticisi ve nasıl bağlantı kurulacağı hakkında bilgileri tutar.

source: A <b>LeaseSet</b> stores information on a specific destination (e.g. I2P website, e-mail server...)
pt: Um <b>LeaseSet</b> armazena informações sobre um destino específico (por exemplo, site I2P, servidor de e-mail...)
tr: <b>"Kiralama kümesi" (LeaseSet)</b> belirli bir hedefin bilgilerini tutar (I2P sitesi, e-posta sunucusu gibi)

source: All of this information is signed by the publishing party and verified by any I2P router using or storing the information. In addition, the data contains timing information, to avoid storage of old entries and possible attacks. This is also why I2P bundles the necessary code for maintaining the correct time, occasionally querying some SNTP servers (the <a href="http://www.pool.ntp.org/">pool.ntp.org</a> round robin by default) and detecting skew between routers at the transport layer.
pt: Todas essas informações são assinadas pela parte publicadora e verificadas por qualquer roteador I2P que use ou armazene as informações. Além disso, os dados contêm informações de tempo, para evitar o armazenamento de entradas antigas e possíveis ataques. É também por isso que o I2P agrupa o código necessário para manter o tempo correto, consultando ocasionalmente alguns servidores SNTP (o <a href="http://www.pool.ntp.org/">pool.ntp.org</a> round robin por padrão) e detectando distorção entre roteadores na camada de transporte.
tr: Tüm bu bilgiler, yayınlayan tarafça imzalanır ve bilgileri kullanan veya depolayan herhangi bir I2P yönelticisi tarafından doğrulanır. Ek olarak, eski kayıtların tutulmasını ve olası saldırıları önlemek için verilerde süre bilgisi bulunur. Bu aynı zamanda I2P tarafından doğru zamanı korumak, ara sıra bazı SNTP sunucularını sorgulamak (varsayılan olarak <a href="http://www.pool.ntp.org/">pool.ntp.org</a> round robin) ve taşıyıcı katmanındaki yönelticiler arasındaki sapmayı algılamak için gerekli kodu bir araya getirmekte kullanılır.

source: Some additional remarks are also important.
pt: Algumas observações adicionais também são importantes.
tr: Bazı ek açıklamalar da önemlidir.

source: Unpublished and encrypted leasesets:
pt: Conjuntos de arrendamento não publicados e criptografados:
tr: Yayınlanmamış ve "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets):

source: One could only want specific people to be able to reach a destination. This is possible by not publishing the destination in the netDb. You will however have to transmit the destination by other means. An alternative are the 'encrypted leaseSets'. These leaseSets can only be decoded by people with access to the decryption key.
pt: Alguém poderia querer que apenas pessoas específicas pudessem alcançar um destino. Isso é possível não publicando o destino no netDb. No entanto, você terá que transmitir o destino por outros meios. Uma alternativa são os 'encrypted leaseSets'. Esses leaseSets só podem ser decodificados por pessoas com acesso à chave de descriptografia.
tr: Bir kişi yalnızca belirli kişilerin bir hedefe ulaşabilmesini isteyebilir. Bu, hedef "Ağ veri tabanında" (NetDB) yayınlanabilir. Ancak hedefi başka yollarla iletmeniz gerekir. Bir alternatif, "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) kullanmak olur. Bu "Kiralama kümeleri" (LeaseSets) yalnızca şifre çözme anahtarına erişimi olan kişiler tarafından çözülebilir.

source: Bootstrapping:
pt: Inicialização:
tr: Ön yükleme:
