Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Due to the relatively small size of the network and flooding redundancy, lookups are usually O(1) rather than O(log n). A router is highly likely to know a floodfill router close enough to the key to get the answer on the first try. In releases prior to 0.8.9, routers used a lookup redundancy of two (that is, two lookups were performed in parallel to different peers), and neither <i>recursive</i> nor <i>iterative</i> routing for lookups was implemented. Queries were sent through <i>multiple routes simultaneously</i> to <i>reduce the chance of query failure</i>.
pt: Devido ao tamanho relativamente pequeno da rede e à redundância de inundação, as pesquisas são geralmente O(1) em vez de O(log n). É altamente provável que um roteador conheça um roteador de inundação próximo o suficiente da chave para obter a resposta na primeira tentativa. Em versões anteriores à 0.8.9, os roteadores usavam uma redundância de pesquisa de dois (ou seja, duas pesquisas eram realizadas em paralelo para pares diferentes) e nem <i>recursivo</i> nem <i>iterativo</i> o roteamento para pesquisas foi implementado. As consultas foram enviadas por <i>várias rotas simultaneamente</i> para <i>reduzir a chance de falha da consulta</i>.
tr: Ağın nispeten küçük boyutu ve otomatik doldurma yedekliliği nedeniyle, aramalar genellikle O(log n) yerine O(1) şeklindedir. Bir yönelticinin, ilk denemede yanıtı almak için anahtara yeterince yakın bir otomatik doldurma yönelticisini bilme olasılığı yüksektir. 0.8.9 öncesindeki sürümlerde, yönelticiler iki arama yedekliliği kullandı (yani, farklı eşlere paralel olarak iki arama yapıldı) ve aramalar için ne <i>iç içe</i> ne de <i>yinelemeli</i> yöneltme uygulandı. <i>Sorgu başarısızlığı olasılığını azaltmak</i> için sorgular aynı anda <i>birden fazla yöneltme ile</i> gönderildi.

source: As of release 0.8.9, <i>iterative lookups</i> are implemented with no lookup redundancy. This is a more efficient and reliable lookup that will work much better when not all floodfill peers are known, and it removes a serious limitation to network growth. As the network grows and each router knows only a small subset of the floodfill peers, lookups will become O(log n). Even if the peer does not return references closer to the key, the lookup continues with the next-closest peer, for added robustness, and to prevent a malicious floodfill from black-holing a part of the key space. Lookups continue until a total lookup timeout is reached, or the maximum number of peers is queried.
pt: A partir da versão 0.8.9, <i>pesquisas iterativas</i> são implementadas sem redundância de pesquisa. Esta é uma pesquisa mais eficiente e confiável que funcionará muito melhor quando nem todos os pares de floodfill forem conhecidos, e remove uma séria limitação ao crescimento da rede. À medida que a rede cresce e cada roteador conhece apenas um pequeno subconjunto dos pares de floodfill, as pesquisas se tornarão O(log n). Mesmo que o par não retorne referências mais próximas da chave, a pesquisa continua com o próximo par mais próximo, para maior robustez e para evitar que um floodfill malicioso faça um black-hole em uma parte do espaço da chave. As pesquisas continuam até que o tempo limite total de pesquisa seja atingido, ou o número máximo de pares seja consultado.
tr: 0.8.9 sürümünden itibaren, <i>yinelemeli aramalar</i> arama artıklığı olmadan uygulanıyor. Bu yöntem, tüm otomatik doldurma eşleri bilinmediğinde çok daha iyi çalışacak daha verimli ve güvenilir bir arama sağlıyor ve ağ büyümesine yönelik ciddi bir sınırlamayı ortadan kaldırıyor. Ağ büyüdükçe ve her yöneltici otomatik doldurma eşlerinin yalnızca küçük bir alt kümesini bildikçe, aramalar O(log n) şeklinde olur. Eş, anahtara daha yakın referanslar döndürmese bile, arama işlemi ek güvenlik sağlamak ve kötü niyetli bir otomatik doldurma yönelticisinin anahtar uzayının bir bölümünden kara delik oluşturmasını önlemek için bir sonraki en yakın eşle ilerler. Aramalar, toplam arama zaman aşımına ulaşılana veya en fazla eş sayısı sorgulanana kadar sürdürülür.

source: <i>Node IDs</i> are <i>verifiable</i> in that we use the router hash directly as both the node ID and the Kademlia key. Incorrect responses that are not closer to the search key are generally ignored. Given the current size of the network, a router has <i>detailed knowledge of the neighborhood of the destination ID space</i>.
pt: <i>IDs de nó</i> são <i>verificáveis</i> porque usamos o hash do roteador diretamente como ID de nó e chave Kademlia. Respostas incorretas que não estão mais próximas da chave de pesquisa são geralmente ignoradas. Dado o tamanho atual da rede, um roteador tem <i>conhecimento detalhado da vizinhança do espaço de ID de destino</i>.
tr: <i>Düğüm kimlikleri</i>, <i>doğrulanabilir</i>. Çünkü yöneltici karmasını doğrudan hem düğüm kimliği hem de Kademlia anahtarı olarak kullanırız. Arama anahtarına daha yakın olmayan yanlış yanıtlar genellikle yok sayılır. Ağın güncel boyutu göz önüne alındığında, bir yöneltici <i>hedef kimliği uzayının komşuluğu hakkında ayrıntılı bilgiye</i> sahiptir.

source: RouterInfo Storage Verification
pt: Verificação de armazenamento RouterInfo
tr: "Yöneltici bilgileri" (RouterInfo) depolama doğrulaması

source: Note: RouterInfo verification is disabled as of release 0.9.7.1 to prevent the attack described in the paper <a href="%(egger2013)s">Practical Attacks Against the I2P Network</a>. It is not clear if verification can be redesigned to be done safely.
pt: Observação: a verificação do RouterInfo está desabilitada a partir da versão 0.9.7.1 para evitar o ataque descrito no artigo <a href="%(egger2013)s">Ataques práticos contra a rede I2P</a>. Não está claro se a verificação pode ser redesenhada para ser feita com segurança.
tr: Not: "Yöneltici bilgileri" (RouterInfo) doğrulaması, <a href="%(egger2013)s">Practical Attacks Against the I2P Network</a> belgesinde açıklanan saldırıyı önlemek için 0.9.7.1 sürümünden başlayarak devre dışı bırakılmıştır. Doğrulamanın güvenli olarak yapılacak şekilde yeniden tasarlanıp tasarlanamayacağı açık değildir.

source: To verify a storage was successful, a router simply waits about 10 seconds, then sends a lookup to another floodfill router close to the key (but not the one the store was sent to). Lookups sent out one of the router's outbound exploratory tunnels. Lookups are end-to-end garlic encrypted to prevent snooping by the outbound endpoint(OBEP).
pt: Para verificar se um armazenamento foi bem-sucedido, um roteador simplesmente espera cerca de 10 segundos, e então envia uma pesquisa para outro roteador de floodfill próximo à chave (mas não para aquele para o qual o armazenamento foi enviado). As pesquisas são enviadas para um dos túneis exploratórios de saída do roteador. As pesquisas são criptografadas de ponta a ponta para evitar espionagem pelo ponto de extremidade de saída (OBEP).
tr: Bir depolamanın başarılı olduğunu doğrulamak için, bir yöneltici yalnızca 10 saniye kadar bekler. Ardından anahtara yakın başka bir otomatik doldurma yönelticisine bir arama gönderir (ancak depolamanın gönderildiğine değil). Aramalar, yönelticinin gidiş keşif tünellerinden birini gönderdi. Aramalar, gidiş uç noktası (OBEP) tarafından gözetlenmeyi önlemek için uçtan uca Garlic şifrelenir.

source: LeaseSet Storage Verification
pt: Verificação de armazenamento LeaseSet
tr: "Kiralama kümesi" (LeaseSet) depolama doğrulaması

source: To verify a storage was successful, a router simply waits about 10 seconds, then sends a lookup to another floodfill router close to the key (but not the one the store was sent to). Lookups sent out one of the outbound client tunnels for the destination of the LeaseSet being verified. To prevent snooping by the OBEP of the outbound tunnel, lookups are end-to-end garlic encrypted. The replies are specified to return via one of the client's inbound tunnels.
pt: Para verificar se um armazenamento foi bem-sucedido, um roteador simplesmente espera cerca de 10 segundos, então envia uma consulta para outro roteador de floodfill próximo à chave (mas não aquela para a qual o armazenamento foi enviado). As consultas enviam um dos túneis de saída do cliente para o destino do LeaseSet que está sendo verificado. Para evitar espionagem pelo OBEP do túnel de saída, as consultas são criptografadas de ponta a ponta. As respostas são especificadas para retornar por meio de um dos túneis de entrada do cliente.
tr: Bir depolamanın başarılı olduğunu doğrulamak için, bir yöneltici yalnızca 10 saniye kadar bekler. Ardından anahtara yakın başka bir otomatik doldurma yönelticisine bir arama gönderir (ancak depolamanın gönderildiğine değil). Aramalar, doğrulanmakta olan "Kiralama kümesinin" (LeaseSet) hedefi için istemci gidiş tünellerinden birini gönderdi. Gidiş tünelinin OBEP tarafından gözetlenmesini önlemek için, aramalar uçtan uca Garlic olarak şifrelenir. Yanıtlar, istemcinin geliş tünellerinden biri aracılığıyla döndürülecek şekilde belirtilir.

source: As of release 0.9.7, replies for both RouterInfo and LeaseSet lookups (a DatabaseStoreMessage or a DatabaseSearchReplyMessage) will be encrypted, to hide the reply from the inbound gateway (IBGW) of the reply tunnel.
pt: A partir da versão 0.9.7, as respostas para pesquisas RouterInfo e LeaseSet (uma DatabaseStoreMessage ou uma DatabaseSearchReplyMessage) serão criptografadas, para ocultar a resposta do gateway de entrada (IBGW) do túnel de resposta.
tr: 0.9.7 sürümünden başlayarak, yanıt tünelinin geliş ağ geçidinden (IBGW) gelen yanıtı gizlemek için hem "Yöneltici bilgileri" (RouterInfo) hem de "Kiralama kümesi" (LeaseSet) aramaları (bir "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) veya bir "Veri tabanı arama yanıtı iletisi" (DatabaseSearchReplyMessages)) için yanıtlar şifrelenir.

source: Exploration
pt: Exploração
tr: Keşif

source: <i>Exploration</i> is a special form of netdb lookup, where a router attempts to learn about new routers. It does this by sending a floodfill router a <a href="%(i2np)s">I2NP</a> DatabaseLookup Message, looking for a random key. As this lookup will fail, the floodfill would normally respond with a <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage containing hashes of floodfill routers close to the key. This would not be helpful, as the requesting router probably already knows those floodfills, and it would be impractical to add all floodfill routers to the "don't include" field of the DatabaseLookup Message. For an exploration query, the requesting router sets a special flag in the DatabaseLookup Message. The floodfill will then respond only with non-floodfill routers close to the requested key.
pt: <i>Exploração</i> é uma forma especial de pesquisa netdb, onde um roteador tenta aprender sobre novos roteadores. Ele faz isso enviando a um roteador floodfill uma <a href="%(i2np)s">I2NP</a> Mensagem DatabaseLookup, procurando por uma chave aleatória. Como essa pesquisa falhará, o floodfill normalmente responderia com uma <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage contendo hashes de roteadores floodfill próximos à chave. Isso não seria útil, pois o roteador solicitante provavelmente já conhece esses floodfills, e seria impraticável adicionar todos os roteadores floodfill ao campo "não incluir" da mensagem DatabaseLookup. Para uma consulta de exploração, o roteador solicitante define um sinalizador especial na mensagem DatabaseLookup. O floodfill responderá apenas com roteadores não floodfill próximos à chave solicitada.
tr: <i>Keşif</i>, bir yönelticinin yeni yönelticiler hakkında bilgi edinmeye çalıştığı özel bir "Ağ veri tabanı" (NetDB) arama biçimidir. Bunu, bir otomatik doldurma yönelticisine rastgele bir anahtar arayan bir <a href="%(i2np)s">I2NP</a> "Veri tabanı arama iletisi" (DatabaseLookupMessage) göndererek yapar. Bu arama başarısız olacağından, otomatik doldurma işlemi normalde anahtara yakın otomatik doldurma yönelticilerinin karmalarını içeren bir <a href="%(i2np)s">I2NP</a> "Veri tabanı arama yanıtı iletisi" (DatabaseSearchReplyMessages) ile yanıt verir. İstekte bulunan yöneltici büyük olasılıkla bu otomatik doldurma yönelticilerini zaten bildiğinden, bu bilginin yardımı olmaz ve tüm otomatik doldurma yönelticilerini "Veri tabanı arama iletisinin" (DatabaseLookupMessage) "katılmayacaklar" alanına eklemek pratik olmaz. Bir keşif sorgusu için istekte bulunan yöneltici, "Veri tabanı arama iletisi" (DatabaseLookupMessage) içine özel bir işaret koyar. Otomatik doldurma yönelticisi yalnızca istenen anahtara yakın, otomatik doldurma olmayan yönelticilerle yanıt verir.

source: Notes on Lookup Responses
pt: Notas sobre respostas de pesquisa
tr: Arama Yanıtları Hakkında Notlar

source: The response to a lookup request is either a Database Store Message (on success) or a Database Search Reply Message (on failure). The DSRM contains a 'from' router hash field to indicate the source of the reply; the DSM does not. The DSRM 'from' field is unauthenticated and may be spoofed or invalid. There are no other response tags. Therefore, when making multiple requests in parallel, it is difficult to monitor the performance of the various floodfill routers.
pt: A resposta a uma solicitação de pesquisa é uma Database Store Message (em caso de sucesso) ou uma Database Search Reply Message (em caso de falha). O DSRM contém um campo hash do roteador 'from' para indicar a origem da resposta; o DSM não. O campo 'from' do DSRM não é autenticado e pode ser falsificado ou inválido. Não há outras tags de resposta. Portanto, ao fazer várias solicitações em paralelo, é difícil monitorar o desempenho dos vários roteadores floodfill.
tr: Bir arama isteğine verilen yanıt, bir veri tabanı depolama iletisi (başarı durumunda) veya bir veri tabanı arama yanıt iletisi (başarısızlık durumunda). DSRM, yanıtın kaynağını belirtmek için bir yöneltici karma alanı içerir. Veri tabanı depolama iletisinde bu bulunmaz. Veri tabanı arama yanıt iletisinin 'kimden' alanı kimliği doğrulanmamış ve sahte veya geçersiz olabilir. Başka bir yanıt etiketi bulunmaz. Bu nedenle, paralel olarak birden çok istekte bulunurken, çeşitli otomatik doldurma yönelticilerinin başarımını izlemek zordur.

source: MultiHoming
tr: Birden Çok Barındırma

source: Destinations may be hosted on multiple routers simultaneously, by using the same private and public keys (traditionally stored in eepPriv.dat files). As both instances will periodically publish their signed LeaseSets to the floodfill peers, the most recently published LeaseSet will be returned to a peer requesting a database lookup. As LeaseSets have (at most) a 10 minute lifetime, should a particular instance go down, the outage will be 10 minutes at most, and generally much less than that. The multihoming function has been verified and is in use by several services on the network.
pt: Os destinos podem ser hospedados em vários roteadores simultaneamente, usando as mesmas chaves privadas e públicas (tradicionalmente armazenadas em arquivos eepPriv.dat). Como ambas as instâncias publicarão periodicamente seus LeaseSets assinados para os pares de floodfill, o LeaseSet publicado mais recentemente será retornado a um par que solicitou uma consulta ao banco de dados. Como os LeaseSets têm (no máximo) uma vida útil de 10 minutos, se uma instância específica cair, a interrupção será de 10 minutos no máximo, e geralmente muito menos que isso. A função multihoming foi verificada e está em uso por vários serviços na rede.
tr: Hedefler, aynı kişisel ve herkese açık anahtarlar (geleneksel olarak eepPriv.dat dosyalarında depolanır) kullanılarak aynı anda birden çok yönelticide barındırılabilir. Her iki örnek de imzalı "Kiralama kümelerini" (LeaseSets) otomatik doldurma eşlerine düzenli olarak yayınlayacağından, en son yayınlanan "Kiralama kümesi" (LeaseSet) bir veri tabanı araması isteği yapan bir eşe döndürülür. "Kiralama kümelerinin" (LeaseSets) en fazla 10 dakikalık bir kullanım ömrü olduğundan, belirli bir bulut sunucusunun çökmesi durumunda kesinti en fazla 10 dakika olur ve genellikle bundan çok daha azdır. Çoklu barındırma arama işlevi doğrulandı ve ağdaki çeşitli hizmetler tarafından kullanılıyor.

source: Threat Analysis
pt: Análise de ameaças
tr: Tehdit İncelemesi

source: Also discussed on <a href="%(threatmodel)s#floodfill">the threat model page</a>.
pt: Também discutido na página <a href="%(threatmodel)s#floodfill">do modelo de ameaça</a>.
tr: Ayrıca <a href="%(threatmodel)s#floodfill">tehdit modeli sayfasında</a> tartışılmıştır.

source: A hostile user may attempt to harm the network by creating one or more floodfill routers and crafting them to offer bad, slow, or no responses. Some scenarios are discussed below.
pt: Um usuário hostil pode tentar prejudicar a rede criando um ou mais roteadores de floodfill e adaptando-os para oferecer respostas ruins, lentas ou nenhuma resposta. Alguns cenários são discutidos abaixo.
tr: Kötü niyetli bir kullanıcı, bir veya daha fazla otomatik doldurma yönelticisi oluşturarak ve bunları kötü, yavaş veya hiç yanıt vermeyecek şekilde hazırlayarak ağa zarar vermeye çalışabilir. Bazı senaryolar aşağıda tartışılmıştır.

source: General Mitigation Through Growth
pt: Mitigação Geral Através do Crescimento
tr: Büyümeyle Genel Azaltma

source: There are currently around %(ffcount)s floodfill routers in the network. Most of the following attacks will become more difficult, or have less impact, as the network size and number of floodfill routers increase.
pt: Atualmente, há cerca de %(ffcount)s roteadores floodfill na rede. A maioria dos ataques a seguir se tornará mais difícil ou terá menos impacto, à medida que o tamanho da rede e o número de roteadores floodfill aumentarem.
tr: Şu anda ağda yaklaşık %(ffcount)s otomatik doldurma yönelticisi var. Aşağıdaki saldırıların çoğu, ağ boyutu ve otomatik doldurma yönelticilerinin sayısı arttıkça daha zor hale gelir veya daha az etkiye sahip olur.

source: General Mitigation Through Redundancy
pt: Mitigação geral por meio de redundância
tr: Süreklilikle Genel Azaltma

source: Via flooding, all netdb entries are stored on the %(floodsize)s floodfill routers closest to the key.
pt: Por meio de inundação, todas as entradas netdb são armazenadas nos roteadores de inundação %(floodsize)s mais próximos da chave.
tr: Otomatik doldurma yoluyla, tüm "Ağ veri tabanı" (NetDB) kayıtları, anahtara en yakın %(floodsize)s otomatik doldurma yönelticisinde depolanır.

source: Forgeries
pt: Falsificações
tr: Sahtecilikler

source: All netdb entries are signed by their creators, so no router may forge a RouterInfo or LeaseSet.
pt: Todas as entradas netdb são assinadas por seus criadores, portanto nenhum roteador pode falsificar um RouterInfo ou LeaseSet.
tr: Tüm "Ağ veri tabanı" (NetDB) kayıtları oluşturucuları tarafından imzalanmıştır. Bu nedenle hiçbir yöneltici bir "Yöneltici bilgileri" (RouterInfo) veya "Kiralama kümesi" (LeaseSet) verisini taklit edemez.

source: Slow or Unresponsive
pt: Lento ou sem resposta
tr: Yavaş ya da Yanıtsız

source: Each router maintains an expanded set of statistics in the <a href="%(peerselection)s">peer profile</a> for each floodfill router, covering various quality metrics for that peer. The set includes:
pt: Cada roteador mantém um conjunto expandido de estatísticas no perfil de peer <a href="%(peerselection)s"></a> para cada roteador de floodfill, cobrindo várias métricas de qualidade para aquele peer. O conjunto inclui:
tr: Her yöneltici, her bir otomatik doldurma yönelticisi için <a href="%(peerselection)s">eş profilinde</a> o eş için çeşitli kalite ölçümlerini kapsayan genişletilmiş bir istatistik kümesi tutar. Kümede şunlar bulunur:

source: Average response time
pt: Tempo médio de resposta
tr: Ortalama yanıt süresi

source: Percentage of queries answered with the data requested
pt: Porcentagem de consultas respondidas com os dados solicitados
tr: İstenilen verilerle yanıtlanan sorguların yüzdesi

source: Percentage of stores that were successfully verified
pt: Porcentagem de lojas que foram verificadas com sucesso
tr: Başarıyla doğrulanan depolamaların yüzdesi

source: Last successful store
pt: Última loja de sucesso
tr: Son başarılı depolama

source: Last successful lookup
pt: Última pesquisa bem-sucedida
tr: Son başarılı arama

source: Last response
pt: Última resposta
tr: Son yanıt

source: Each time a router needs to make a determination on which floodfill router is closest to a key, it uses these metrics to determine which floodfill routers are "good". The methods, and thresholds, used to determine "goodness" are relatively new, and are subject to further analysis and improvement. While a completely unresponsive router will quickly be identified and avoided, routers that are only sometimes malicious may be much harder to deal with.
pt: Cada vez que um roteador precisa determinar qual roteador de floodfill está mais próximo de uma chave, ele usa essas métricas para determinar quais roteadores de floodfill são "bons". Os métodos e limites usados para determinar a "bondade" são relativamente novos, e estão sujeitos a análises e melhorias adicionais. Enquanto um roteador completamente sem resposta será rapidamente identificado e evitado, roteadores que são apenas algumas vezes maliciosos podem ser muito mais difíceis de lidar.
tr: Bir yönelticinin hangi otomatik doldurma yönelticisinin bir anahtara en yakın olduğunu belirlemesi gerektiğinde, hangi otomatik doldurma yönelticilerinin "iyi" olduğunu belirlemesi için bu ölçümler kullanılır. "İyiliği" belirlemek için kullanılan yöntemler ve eşikler nispeten yenidir ve daha fazla analiz ve iyileştirmeye açıktır. Tamamen yanıt vermeyen bir yöneltici hızlı bir şekilde belirlenip bunlardan kaçınılırken, yalnızca bazen kötü niyetli olan yönelticilerle uğraşmak çok daha zor olabilir.

source: Sybil Attack (Full Keyspace)
pt: Ataque Sybil (Keyspace Completo)
tr: Sybil Saldırısı (Tam Anahtar Uzayı)

source: An attacker may mount a <a href="%(url)s">Sybil attack</a> by creating a large number of floodfill routers spread throughout the keyspace.
pt: Um invasor pode montar um ataque Sybil <a href="%(url)s"></a> criando um grande número de roteadores floodfill espalhados pelo keyspace.
tr: Saldırgan, anahtar uzayı boyunca yayılmış çok sayıda otomatik doldurma yönelticisi oluşturarak <a href="%(url)s">Sybil saldırısı</a> başlatabilir.

source: (In a related example, a researcher recently created a <a href="%(url)s">large number of Tor relays</a>.) If successful, this could be an effective DOS attack on the entire network.
pt: (Em um exemplo relacionado, um pesquisador criou recentemente um <a href="%(url)s">grande número de relés Tor</a>.) Se bem-sucedido, este poderia ser um ataque DOS eficaz em toda a rede.
tr: (İlgili bir örnekte, bir araştırmacı yakın zamanda <a href="%(url)s">çok sayıda Tor aktarıcısı</a> oluşturmuştur.) Başarılı olursa, bu şekilde tüm ağ üzerinde etkili bir DOS saldırısı yapılabilir.
