Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Data <a href="%(cryptography)s#AES">AES encrypted</a> using the DH session key and the last 16 bytes of the encrypted contents of message #2 as the IV 48 bytes for a DSA signature, may vary for other signature types
pt: Dados <a href="%(cryptography)s#AES">criptografados com AES</a> usando a chave de sessão DH e os últimos 16 bytes do conteúdo criptografado da mensagem nº 2 como IV 48 bytes para uma assinatura DSA, pode variar para outros tipos de assinatura
tr: Veriler Diffie-Hellman oturum anahtarı ve bir DSA imzası için IV 48 bayt olarak 2. iletinin şifrelenmiş içeriğinin son 16 baytı kullanılarak <a href="%(cryptography)s#AES">AES ile şifrelenir</a>. Diğer imza türleri için değişiklik gösterebilir

source: Alice verifies the signature, and on failure, drops the connection.
pt: Alice verifica a assinatura e, em caso de falha, interrompe a conexão.
tr: Alice imzayı doğrular ve başarısızlık durumunda bağlantıyı keser.

source: Bob will use the last 16 bytes of the encrypted contents of this message as the IV for the next message.
pt: Bob usará os últimos 16 bytes do conteúdo criptografado desta mensagem como IV para a próxima mensagem.
tr: Bob, bu iletinin şifrelenmiş içeriğinin son 16 baytını bir sonraki ileti için IV olarak kullanır.

source: After Establishment
pt: Após o estabelecimento
tr: Bağlantı Kuruluşundan Sonra

source: The connection is established, and standard or time sync messages may be exchanged. All subsequent messages are AES encrypted using the negotiated DH session key. Alice will use the last 16 bytes of the encrypted contents of message #3 as the next IV. Bob will use the last 16 bytes of the encrypted contents of message #4 as the next IV.
pt: A conexão é estabelecida e mensagens de sincronização padrão ou de tempo podem ser trocadas. Todas as mensagens subsequentes são criptografadas com AES usando a chave de sessão DH negociada. Alice usará os últimos 16 bytes do conteúdo criptografado da mensagem nº 3 como o próximo IV. Bob usará os últimos 16 bytes do conteúdo criptografado da mensagem nº 4 como o próximo IV.
tr: Bağlantı kurulur ve standart veya zaman eşitleme iletileri alınıp verilebilir. Sonraki tüm iletiler anlaşmalı Diffie-Hellman oturum anahtarı kullanılarak AES ile şifrelenir. Alice, bir sonraki IV olarak 3. iletinin şifrelenmiş içeriğinin son 16 baytını kullanır. Bob, 4. iletinin şifrelenmiş içeriğinin son 16 baytını sonraki "Başlatma vektörü" (IV) olarak kullanır.

source: Check Connection Message
pt: Verificar Mensagem de Conexão
tr: Bağlantıyı Denetle İletisi

source: Alternately, when Bob receives a connection, it could be a check connection (perhaps prompted by Bob asking for someone to verify his listener). Check Connection is not currently used. However, for the record, check connections are formatted as follows. A check info connection will receive 256 bytes containing:
pt: Alternativamente, quando Bob recebe uma conexão, pode ser uma conexão de verificação (talvez solicitada por Bob pedindo para alguém verificar seu ouvinte). A conexão de verificação não está sendo usada no momento. No entanto, para registro, as conexões de verificação são formatadas da seguinte forma. Uma conexão de informações de verificação receberá 256 bytes contendo:
tr: Alternatif olarak, Bob bir bağlantı aldığında, bu bir bağlantı denetimi olabilir (belki de Bob, birinden dinleyicisini doğrulamasını istemiştir). Bağlantı denetimi şu anda kullanılmıyor. Ancak, kayıt için bağlantıların aşağıdaki gibi biçimlendirildiğinden emin olun. Bir bilgi denetimi bağlantısı, aşağıdakileri içeren 256 bayt alır:

source: 32 bytes of uninterpreted, ignored data
pt: 32 bytes de dado não interpretada, ignorado
tr: 32 bayt yorumlanmamış, yok sayılan veri

source: 1 byte size
pt: Tamanho de 1 byte
tr: 1 bayt boyut

source: that many bytes making up the local router's IP address (as reached by the remote side)
pt: que muitos bytes compõem o endereço IP do roteador local (conforme alcançado pelo lado remoto)
tr: yerel yönelticinin IP adresini oluşturan bu kadar bayt (uzak tarafın ulaştığı şekilde)

source: 2 byte port number that the local router was reached on
pt: Número de porta de 2 bytes em que o roteador local foi alcançado
tr: yerel yönelticiye ulaşılan 2 bayt bağlantı noktası numarası

source: 4 byte i2p network time as known by the remote side (seconds since the epoch)
pt: Tempo de rede i2p de 4 bytes conforme conhecido pelo lado remoto (segundos desde a época)
tr: Uzak tarafın bildiği şekliyle 4 bayt i2p ağ süresi (epoch sonrası saniye)

source: uninterpreted padding data, up to byte 223
pt: dados de preenchimento não interpretados, até o byte 223
tr: yorumlanmamış dolgu ekleme verileri, 223. bayta kadar

source: xor of the local router's identity hash and the SHA256 of bytes 32 through bytes 223
pt: xor do hash de identidade do roteador local e o SHA256 dos bytes 32 a bytes 223
tr: yerel yönelticinin kimlik karması ile SHA256 32. bayt ile 223. bayt arasının xor sonucu

source: Check connection is completely disabled as of release 0.9.12.
pt: A verificação de conexão está completamente desabilitada a partir da versão 0.9.12.
tr: Bağlantı denetimi 0.9.12 sürümünden sonra tamamen devre dışı bırakılmıştır.

source: Discussion
pt: Discussão
tr: Tartışma

source: Now on the <a href="%(ntcpdisc)s">NTCP Discussion Page</a>.
pt: Agora na <a href="%(ntcpdisc)s">`Página de Discussão do NTCP</a>.
tr: <a href="%(ntcpdisc)s">NTCP tartışma sayfasında</a> görülebilir.

source: The maximum message size should be increased to approximately 32 KB.
pt: O tamanho máximo da mensagem deve ser aumentado para aproximadamente 32 KB.
tr: En büyük ileti boyutu yaklaşık 32 KB olarak yükseltilmelidir.

source: A set of fixed packet sizes may be appropriate to further hide the data fragmentation to external adversaries, but the tunnel, garlic, and end to end padding should be sufficient for most needs until then. However, there is currently no provision for padding beyond the next 16-byte boundary, to create a limited number of message sizes.
pt: Um conjunto de tamanhos de pacotes fixos pode ser apropriado para ocultar ainda mais a fragmentação de dados para adversários externos, mas o túnel, o alho e o preenchimento de ponta a ponta devem ser suficientes para a maioria das necessidades até então. No entanto, atualmente não há nenhuma provisão para preenchimento além do próximo limite de 16 bytes, para criar um número limitado de tamanhos de mensagem.
tr: Verilerin parçalanmasını dış saldırganlardan daha fazla gizlemek için bir dizi sabit paket boyutu uygun olabilir. Ancak tünel, Garlic ve uçtan uca dolgu ekleme o zamana kadar çoğu gereksinim için yeterli olmalıdır. Ancak, sınırlı sayıda ileti boyutu oluşturmak amacıyla bir sonraki 16 baytlık sınırın ötesinde dolgu ekleme için şu anda herhangi bir koşul bulunmuyor.

source: Memory utilization (including that of the kernel) for NTCP should be compared to that for SSU.
pt: A utilização de memória (incluindo a do kernel) para NTCP deve ser comparada à do SSU.
tr: NTCP için bellek kullanımı (çekirdek ile birlikte) SSU ile karşılaştırılmalıdır.

source: Can the establishment messages be randomly padded somehow, to frustrate identification of I2P traffic based on initial packet sizes?
pt: As mensagens de estabelecimento podem ser preenchidas aleatoriamente de alguma forma, para frustrar a identificação do tráfego I2P com base nos tamanhos iniciais dos pacotes?
tr: İlk paket boyutlarına bakılarak I2P trafiğinin tanınmasını engellemek için kuruluş iletileri bir şekilde rastgele doldurulabilir mi?

source: Secure Semireliable UDP
pt: UDP seguro semiconfiável
tr: Güvenli Yarı Güvenilir UDP

source: SSU (also called "UDP" in much of the I2P documentation and user interfaces) is one of two <a href="%(transports)s">transports</a> currently implemented in I2P. The other is <a href="%(ntcp2)s">NTCP2</a>. Support for <a href="%(ntcp)s">NTCP</a> has been removed.
pt: SSU (também chamado de "UDP" em grande parte da documentação e interfaces de usuário do I2P) é um dos dois <a href="%(transports)s">transportes</a> atualmente implementados no I2P. O outro é <a href="%(ntcp2)s">NTCP2</a>. O suporte para <a href="%(ntcp)s">NTCP</a> foi removido.
tr: SSU (I2P belgelerinin ve kullanıcı arabirimlerinin çoğunda "UDP" olarak da adlandırılır), şu anda I2P üzerinde uygulanan iki <a href="%(transports)s">taşıyıcıdan</a> biridir. Diğeri <a href="%(ntcp2)s">NTCP2</a> taşıyıcısıdır. <a href="%(ntcp)s">NTCP</a> desteği kaldırıldı.

source: SSU was introduced in I2P release 0.6. In a standard I2P installation, the router uses both NTCP and SSU for outbound connections. SSU-over-IPv6 is supported as of version 0.9.8.
pt: O SSU foi introduzido na versão 0.6 do I2P. Em uma instalação I2P padrão, o roteador usa NTCP e SSU para conexões de saída. O SSU sobre IPv6 é suportado a partir da versão 0.9.8.
tr: SSU, I2P 0.6 sürümünde tanıtıldı. Standart bir I2P kurulumunda yöneltici, gidiş bağlantılar için hem NTCP hem de SSU kullanır. IPv6 üzerinden SSU, 0.9.8 sürümünden başlayarak destekleniyor.

source: SSU is called "semireliable" because it will repeatedly retransmit unacknowledged messages, but only up to a maximum number of times. After that, the message is dropped.
pt: O SSU é chamado de "semiconfiável" porque ele retransmite repetidamente mensagens não confirmadas, mas apenas até um número máximo de vezes. Depois disso, a mensagem é descartada.
tr: SSU "yarı güvenilir" olarak anılır, çünkü onaylanmayan iletileri en fazla sınır sayısına ulaşana kadar yeniden ve yeniden iletir. İleti ancak bundan sonra atılır.

source: SSU Services
pt: Serviços SSU
tr: SSU Hizmetleri

source: Like the NTCP transport, SSU provides reliable, encrypted, connection-oriented, point-to-point data transport. Unique to SSU, it also provides IP detection and NAT traversal services, including:
pt: Assim como o transporte NTCP, o SSU fornece transporte de dados ponto a ponto, confiável, criptografado e orientado à conexão. Exclusivo do SSU, ele também fornece serviços de detecção de IP e travessia de NAT, incluindo:
tr: NTCP taşıyıcısı gibi, SSU taşıyıcısı da güvenilir, şifrelenmiş, bağlantıya odaklı, noktadan noktaya veri aktarımı sağlar. SSU taşıyıcısı ek olarak, aşağıdakiler ile birlikte IP adresi algılama ve NAT aktarım hizmetleri de sağlar:

source: Cooperative NAT/Firewall traversal using <a href="#introduction">introducers</a>
pt: Travessia cooperativa de NAT/Firewall usando <a href="#introduction">introdutores</a>
tr: <a href="#introduction">Tanıtıcıları</a> kullanarak işbirlikli NAT/Güvenlik duvarı geçişi

source: Local IP detection by inspection of incoming packets and <a href="#peerTesting">peer testing</a>
pt: Detecção de IP local por inspeção de pacotes de entrada e <a href="#peerTesting">teste de pares</a>
tr: Gelen paketlerin incelenmesi ve <a href="#peerTesting">eş sınaması</a> ile yerel IP adresi algılaması

source: Communication of firewall status and local IP, and changes to either to NTCP
pt: Comunicação do status do firewall e IP local, e alterações para NTCP
tr: Güvenlik duvarı durumu ve yerel IP iletişimi ve her ikisi için de NTCP üzerinde değişiklik yapılması

source: See below
pt: Veja abaixo
tr: Aşağıya bakın

source: Protocol Details
pt: Detalhes do Protocolo
tr: İletişim Kuralı Ayrıntıları

source: Congestion control
pt: Controle de congestionamento
tr: Tıkanıklık denetimi

source: SSU's need for only semireliable delivery, TCP-friendly operation, and the capacity for high throughput allows a great deal of latitude in congestion control. The congestion control algorithm outlined below is meant to be both efficient in bandwidth as well as simple to implement.
pt: A necessidade do SSU por apenas entrega semiconfiável, operação amigável ao TCP, e a capacidade para alto rendimento permite uma grande latitude no controle de congestionamento . O algoritmo de controle de congestionamento descrito abaixo é destinado a ser eficiente em largura de banda e também simples de implementar.
tr: SSU taşıyıcısının yarı güvenilir aktarım gereksinimi, TCP dostu çalışması ve yüksek çıkış kapasitesi sağlaması, tıkanıklık denetiminde büyük bir serbestlik sağlar. Aşağıda özetlenen tıkanıklık denetimi algoritmasının hem bant genişliği açısından verimli olması hem de basit şekilde uygulanması amaçlanmıştır.

source: Packets are scheduled according to the router's policy, taking care not to exceed the router's outbound capacity or to exceed the measured capacity of the remote peer. The measured capacity operates along the lines of TCP's slow start and congestion avoidance, with additive increases to the sending capacity and multiplicative decreases in face of congestion. Unlike for TCP, routers may give up on some messages after a given period or number of retransmissions while continuing to transmit other messages.
pt: Os pacotes são agendados de acordo com a política do roteador, tomando cuidado para não exceder a capacidade de saída do roteador ou exceder a capacidade medida de do peer remoto. A capacidade medida opera ao longo das linhas de início lento do TCP e prevenção de congestionamento, com aumentos aditivos de para a capacidade de envio e diminuições multiplicativas em face do congestionamento. Ao contrário do TCP, os roteadores podem desistir de algumas mensagens após um determinado período ou número de retransmissões enquanto continuam a transmitir outras mensagens.
tr: Paketler, yönelticinin gidiş kapasitesini aşmamaya veya uzak eşin ölçülen kapasitesini aşmamaya özen göstererek yöneltici ilkesine göre programlanır. Ölçülen kapasite, TCP üzerindeki yavaş başlatma ve tıkanıklıktan kaçınma sınırlarına göre çalışır. Gönderme kapasitesinde ek artış ve tıkanıklık durumunda çarpımsal azaltma özellikleri bulunur. TCP iletişim kuralından farklı olarak, yönelticiler belirli bir süre veya sayıda yeniden iletimden sonra diğer iletileri aktarmayı sürdürürken bazı iletileri atabilir.

source: The congestion detection techniques vary from TCP as well, since each message has its own unique and nonsequential identifier, and each message has a limited size - at most, 32KB. To efficiently transmit this feedback to the sender, the receiver periodically includes a list of fully ACKed message identifiers and may also include bitfields for partially received messages, where each bit represents the reception of a fragment. If duplicate fragments arrive, the message should be ACKed again, or if the message has still not been fully received, the bitfield should be retransmitted with any new updates.
pt: As técnicas de detecção de congestionamento também variam do TCP, já que cada mensagem tem seu próprio identificador único e não sequencial, e cada mensagem tem um tamanho limitado - no máximo, 32 KB. Para transmitir esse feedback de forma eficiente para o remetente, o receptor inclui periodicamente uma lista de identificadores de mensagem totalmente ACKed e também pode incluir campos de bits para mensagens parcialmente recebidas, onde cada bit representa a recepção de um fragmento. Se fragmentos duplicados chegarem, a mensagem deve ser ACKed novamente, ou se a mensagem ainda não tiver sido totalmente recebida, o campo de bits deve ser retransmitido com quaisquer novas atualizações.
tr: Tıkanıklık algılama teknikleri de TCP iletişim kuralından farklıdır. Her iletinin kendine özgü ve sıralı olmayan bir tanımlayıcısı vardır ve her iletinin boyutu sınırlıdır. En fazla 32KB olabilir. Bu geri bildirimi göndericiye verimli bir şekilde iletmek için, alıcı düzenli olarak tamamen onaylı (ACK) ileti tanımlayıcılarının bir listesini bulundurur ve ayrıca kısmen alınan iletiler için bit alanları içerebilir. Burada her bit bir parçanın alımını temsil eder. Yinelenen parçalar gelirse, ileti yeniden onaylanmalı (ACK) ya da ileti hala tam olarak alınmadıysa, bit alanı yeni güncellemelerle yeniden iletilmelidir.

source: The current implementation does not pad the packets to any particular size, but instead just places a single message fragment into a packet and sends it off (careful not to exceed the MTU).
pt: A implementação atual não preenche os pacotes com nenhum tamanho específico, mas apenas coloca um único fragmento de mensagem em um pacote e o envia (cuidado para não exceder o MTU).
tr: Var olan uygulama, paketleri belirli bir boyuta doldurmaz. Bunun yerine yalnızca tek bir ileti parçasını bir pakete yerleştirir ve gönderir (MTU değerinin aşılmamasına dikkat edin).

source: As of router version 0.8.12, two MTU values are used for IPv4: 620 and 1484. The MTU value is adjusted based on the percentage of packets that are retransmitted.
pt: A partir da versão 0.8.12 do roteador, dois valores de MTU são usados para IPv4: 620 e 1484. O valor de MTU é ajustado com base na porcentagem de pacotes que são retransmitidos.
tr: Yöneltici sürümü 0.8.12 ile başlayarak, IPv4 için iki MTU değeri kullanılır: 620 ve 1484. MTU değeri, yeniden aktarılan paketlerin yüzdesine göre ayarlanır.

source: For both MTU values, it is desirable that (MTU &#37; 16) == 12, so that the payload portion after the 28-byte IP/UDP header is a multiple of 16 bytes, for encryption purposes.
pt: Para ambos os valores de MTU, é desejável que (MTU &#37; 16) == 12, de modo que a porção de carga útil após o cabeçalho IP/UDP de 28 bytes seja um múltiplo de 16 bytes, para fins de criptografia.
tr: Her iki MTU değeri için de (MTU &#37; 16) == 12 olması istenir. Böylece 28 baytlık IP/UDP üst bilgisinden sonraki yük bölümü şifreleme amacıyla 16 baytın katı olur.

source: For the small MTU value, it is desirable to pack a 2646-byte Variable Tunnel Build Message efficiently into multiple packets; with a 620-byte MTU, it fits into 5 packets with nicely.
pt: Para um valor de MTU pequeno, é desejável empacotar uma Mensagem de Construção de Túnel Variável de 2646 bytes de forma eficiente em vários pacotes; com uma MTU de 620 bytes, ela cabe perfeitamente em 5 pacotes.
tr: Küçük MTU değeri için, 2646 baytlık bir değişken tünel oluşturma iletisinin birden çok pakete verimli bir şekilde paketlenmesi istenir. 620 bayt MTU ile 5 pakete güzelce sığar.

source: Based on measurements, 1492 fits nearly all reasonably small I2NP messages (larger I2NP messages may be up to 1900 to 4500 bytes, which isn't going to fit into a live network MTU anyway).
pt: Com base nas medições, 1492 acomoda quase todas as mensagens I2NP razoavelmente pequenas (mensagens I2NP maiores podem ter de 1900 a 4500 bytes, o que não acomodaria em uma MTU de rede ativa de qualquer maneira).
tr: Ölçümlere dayanarak, 1492, neredeyse tüm makul küçük I2NP iletilerine uyar (daha büyük I2NP iletileri, 1900 ile 4500 bayt arasında olabilir. Bu da zaten canlı bir ağ MTU değerine sığmaz).

source: The MTU values were 608 and 1492 for releases 0.8.9 - 0.8.11. The large MTU was 1350 prior to release 0.8.9.
pt: Os valores de MTU foram 608 e 1492 para as versões 0.8.9 - 0.8.11. A MTU grande era 1350 antes da versão 0.8.9.
tr: MTU değerleri, 0.8.9 - 0.8.11 sürümleri için 608 ve 1492 idi. Geniş MTU, 0.8.9 sürümünün yayınlanmasından önce 1350 idi.

source: The maximum receive packet size is 1571 bytes as of release 0.8.12. For releases 0.8.9 - 0.8.11 it was 1535 bytes. Prior to release 0.8.9 it was 2048 bytes.
pt: O tamanho máximo do pacote de recebimento é de 1571 bytes a partir da versão 0.8.12. Para as versões 0.8.9 - 0.8.11, era de 1535 bytes. Antes da versão 0.8.9, era de 2048 bytes.
tr: En fazla alınan paket boyutu, 0.8.12 sürümünden başlayarak 1571 bayt oldu. 0.8.9 - 0.8.11 sürümleri için 1535 bayttı. 0.8.9 sürümünden önce 2048 bayttı.

source: As of release 0.9.2, if a router's network interface MTU is less than 1484, it will publish that in the network database, and other routers should honor that when a connection is established.
pt: A partir da versão 0.9.2, se a MTU da interface de rede de um roteador for menor que 1484, ele publicará isso no banco de dados da rede, e outros roteadores deverão respeitar isso quando uma conexão for estabelecida.
tr: 0.9.2 sürümünden itibaren, bir yönelticinin ağ arabirimi MTU değeri 1484 bayttan azsa, bunu ağ veri tabanında yayınlar ve bir bağlantı kurulduğunda diğer yönelticiler buna saygı göstermelidir.

source: For IPv6, the minimum MTU is 1280. The IPv6 IP/UDP header is 48 bytes, so we use an MTU where (MTN &#37; 16 == 0), which is true for 1280. The maximum IPv6 MTU is 1488. (max was 1472 prior to version 0.9.28).
pt: Para IPv6, a MTU mínima é 1280. O cabeçalho IPv6 IP/UDP tem 48 bytes, então usamos uma MTU onde (MTN &#37; 16 == 0), o que é verdadeiro para 1280. A MTU máxima do IPv6 é 1488. (o máximo era 1472 antes da versão 0.9.28).
tr: IPv6 için en az MTU değeri 1280 bayttır. IPv6 IP/UDP üst bilgisi 48 bayttır. Bu nedenle 1280 için doğru olan (MTN &#37; 16 == 0) bir MTU kullanırız. En fazla IPv6 MTU değeri 1488 bayttır (0.9.28 sürümünden önce en fazla 1472 bayttır).

source: Message Size Limits
pt: Limites do Tamanho da Mensagem
tr: İleti Boyutu Sınırları

source: While the maximum message size is nominally 32KB, the practical limit differs. The protocol limits the number of fragments to 7 bits, or 128. The current implementation, however, limits each message to a maximum of 64 fragments, which is sufficient for 64 * 534 = 33.3 KB when using the 608 MTU. Due to overhead for bundled LeaseSets and session keys, the practical limit at the application level is about 6KB lower, or about 26KB. Further work is necessary to raise the UDP transport limit above 32KB. For connections using the larger MTU, larger messages are possible.
pt: Embora o tamanho máximo da mensagem seja nominalmente 32 KB, o limite prático é diferente. O protocolo limita o número de fragmentos a 7 bits, ou 128. A implementação atual, no entanto, limita cada mensagem a um máximo de 64 fragmentos, o que é suficiente para 64 * 534 = 33,3 KB ao usar a MTU 608. Devido à sobrecarga para LeaseSets e chaves de sessão agrupados, o limite prático no nível do aplicativo é cerca de 6 KB menor, ou cerca de 26 KB. Mais trabalho é necessário para aumentar o limite de transporte UDP acima de 32 KB. Para conexões usando a MTU maior, mensagens maiores são possíveis.
tr: En fazla ileti boyutu nominal olarak 32KB iken, pratik sınır farklıdır. İletişim kuralı, parça sayısını 7 ya da 128 bit ile sınırlar. Ancak var olan uygulama, her iletiyi, 608 MTU kullanıldığında 64 * 534 = 33,3 KB için yeterli olan en fazla 64 parça ile sınırlar. Birlikte verilen "Kiralama kümelerl" (LeaseSets) ve oturum anahtarları için oluşan ek yük nedeniyle, uygulama düzeyinde pratik sınır yaklaşık 6 KB daha düşük veya yaklaşık 26 KB olur. UDP taşıyıcı sınırını 32KB üzerine çıkarmak için daha fazla çalışma yapılması gerekiyor. Daha büyük MTU kullanan bağlantılarda daha büyük iletiler kullanılabilir.

source: Keys
pt: Chaves
tr: Anahtarlar

source: All encryption used is AES256/CBC with 32 byte keys and 16 byte IVs. When Alice originates a session with Bob, the MAC and session keys are negotiated as part of the DH exchange, and are then used for the HMAC and encryption, respectively. During the DH exchange, Bob's publicly knowable introKey is used for the MAC and encryption.
pt: Toda a criptografia usada é AES256/CBC com chaves de 32 bytes e IVs de 16 bytes. Quando Alice origina uma sessão com Bob, as chaves MAC e de sessão são negociadas como parte da troca DH e são então usadas para o HMAC e criptografia, respectivamente. Durante a troca DH, a introKey publicamente conhecida de Bob é usada para o MAC e criptografia.
tr: Kullanılan tüm şifreleme, 32 bayt anahtar ve 16 bayt "Başlatma vektörü" (IV) ile AES256/CBC yöntemidir. Alice, Bob ile bir oturum başlattığında, MAC ve oturum anahtarları üzerinde, Diffie-Hellman alış verişinin bir parçası olarak uzlaşılır ve ardından bunlar sırasıyla HMAC ve şifreleme için kullanılır. Diffie-Hellman alış verişi sırasında, Bob'un herkes tarafından bilinen introKey bilgisi MAC ve şifreleme için kullanılır.
