Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Intermediate tunnel participants do not know whether they are in an inbound or an outbound tunnel; they always "encrypt" for the next hop. Therefore, we take advantage of symmetric AES encryption to "decrypt" at the outbound tunnel gateway, so that the plaintext is revealed at the outbound endpoint.
pt: Os participantes do túnel intermediário não sabem se estão em um túnel de entrada ou de saída ; eles sempre "criptografam" para o próximo salto. Portanto, aproveitamos a criptografia AES simétrica para "descriptografar" no gateway do túnel de saída, para que o texto simples seja revelado no ponto de extremidade de saída.
tr: Ara tünel katılımcıları, bir geliş veya gidiş tünelinde olup olmadıklarını bilmez. Her zaman bir sonraki sıçrama için "şifreleme" yaparlar. Böylece, gidiş tüneli ağ geçidinde "şifrenin çözülmesi" için simetrik AES şifrelemesinden yararlanarak uç noktada düz metnin ortaya çıkması sağlanır.

source: Role
pt: Regra
tr: Rol

source: Preprocessing
pt: Pré-processamento
tr: Ön işleme

source: Encryption Operation
pt: Operação de Criptografia
tr: Şifreleme işlemi

source: Postprocessing
pt: Pós-processamento
tr: Art işleme

source: Outbound Gateway (Creator)
pt: Gateway de saída (criador)
tr: Gidiş ağ geçidi (oluşturucu)

source: Fragment, Batch, and Pad
pt: Fragmento, Lote e Pad
tr: Parçalama, toplu işlem ve dolgu

source: Iteratively encrypt (using decryption operations)
pt: Criptografar iterativamente (usando operações de descriptografia)
tr: Döngüsel şifreleme (şifre çözme işlemleri kullanılarak)

source: Forward to next hop
pt: Encaminhar para o próximo pulo
tr: Sonraki sıçramaya aktarma

source: Participant
pt: Participante
tr: Katılımcı

source: Decrypt (using an encryption operation)
pt: Descriptografar (usando uma operação de criptografia)
tr: Şifre çözme (şifreleme işlemi kullanılarak)

source: Decrypt (using an encryption operation) to reveal plaintext tunnel message
pt: Descriptografar (usando uma operação de criptografia) para revelar a mensagem do túnel em texto simples
tr: Düz metin tünel iletisini bulmak için şifre çözme (bir şifreleme işlemi kullanılarak)

source: Reassemble Fragments, Forward as instructed to Inbound Gateway or Router
pt: Remontar fragmentos, encaminhar conforme as instruções para o gateway de entrada ou roteador
tr: Parçaları birleştirme, geliş ağ geçidi ya da yönelticisi tarafından belirtildiği gibi iletim

source: Encrypt
pt: Encriptar
tr: Şifreleme

source: Inbound Endpoint (Creator)
pt: Ponto de extremidade de entrada (criador)
tr: Geliş uç noktası (oluşturucu)

source: Iteratively decrypt to reveal plaintext tunnel message
pt: Descriptografar iterativamente para revelar mensagem de túnel em texto simples
tr: Düz metin tünel iletisini bulmak için döngüsel şifre çözme

source: Reassemble Fragments, Receive data
pt: Remontar fragmentos, receber dados
tr: Parçaları birleştirme, verileri alma

source: Gateway Processing
pt: Processamento de Gateway
tr: Ağ geçidi işlemesi

source: Message Preprocessing
pt: Pré-processamento de mensagens
tr: İleti Ön İşlemesi

source: A tunnel gateway's function is to fragment and pack <a href="%(i2np)s">I2NP messages</a> into fixed-size <a href="%(tunnelmessage)s">tunnel messages</a> and encrypt the tunnel messages. Tunnel messages contain the following:
pt: A função de um gateway de túnel é fragmentar e compactar <a href="%(i2np)s">mensagens I2NP</a> em mensagens de túnel de tamanho fixo <a href="%(tunnelmessage)s"></a> e criptografar as mensagens de túnel. As mensagens de túnel contêm o seguinte:
tr: Bir tünel ağ geçidinin işlevi, <a href="%(i2np)s">I2NP iletilerini</a> sabit boyutlu <a href="%(tunnelmessage)s">tünel iletilerine</a> bölüp paketlemek ve tünel iletilerini şifrelemektir. Tünel iletilerinde şunlar bulunur:

source: A 4 byte Tunnel ID
pt: Um ID de túnel de 4 bytes
tr: 4 bayt uzunluğunda bir tünel kimliği

source: A 16 byte IV (initialization vector)
pt: Um IV de 16 bytes (vetor de inicialização)
tr: 16 bayt uzunluğunda “Başlatma vektörü” (IV)

source: A checksum
pt: Uma soma de verificação
tr: Bir sağlama

source: Padding, if necessary
pt: Preenchimento, se necessário
tr: Gerekiyorsa dolgu ekleme

source: One or more { delivery instruction, I2NP message fragment } pairs
pt: Um ou mais pares { delivery instruction, I2NP message fragment }
tr: Bir ya da birkaç { aktarım yönergeleri, I2NP ileti parçaları } eşi

source: Tunnel IDs are 4 byte numbers used at each hop - participants know what tunnel ID to listen for messages with and what tunnel ID they should be forwarded on as to the next hop, and each hop chooses the tunnel ID which they receive messages on. Tunnels themselves are short-lived (10 minutes). Even if subsequent tunnels are built using the same sequence of peers, each hop's tunnel ID will change.
pt: IDs de túnel são números de 4 bytes usados em cada salto - os participantes sabem qual ID de túnel ouvir mensagens e qual ID de túnel eles devem ser encaminhados para o próximo salto, e cada salto escolhe a ID de túnel na qual eles recebem mensagens . Os túneis em si têm vida curta (10 minutos). Mesmo se os túneis subsequentes forem construídos usando a mesma sequência de pares, a ID de túnel de cada salto mudará.
tr: Tünel kimlikleri, her sıçramada kullanılan 4 baytlık sayılardır. Katılımcılar, iletileri hangi tünel kimliğiyle dinleyeceğini ve bir sonraki sıçramayı hangi tünel kimliğine aktarmaları gerektiğini bilir ve her sıçrama, üzerinden ileti alacağı tünel kimliğini seçer. Tünellerin kendileri kısa ömürlüdür (10 dakika). Sonraki tüneller aynı eşler dizisi kullanılarak oluşturulsa bile, her sıçramanın tünel kimliği değişir.

source: To prevent adversaries from tagging the messages along the path by adjusting the message size, all tunnel messages are a fixed 1024 bytes in size. To accommodate larger I2NP messages as well as to support smaller ones more efficiently, the gateway splits up the larger I2NP messages into fragments contained within each tunnel message. The endpoint will attempt to rebuild the I2NP message from the fragments for a short period of time, but will discard them as necessary.
pt: Para evitar que adversários marquem as mensagens ao longo do caminho ajustando o tamanho da mensagem, todas as mensagens de túnel têm um tamanho fixo de 1024 bytes. Para acomodar mensagens I2NP maiores, bem como para suportar as menores de forma mais eficiente, o gateway divide as mensagens I2NP maiores em fragmentos contidos em cada mensagem de túnel. O ponto final tentará reconstruir a mensagem I2NP a partir dos fragmentos por um curto período de tempo, mas os descartará conforme necessário.
tr: Saldırganların ileti boyutunu ayarlayarak, iletileri yol boyunca etiketlemesini önlemek için, tüm tünel iletilerinin boyutu sabit 1024 bayttır. Daha büyük I2NP iletilerini barındırmak ve daha küçük olanları daha verimli bir şekilde desteklemek için ağ geçidi, daha büyük I2NP iletilerini her tünel iletisinde bulunan parçalara böler. Uç nokta, kısa bir süre için parçalardan I2NP iletisini yeniden oluşturmaya çalışır, ancak gerektiğinde bunları atar.

source: Details are in the <a href="%(tunnelmessage)s">tunnel message specification</a>.
pt: Os detalhes estão na especificação da mensagem de túnel <a href="%(tunnelmessage)s"></a>.
tr: Ayrıntılı bilgi almak için <a href="%(tunnelmessage)s">tünel iletisi teknik özellikleri</a> bölümüne bakabilirsiniz.

source: Gateway Encryption
pt: Criptografia de Gateway
tr: Ağ Geçidi Şifrelemesi

source: After the preprocessing of messages into a padded payload, the gateway builds a random 16 byte IV value, iteratively encrypting it and the tunnel message as necessary, and forwards the tuple {tunnelID, IV, encrypted tunnel message} to the next hop.
pt: Após o pré-processamento das mensagens em uma carga útil preenchida, o gateway cria um valor IV aleatório de 16 bytes, criptografando-o iterativamente e a mensagem do túnel conforme necessário, e encaminha a tupla {tunnelID, IV, encrypted tunnel message} para o próximo salto.
tr: İletilerin dolgulu bir yük şeklinde ön işlenmesinden sonra, ağ geçidi rastgele 16 baytlık bir IV değeri oluşturur. Bunu ve tünel iletisini gerektiği gibi döngüsel olarak şifreler ve {tunnelID, IV, şifrelenmiş tünel iletisi grubunu bir sonraki sıçramaya iletir.

source: How encryption at the gateway is done depends on whether the tunnel is an inbound or an outbound tunnel. For inbound tunnels, they simply select a random IV, postprocessing and updating it to generate the IV for the gateway and using that IV along side their own layer key to encrypt the preprocessed data. For outbound tunnels they must iteratively decrypt the (unencrypted) IV and preprocessed data with the IV and layer keys for all hops in the tunnel. The result of the outbound tunnel encryption is that when each peer encrypts it, the endpoint will recover the initial preprocessed data.
pt: A forma como a criptografia no gateway é feita depende se o túnel é um túnel de entrada ou de saída. Para túneis de entrada, eles simplesmente selecionam um IV aleatório, pós-processando e atualizando-o para gerar o IV para o gateway e usando esse IV junto com sua própria chave de camada para criptografar os dados pré-processados. Para túneis de saída , eles devem descriptografar iterativamente o IV (não criptografado) e os dados pré-processados com o IV e as chaves de camada para todos os saltos no túnel. O resultado da criptografia do túnel de saída é que quando cada par o criptografa, o ponto final recuperará os dados pré-processados iniciais.
tr: Ağ geçidinde şifrelemenin nasıl yapılacağı, tünelin geliş veya gidiş tüneli olmasına bağlıdır. Geliş tünelleri, yalnızca rastgele bir IV seçer, ağ geçidinin IV değerini oluşturmak için onu son işleyip günceller ve ön işlenmiş verileri şifrelemek için bu IV değerini kendi katman anahtarının yanında kullanır. Gidiş tünelleri, tüneldeki tüm atlamalar için IV ve katman anahtarları ile (şifrelenmemiş) IV ve önceden işlenmiş verilerin şifresini döngüsel olarak çözmelidir. Gidiş tüneli şifrelemesinin sonucunda, her bir eş bunu şifrelediğinde, uç noktada ön işlenmiş ilk veriler elde edilir.

source: Participant Processing
pt: Processamento de Participantes
tr: Katılımcı İşlemesi

source: When a peer receives a tunnel message, it checks that the message came from the same previous hop as before (initialized when the first message comes through the tunnel). If the previous peer is a different router, or if the message has already been seen, the message is dropped. The participant then encrypts the received IV with AES256/ECB using their IV key to determine the current IV, uses that IV with the participant's layer key to encrypt the data, encrypts the current IV with AES256/ECB using their IV key again, then forwards the tuple {nextTunnelId, nextIV, encryptedData} to the next hop. This double encryption of the IV (both before and after use) help address a certain class of confirmation attacks.
pt: Quando um peer recebe uma mensagem de túnel, ele verifica se a mensagem veio de o mesmo salto anterior de antes (inicializado quando a primeira mensagem chega através de o túnel). Se o peer anterior for um roteador diferente, ou se a mensagem já tiver sido vista, a mensagem é descartada. O participante então criptografa o IV recebido com AES256/ECB usando sua chave IV para determinar o IV atual, usa aquele IV com a chave de camada do participante para criptografar os dados, criptografa o IV atual com AES256/ECB usando sua chave IV novamente, então encaminha a tupla {nextTunnelId, nextIV, encryptedData} para o próximo salto. Essa criptografia dupla do IV (antes e depois do uso) ajuda a lidar com uma certa classe de ataques de confirmação .
tr: Bir eş bir tünel iletisi aldığında, iletinin önceki sıçramadan geldiğini denetler (ilk ileti tünelden geldiğinde hazırlanır). Önceki eş farklı bir yönelticiyse veya ileti zaten görülmüşse, ileti atılır. Katılımcı daha sonra geçerli IV değerini belirlemek için IV anahtarını kullanarak alınan IV verilerini AES256/ECB ile şifreler. Bu IV değerini katılımcının katman anahtarıyla verileri şifrelemek için kullanır. Geçerli IV değerini IV anahtarını kullanarak AES256/ECB ile şifreler, ardından {nextTunnelId, nextIV,cryptData} demetini bir sonraki sıçramaya aktarır. IV üzerinde yapılan bu çift şifreleme (hem kullanımdan önce hem de kullanımdan sonra), belirli bir onay saldırısı sınıfına karşı savunma oluşturmakta yardımcı olur.

source: Duplicate message detection is handled by a decaying Bloom filter on message IVs. Each router maintains a single Bloom filter to contain the XOR of the IV and the first block of the message received for all of the tunnels it is participating in, modified to drop seen entries after 10-20 minutes (when the tunnels will have expired). The size of the bloom filter and the parameters used are sufficient to more than saturate the router's network connection with a negligible chance of false positive. The unique value fed into the Bloom filter is the XOR of the IV and the first block so as to prevent nonsequential colluding peers in the tunnel from tagging a message by resending it with the IV and first block switched.
pt: A detecção de mensagens duplicadas é tratada por um filtro Bloom decadente em IVs de mensagem . Cada roteador mantém um único filtro Bloom para conter o XOR do IV e o primeiro bloco da mensagem recebida para todos os túneis dos quais ele participa , modificado para descartar entradas vistas após 10-20 minutos (quando os túneis terão expirado). O tamanho do filtro Bloom e os parâmetros usados são suficientes para mais do que saturar a conexão de rede do roteador com uma chance insignificante de falso positivo. O valor exclusivo alimentado no filtro Bloom é o XOR do IV e do primeiro bloco, de modo a evitar que pares em conluio não sequenciais no túnel marquem uma mensagem reenviando-a com o IV e o primeiro bloco trocados.
tr: Yinelenen ileti algılaması, ileti IV değerlerinde eskitme yapan bir Bloom süzgeci tarafından işlenir. Her yöneltici, katıldığı tüm tüneller için, alınan iletinin ilk bloğu ile IV değerinin XOR sonucunu üretir, 10-20 dakika sonra (tünellerin süresi dolduğunda) görülmüş kayıtları atacak şekilde değiştirir. Bloom süzgecinin boyutu ve kullanılan parametreler, yönelticinin ağ bağlantısını ihmal edilebilir bir hatalı doğru olasılığıyla doyurmaktan daha fazlası için yeterlidir. Bloom süzgecine gönderilen benzersiz değer, ilk blok ile IV değerinin XOR sonucudur ve tüneldeki sıralı olmayan çakışan eşlerin bir iletisinin IV ve ilk blok değiştirilmiş olarak yeniden gönderilerek etiketlenmesini önler.

source: Endpoint Processing
pt: Processamento de ponto final
tr: Uç Nokta İşlemesi

source: After receiving and validating a tunnel message at the last hop in the tunnel, how the endpoint recovers the data encoded by the gateway depends upon whether the tunnel is an inbound or an outbound tunnel. For outbound tunnels, the endpoint encrypts the message with its layer key just like any other participant, exposing the preprocessed data. For inbound tunnels, the endpoint is also the tunnel creator so they can merely iteratively decrypt the IV and message, using the layer and IV keys of each step in reverse order.
pt: Após receber e validar uma mensagem de túnel no último salto no túnel, como o ponto final recupera os dados codificados pelo gateway depende se o túnel é um túnel de entrada ou de saída. Para túneis de saída, o ponto final criptografa a mensagem com sua chave de camada, assim como qualquer outro participante, expondo os dados pré-processados. Para túneis de entrada, o ponto final também é o criador do túnel, então eles podem apenas descriptografar iterativamente o IV e a mensagem, usando as chaves de camada e IV de cada etapa na ordem inversa.
tr: Tüneldeki son sıçramada bir tünel iletisini aldıktan ve doğruladıktan sonra, uç noktanın ağ geçidi tarafından kodlanan verileri nasıl elde edeceği tünelin geliş ya da gidiş tüneli olmasına bağlıdır. Gidiş tüneller için uç nokta, iletiyi diğer katılımcılar gibi katman anahtarıyla şifreleyerek ön işlenmiş verileri açığa çıkarır. Geliş tünellerinde, uç nokta aynı zamanda tünel oluşturucudur. Bu nedenle IV ve iletinin şifresini her adımın katman ve IV anahtarlarını ters sırada kullanarak yalnızca döngüsel olarak çözebilirler.

source: At this point, the tunnel endpoint has the preprocessed data sent by the gateway, which it may then parse out into the included I2NP messages and forwards them as requested in their delivery instructions.
pt: Neste ponto, o ponto final do túnel tem os dados pré-processados enviados pelo gateway, , que ele pode então analisar nas mensagens I2NP incluídas e encaminhá-las conforme solicitado em suas instruções de entrega.
tr: Bu noktada, tünel uç noktası, ağ geçidi tarafından gönderilen ve daha sonra katılan I2NP iletilerine ayrıştırabilecek ve bunları aktarım yönergelerinde istendiği gibi aktarabilecek ön işlenmiş verilere sahiptir.

source: Tunnel Building
pt: Construção de Túnel
tr: Tünel Oluşturma

source: When building a tunnel, the creator must send a request with the necessary configuration data to each of the hops and wait for all of them to agree before enabling the tunnel. The requests are encrypted so that only the peers who need to know a piece of information (such as the tunnel layer or IV key) has that data. In addition, only the tunnel creator will have access to the peer's reply. There are three important dimensions to keep in mind when producing the tunnels: what peers are used (and where), how the requests are sent (and replies received), and how they are maintained.
pt: Ao construir um túnel, o criador deve enviar uma solicitação com os dados de configuração necessários para cada um dos saltos e esperar que todos eles concordem antes de habilitar o túnel. As solicitações são criptografadas para que apenas os pares que precisam saber uma informação (como a camada do túnel ou a chave IV) tenham esses dados. Além disso, apenas o criador do túnel terá acesso à resposta do par. Há três dimensões importantes a serem lembradas ao produzir os túneis: quais pares são usados (e onde), como as solicitações são enviadas (e as respostas são recebidas) e como são mantidas.
tr: Bir tünel oluştururken, oluşturucu, sıçramaların her birine gerekli yapılandırma verilerini içeren bir istek göndermeli ve tüneli etkinleştirmeden önce tümünün kabul etmesini beklemelidir. İstekler, yalnızca bir bilgiyi (tünel katmanı veya IV anahtarı gibi) bilmesi gereken eşlerin bu verilere sahip olması için şifrelenir. Ayrıca, yalnızca tünel oluşturucu eşin yanıtına erişebilir. Tünelleri oluştururken akılda tutulması gereken üç önemli boyut vardır: Hangi eşlerin kullanıldığı (ve nerede), isteklerin nasıl gönderildiği (ve yanıtların alındığı) ve bunların nasıl sürdürüldüğü.

source: Beyond the two types of tunnels - inbound and outbound - there are two styles of peer selection used for different tunnels - exploratory and client. Exploratory tunnels are used for both network database maintenance and tunnel maintenance, while client tunnels are used for end to end client messages.
pt: Além dos dois tipos de túneis - de entrada e de saída - há dois estilos de seleção de pares usados para diferentes túneis - exploratório e cliente. Os túneis exploratórios são usados para manutenção de banco de dados de rede e manutenção de túneis , enquanto os túneis de cliente são usados para mensagens de cliente de ponta a ponta.
tr: İki tür tünelin (geliş ve gidiş) ötesinde, farklı tüneller için kullanılan iki eş seçim türü daha vardır: Keşif ve istemci. Keşif tünelleri hem ağ veri tabanı (netDB) bakımı hem de tünel bakımı için kullanılırken, istemci tünelleri uçtan uca istemci iletileri için kullanılır.

source: Exploratory tunnel peer selection
pt: Seleção de pares de túneis exploratórios
tr: Keşif tüneli eş seçimi

source: Exploratory tunnels are built out of a random selection of peers from a subset of the network. The particular subset varies on the local router and on what their tunnel routing needs are. In general, the exploratory tunnels are built out of randomly selected peers who are in the peer's "not failing but active" profile category. The secondary purpose of the tunnels, beyond merely tunnel routing, is to find underutilized high capacity peers so that they can be promoted for use in client tunnels.
pt: Túneis exploratórios são construídos a partir de uma seleção aleatória de pares de um subconjunto da rede. O subconjunto específico varia no roteador local e em quais são suas necessidades de roteamento de túnel. Em geral, os túneis exploratórios são construídos a partir de pares selecionados aleatoriamente que estão na categoria de perfil "não falhando, mas ativo" do par. O propósito secundário dos túneis, além do mero roteamento de túnel, é encontrar pares de alta capacidade subutilizados para que eles possam ser promovidos para uso em túneis de cliente.
tr: Keşif tünelleri, ağın bir alt kümesinden rastgele seçilen eşlerden oluşur. Belirli alt küme, yerel yönelticiye ve tünel yöneltme gereksinimlerinin ne olduğuna göre değişir. Genel olarak, keşif tünelleri, eşin "başarısız değil ama etkin" profil kategorisinde bulunan rastgele seçilmiş eşlerinden oluşturulur. Tünellerin ikincil amacı, yalnızca tünel yöneltmenin ,ötesinde, istemci tünellerinde kullanılmak üzere yükseltmek için yeterince kullanılmayan yüksek kapasiteli eşler bulmaktır.

source: Exploratory peer selection is discussed further on the <a href="%(peerselection)s">Peer Profiling and Selection page</a>.
pt: A seleção exploratória de pares é discutida mais detalhadamente na página <a href="%(peerselection)s">Seleção e Perfil de Pares</a>.
tr: Keşif amaçlı eş seçimi, <a href="%(peerselection)s">Eş profilinin belirlenmesi ve seçimi sayfasında</a> ayrıntılı olarak ele alınmıştır.

source: Client tunnel peer selection
pt: Seleção de pares de túnel do cliente
tr: İstemci tüneli eş seçimi

source: Client tunnels are built with a more stringent set of requirements - the local router will select peers out of its "fast and high capacity" profile category so that performance and reliability will meet the needs of the client application. However, there are several important details beyond that basic selection that should be adhered to, depending upon the client's anonymity needs.
pt: Os túneis do cliente são construídos com um conjunto mais rigoroso de requisitos - o roteador local selecionará pares de sua categoria de perfil "rápido e de alta capacidade" para que o desempenho e a confiabilidade atendam às necessidades do aplicativo cliente. No entanto, há vários detalhes importantes além dessa seleção básica que devem ser respeitados, dependendo das necessidades de anonimato do cliente.
tr: İstemci tünelleri daha katı gereksinim kümesiyle oluşturulur. Yerel yöneltici, başarım ve güvenilirliğin istemci uygulamasının gereksinimlerini karşılaması için "hızlı ve yüksek kapasiteli" profil kategorisinden eşler seçer. Ancak, istemcinin anonimlik gereksinimlerine bağlı olarak, bu temel seçimin ötesinde uyulması gereken birkaç önemli ayrıntı vardır.

source: Client peer selection is discussed further on the <a href="%(peerselection)s">Peer Profiling and Selection page</a>.
pt: A seleção de pares do cliente é discutida mais detalhadamente na página <a href="%(peerselection)s">Seleção e Perfil de Pares</a>.
tr: İstemci eş seçimi, <a href="%(peerselection)s">Eş profilinin belirlenmesi ve seçimi sayfasında</a> ayrıntılı olarak ele alınmıştır.

source: Peer Ordering within Tunnels
pt: Ordenação por pares dentro de túneis
tr: Tünellerde Eş Sıralaması
