Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Now all we need to do is telnet into 127.0.0.1, port 37337, send the destination key or host address from address book we want to contact. In this case, we want to contact "mouth", all we do is paste in the key and it goes.
pt: Agora, tudo o que precisamos fazer é fazer telnet para 127.0.0.1, porta 37337, enviar a chave de destino ou o endereço do host do catálogo de endereços que queremos contatar. Neste caso, queremos contatar "mouth", tudo o que fazemos é colar a chave e pronto.
tr: Şimdi tek yapmamız gereken 127.0.0.1 adresinden 37337 numaralı bağlantı noktasına telnet açtıktan sonra, iletişim kurmak istediğimiz adres defterinden hedef anahtarı veya sunucu adresini göndermektir. Bu durumda "ağız" ile iletişime geçmek istiyoruz, tek yapmamız gereken anahtarı yapıştırmak ve göndermek.

source: <b>NOTE:</b> The "quit" command in the command channel does NOT disconnect the tunnels like SAM.
pt: <b>NOTA:</b> O comando "quit" no canal de comando NÃO desconecta os túneis como o SAM.
tr: <b>NOT:</b> Komut kanalındaki "quit" komutu, SAM gibi tünellerin bağlantısını KESMEZ.

source: After a few virtual miles of this spew, press <code>Control-]</code>
pt: Depois de algumas milhas virtuais desse vômito, pressione <code>Control-]</code>
tr: Bu püskürmenin birkaç sanal mili geçtikten sonra, <code>Control-]</code> üzerine basın

source: Here is what happened...
pt: Eis aqui o que acontece...
tr: İşte olanlar...

source: You can connect to I2P SITES too!
pt: Você também pode se conectar aos SITES I2P!
tr: I2P sitelerine de bağlanabilirsiniz!

source: Pretty cool isn't it? Try some other well known I2P SITES if you like, nonexistent ones, etc, to get a feel for what kind of output to expect in different situations. For the most part, it is suggested that you ignore any of the error messages. They would be meaningless to the application, and are only presented for human debugging.
pt: Muito legal, não é? Tente outros SITES I2P bem conhecidos, se quiser, inexistentes, etc, para ter uma ideia de que tipo de saída esperar em diferentes situações. Na maioria das vezes, é sugerido que você ignore qualquer uma das mensagens de erro. Elas não teriam sentido para o aplicativo e são apresentadas apenas para depuração humana.
tr: Çok güzel değil mi? Farklı durumlarda ne tür bir çıktının beklendiğini anlamak için, isterseniz, iyi bilinen diğer bazı I2P sitelerini, var olmayanları vb. deneyin. Çoğunlukla, hata iletilerinden tümünü görmezden gelmeniz önerilir. Uygulama için anlamları yoktur ve yalnızca insan hata ayıklaması için sunulurlar.

source: Let's put down our destinations now that we are all done with them.
pt: Vamos anotar nossos destinos agora que já terminamos de conhecê-los.
tr: Artık onlarla işimiz bittiğine göre hedeflerimizi yazalım.

source: First, lets see what destination nicknames we have.
pt: Primeiro, vamos ver quais apelidos de destino temos.
tr: İlk olarak, hangi hedef takma adlarına sahip olduğumuzu görelim.

source: Alright, there they are. First, let's remove "mouth".
pt: Certo, aqui estão eles. Primeiro, vamos remover "boca".
tr: Tamam, işte buradalar. Önce "ağız" hedefini kaldıralım.

source: Now to remove "ear", note that this is what happens when you type too fast, and shows you what typical ERROR messages looks like.
pt: Agora, para remover "orelha", observe que isso é o que acontece quando você digita muito rápido, e mostra como são as mensagens de ERRO típicas.
tr: Şimdi "kulağı" kaldırmak için, çok hızlı yazdığınızda olanın bu olduğunu ve size tipik HATA iletilerinin nasıl göründüğünü gösterdiğini unutmayın.

source: I won't bother to show an example of the receiver end of a bridge because it is very simple. There are two possible settings for it, and it is toggled with the "quiet" command.
pt: Não vou me incomodar em mostrar um exemplo da extremidade do receptor de uma ponte porque é muito simples. Há duas configurações possíveis para ela, e ela é alternada com o comando "quiet".
tr: Çok basit olduğu için bir köprünün alıcı ucunun bir örneğini göstermeye zahmet etmeyeceğim. Bunun için iki olası ayar vardır ve "quiet" komutuyla değiştirilir.

source: The default is NOT quiet, and the first data to come into your listening socket is the destination that is making the contact. It is a single line consisting of the BASE64 address followed by a newline. Everything after that is for the application to actually consume.
pt: O padrão NÃO é quiet, e os primeiros dados a entrarem no seu soquete de escuta são o destino que está fazendo o contato. É uma linha única consistindo do endereço BASE64 seguido por uma nova linha. Tudo depois disso é para o aplicativo realmente consumir.
tr: Varsayılan quiet DEĞİLDİR ve dinleme soketinize gelen ilk veri, bağlantı kuran hedeftir. BASE64 adresinin ardından yeni bir satırdan oluşan tek bir satırdır. Bundan sonraki her şey, uygulamanın gerçekten tüketmesi içindir.

source: In quiet mode, think of it as a regular Internet connection. No extra data comes in at all. It's just as if you are plain connected to the regular Internet. This mode allows a form of transparency much like is available on the router console tunnel settings pages, so that you can use BOB to point a destination at a web server, for example, and you would not have to modify the web server at all.
pt: No modo silencioso, pense nisso como uma conexão de Internet regular. Nenhum dado extra entra. É como se você estivesse conectado à Internet regular. Este modo permite uma forma de transparência muito parecida com a disponível nas páginas de configurações do túnel do console do roteador, para que você possa usar o BOB para apontar um destino para um servidor web, por exemplo, e você não teria que modificar o servidor web de forma alguma.
tr: Quiet kipinde, normal bir İnternet bağlantısı gibi düşünün. Hiçbir ek veri gelmiyor. Normal İnternete doğrudan bağlıymışsınız gibi. Bu kip, yöneltici panosu tünel ayarları sayfalarında bulunana çok benzer bir saydamlık biçimine izin verir. Böylece örneğin bir site sunucusunda bir hedefi göstermek için BOB kullanabilirsiniz ve site sunucusunda değişiklik yapmanız gerekmez.

source: The advantage with using BOB for this is as discussed previously. You could schedule random uptimes for the application, redirect to a different machine, etc. One use of this may be something like wanting to try to goof up router-to-destination upness guessing. You could stop and start the destination with a totally different process to make random up and down times on services. That way you would only be stopping the ability to contact such a service, and not have to bother shutting it down and restarting it. You could redirect and point to a different machine on your LAN while you do updates, or point to a set of backup machines depending on what is running, etc, etc. Only your imagination limits what you could do with BOB.
pt: A vantagem de usar BOB para isso é como discutido anteriormente. Você pode agendar tempos de atividade aleatórios para o aplicativo, redirecionar para uma máquina diferente, etc. Um uso disso pode ser algo como querer tentar estragar a adivinhação de atividade do roteador para o destino. Você pode parar e iniciar o destino com um processo totalmente diferente para criar tempos de atividade e inatividade aleatórios em serviços. Dessa forma, você estaria apenas interrompendo a capacidade de contatar tal serviço, e não teria que se preocupar em desligá-lo e reiniciá-lo. Você pode redirecionar e apontar para uma máquina diferente na sua LAN enquanto faz atualizações, ou apontar para um conjunto de máquinas de backup dependendo do que está em execução, etc., etc. Somente sua imaginação limita o que você pode fazer com o BOB.
tr: Bunun için BOB kullanmanın avantajı daha önce tartışıldığı gibidir. Uygulama için rastgele çalışma süreleri planlayabilir, farklı bir bilgisayara yeniden yönlendirebilir vb. Hizmetlerde rastgele açılış ve kapanış zamanları oluşturmak için tamamen farklı bir süreçle hedefi durdurabilir ve başlatabilirsiniz. Bu şekilde, yalnızca böyle bir hizmetle iletişim kurma yeteneğini durdurmuş olursunuz ve onu kapatıp yeniden başlatmakla uğraşmanıza gerek kalmaz. Güncellemeler yaparken yerel ağıjnızdaki farklı bir bilgisayarı yönlendirebilir ve gösterebilir veya neyin çalıştığına vb. bağlı olarak bir dizi yedekleme biligsayarına işaret edebilirsiniz. BOB ile yapabilecekleriniz hayallerinizle sınırlıdır.

source: February 2019
pt: Fevereiro de 2019
tr: 2019 Şubat

source: Datagram Overview
pt: Uma visão geral do datagrama
tr: Veri Şeması Özeti

source: Datagrams build upon the base <a href="%(i2cp)s">I2CP</a> to provide authenticated and repliable messages in a standard format. This lets applications reliably read the "from" address out of a datagram and know that the address really sent the message. This is necessary for some applications since the base I2P message is completely raw - it has no "from" address (unlike IP packets). In addition, the message and sender are authenticated by signing the payload.
pt: Os datagramas são construídos sobre a base <a href="%(i2cp)s">I2CP</a> para fornecer mensagens autenticadas e replicáveis em um formato padrão. Isso permite que os aplicativos leiam de forma confiável o endereço "de" de um datagrama e saibam que o endereço realmente enviou a mensagem. Isso é necessário para alguns aplicativos, pois a mensagem I2P base é completamente crua - ela não tem endereço "de" (ao contrário dos pacotes IP). Além disso, a mensagem e o remetente são autenticados assinando a carga útil.
tr: Veri şemaları, standart bir biçimde kimliği doğrulanmış ve yinelenebilir iletiler sağlamak için <a href="%(i2cp)s">I2CP</a> tabanı üzerine oluşturulur. Böylece, uygulamalar bir veri şemasından "gönderici" adresini güvenilir bir şekilde okuyabilir ve adresin gerçekten iletiyi gönderdiğinin bilinmesini sağlar. Bu özellik, bazı uygulamalar için gereklidir, çünkü temel I2P iletisi tamamen hamdır - "gönderici" adresi yoktur (IP paketlerinin aksine). Ayrıca, ileti ve göndericinin kimliği, veri yükü imzalanarak doğrulanır.

source: Datagrams, like <a href="%(streaming)s">streaming library packets</a>, are an application-level construct. These protocols are independent of the low-level <a href="%(transports)s">transports</a>; the protocols are converted to I2NP messages by the router, and either protocol may be carried by either transport.
pt: Datagramas, como <a href="%(streaming)s">pacotes de biblioteca de streaming</a>, são uma construção de nível de aplicação. Esses protocolos são independentes dos transportes de baixo nível <a href="%(transports)s"></a>; os protocolos são convertidos em mensagens I2NP pelo roteador, e qualquer protocolo pode ser transportado por qualquer transporte.
tr: <a href="%(streaming)s">Streaming kitaplığı paketleri</a> gibi veri şemaları, uygulama düzeyinde yapılardır. Bu iletişim kuralları, düşük düzeyli <a href="%(transports)s">taşıyıcılardan</a> bağımsızdır. İletişim kuralları yöneltici tarafından I2NP iletilerine dönüştürülür ve her iki iletişim kuralı da her iki taşıyıcı ile aktarılabilir.

source: Application Guide
pt: Guia de aplicações
tr: Uygulama Rehberi

source: Applications written in Java may use the <a href="%(url)s">datagram API</a>, while applications in other languages can use <a href="%(sam)s">SAM</a>'s datagram support. There is also limited support in i2ptunnel in the <a href="%(socks)s">SOCKS proxy</a>, the 'streamr' tunnel types, and udpTunnel classes.
pt: Aplicações escritas em Java podem usar a API de datagrama <a href="%(url)s"></a>, enquanto aplicações em outras linguagens podem usar o suporte a datagramas do <a href="%(sam)s">SAM</a>. Também há suporte limitado no i2ptunnel no <a href="%(socks)s">proxy SOCKS</a>, os tipos de túnel 'streamr' e as classes udpTunnel.
tr: Java ile yazılmış uygulamalar <a href="%(url)s">veri şeması API</a> kullanabilirken, diğer dillerdeki uygulamalar <a href="%(sam)s">SAM</a> veri şeması desteğini kullanabilir. Ayrıca <a href="%(socks)s">SOCKS vekil sunucu</a> içindeki i2ptunnel üzerinde, 'streamr' tünel türlerinde ve udpTunnel sınıflarında sınırlı destek vardır.

source: Datagram Length
pt: Comprimento do datagrama
tr: Veri Şeması Uzunluğu

source: The application designer should carefully consider the tradeoff of repliable vs. non-repliable datagrams. Also, the datagram size will affect reliability, due to tunnel fragmentation into 1KB tunnel messages. The more message fragments, the more likely that one of them will be dropped by an intermediate hop. Messages larger than a few KB are not recommended. Over about 10 KB, the delivery probablility drops dramatically. Messages over 16 KB cannot be delivered over NTCP, dropping delivery chances even more.
pt: O designer do aplicativo deve considerar cuidadosamente a compensação de datagramas replicáveis vs. não replicáveis. Além disso, o tamanho do datagrama afetará a confiabilidade, devido à fragmentação do túnel em mensagens de túnel de 1 KB . Quanto mais fragmentos de mensagem, maior a probabilidade de um deles ser descartado por um salto intermediário. Mensagens maiores do que alguns KB não são recomendadas. Acima de cerca de 10 KB, a probabilidade de entrega cai drasticamente. Mensagens acima de 16 KB não podem ser entregues por NTCP, diminuindo ainda mais as chances de entrega.
tr: Uygulama tasarımcısı, yinelenebilir ve yinelenemeyen veri şemaları arasındaki dengeyi dikkatlice düşünmelidir. Ayrıca, tünel iletileri 1KB boyutunda paketlere bölündüğünden veri şeması boyutu güvenilirliği etkiler. İleti parçaları ne kadar fazlaysa, bunlardan birinin bir ara durak tarafından kaybedilmesi olasılığı yükselir. Birkaç KB boyutundan büyük iletilerin kullanılması önerilmez. Yaklaşık 10 KB üzerinde, teslim olasılığı önemli ölçüde düşer. 16 KB üzerindeki mesajlar NTCP üzerinden teslim edilemez ve bu da teslim şansını daha da düşürür.

source: Also note that the various overheads added by lower layers, in particular asymmetric <a href="%(elgamalaes)s">ElGamal/AES</a>, place a large burden on intermittent messages such as used by a Kademlia-over-UDP application. The implementations are currently tuned for frequent traffic using the streaming library. There are a high number of session tags delivered, and a short session tag lifetime, for example. There are currently no configuration parameters available within I2CP to tune the ElGamal Session Tag parameters.
pt: Observe também que as várias sobrecargas adicionadas por camadas inferiores, em particular assimétricas <a href="%(elgamalaes)s">ElGamal/AES</a>, colocam uma grande carga em mensagens intermitentes como as usadas por um aplicativo Kademlia sobre UDP. As implementações estão atualmente ajustadas para tráfego frequente usando a biblioteca de streaming. Há um alto número de tags de sessão entregues e uma curta duração de tag de sessão, por exemplo. Atualmente, não há parâmetros de configuração disponíveis no I2CP para ajustar os parâmetros da tag de sessão ElGamal.
tr: Ayrıca, alt katmanlar tarafından eklenen çeşitli ek yüklerin, özellikle asimetrik <a href="%(elgamalaes)s">ElGamal/AES</a>, bir UDP üzerinden Kademlia uygulaması tarafından kullanıldığı gibi aralıklı iletilere büyük bir yük getirdiğine dikkat edin. Uygulamalar şu anda Streaming kitaplığı kullanılarak yoğun trafik için ayarlanmıştır. Örneğin, teslim edilen çok sayıda oturum etiketi ve kısa bir oturum etiketi ömrü vardır. Şu anda I2CP içinde, ElGamal oturum etiketi parametrelerini ayarlamak için herhangi bir yapılandırma parametresi bulunmuyor.

source: I2CP Protocol Number and Ports
pt: Número e Portas do Protocolo I2CP
tr: I2CP İletişim Kuralı ve Bağlantoı Noktaları

source: The standard I2CP protocol number for datagrams is PROTO_DATAGRAM (17). Applications may or may not choose to set the protocol in the I2CP header. It is not set by default. It must be set to demultiplex datagram and streaming traffic received on the same Destination.
pt: O número do protocolo I2CP padrão para datagramas é PROTO_DATAGRAM (17). Os aplicativos podem ou não escolher definir o protocolo no cabeçalho I2CP. Ele não é definido por padrão. Ele deve ser definido para demultiplexar o tráfego de datagrama e streaming recebido no mesmo Destino.
tr: Veri şemalarının standart I2CP iletişim kuralı numarası PROTO_DATAGRAM (17) şeklindedir. Uygulamalar, iletişim kuralını I2CP başlığında ayarlamayı seçebilir veya seçmeyebilir. Varsayılan olarak ayarlanmamıştır. Aynı hedefte alınan veri şemalarını ve Streaming trafiğini tekilleyecek şekilde ayarlanmalıdır.

source: As datagrams are not connection-oriented, the application may require port numbers to correlate datagrams with particular peers or communications sessions, as is traditional with UDP over IP. Applications may add 'from' and 'to' ports to the I2CP (gzip) header as described in the <a href="%(i2cp)s#format">I2CP page</a>.
pt: Como os datagramas não são orientados à conexão, o aplicativo pode exigir números de porta para correlacionar datagramas com pares ou sessões de comunicação específicos, como é tradicional com UDP sobre IP. Os aplicativos podem adicionar portas 'de' e 'para' ao cabeçalho I2CP (gzip), conforme descrito em a <a href="%(i2cp)s#format">página I2CP</a>.
tr: Veri şemaları bağlantı yönelimli olmadığından, uygulama, IP üzerinde UDP ile alışıldık şekilde, veri şemalarını belirli eşler veya iletişim oturumlarıyla ilişkilendirmek için bağlantı noktaları gerekebilir. Uygulamalar, <a href="%(i2cp)s#format">I2CP sayfasında</a> açıklandığı gibi I2CP (gzip) üst bilgisine 'from' ve 'to' bağlantı noktaları ekleyebilir.

source: There is no method within the datagram API to specify whether it is non-repliable (raw) or repliable. The application should be designed to expect the appropriate type. The I2CP protocol number or port should be used by the application to indicate datagram type. The I2CP protocol numbers PROTO_DATAGRAM (signed) and PROTO_DATAGRAM_RAW are defined in the <a href="%(i2psession)s">I2PSession API</a> for this purpose. A common design pattern in client/server datagram applications is to use signed datagrams for a request which includes a nonce, and use a raw datagram for the reply, returning the nonce from the request.
pt: Não há método dentro da API de datagrama para especificar se ele é não-repliable (raw) ou replicável. O aplicativo deve ser projetado para esperar o tipo apropriado. O número do protocolo I2CP ou porta deve ser usado pelo aplicativo para indicar o tipo de datagrama. Os números do protocolo I2CP PROTO_DATAGRAM (signed) e PROTO_DATAGRAM_RAW são definidos na <a href="%(i2psession)s">API I2PSession</a> para esta finalidade. Um padrão de design comum em aplicações de datagrama cliente/servidor é usar datagramas assinados para uma solicitação que inclui um nonce e usar um datagrama bruto para a resposta, retornando o nonce da solicitação.
tr: Veri şeması API yazılımında, yinelenemeyen (ham) ya da yinelenebilir olup olmadığını belirtecek bir yöntem yoktur. Uygulama, uygun türü bekleyecek şekilde tasarlanmalıdır. I2CP iletişim kuralı numarası ya da bağlantı noktası uygulama tarafından veri şeması türünü belirtmek için kullanılmalıdır. PROTO_DATAGRAM (imzalı) ve PROTO_DATAGRAM_RAW I2CP iletişim kuralı numaraları, bu amaç için <a href="%(i2psession)s">I2PSession API</a> içinde tanımlanmıştır. İstemci/sunucu veri şeması uygulamalarında yaygın bir tasarım modeli, bir nonce içeren bir istek için imzalı veri şeması kullanmak ve istekten nonce değerini döndürerek yanıt için ham bir veri şeması kullanmaktır.

source: The protocols and ports may be set in I2CP's <a href="%(i2psession)s">I2PSession API</a>, as implemented in <a href="%(i2psessionmuxed)s">I2PSessionMuxedImpl</a>.
pt: Os protocolos e portas podem ser definidos na API I2PSession <a href="%(i2psession)s">do I2CP</a>, conforme implementado em <a href="%(i2psessionmuxed)s">I2PSessionMuxedImpl</a>.
tr: İletişim kuralları ve bağlantı noktaları I2CP <a href="%(i2psession)s">I2PSession API</a> içinde, <a href="%(i2psessionmuxed)s">I2PSessionMuxedImpl</a> içinde olduğu gibi uygulanabilir.

source: Data Integrity
pt: Integridade dos dados
tr: Veri Bütünlüğü

source: Data integrity is assured by the gzip CRC-32 checksum implemented in <a href="%(i2cp)s#format">the I2CP layer</a>. There is no checksum field in the datagram protocol.
pt: A integridade dos dados é garantida pela soma de verificação CRC-32 gzip implementada em <a href="%(i2cp)s#format">na camada I2CP</a>. Não há campo de soma de verificação no protocolo de datagrama.
tr: Veri bütünlüğü, <a href="%(i2cp)s#format">I2CP katmanında</a> uygulanan gzip CRC-32 sağlaması kullanılarak sağlanır. Veri şeması iletişim kuralında sağlama alanı yoktur.

source: Packet Encapsulation
pt: Encapsulamento de pacotes
tr: Paket Kapsülleme

source: Each datagram is sent through I2P as a single message (or as an individual clove in a <a href="%(garlicrouting)s">Garlic Message</a>). Message encapsulation is implemented in the underlying <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a>, and <a href="%(tunnelmessage)s">tunnel message</a> layers. There is no packet delimiter mechanism or length field in the datagram protocol.
pt: Cada datagrama é enviado através do I2P como uma única mensagem (ou como um dente individual em uma <a href="%(garlicrouting)s">Mensagem de Alho</a>). O encapsulamento da mensagem é implementado nas camadas subjacentes <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a>e <a href="%(tunnelmessage)s">mensagem de túnel</a> . Não há mecanismo delimitador de pacotes ou campo de comprimento no protocolo de datagrama.
tr: Her veri şeması, I2P aracılığıyla tek bir ileti olarak (ya da bir <a href="%(garlicrouting)s">Garlic iletisi</a> içindeki tek bir diş olarak) gönderilir. İleti kapsüllemesi için <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a> ve <a href="%(tunnelmessage)s">tünel ileti</a> katmanları kullanılır. Veri şeması iletişim kuralında paket sınırlayıcı bir yöntem veya uzunluk alanı yoktur.

source: Specification
pt: Especificação
tr: Teknik özellikler

source: See the Datagrams Specification page.
pt: Ver a página da Especificação de Datagramas.
tr: Veri şemaları teknik özellikleri sayfasına bakın.

source: I2PControl - Remote Control Service
pt: I2PControl - Serviço de Controle Remoto
tr: I2PControl - Uzaktan Denetim Hizmeti
