Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Bootstrapping the netDb is quite simple. Once a router manages to receive a single routerInfo of a reachable peer, it can query that router for references to other routers in the network. Currently, a number of users post their routerInfo files to a website to make this information available. I2P automatically connects to one of these websites to gather routerInfo files and bootstrap.
pt: Bootstrapping do netDb é bem simples. Uma vez que um roteador consegue receber um único routerInfo de um peer alcançável, ele pode consultar esse roteador para referências a outros roteadores na rede. Atualmente, vários usuários postam seus arquivos routerInfo em um site para tornar essas informações disponíveis. O I2P se conecta automaticamente a um desses sites para reunir arquivos routerInfo e bootstrap.
tr: "Ağ veri tabanının" (NetDB) ön yüklenmesi oldukça basittir. Bir yöneltici, erişilebilir bir eşten tek bir "Yöneltici bilgileri" (RouterInfo) almayı başardığında, ağdaki diğer yöneltici referansları için bu yönelticiyi sorgulayabilir. Şu anda, birkaç kullanıcı, bu bilgileri kullanılabilir hale getirmek için "Yöneltici bilgileri" (RouterInfo) dosyalarını bir siteye gönderiyor. I2P, "Yöneltici bilgileri" (RouterInfo) dosyalarını ve ön yüklemeyi almak için otomatik olarak bu sitelerden birine bağlanır.

source: Lookup scalability:
pt: Escalabilidade de pesquisa:
tr: Arama ölçeklenebilirliği:

source: Lookups in the I2P network are not forwarded to other netDb routers. Currently, this is not a major problem, since the network is not very large. However, as the network grows, not all routerInfo and leaseSet files will be present on each netDb router. This will cause a deterioration of the percentage of successful lookups. Because of this, refinements to the netDb will be done in the next releases.
pt: As pesquisas na rede I2P não são encaminhadas para outros roteadores netDb. Atualmente, isso não é um problema grave, já que a rede não é muito grande. No entanto, conforme a rede cresce, nem todos os arquivos routerInfo e leaseSet estarão presentes em cada roteador netDb. Isso causará uma deterioração da porcentagem de pesquisas bem-sucedidas. Por causa disso, refinamentos no netDb serão feitos nas próximas versões.
tr: I2P ağındaki aramalar diğer "Ağ veri tabanı" (NetDB) yönelticilerine iletilmez. Şu anda, ağ çok büyük olmadığı için bu büyük bir sorun oluşturmaz. Ancak ağ büyüdükçe, her ağ veri tabanı yönelticisinde "Yöneltici bilgileri" (RouterInfo) ve "Kiralama kümesi" (LeaseSet) dosyalarının tümü bulunmaz ve başarılı arama oranı düşer. Bu nedenle, sonraki sürümlerde ağ veri tabanında iyileştirmeler yapılacaktır.

source: Communication between routers needs to provide confidentiality and integrity against external adversaries while authenticating that the router contacted is the one who should receive a given message. The particulars of how routers communicate with other routers aren't critical - three separate protocols have been used at different points to provide those bare necessities.
pt: A comunicação entre roteadores precisa fornecer confidencialidade e integridade contra adversários externos enquanto autentica que o roteador contatado é aquele que deve receber uma determinada mensagem. Os detalhes de como os roteadores se comunicam com outros roteadores não são críticos - três protocolos separados foram usados em diferentes pontos para fornecer essas necessidades básicas.
tr: Yönelticiler arasındaki iletişimde, iletişim kurulan yönelticinin belirli bir iletiyi alması gereken yöneltici olduğunu doğrulanırken, dış düşmanlara karşı gizlilik ve bütünlük sağlanması gerekir. Yönelticilerin diğer yönelticilerle nasıl iletişim kurduğunun ayrıntıları kritik değildir. Temel gereksinimleri karşılamak için farklı noktalarda üç ayrı iletişim kuralı kullanılmıştır.

source: I2P started with a TCP-based protocol which has since been disabled. Then, to accommodate the need for high degree communication (as a number of routers will end up speaking with many others), I2P moved from a TCP based transport to a <a href="%(ssu)s">UDP-based one</a> - "Secure Semireliable UDP", or "SSU".
pt: O I2P começou com um protocolo baseado em TCP que foi desabilitado desde então. Então, para acomodar a necessidade de comunicação de alto grau (já que vários roteadores acabarão falando com muitos outros), o I2P mudou de um transporte baseado em TCP para um <a href="%(ssu)s">baseado em UDP</a> - "Secure Semireliable UDP", ou "SSU".
tr: I2P, o zamandan beri devre dışı bırakılan TCP tabanlı bir iletişim kuralı ile başladı. Daha sonra, yüksek düzeyli iletişim gereksinimini karşılamak için (birkaç yöneltici diğerleriyle konuşacağından), I2P, TCP tabanlı bir taşıyıcıdan <a href="%(ssu)s">UDP tabanlı bir taşıyıcıya</a> - "Güvenli yarı güvenilir UDP" ya da "SSU" kullanmaya geçti.

source: As described in the <a href="%(ssu)s">SSU spec</a>:
pt: Conforme descrito na especificação SSU <a href="%(ssu)s"></a>:
tr: <a href="%(ssu)s">SSU teknik özelliklerinde</a> belirtildiği şekilde:

source: The goal of this protocol is to provide secure, authenticated, semireliable and unordered message delivery, exposing only a minimal amount of data easily discernible to third parties. It should support high degree communication as well as TCP-friendly congestion control and may include PMTU detection. It should be capable of efficiently moving bulk data at rates sufficient for home users. In addition, it should support techniques for addressing network obstacles, like most NATs or firewalls.
pt: O objetivo deste protocolo é fornecer entrega de mensagens segura, autenticada, semiconfiável e não ordenada, expondo apenas uma quantidade mínima de dados facilmente discerníveis para terceiros. Ele deve suportar comunicação de alto grau , bem como controle de congestionamento amigável ao TCP e pode incluir detecção de PMTU. Ele deve ser capaz de mover dados em massa de forma eficiente a taxas suficientes para usuários domésticos. Além disso, ele deve suportar técnicas para abordar obstáculos de rede, como a maioria dos NATs ou firewalls.
tr: Bu iletişim kuralının amacı, güvenli, kimliği doğrulanmış, yarı güvenilir ve sıralanmamış ileti aktarımını sağlamak ve üçüncü tarafların kolayca fark edemeyeceği kadar az miktarda veri ortaya çıkarmaktır. TCP dostu tıkanıklık denetiminin yanında yüksek düzeyli iletişimi desteklerken PMTU algılamasını da içerebilir. Ev kullanıcıları için toplu verileri yeterli hızlarda verimli bir şekilde aktarabilmelidir. Ayrıca, NAT veya güvenlik duvarı gibi yaygın kullanılan ağ engellerini ele alan teknikleri desteklemelidir.

source: Following the introduction of SSU, after issues with congestion collapse appeared, a new NIO-based TCP transport called <a href="%(ntcp)s">NTCP</a> was implemented. It is enabled by default for outbound connections only. Those who configure their NAT/firewall to allow inbound connections and specify the external host and port (dyndns/etc is ok) on /config.jsp can receive inbound connections. As NTCP is NIO based, so it doesn't suffer from the 1 thread per connection issues of the old TCP transport.
pt: Após a introdução do SSU, após problemas com o colapso de congestionamento aparecerem, um novo transporte TCP baseado em NIO chamado <a href="%(ntcp)s">NTCP</a> foi implementado. Ele é habilitado por padrão apenas para conexões de saída. Aqueles que configuram seu NAT/firewall para permitir conexões de entrada e especificam o host externo e a porta (dyndns/etc está ok) em /config.jsp podem receber conexões de entrada . Como o NTCP é baseado em NIO, ele não sofre com os problemas de 1 thread por conexão do antigo transporte TCP.
tr: SSU duyurulduktan sonra ve tıkanıklık çökmesi sorunlarının ortaya çıkmasıyla, <a href="%(ntcp)s">NTCP</a> adlı yeni bir NIO tabanlı TCP taşıyıcısı uygulandı. Yalnızca gidiş bağlantıları için varsayılan olarak etkindir. NAT/güvenlik duvarlarını geliş bağlantılarına izin verecek şekilde yapılandıranlar ve /config.jsp üzerinde dış sunucu ve bağlantı noktası (dyndns/etc tamam olan) belirtenler geliş bağlantılarını alabilir. NTCP NIO tabanlı olduğundan, eski TCP taşıyıcısındaki her bağlantı için 1 işlem sorunu yaşanmaz.

source: I2P supports multiple transports simultaneously. A particular transport for an outbound connection is selected with "bids". Each transport bids for the connection and the relative value of these bids assigns the priority. Transports may reply with different bids, depending on whether there is already an established connection to the peer.
pt: O I2P suporta múltiplos transportes simultaneamente. Um transporte particular para uma conexão de saída é selecionado com "bids". Cada transporte faz um lance para a conexão e o valor relativo desses lances atribui a prioridade. Os transportes podem responder com lances diferentes, dependendo se já existe uma conexão estabelecida com o peer.
tr: I2P, aynı anda birden fazla taşıyıcı kullanılmasını destekler. Gidiş bağlantısı için belirli bir taşıyıcı "teklifler" yoluyla seçilir. Bağlantı için her taşıyıcı teklifi ve bu tekliflerin göreli değeri önceliği belirler. Taşıyıcılar, eş ile daha önce kurulmuş bir bağlantı olup olmadığına bağlı olarak farklı tekliflerle yanıt verebilir.

source: The current implementation ranks NTCP as the highest-priority transport for outbound connections in most situations. SSU is enabled for both outbound and inbound connections. Your firewall and your I2P router must be configured to allow inbound NTCP connections. For further information see the <a href="%(ntcp)s">NTCP page</a>.
pt: A implementação atual classifica o NTCP como o transporte de maior prioridade para conexões de saída na maioria das situações. O SSU é habilitado para conexões de saída e de entrada. Seu firewall e seu roteador I2P devem ser configurados para permitir conexões NTCP de entrada. Para mais informações, consulte a página <a href="%(ntcp)s">NTCP </a>.
tr: Geçerli uygulama, çoğu durumda gidiş bağlantıları için en yüksek öncelikli taşıyıcı olarak NTCP değerlendirmesi yapar. SSU, hem gidiş hem de geliş bağlantılar için etkinleştirilir. Güvenlik duvarınız ve I2P yönelticiniz, geliş NTCP bağlantılarına izin verecek şekilde yapılandırılmalıdır. Ayrıntılı bilgi almak için <a href="%(ntcp)s">NTCP sayfasına</a> bakabilirsiniz.

source: A bare minimum set of cryptographic primitives are combined together to provide I2P's layered defenses against a variety of adversaries. At the lowest level, inter router communication is protected by the transport layer security - SSU encrypts each packet with AES256/CBC with both an explicit IV and MAC (HMAC-MD5-128) after agreeing upon an ephemeral session key through a 2048bit Diffie-Hellman exchange, station-to-station authentication with the other router's DSA key, plus each network message has their own hash for local integrity checking. <a href="#op.tunnels">Tunnel</a> messages passed over the transports have their own layered AES256/CBC encryption with an explicit IV and verified at the tunnel endpoint with an additional SHA256 hash. Various other messages are passed along inside "garlic messages", which are encrypted with ElGamal/AES+SessionTags (explained below).
pt: Um conjunto mínimo de primitivas criptográficas são combinadas para fornecer defesas em camadas do I2P contra uma variedade de adversários. No nível mais baixo , a comunicação entre roteadores é protegida pela segurança da camada de transporte - SSU criptografa cada pacote com AES256/CBC com um IV e MAC explícitos (HMAC-MD5-128) após concordar com uma chave de sessão efêmera por meio de uma troca Diffie-Hellman de 2048 bits , autenticação de estação para estação com a chave DSA do outro roteador, além de cada mensagem de rede ter seu próprio hash para verificação de integridade local . <a href="#op.tunnels">Túnel</a> mensagens passadas pelos transportes têm sua própria criptografia AES256/CBC em camadas com um IV explícito e verificado no ponto final do túnel com um hash SHA256 adicional. Várias outras mensagens são passadas dentro de "mensagens de alho", que são criptografadas com ElGamal/AES+SessionTags (explicado abaixo).
tr: I2P üzerinde çeşitli düşmanlara karşı katmanlı savunma sağlamak için en düşük düzeyde şifreleme öncülleri bir araya getirilir. En düşük düzeyde, yönelticiler arası iletişim, taşıyıcı katmanı güvenliği tarafından korunur - SSU, Diffie-Hellman alış verişi ile elde edilen 2048 bitlik kısa ömürlü bir oturum anahtarı üzerinde anlaştıktan sonra her paketi hem açık IV hem de MAC (HMAC-MD5-128) ile AES-256/CBC ile şifreler ve diğer yönelticinin DSA anahtarıyla istasyondan istasyona kimliği doğrular. Ayrıca her ağ iletisinin yerel bütünlük denetimi için kendi karması vardır. Taşıyıcılar üzerinden geçirilen <a href="#op.tunnels">Tünel</a> iletileri, açık bir IV ile kendi katmanlı AES-256/CBC şifrelemesini kullanır ve tünel uç noktasında ek bir SHA-256 karması ile doğrulanır. ElGamal/AES+SessionTags (aşağıda açıklanmıştır) ile şifrelenmiş "garlic iletileri" içinde çeşitli diğer iletiler aktarılır.

source: Garlic messages
pt: Mensagens de alho
tr: Garlic iletileri

source: Garlic messages are an extension of "onion" layered encryption, allowing the contents of a single message to contain multiple "cloves" - fully formed messages alongside their own instructions for delivery. Messages are wrapped into a garlic message whenever the message would otherwise be passing in cleartext through a peer who should not have access to the information - for instance, when a router wants to ask another router to participate in a tunnel, they wrap the request inside a garlic, encrypt that garlic to the receiving router's 2048bit ElGamal public key, and forward it through a tunnel. Another example is when a client wants to send a message to a destination - the sender's router will wrap up that data message (alongside some other messages) into a garlic, encrypt that garlic to the 2048bit ElGamal public key published in the recipient's leaseSet, and forward it through the appropriate tunnels.
pt: As mensagens de alho são uma extensão da criptografia em camadas "cebola", permitindo que o conteúdo de uma única mensagem contenha múltiplos "dentes" - mensagens totalmente formadas junto com suas próprias instruções de entrega. As mensagens são envolvidas em uma mensagem de alho sempre que a mensagem de outra forma estaria passando em texto claro através de um par que não deveria ter acesso à informação - por exemplo, quando um roteador deseja pedir a outro roteador para participar de um túnel, ele envolve o pedido dentro de um alho, criptografa esse alho com a chave pública ElGamal de 2048 bits do roteador receptor e o encaminha através de um túnel. Outro exemplo é quando um cliente deseja enviar uma mensagem a um destino - o roteador do remetente irá envolver essa mensagem de dados (junto com algumas outras mensagens) em um alho, criptografar esse alho com a chave pública ElGamal de 2048 bits publicada no leaseSet do destinatário e encaminhá-lo através dos túneis apropriados.
tr: Garlic iletileri, "onion" katmanlı şifrelemenin bir uzantısıdır ve tek bir iletinin içeriğinin birden fazla "diş" içermesini sağlar - kendi aktarım yönergelerinin yanında tam olarak biçimlendirilmiş iletiler. İleriler aksi durumda bilgiye erişimi olmaması gereken bir eşten açık metin olarak geçtiğinde, iletiler bir Garlic iletisine samalanır. Örneğin, bir yöneltici başka bir yönelticiden bir tünele katılmasını istediğinde, istek bir Garlic içine samalanır. Bu Garlic alıcı yönelticinin 2048bit ElGamal ortak anahtarına şifrelenir ve bir tünelden iletilir. Başka bir örnek, bir istemci bir hedefe ileti göndermek istediğinde - göndericinin yönelticisi bu veri iletisini (diğer bazı iletilerin yanında bir Garlic içine sarmalar. Bu Garlic alıcının "Kiralama kümesi" (LeaseSet) içinde yayınlanan 2048 bit ElGamal herkese açık anahtarı ile şifrelenir ve uygun tünellerden geçirilir.

source: The "instructions" attached to each clove inside the encryption layer includes the ability to request that the clove be forwarded locally, to a remote router, or to a remote tunnel on a remote router. There are fields in those instructions allowing a peer to request that the delivery be delayed until a certain time or condition has been met, though they won't be honored until the <a href="#future.variablelatency">nontrivial delays</a> are deployed. It is possible to explicitly route garlic messages any number of hops without building tunnels, or even to reroute tunnel messages by wrapping them in garlic messages and forwarding them a number of hops prior to delivering them to the next hop in the tunnel, but those techniques are not currently used in the existing implementation.
pt: As "instruções" anexadas a cada cravo dentro da camada de criptografia incluem a capacidade de solicitar que o cravo seja encaminhado localmente, para um roteador remoto, ou para um túnel remoto em um roteador remoto. Há campos nessas instruções permitindo que um par solicite que a entrega seja adiada até que um certo tempo ou condição seja atendida, embora eles não sejam honrados até que os <a href="#future.variablelatency">atrasos não triviais </a> sejam implantados. É possível rotear explicitamente mensagens de alho qualquer número de saltos sem construir túneis, ou mesmo redirecionar mensagens de túnel envolvendo-as em mensagens de alho e encaminhando-as um número de saltos antes de entregá-las ao próximo salto no túnel, mas essas técnicas não são usadas atualmente na implementação existente.
tr: Şifreleme katmanının içindeki her bir dişe eklenmiş "yönergeler", dişin yerel olarak, uzak bir yönelticiye ya da uzak bir yönelticideki uzak bir tünele aktarılmasını isteme yeteneğini bulundurur. Bu yönergelerde, bir eşin aktarımın belirli bir zaman veya koşul karşılanana kadar ertelenmesini istemesini sağlayan alanlar vardır. Ancak bunlar <a href="#future.variablelatency">önemsiz gecikmeler</a> dağıtılana kadar kabul edilmez. Garlic iletilerini tünel oluşturmadan herhangi bir sayıda sıçrama ile açıkta yöneltmek ya da tünel iletilerini garlic iletilerine sararak ve tüneldeki bir sonraki sıçramaya iletmeden önce birkaç sıçramadan geçirerek yönlendirilebilir. Ancak bu teknikler şu andaki uygulama kullanılmıyor

source: Session tags
pt: Etiquetas de sessão
tr: Oturum etiketleri

source: As an unreliable, unordered, message based system, I2P uses a simple combination of asymmetric and symmetric encryption algorithms to provide data confidentiality and integrity to garlic messages. As a whole, the combination is referred to as ElGamal/AES+SessionTags, but that is an excessively verbose way to describe the simple use of 2048bit ElGamal, AES256, SHA256 and 32 byte nonces.
pt: Como um sistema não confiável, não ordenado e baseado em mensagens, o I2P usa uma combinação simples de algoritmos de criptografia assimétrica e simétrica para fornecer confidencialidade de dados e integridade para mensagens garlic. Como um todo, a combinação é referida como ElGamal/AES+SessionTags, mas essa é uma maneira excessivamente prolixa de descrever o uso simples de ElGamal de 2048 bits, AES256, SHA256 e nonces de 32 bytes.
tr: Güvenilmez, sıralı olmayan ileti tabanlı bir sistem olan I2P, garlic iletilerinin veri gizliliği ve bütünlüğü sağlamak için asimetrik ve simetrik şifreleme algoritmalarının basit bir kombinasyonunu kullanır. Bir bütün olarak, kombinasyon ElGamal/AES+Oturum etiketi olarak anılır. Ancak bu, basit 2048 bit ElGamal, AES-256, SHA-256 ve 32 bayt nonce kullanımını açıklamak için aşırı derecede ayrıntılı bir yoldur.

source: Session tags themselves have a very short lifetime, after which they are discarded if not used. In addition, the quantity stored for each key is limited, as are the number of keys themselves - if too many arrive, either new or old messages may be dropped. The sender keeps track whether messages using session tags are getting through, and if there isn't sufficient communication it may drop the ones previously assumed to be properly delivered, reverting back to the full expensive ElGamal encryption.
pt: As próprias tags de sessão têm uma vida útil muito curta, após a qual são descartadas se não forem usadas. Além disso, a quantidade armazenada para cada chave é limitada, assim como o número de chaves em si - se muitas chegarem, mensagens novas ou antigas podem ser descartadas. O remetente mantém o controle se as mensagens usando as tags de sessão estão sendo transmitidas e, se não houver comunicação suficiente, ele pode descartar aquelas que antes eram consideradas entregues corretamente, revertendo para a criptografia ElGamal completa e cara.
tr: Oturum etiketlerinin ömürleri kısadır. bu sürenin sonunda kullanılmazlarsa atılır. Ek olarak, her bir anahtar için depolanan miktar ve anahtarların sayısı sınırlıdır. Çok fazla gelirse, yeni veya eski iletiler kaybolabilir Gönderici, oturum etiketlerini kullanan iletilerin geçip geçmediğini izler ve yeterli iletişim yoksa, daha önce düzgün bir şekilde iletildiği varsayılanları bırakarak en pahalı ElGamal şifrelemesine geri dönebilir.

source: One alternative is to transmit only a single session tag, and from that, seed a deterministic PRNG for determining what tags to use or expect. By keeping this PRNG roughly synchronized between the sender and recipient (the recipient precomputes a window of the next e.g. 50 tags), the overhead of periodically bundling a large number of tags is removed, allowing more options in the space/time tradeoff, and perhaps reducing the number of ElGamal encryptions necessary. However, it would depend upon the strength of the PRNG to provide the necessary cover against internal adversaries, though perhaps by limiting the amount of times each PRNG is used, any weaknesses can be minimized. At the moment, there are no immediate plans to move towards these synchronized PRNGs.
pt: Uma alternativa é transmitir apenas uma única tag de sessão e, a partir disso, semear um PRNG determinístico para determinar quais tags usar ou esperar. Ao manter este PRNG aproximadamente sincronizado entre o remetente e o destinatário (o destinatário pré-calcula uma janela das próximas, por exemplo, 50 tags), a sobrecarga de periodicamente agrupar um grande número de tags é removida, permitindo mais opções no tradeoff espaço/tempo e talvez reduzindo o número de criptografias ElGamal necessárias. No entanto, dependeria da força do PRNG fornecer a cobertura necessária contra adversários internos, embora talvez limitando a quantidade de vezes que cada PRNG é usado, quaisquer fraquezas possam ser minimizadas. No momento, não há planos imediatos para avançar em direção a esses PRNGs sincronizados.
tr: Bir alternatif, yalnızca tek bir oturum etiketi iletmek ve bundan, hangi etiketlerin kullanılacağını veya bekleneceğini belirlemek için belirleyici bir PRNG tohumlanmasıdır. Bu PRNG verisini gönderici ve alıcı arasında kabaca eşitlenmiş olarak tutularak (alıcı örneğin sonraki 50 etiketin bir penceresini önceden hesaplar), çok sayıda etiketi düzenli olarak gruplamanın yükü ortadan kaldırır ve ek seçenekler ile alan/zaman değiş tokuşu ve belki de gerekli ElGamal şifrelemelerinin sayısını daha fazla azaltılması sağlanır. Bununla birlikte, iç düşmanlara karşı gerekli korumayı sağlamak PRNG gücüne bağlı olacaktır. Ancak belki de her bir PRNG kullanım sürelerini sınırlayarak, herhangi bir zayıflık en aza indirilebilir. Şu anda, eşitlenen PRNG yöntemine doğru ilerlemek için acil bir plan yok.

source: Future
pt: Futuro
tr: Gelecek
