Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Change the value in "Servers" from the default to `localhost/6669`, and configure the default channels you want to join. I suggest #i2p and #i2p-dev
pt: Altere o valor em "Servers" do padrão para `localhost/6669`, e configure os canais padrão que você deseja ingressar. Eu sugiro #i2p e #i2p-dev
tr: "Servers" değerini varsayılan yerine "localhost/6669" olarak değiştirin ve katılmak istediğiniz varsayılan kanalları yapılandırın. #i2p ve #i2p-dev önerilir

source: XChat Step Three
pt: XChat Passo Três
tr: XChat üçüncü adım

source: Close the "Edit Server" window from to return to the Server List page and click "Connect" to join I2PRC.
pt: Feche a janela "Editar servidor" para retornar à página Lista de servidores e clique em "Conectar" para ingressar no I2PRC.
tr: Sunucu listesine dönmek için "Edit server" penceresini kapatın ve I2PRC bağlantısı kurmak için "Bağlan"' üzerine tıklayın.

source: XChat Step Four
pt: XChat Passo Quatro
tr: XChat dördüncü adım

source: Click on the "Chat" button in the toolbar at the top of the Thunderbird window.
pt: Clique no botão "Bate-papo" na barra de ferramentas na parte superior da janela do Thunderbird.
tr: Thunderbird penceresinin üst kısmındaki araç çubuğundan "Sohbet" düğmesine tıklayın.

source: Add a chat
pt: Adicionar um bate-papo
tr: Bir sohbet ekleyin

source: Thunderbird Step One
pt: Thunderbird Passo Um
tr: Thunderbird birinci adım

source: Click the get started button to begin setting up Irc2P.
pt: Clique no botão começar para começar a configurar o Irc2P.
tr: Irc2P kurmak için Başla düğmesine tıklayın.

source: Get Started
pt: Começar
tr: Başla

source: Thunderbird Step Two
pt: Thunderbird Passo Dois
tr: Thunderbird ikinci adım

source: In the first step, select "IRC" for your network type.
pt: No primeiro passo, selecione "IRC" para seu tipo de rede.
tr: Birinci adımda ağ türü olarak "IRC" seçin.

source: Pick IRC
pt: Escolha IRC
tr: IRC olarak seçin

source: Thunderbird Step Three
pt: Thunderbird Passo Três
tr: Thunderbird üçüncü adım

source: Choose a nickname and set your IRC Server to 127.0.0.1, but do not set a port.
pt: Escolha um apelido e defina seu servidor IRC como 127.0.0.1, mas não defina uma porta.
tr: Bir takma ad seçin ve IRC sunucunuzu 127.0.0.1 olarak ayarlayın, ancak bir bağlantı noktası belirtmeyin.

source: Set username and server
pt: Definir nome de usuário e servidor
tr: Kullanıcı adı ve sunucuyu ayarlayın

source: Thunderbird Step Four
pt: Thunderbird Passo Quatro
tr: Thunderbird dördüncü adım

source: Set a password if you want.
pt: Defina uma senha se desejar.
tr: İstiyorsanız bir parola ayarlayın.

source: Thunderbird Step Five
pt: Thunderbird Passo Cinco
tr: Thunderbird beşinci adım

source: Configure the IRC Server with an alias like "Irc2P" and set the port to 6668.
pt: Configure o servidor IRC com um alias como "Irc2P" e defina a porta como 6668.
tr: IRC sunucusunu "Irc2P" gibi bir takma adla yapılandırın ve bağlantı noktasını 6668 olarak ayarlayın.

source: Thunderbird Step Six
pt: Thunderbird Passo Seis
tr: Thunderbird altıncı adım

source: If your summary looks like this, then you're ready to connect with Irc2P.
pt: Se o seu resumo for parecido com este, então você está pronto para conectar com Irc2P.
tr: Özetiniz böyle görünüyorsa Irc2P bağlantısı kurmaya hazırsınız demektir..

source: Thunderbird Step Seven
pt: Thunderbird Passo Sete
tr: Thunderbird yedinci adım

source: Revolution IRC is an easy to use IRC client for Android. It's able to handle multiple accounts on multiple services, so you can use it for Irc2P and for your non-I2P IRC networks as well.
pt: Revolution IRC é um cliente IRC fácil de usar para Android. Ele é capaz de lidar com múltiplas contas em múltiplos serviços, então você pode usá-lo para Irc2P e para suas redes IRC não-I2P também.
tr: Revolution IRC, Android için kullanımı kolay bir IRC istemcisidir. Birden çok hizmette birden çok hesabı yönetebilir. Böylece Irc2P ve I2P olmayan IRC ağlarınız için de kullanabilirsiniz.

source: Click the "Add Server" button(Shaped like this: `+`) in the corner to get started configuring Revolution IRC for I2P.
pt: Clique no botão "Adicionar servidor" (com o formato assim: `+`) no canto para começar a configurar o Revolution IRC para I2P.
tr: I2P ile Revolution IRC yapılandırmasına başlamak için köşedeki "Sunucu ekle" düğmesine (`+` şeklinde) tıklayın.

source: Revolution Step One
pt: Revolução Passo Um
tr: Revolution birinci adım

source: Fill in the server name, change the address to "127.0.0.1" and the port to 6668.
pt: Preencha o nome do servidor, altere o endereço para "127.0.0.1" e a porta para 6668.
tr: Sunucu adını yazın, adresi "127.0.0.1" ve bağlantı noktasını 6668 olarak değiştirin.

source: Configure it like this
pt: Configure assim
tr: Şu şekilde yapılandırın

source: Revolution Step Two
pt: Revolução Passo Dois
tr: Revolution ikinci adım

source: Give yourself a nickname and configure some channels to automatically join.
pt: Dê a si mesmo um apelido e configure alguns canais para entrarem automaticamente .
tr: Kendinize bir takma ad verin ve bazı kanallara otomatik olarak katılınacak şekilde yapılandırın.

source: Revolution Step Three
pt: Revolução Passo Três
tr: Revolution üçüncü adım

source: Dispatch is a stable, self-hosted IRC client with a web interface. It has native I2P configuration available by communicating over the
pt: Dispatch é um cliente IRC estável e auto-hospedado com uma interface web. Ele tem configuração I2P nativa disponível por comunicação através do
tr: Dispatch, internet arayüzüne sahip, kararlı, kendinizin barındırabileceği bir IRC istemcisidir. Üzerinden iletişim kurarak kullanılabilen yerel I2P yapılandırmasına sahiptir.

source: Dispatch is configured with a file called `config.toml`, which you can configure the common settings.
pt: O Dispatch é configurado com um arquivo chamado `config.toml`, que você pode configurar as configurações comuns.
tr: Dispatch genel ayarları `config.toml` dosyası içinden yapılır.

source: Servers
pt: Servidores
tr: Sunucular

source: Eris is an easy-to-configure IRC server with self-configuring support for I2P. If you want to run a private IRC server it's one of the easiest ways.
pt: Eris é um servidor IRC fácil de configurar com suporte de autoconfiguração para I2P. Se você quer rodar um servidor IRC privado, essa é uma das maneiras mais fáceis.
tr: Eris, I2P için kendi kendini yapılandırabilen, ve kolay yapılandırılan bir IRC sunucusudur. Özel bir IRC sunucusu işletmek istiyorsanız, en kolay yollardan biridir.

source: This is a valid configuration of the Eris IRC server, but it uses a default password for the admin account(admin). You should change the operator.admin.password and account.admin.password before deploying to a real service.
pt: Esta é uma configuração válida do servidor Eris IRC, mas ele usa uma senha padrão para a conta de administrador (admin). Você deve alterar operator.admin.password e account.admin.password antes de implantar em um serviço real.
tr: Burada Eris IRC sunucusunun geçerli yapılandırmasını görebilirsiniz. Ancak yönetici hesabı (admin) için varsayılan bir parola kullanılır. Gerçek bir hizmet yayınlamadan önce operator.admin.password ve account.admin.password değerlerini değiştirmelisiniz.

source: February 2014
pt: Fevereiro de 2014
tr: 2014 Şubat

source: Clients may be started directly by the router when they are listed in the <a href="%(configspec)s">clients.config</a> file. These clients may be "managed" or "unmanaged". This is handled by the ClientAppManager. Additionally, managed or unmanaged clients may register with the ClientAppManager so that other clients may retrieve a reference to them. There is also a simple Port Mapper facility for clients to register an internal port that other clients may look up.
pt: Os clientes podem ser iniciados diretamente pelo roteador quando são listados no arquivo <a href="%(configspec)s">clients.config</a> . Esses clientes podem ser "gerenciados" ou "não gerenciados". Isso é controlado pelo ClientAppManager. Além disso, clientes gerenciados ou não gerenciados podem se registrar no ClientAppManager para que outros clientes possam recuperar uma referência a eles. Há também um recurso simples do Port Mapper para que os clientes registrem uma porta interna que outros clientes podem consultar.
tr: İstemciler, <a href="%(configspec)s">clients.config</a> dosyasında listelendiğinde, doğrudan yöneltici tarafından başlatılabilir. Bu istemciler "yönetilen" veya "yönetilmeyen" olabilir. Bu durum, ClientAppManager tarafından işlenir. Ek olarak, yönetilen veya yönetilmeyen istemciler, diğer istemcilerin kendilerine bir referans alabilmesi için ClientAppManager üzerine kayıt olabilir. Ayrıca, istemcilerin diğer istemcilerin arayabileceği iç bağlantı noktasını kaydetmesi için basit bir bağlantı noktası eşleştirme özelliği de vardır.

source: As of release 0.9.4, the router supports managed clients. Managed clients are instantiated and started by the ClientAppManager. The ClientAppManager maintains a reference to the client and receives updates on the client's state. Managed clients are preferred, as it is much easier to implement state tracking and to start and stop a client. It also is much easier to avoid static references in the client code which could lead to excessive memory usage after a client is stopped. Managed clients may be started and stopped by the user in the router console, and are stopped at router shutdown.
pt: A partir da versão 0.9.4, o roteador suporta clientes gerenciados. Os clientes gerenciados são instanciados e iniciados pelo ClientAppManager. O ClientAppManager mantém uma referência ao cliente e recebe atualizações sobre o estado do cliente. Os clientes gerenciados são preferidos, pois é muito mais fácil implementar o rastreamento de estado e iniciar e parar um cliente. Também é muito mais fácil evitar referências estáticas no código do cliente que podem levar ao uso excessivo de memória após um cliente ser interrompido. Os clientes gerenciados podem ser iniciados e interrompidos pelo usuário no console do roteador, e são interrompidos no desligamento do roteador.
tr: 0.9.4 sürümünden başlayarak yöneltici, yönetilen istemcileri destekler. Yönetilen istemciler, ClientAppManager tarafından hazırlanır ve başlatılır. ClientAppManager, istemciye bir referans tutar ve istemcinin durumuyla ilgili güncellemeleri alır. Durum izlemeyi uygulamak ve bir istemciyi başlatmak ve durdurmak çok daha kolay olduğundan yönetilen istemciler yeğlenir. İstemci kodunda, bir istemci durdurulduktan sonra aşırı bellek kullanımına yol açabilecek durağan başvurulardan kaçınmak da çok daha kolaydır. Yönetilen istemciler, kullanıcı tarafından yöneltici panosundan başlatılıp durdurulabilir ve yöneltici kapatıldığında durdurulur.

source: Managed clients implement either the net.i2p.app.ClientApp or net.i2p.router.app.RouterApp interface. Clients implementing the ClientApp interface must provide the following constructor:
pt: Os clientes gerenciados implementam a interface net.i2p.app.ClientApp ou net.i2p.router.app.RouterApp. Os clientes que implementam a interface ClientApp devem fornecer o seguinte construtor:
tr: Yönetilen istemciler, net.i2p.app.ClientApp ya da net.i2p.router.app.RouterApp arabirimini uygular. ClientApp arabirimini uygulayan istemciler, aşağıdaki oluşturucuyu sağlamalıdır:

source: Clients implementing the RouterApp interface must provide the following constructor:
pt: Os clientes que implementam a interface RouterApp devem fornecer o seguinte construtor:
tr: RouterApp arabirimini uygulayan istemciler aşağıdaki oluşturucuyu sağlamalıdır:

source: The arguments provided are specified in the clients.config file.
pt: Os argumentos fornecidos são especificados no arquivo clients.config.
tr: Sunulan bağımsız değişkenler, client.config dosyasında belirtilir.

source: Unmanaged Clients
pt: Clientes não gerenciados
tr: Yönetilmeyen İstemciler

source: If the main class specified in the clients.config file does not implement a managed interface, it will be started with main() with the arguments specified, and stopped with main() with the arguments specified. The router does not maintain a reference, since all interactions are via the static main() method. The console cannot provide accurate state information to the user.
pt: Se a classe principal especificada no arquivo clients.config não implementar uma interface gerenciada, ela será iniciada com main() com os argumentos especificados, e interrompida com main() com os argumentos especificados. O roteador não mantém uma referência, pois todas as interações são por meio do método main() estático. O console não pode fornecer informações de estado precisas ao usuário.
tr: Client.config dosyasında belirtilen ana sınıf, yönetilen bir arabirim uygulamıyorsa, belirtilen argümanlarla main() ile başlatılur ve belirtilen argümanlarla main() ile durdurulur. Tüm etkileşimler statik main() yöntemiyle yapıldığından, yöneltici bir referans tutmaz. Pano, kullanıcıya doğru durum bilgisi sağlayamaz.

source: Registered Clients
pt: Clientes Registrados
tr: Kayıtlı İstemciler

source: Clients, whether managed or unmanaged, may register with the ClientAppManager so that other clients may retrieve a reference to them. Registration is by name. Known registered clients are:
pt: Clientes, gerenciados ou não, podem se registrar no ClientAppManager para que outros clientes possam recuperar uma referência a eles. O registro é feito por nome. Os clientes registrados conhecidos são:
tr: Yönetilen veya yönetilmeyen istemciler, diğer istemcilerin kendilerine bir referans alabilmesi için ClientAppManager üzerine kayıt olabilir. Kayıt ada göredir. Bilinen kayıtlı istemciler şunlardır:

source: Port Mapper
pt: Mapeador de Portos
tr: Bağlantı Noktası Eşleştirme

source: The router also provides a simple mechanism for clients to find an internal socket service, such as the HTTP proxy. This is provided by the Port Mapper. Registration is by name. Clients that register generally provide an internal emulated socket on that port.
pt: O roteador também fornece um mecanismo simples para clientes encontrarem um serviço de socket interno, como o proxy HTTP. Isso é fornecido pelo Port Mapper. O registro é por nome. Clientes que se registram geralmente fornecem um socket emulado interno naquela porta.
tr: Yöneltici ayrıca istemcilerin bir iç soket hizmeti bulması için basit bir mekanizma sağlar. HTTP vekil sunucusu gibi. Bu, bağlantı noktası eşleştiricisi tarafından sağlanır. Kayıt ada göredir. Kayıt olan istemciler genellikle bu bağlantı noktasından bir iç öykünme soketi sağlar.

source: Naming discussion
pt: Discussão sobre nomenclatura
tr: Adlandırma tartışması

source: NOTE: The following is a discussion of the reasons behind the I2P naming system, common arguments and possible alternatives. See <a href="%(naming)s">the naming page</a> for current documentation.
pt: NOTA: A seguir está uma discussão sobre as razões por trás do sistema de nomenclatura I2P, argumentos comuns e possíveis alternativas. Veja <a href="%(naming)s">a página de nomenclatura</a> para documentação atual.
tr: NOT: Aşağıda, I2P adlandırma sisteminin arkasındaki nedenler, ortak argümanlar ve olası alternatifler hakkında bir tartışma yer almaktadır. Güncel belgeler için <a href="%(naming)s">adlandırma sayfasına</a> bakabilirsiniz.

source: Discarded alternatives
pt: Alternativas descartadas
tr: Vazgeçilen alternatifler

source: Naming within I2P has been an oft-debated topic since the very beginning with advocates across the spectrum of possibilities. However, given I2P's inherent demand for secure communication and decentralized operation, the traditional DNS-style naming system is clearly out, as are "majority rules" voting systems.
pt: A nomeação dentro do I2P tem sido um tópico frequentemente debatido desde o início, comdefensores em todo o espectro de possibilidades. No entanto, dada a demanda inerenteda I2P por comunicação segura e operação descentralizada, o sistema de nomenclatura tradicional no estilo DNS está claramente fora, assim como os sistemas devotação de "regras da maioria".
tr: I2P üzerinde adlandırma, en başından beri, çeşitli olasılıkların savunucuları ile sıkça tartışılan bir konu olmuştur. Bununla birlikte, I2P uygulamasının güvenli iletişim ve merkezi olmayan işleme şekli için doğal isteği göz önüne alındığında, geleneksel DNS adlandırma sistemi ve "çoğunluk kuralları" oylama sistemleri açıkça geçersizdir.

source: I2P does not promote the use of DNS-like services though, as the damage done by hijacking a site can be tremendous - and insecure destinations have no value. DNSsec itself still falls back on registrars and certificate authorities, while with I2P, requests sent to a destination cannot be intercepted or the reply spoofed, as they are encrypted to the destination's public keys, and a destination itself is just a pair of public keys and a certificate. DNS-style systems on the other hand allow any of the name servers on the lookup path to mount simple denial of service and spoofing attacks. Adding on a certificate authenticating the responses as signed by some centralized certificate authority would address many of the hostile nameserver issues but would leave open replay attacks as well as hostile certificate authority attacks.
pt: No entanto, a I2P não promove o uso de serviços semelhantes ao DNS, pois os danos causadospelo sequestro de um site podem ser tremendos - e destinos inseguros nãotêm valor. O próprio DNSsec ainda recai sobre registradores e autoridades de certificação, enquanto com o I2P, as solicitações enviadas para um destino não podem ser interceptadas ou a respostafalsificada, pois são criptografadas para as chaves públicas do destino, e um destinoem si é apenas um par de chaves públicas e um certificado. Os sistemas no estilo DNS, por outro lado,permitem que qualquer um dos servidores de nomes no caminhode pesquisa monte ataques simples de negação de serviço e falsificação. Adicionar um certificado autenticando asrespostas como assinadas por alguma autoridade de certificação centralizada resolveria muitos dos problemas hostis do servidor de nomes, mas deixaria em aberto ataques de repetição, bem como ataques hostis de autoridade decertificação.
tr: I2P, DNS benzeri hizmetlerin kullanımını desteklemez, çünkü bir siteyi ele geçirmenin verdiği zarar çok büyük olabilir - ve güvenli olmayan hedeflerin hiçbir değeri yoktur. DNSsec hala kayıt şirketlerine ve sertifika yetkililerine giderken, I2P ile, bir hedefe gönderilen istekler ya da yanıt, hedefin herkese açık anahtarlarıyla şifrelendiğinden ve bir hedefin kendisi yalnızca bir çift herkese açık anahtar ve sertifika olduğundan engellenemez. Öte yandan DNS sistemleri, arama yolundaki herhangi bir ad sunucusunun basit hizmet reddi ve sahtekarlık saldırıları başlatmasına izin verir. Bazı merkezi sertifika yetkilileri tarafından imzalanmış olarak yanıtları doğrulayan bir sertifika eklemek, düşmanca ad sunucusu sorunlarının çoğunu giderir, ancak düşman sertifika yetkilisi saldırılarının yanında yeniden yürütme saldırılarına da açık olur.

source: Voting style naming is dangerous as well, especially given the effectiveness of Sybil attacks in anonymous systems - the attacker can simply create an arbitrarily high number of peers and "vote" with each to take over a given name. Proof-of-work methods can be used to make identity non-free, but as the network grows the load required to contact everyone to conduct online voting is implausible, or if the full network is not queried, different sets of answers may be reachable.
pt: A nomeação de estilo de votação também é perigosa, especialmente dada a eficácia de ataques Sybil em sistemas anônimos - o invasor pode simplesmente criar um número arbitrariamente alto de pares e "votar" com cada um para assumir um determinado nome. Métodos de prova de trabalho podem ser usados para tornar a identidade não livre, mas conforme a rede cresce, a carga necessária para contatar todos para conduzir a votação online é implausível, ou se a rede completa não for consultada, diferentes conjuntos de respostas podem ser alcançáveis.
tr: Oylama biçimindeki adlandırma da tehlikelidir. Özellikle de anonim sistemlerdeki Sybil saldırılarının etkinliği göz önüne alındığında - saldırgan yalnızca keyfi olarak yüksek sayıda eş oluşturabilir ve belirli bir adı devralmak için her biriyle "oy kullanabilir". Proof-of-work yöntemleri, kimliği özgür olmayan hale getirmek için kullanılabilir. Ancak ağ büyüdükçe, çevrimiçi oylama yapmak için herkesle iletişim kurmayı sağlayacak yük çok fazladır ya da ağın tamamı sorgulanmazsa, farklı yanıt kümelerine ulaşılabilir. .

source: As with the Internet however, I2P is keeping the design and operation of a naming system out of the (IP-like) communication layer. The bundled naming library includes a simple service provider interface which <a href="#alternatives">alternate naming systems</a> can plug into, allowing end users to drive what sort of naming tradeoffs they prefer.
pt: Assim como na Internet, no entanto, o I2P está mantendo o design e a operação de um sistema de nomenclatura fora da camada de comunicação (semelhante ao IP). A biblioteca de nomenclatura empacotada inclui uma interface simples de provedor de serviços que <a href="#alternatives">sistemas de nomenclatura alternativos</a> podem conectar, permitindo que os usuários finais conduzam que tipo de trocas de nomenclatura eles preferem.
tr: Ancak İnternet üzerinde olduğu gibi, I2P bir adlandırma sisteminin tasarımını ve çalışmasını (IP benzeri) iletişim katmanının dışında tutar. Paketlenmiş adlandırma kitaplığında, <a href="#alternatives">alternatif adlandırma sistemlerinin</a> takılabileceği basit bir hizmet sağlayıcı arabirimi bulunur ve son kullanıcıların yeğlediği adlandırma değiş tokuşunu yapmalarını sağlar.

source: See also <a href="https://zooko.com/distnames.html">Names: Decentralized, Secure, Human-Meaningful: Choose Two</a>.
pt: Veja também <a href="https://zooko.com/distnames.html">Nomes: Descentralizado, Seguro, Significativo para o ser humano: Escolha dois</a>.
tr: Ayrıntılı bilgi almak için. <a href="https://zooko.com/distnames.html">Adlar: Merkezi olmayan, Güvenli, İnsan tarafından anlaşılabilir: İki seçin</a>.

source: (adapted from a post in the old Syndie, November 26, 2005)
pt: (adaptado de uma postagem no antigo Syndie, 26 de novembro de 2005)
tr: (26 Kasım 2005 tarihli eski Syndie üzerindeki bir yazıdan alınmıştır)

source: Q: What to do if some hosts do not agree on one address and if some addresses are working, others are not? Who is the right source of a name?
pt: P: O que fazer se alguns hosts não concordarem com um endereço e se alguns endereços estiverem funcionando, outros não? Quem é a fonte correta de um nome?
tr: Soru: Bazı sunucular bir adres üzerinde anlaşamıyorsa ve bazı adresler çalışırken diğerleri çalışmıyorsa ne yapmalı? Bir adın doğru kaynağı kimdir?

source: A: You don't. This is actually a critical difference between names on I2P and how DNS works - names in I2P are human readable, secure, but <b>not globally unique</b>. This is by design, and an inherent part of our need for security.
pt: R: Você não. Esta é, na verdade, uma diferença crítica entre nomes no I2P e como DNS funciona - nomes no I2P são legíveis por humanos, seguros, mas <b>não são globalmente únicos</b>. Isto é por design e uma parte inerente da nossa necessidade de segurança.
tr: Yanıt: Yapamazsınız. Bu aslında I2P üzerindeki adlar ile DNS yapısının çalışma şekli arasındaki kritik bir farktır - I2P üzerindeki adlar insanlar tarafından okunabilir, güvenlidir, ancak <b>küresel olarak eşsiz değildir</b>. Bu durum tasarımın gereğidir ve güvenlik gereksinimimizin doğal bir parçasıdır.
