Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: A <a href="%(i2npspec)s#msg_DeliveryStatus">Delivery Status Message</a>, with <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Delivery Instructions</a> specifying that it be sent back to the originating router as an acknowledgment. This is similar to the "reply block" or "reply onion" described in the references. It is used for determining the success or failure of end to end message delivery. The originating router may, upon failure to receive the Delivery Status Message within the expected time period, modify the routing to the far-end Destination, or take other actions.
pt: Uma mensagem de status de entrega <a href="%(i2npspec)s#msg_DeliveryStatus"></a>, com <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Instruções de entrega</a> especificando que ela seja enviada de volta ao roteador de origem como uma confirmação. Isso é semelhante ao "bloco de resposta" ou "cebola de resposta" descrito nas referências. É usado para determinar o sucesso ou a falha da entrega de mensagens de ponta a ponta. O roteador de origem pode, caso não receba a Mensagem de Status de Entrega dentro do período de tempo esperado, modificar o roteamento para o Destino remoto, ou tomar outras ações.
tr: Bir <a href="%(i2npspec)s#msg_DeliveryStatus">Teslim durumu iletisi</a>, <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Teslim yönergeleri</a> ile kaynak yönelticiye geri dönüleceğini belirten bir alındıdır. Bu durum, referanslarda açıklanan "yanıt bloğu" veya "yanıt onion" paketine benzer. Uçtan uca ileti tesliminin başarılı ya da başarısız olduğunu belirlemek için kullanılır. Kaynak yöneltici, teslimat durumu iletisini beklenen süre içinde alamazsa, uzak uçtaki varış noktasına yöneltmeyi değiştirebilir veya başka işlemler yapabilir.

source: A <a href="%(i2npspec)s#msg_DatabaseStore">Database Store Message</a>, containing a <a href="%(commonstructures)s#struct_LeaseSet">LeaseSet</a> for the originating Destination, with <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Delivery Instructions</a> specifying the far-end destination's router. By periodically bundling a LeaseSet, the router ensures that the far-end will be able to maintain communications. Otherwise the far-end would have to query a floodfill router for the network database entry, and all LeaseSets would have to be published to the network database, as explained on the <a href="%(netdb)s">network database page</a>.
pt: Uma mensagem de armazenamento de banco de dados <a href="%(i2npspec)s#msg_DatabaseStore"></a>, contendo um <a href="%(commonstructures)s#struct_LeaseSet">LeaseSet</a> para o destino de origem, com <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Instruções de entrega</a> especificando o roteador de destino do extremo remoto. Ao agrupar periodicamente um LeaseSet, o roteador garante que o extremo remoto será capaz de manter as comunicações. Caso contrário, o extremo remoto teria que consultar um roteador de floodfill para obter a entrada do banco de dados de rede, e todos os LeaseSets teriam que ser publicados no banco de dados de rede, conforme explicado na página do banco de dados de rede <a href="%(netdb)s"></a>.
tr: Bir <a href="%(i2npspec)s#msg_DatabaseStore">Veri tabanı kaydetme iletisi</a>, kaynak hedef için bir <a href="%(commonstructures)s#struct_LeaseSet">"Kiralama kümesi" (LeaseSet)</a> ile uzak uçtaki hedefin yönelticisini belirten <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">teslimat yönergeleri</a> bilgilerini içerir. Yöneltici bir "Kiralama kümesini" (LeaseSet) düzenli olarak gruplayarak, uzak ucun iletişimi sürdürebilmesini sağlar. Yoksa, uzak uç "Ağ veri tabanı" (NetDB) kaydı için bir otomatik doldurma yönlendiricisini sorgulamak zorunda kalacak ve <a href="%(netdb)s">"Ağ veri tabanı" (NetDB) sayfasında</a> açıklandığı gibi tüm "Kiralama kümelerinin" (LeaseSets) "Ağ veri tabanında" (NetDB) yayınlanması gerekecekti.

source: By default, the Delivery Status and Database Store Messages are bundled when the local LeaseSet changes, when additional <a href="%(commonstructures)s#type_SessionTag">Session Tags</a> are delivered, or if the messages have not been bundled in the previous minute. As of release 0.9.2, the client may configure the default number of Session Tags to send and the low tag threshold for the current session. See the <a href="%(i2cp)s#options">I2CP options specification</a> for details. The session settings may also be overridden on a per-message basis. See the <a href="%(i2cpspec)s#msg_SendMessageExpires">I2CP Send Message Expires specification</a> for details.
pt: Por padrão, o status de entrega e as mensagens do armazenamento de banco de dados são agrupados quando o LeaseSet local muda, quando <a href="%(commonstructures)s#type_SessionTag">tags de sessão</a> adicionais são entregues ou se as mensagens não foram agrupadas no minuto anterior. A partir da versão 0.9.2, o cliente pode configurar o número padrão de tags de sessão a serem enviadas e o limite de tag baixo para a sessão atual. Consulte a <a href="%(i2cp)s#options">especificação de opções I2CP</a> para obter detalhes. As configurações de sessão também podem ser substituídas por mensagem. Veja a especificação <a href="%(i2cpspec)s#msg_SendMessageExpires">I2CP Send Message Expires</a> para detalhes.
tr: Varsayılan olarak, teslimat durumu ve veri tabanı kaydetme iletileri, yerel "Kiralama kümesi" (LeaseSet) değiştiğinde, ek <a href="%(commonstructures)s#type_SessionTag">Oturum etiketleri</a> teslim edildiğinde ya da iletiler bir önceki dakika içinde paketlenmemişse paketlenir. 0.9.2 sürümünden başlayarak, istemci gönderilecek varsayılan oturum etiketi sayısını ve geçerli oturum için düşük etiket eşiğini yapılandırabilir. Ayrıntılı bilgi almak için <a href="%(i2cp)s#options">I2CP seçenekleri teknik özelliklerine</a> bakabilirsiniz. Ayrıca her ileti için oturum ayarları değiştirilebilir. Ayrıntılı bilgi almak için <a href="%(i2cpspec)s#msg_SendMessageExpires">I2CP ileti gönderme geçerlilik süresi teknik özelliklerine</a> bakabilirsiniz.

source: Obviously, the additional messages are currently bundled for specific purposes, and not part of a general-purpose routing scheme.
pt: Obviamente, as mensagens adicionais são atualmente agrupadas para propósitos específicos, e não fazem parte de um esquema de roteamento de propósito geral.
tr: Açıkçası, ek iletiler şu anda genel amaçlı bir yöneltme şemasının parçası olarak değil, belirli amaçlar için paketlenmiştir.

source: As of release 0.9.12, the Delivery Status Message is wrapped in another Garlic Message by the originator so that the contents are encrypted and not visible to routers on the return path.
pt: A partir da versão 0.9.12, a mensagem de status de entrega é encapsulada em outra mensagem Garlic pelo originador para que o conteúdo seja criptografado e não fique visível para os roteadores no caminho de retorno.
tr: 0.9.12 sürümünden başlayarak, teslimat durumu iletisi, içeriğin şifrelenmesi ve dönüş yolundaki yönelticiler tarafından görülmemesi için gönderici tarafından başka bir garlic iletisine sarılır.

source: Storage to the Floodfill Network Database
pt: Armazenamento no banco de dados da rede Floodfill
tr: Otomatik doldurma Ağ veri tabanına depolama

source: As explained on the <a href="%(netdb)s#delivery">network database page</a>, local <a href="%(commonstructures)s#struct_LeaseSet">LeaseSets</a> are sent to floodfill routers in a <a href="%(i2npspec)s#msg_DatabaseStore">Database Store Message</a> wrapped in a <a href="%(i2npspec)s#msg_Garlic">Garlic Message</a> so it is not visible to the tunnel's outbound gateway.
pt: Conforme explicado na página do banco de dados de rede <a href="%(netdb)s#delivery"></a>, locais <a href="%(commonstructures)s#struct_LeaseSet">LeaseSets</a> são enviados para roteadores de floodfill em uma <a href="%(i2npspec)s#msg_DatabaseStore">Mensagem de Armazenamento de Banco de Dados</a> envolta em uma <a href="%(i2npspec)s#msg_Garlic">Mensagem Garlic</a> para que não seja visível para o gateway de saída do túnel.
tr: <a href="%(netdb)s#delivery">"Ağ veri tabanı" (NetDB) sayfasında</a> açıklandığı gibi, yerel <a href="%(commonstructures)s#struct_LeaseSet">"Kiralama kümeleri" (LeaseSets)</a> bir <a href="%(i2npspec)s#msg_Garlic">Garlic iletisine</a> sarılmış bir <a href="%(i2npspec)s#msg_DatabaseStore">"Veri tabanı kaydetme iletisi" (DatabaseStoreMessage)</a> içindeki otomatik doldurma yönelticilerine gönderilir. Böylece tünelin gidiş ağ geçidi tarafından görülmez.

source: The Garlic Message mechanism is very flexible and provides a structure for implementing many types of mixnet delivery methods. Together with the unused delay option in the <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">tunnel message Delivery Instructions</a>, a wide spectrum of batching, delay, mixing, and routing strategies are possible.
pt: O mecanismo Garlic Message é muito flexível e fornece uma estrutura para implementar muitos tipos de métodos de entrega mixnet. Junto com a opção de atraso não utilizada nas <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">Instruções de entrega de mensagens de túnel</a>, um amplo espectro de estratégias de agrupamento, atraso, mistura e roteamento são possíveis.
tr: Garlic ileti mekanizması çok esnektir ve birçok türde mixnet dağıtım yönteminin uygulanabileceği bir yapı sağlar. <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">Tunel ileti teslim yönergelerinde</a> kullanılmayan gecikme seçeneğiyle birlikte, geniş bir toplu işlem, gecikme, karıştırma ve yöneltme stratejileri yelpazesi uygulanabilir.

source: In particular, there is potential for much more flexibility at the outbound tunnel endpoint. Messages could possibly be routed from there to one of several tunnels (thus minimizing point-to-point connections), or multicast to several tunnels for redundancy, or streaming audio and video.
pt: Em particular, há potencial para muito mais flexibilidade no ponto final do túnel de saída. As mensagens poderiam ser roteadas de lá para um dos vários túneis (minimizando assim as conexões ponto a ponto), ou multicast para vários túneis para redundância, ou streaming de áudio e vídeo.
tr: Özellikle, gidiş tüneli uç noktasında çok daha fazla esneklik potansiyeli vardır. İletiler büyük olasılıkla oradan birkaç tünelden birine yöneltilebilir (böylece noktadan noktaya bağlantılar en aza indirilir) ya da yedeklilik veya ses ve görüntü akışı için birkaç tünel ile çok noktaya yayın yapılabilir.

source: Such experiments may conflict with the need to ensure security and anonymity, such as limiting certain routing paths, restricting the types of I2NP messages that may be forwarded along various paths, and enforcing certain message expiration times.
pt: Tais experimentos podem entrar em conflito com a necessidade de garantir segurança e anonimato, como limitar certos caminhos de roteamento, restringir os tipos de mensagens I2NP que podem ser encaminhadas por vários caminhos e impor certos tempos de expiração de mensagens.
tr: Bu tür deneyler, belirli yöneltme yollarının sınırlandırılması, çeşitli yollar boyunca iletilebilecek I2NP iletilerinin türlerinin kısıtlanması ve belirli ileti geçerlilik sürelerinin uygulanması gibi güvenlik ve anonimlik sağlama gereksinimiyle çelişebilir.

source: As a part of <a href="%(elgamalaes)s">ElGamal/AES encryption</a>, a garlic message contains a sender specified amount of padding data, allowing the sender to take active countermeasures against traffic analysis. This is not currently used, beyond the requirement to pad to a multiple of 16 bytes.
pt: Como parte da criptografia ElGamal/AES <a href="%(elgamalaes)s"></a>, uma mensagem garlic contém uma quantidade especificada de dados de preenchimento do remetente , permitindo que o remetente tome contramedidas ativas contra a análise de tráfego. Isso não é usado atualmente, além do requisito de preenchimento para um múltiplo de 16 bytes.
tr: <a href="%(elgamalaes)s">ElGamal/AES şifrelemesinin</a> bir parçası olarak bir Garlic iletisi göndericinin belirttiği kadar dolgu ekleme verisi içerir ve göndericinin trafik analizine karşı etkin önlemler almasını sağlar. Bu seçenek şu anda 16 baytın katlarına kadar dolgu ekleme gereksiniminin ötesinde kullanılmaz.

source: Encryption of additional messages to and from the <a href="%(netdb)s#delivery">floodfill routers</a>.
pt: Criptografia de mensagens adicionais de e para os roteadores de floodfill <a href="%(netdb)s#delivery"></a>.
tr: <a href="%(netdb)s#delivery">Otomatik doldurma yönelticilerinin</a> geliş ve gidiş ek iletilerinin şifrelenmesi.

source: References
pt: Referências
tr: Referanslar

source: The term garlic routing was first coined in Roger Dingledine's Free Haven <a href="http://www.freehaven.net/papers.html">Master's thesis</a> (June 2000), see Section 8.1.1 authored by <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a>.
pt: O termo roteamento de alho foi cunhado pela primeira vez na tese de mestrado de Roger Dingledine, Free Haven <a href="http://www.freehaven.net/papers.html"></a> (junho de 2000), veja Seção 8.1.1 de autoria de <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a>.
tr: Garlic yöneltme terimi ilk olarak Roger Dingledine'in Free Haven <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a> tarafından yazılmış olan <a href="http://www.freehaven.net/papers.html">Yüksek lisans tezinde</a> (Haziran 2000) 8.1.1 bölümünde kullanılmıştır.

source: Onion router publications
pt: Publicações em onion-router.net
tr: Onion yöneltme yayınları

source: Onion Routing on Wikipedia
pt: Roteamento Cebola na Wikipédia
tr: Wikipedia Üzerinde Onion Yöneltme

source: Garlic Routing on Wikipedia
pt: Roteamento Alho na Wikipédia
tr: Wikipedia Üzerinde Garlic Yöneltme

source: <a href="%(meeting58)s">I2P Meeting 58</a> (2003) discussing the implementation of garlic routing
pt: <a href="%(meeting58)s">Encontro 58 sobre a I2P</a> (2003) discussão sobre a implementação do roteamento alho
tr: Garlic yöneltmenin tartışıldığı <a href="%(meeting58)s">58. I2P toplantısı</a> (2003)

source: Free Haven publications
pt: Publicações em freehaven.net
tr: Free Haven yayınları

source: Onion routing was first described in <a href="http://www.onion-router.net/Publications/IH-1996.pdf">Hiding Routing Information</a> by David M. Goldschlag, Michael G. Reed, and Paul F. Syverson in 1996.
pt: O roteamento onion foi descrito pela primeira vez em <a href="http://www.onion-router.net/Publications/IH-1996.pdf">Ocultando informações de roteamento</a> por David M. Goldschlag, Michael G. Reed e Paul F. Syverson em 1996.
tr: Onion yöneltme ilk olarak 1996 yılında David M. Goldschlag, Michael G. Reed ve Paul F. Syverson tarafından <a href="http://www.onion-router.net/Publications/IH-1996.pdf">Hiding Routing Information</a> içinde tanımlanmıştır.

source: A Gentle Introduction to How I2P Works
pt: Uma introdução suave sobre como o I2P funciona
tr: I2P Nasıl Çalışır Hafif Bir Giriş

source: I2P is a project to build, deploy, and maintain a network supporting secure and anonymous communication. People using I2P are in control of the tradeoffs between anonymity, reliability, bandwidth usage, and latency. There is no central point in the network on which pressure can be exerted to compromise the integrity, security, or anonymity of the system. The network supports dynamic reconfiguration in response to various attacks, and has been designed to make use of additional resources as they become available. Of course, all aspects of the network are open and freely available.
pt: O I2P é um projeto para construir, implantar e manter uma rede que suporte comunicação segura e anônima . Pessoas que usam o I2P estão no controle das compensações entre anonimato, confiabilidade, uso de largura de banda e latência. Não há um ponto central na rede sobre o qual a pressão pode ser exercida para comprometer a integridade, segurança ou anonimato do sistema. A rede suporta reconfiguração dinâmica em resposta a vários ataques e foi projetada para fazer uso de recursos adicionais conforme eles se tornam disponíveis. Claro, todos os aspectos da rede são abertos e disponíveis gratuitamente.
tr: I2P, güvenli ve anonim iletişimi destekleyen bir ağ oluşturmayı, dağıtmayı ve sürdürmeyi amaçlayan bir projedir. I2P kullanan kişiler, anonimlik, güvenilirlik, bant genişliği kullanımı ve gecikme arasındaki dengeleri kontrol eder. Ağda, sistemin bütünlüğünü, güvenliğini veya anonimliğini tehlikeye atabilecek şekilde baskı uygulanabilecek hiçbir merkezi nokta bulunmaz. Ağ, çeşitli saldırılara yanıt olarak devingen yeniden yapılandırmayı destekler ve kullanılabilir olduğunda ek kaynaklardan yararlanmak üzere tasarlanmıştır. Tabii ki, ağın tüm yönleri açık ve ücretsiz olarak kullanılabilir.

source: Unlike many other anonymizing networks, I2P doesn't try to provide anonymity by hiding the originator of some communication and not the recipient, or the other way around. I2P is designed to allow peers using I2P to communicate with each other anonymously &mdash; both sender and recipient are unidentifiable to each other as well as to third parties. For example, today there are both in-I2P web sites (allowing anonymous publishing / hosting) as well as HTTP proxies to the normal web (allowing anonymous web browsing). Having the ability to run servers within I2P is essential, as it is quite likely that any outbound proxies to the normal Internet will be monitored, disabled, or even taken over to attempt more malicious attacks.
pt: Diferente de muitas outras redes de anonimização, o I2P não tenta fornecer anonimato ao esconder o origem de alguma comunicação e não o destinatário, ou vice-versa. O I2P é projetado para permitir que os pares usando I2P se comuniquem anonimamente &mdash; tanto o remetente quanto o destinatário são não identificáveis um para o outro, assim como para terceiros. Por exemplo, hoje existem tanto sites da web em I2P (permitindo publicação/hospedagem anônima) quanto proxies HTTP para a web normal (permitindo navegação anônima na web). Ter a capacidade de executar servidores dentro do I2P é essencial, pois é muito provável que quaisquer proxies de saída para a Internet normal sejam monitorados, desativados, ou até mesmo tomados para tentar ataques mais maliciosos.
tr: Diğer birçok anonimleştirici ağdan farklı olarak, I2P, alıcıyı değil, bazı iletişimlerin kaynağını gizleyerek veya tam tersi şekilde anonimlik sağlamaya çalışmaz. I2P, I2P kullanan eşlerin birbirleriyle anonim olarak iletişim kurmasını sağlayacak şekilde tasarlanmıştır. Hem gönderici hem de alıcı birbirleri ve üçüncü şahıslar tarafından tanımlanamaz. Örneğin, bugün hem I2P içi siteler (anonim yayınlamaya / barındırmaya izin veren) hem de normal internet için HTTP vekil sunucuları (anonim internet gezinmesine izin veren) vardır. Sunucuları I2P içinde çalıştırma yeteneği çok önemlidir, çünkü normal İnternet üzerine bağlanan tüm çıkış vekil sunucularının izlenmesi, devre dışı bırakılması ve hatta daha fazla kötü niyetli saldırı girişiminde bulunmak için devralınması olasılığı yüksektir.

source: The network itself is message oriented - it is essentially a secure and anonymous IP layer, where messages are addressed to cryptographic keys (Destinations) and can be significantly larger than IP packets. Some example uses of the network include "I2P Sites" (webservers hosting normal web applications within I2P), a BitTorrent client ("I2PSnark"), or a distributed data store. With the help of the <a href="%(i2ptunnel)s">I2PTunnel</a> application, we are able to stream traditional TCP/IP applications over I2P, such as SSH, IRC, a squid proxy, and even streaming audio. Most people will not use I2P directly, or even need to know they're using it. Instead their view will be of one of the I2P enabled applications, or perhaps as a little controller app to turn on and off various proxies to enable the anonymizing functionality.
pt: A rede em si é orientada a mensagens - é essencialmente uma camada IP segura e anônima, onde as mensagens são endereçadas a chaves criptográficas (Destinos) e podem ser significativamente maiores do que os pacotes IP . Alguns exemplos de uso da rede incluem "Sites I2P" (servidores web que hospedam aplicativos web normais dentro do I2P), um cliente BitTorrent ("I2PSnark") ou um armazenamento de dados distribuído. Com a ajuda do aplicativo <a href="%(i2ptunnel)s">I2PTunnel</a> , podemos transmitir aplicativos TCP/IP tradicionais sobre I2P, como SSH, IRC, um proxy squid e até mesmo streaming de áudio. A maioria das pessoas não usará o I2P diretamente, ou mesmo precisará saber que o está usando. Em vez disso, sua visão será de um dos aplicativos habilitados para I2P, ou talvez como um pequeno aplicativo controlador para ligar e desligar vários proxies para habilitar a funcionalidade de anonimato.
tr: Ağın kendisi ileti odaklıdır. Aslında iletilerin şifreleme anahtarlarına (hedefler) adreslendiği ve IP paketlerinden önemli ölçüde daha büyük olabilen güvenli ve anonim bir IP katmanıdır. Ağın bazı örnek kullanımları arasında "I2P siteleri" (I2P içinde normal internet uygulamalarını barındıran site sunucuları), bir BitTorrent istemcisi ("I2PSnark") veya dağıtılmış bir veri deposu bulunur. <a href="%(i2ptunnel)s">I2PTunnel</a>uygulamasının yardımıyla geleneksel akışları gerçekleştirebiliyoruz. SSH, IRC, bir squid vekil sunucusu ve hatta ses akışı gibi I2P üzerinden TCP/IP uygulamaları. Çoğu insan doğrudan I2P kullanmaz, hatta kullandıklarını bilmeleri gerekir. Bunun yerine, I2P özellikli uygulamalardan biri ya da anonimleştirme işlevini etkinleştirmek için çeşitli vekil sunucuları açıp kapatmak amacıyla küçük bir denetleyici uygulaması kullanırlar.
