Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: An essential part of designing, developing, and testing an anonymizing network is to define the <a href="%(threatmodel)s">threat model</a>, since there is no such thing as "true" anonymity, just increasingly expensive costs to identify someone. Briefly, I2P's intent is to allow people to communicate in arbitrarily hostile environments by providing good anonymity, mixed in with sufficient cover traffic provided by the activity of people who require less anonymity. This way, some users can avoid detection by a very powerful adversary, while others will try to evade a weaker entity, <i>all on the same network</i>, where each one's messages are essentially indistinguishable from the others.
pt: Uma parte essencial do design, desenvolvimento e teste de uma rede de anonimato é definir o modelo de ameaça <a href="%(threatmodel)s"></a>, já que não existe algo como anonimato "verdadeiro", apenas custos cada vez mais altos para identificar alguém. Resumidamente, a intenção do I2P é permitir que as pessoas se comuniquem em ambientes arbitrariamente hostis, fornecendo bom anonimato, misturado com tráfego de cobertura suficiente fornecido pela atividade de pessoas que exigem menos anonimato. Dessa forma, alguns usuários podem evitar a detecção de um adversário muito poderoso, enquanto outros tentarão escapar de uma entidade mais fraca , <i>todos na mesma rede</i>, onde as mensagens de cada um são essencialmente indistinguíveis das outras.
tr: Anonimleştirme ağı tasarlamanın, geliştirmenin ve denemenin önemli bir parçası, "gerçek" anonimlik diye bir şey olmadığından ve yalnızca birini tanımlamanın maliyeti giderek arttığından, <a href="%(threatmodel)s">tehdit modelini</a> tanımlamaktır. Kısaca, I2P ağının amacı, daha az anonimlik gerektiren kişilerin faaliyetleri tarafından sağlanan yeterli kapsama trafiği ile karıştırılmış iyi bir anonimlik sağlayarak, insanların isteğe bağlı olarak düşmanca ortamlarda iletişim kurmasını sağlamaktır. Bu şekilde, bazı kullanıcılar çok güçlü bir düşman tarafından tespit edilmekten kaçınabilirken, diğerleri, her birinin iletilerinin temel olarak diğerlerinden ayırt edilemez olduğu <i>aynı ağda</i> daha zayıf bir varlıktan kaçınmaya çalışacaklardır.

source: Why?
pt: Por que?
tr: Neden?

source: There are a multitude of reasons why we need a system to support anonymous communication, and everyone has their own personal rationale. There are many <a href="%(comparisons)s">other efforts</a> working on finding ways to provide varying degrees of anonymity to people through the Internet, but we could not find any that met our needs or threat model.
pt: Há uma infinidade de razões pelas quais precisamos de um sistema para dar suporte à comunicação anônima, e cada um tem sua própria justificativa pessoal. Há muitos <a href="%(comparisons)s">outros esforços</a> trabalhando para encontrar maneiras de fornecer vários graus de anonimato às pessoas por meio da Internet, mas não conseguimos encontrar nenhum que atendesse às nossas necessidades ou modelo de ameaça.
tr: Anonim iletişimi desteklemek için bir sisteme gerek duymamızın birçok nedeni vardır ve herkesin kendi kişisel mantığı vardır. İnternet üzerinde insanlara değişen derecelerde anonimlik sağlamanın yollarını bulmaya çalışan <a href="%(comparisons)s">başka birçok çaba</a> var. Ancak gereksinimlerimizi veya tehdit modelimizi karşılayan birini bulamadık.

source: How?
pt: Como?
tr: Nasıl?

source: The network at a glance is made up of a set of nodes ("routers") with a number of unidirectional inbound and outbound virtual paths ("tunnels", as outlined on the <a href="%(tunnelrouting)s">tunnel routing</a> page). Each router is identified by a cryptographic RouterIdentity which is typically long lived. These routers communicate with each other through existing transport mechanisms (TCP, UDP, etc), passing various messages. Client applications have their own cryptographic identifier ("Destination") which enables it to send and receive messages. These clients can connect to any router and authorize the temporary allocation ("lease") of some tunnels that will be used for sending and receiving messages through the network. I2P has its own internal <a href="%(netdb)s">network database</a> (using a modification of the Kademlia algorithm) for distributing routing and contact information securely.
pt: A rede em resumo é composta por um conjunto de nós ("roteadores") com um número de caminhos virtuais de entrada e saída unidirecionais ("túneis", conforme descrito na página <a href="%(tunnelrouting)s">roteamento de túnel</a> ). Cada roteador é identificado por uma RouterIdentity criptográfica que é tipicamente de longa duração. Esses roteadores se comunicam entre si por meio de mecanismos de transporte existentes (TCP, UDP, etc.), passando várias mensagens. Os aplicativos clientes têm seu próprio identificador criptográfico ("Destino") que permite enviar e receber mensagens. Esses clientes podem se conectar a qualquer roteador e autorizar a alocação temporária ("concessão") de alguns túneis que serão usados para enviar e receber mensagens pela rede. O I2P tem seu próprio banco de dados de rede interno <a href="%(netdb)s"></a> (usando uma modificação do algoritmo Kademlia) para distribuir informações de roteamento e contato com segurança.
tr: Bir bakışta ağ, bir dizi tek yönlü geliş ve gidiş sanal yoluna sahip bir dizi düğümden ("yönelticiler") oluşur ("tünel", <a href="%(tunnelrouting)s">tünel yöneltme</a> sayfasında ana hatlarıyla belirtildiği gibi). Her yöneltici tipik olarak uzun ömürlü bir şifrelenmiş "Yöneltici kimliği" (RouterIdentity) ile tanımlanır. Bu yönelticiler, çeşitli iletiler ileterek, var olan taşıyıcı yöntemleri (TCP, UDP gibi) üzerinden birbirleriyle iletişim kurar. İstemci uygulamalarının, ileti gönderip almasını sağlayan kendi şifreleme tanımlayıcısı ("hedef") vardır. Bu istemciler herhangi bir yönelticiye bağlanabilir ve ağ üzerinden ileti göndermek ve almak için kullanılacak bazı tünellerin geçici olarak tahsis edilmesine ("kiralama") yetki verebilir. I2P, yöneltme ve iletişim bilgilerini güvenli bir şekilde dağıtmak için kendi iç <a href="%(netdb)s">"Ağ veri tabanına" (NetDB)</a> (Kademlia algoritmasının değiştirilmiş bir şeklini kullanan) sahiptir.

source: Network topology example
pt: Exemplo de topologia de rede
tr: Ağ topolojisi örneği

source: In the above, Alice, Bob, Charlie, and Dave are all running routers with a single Destination on their local router. They each have a pair of 2-hop inbound tunnels per destination (labeled 1, 2, 3, 4, 5 and 6), and a small subset of each of those router's outbound tunnel pool is shown with 2-hop outbound tunnels. For simplicity, Charlie's inbound tunnels and Dave's outbound tunnels are not shown, nor are the rest of each router's outbound tunnel pool (typically stocked with a few tunnels at a time). When Alice and Bob talk to each other, Alice sends a message out one of her (pink) outbound tunnels targeting one of Bob's (green) inbound tunnels (tunnel 3 or 4). She knows to send to those tunnels on the correct router by querying the network database, which is constantly updated as new leases are authorized and old ones expire.
pt: Acima, Alice, Bob, Charlie e Dave estão todos executando roteadores com um único Destino em seu roteador local. Cada um deles tem um par de túneis de entrada de 2 saltos por destino (rotulados 1, 2, 3, 4, 5 e 6), e um pequeno subconjunto de cada pool de túneis de saída desses roteadores é mostrado com túneis de saída de 2 saltos . Para simplificar, os túneis de entrada de Charlie e os túneis de saída de Dave não são mostrados, nem o restante do pool de túneis de saída de cada roteador (normalmente abastecido com alguns túneis por vez). Quando Alice e Bob conversam entre si, Alice envia uma mensagem por um de seus túneis de saída (rosa) visando um dos túneis de entrada (verde) de Bob (túnel 3 ou 4). Ela sabe enviar para esses túneis no roteador correto consultando o banco de dados da rede, que é constantemente atualizado conforme novos leases são autorizados e os antigos expiram.
tr: Yukarıda, Alice, Bob, Charlie ve Dave, yerel yönelticilerinde tek bir hedefe sahip yönelticiler işletiyor. Her birinin hedef başına bir çift 2 sıçramalı geliş tüneli vardır (1, 2, 3, 4, 5 ve 6 olarak etiketlenir) ve bu yönelticinin gidiş tünel havuzunun küçük bir alt kümesi 2 sıçramalı gidiş tünelleri ile gösterilir. Basit olması için, Charlie'nin geliş tünelleri ve Dave'in gidiş tünelleri ve her yönelticinin gidiş tüneli havuzunun geri kalanı gösterilmemiştir (tipik olarak bir seferde birkaç tünelle stoklanmıştır). Alice ve Bob birbirleriyle konuştuğunda, Alice (pembe) gidiş tünellerinden birinden Bob'un (yeşil) geliş tünellerinden (tünel 3 veya 4) birini hedefleyen bir ileti gönderir. Alice, yeni kiralamalar yapılıp eski kiralamalar sona erdikçe sürekli güncellenen ağ veri tabanını sorgulayarak iletileri yöneltici üzerinde bu tünellere doğru göndermeyi bilir.

source: If Bob wants to reply to Alice, he simply goes through the same process - send a message out one of his outbound tunnels targeting one of Alice's inbound tunnels (tunnel 1 or 2). To make things easier, most messages sent between Alice and Bob are <a href="%(garlicrouting)s">garlic</a> wrapped, bundling the sender's own current lease information so that the recipient can reply immediately without having to look in the network database for the current data.
pt: Se Bob quiser responder a Alice, ele simplesmente passa pelo mesmo processo - envia uma mensagem por um dos seus túneis de saída visando um dos túneis de entrada de Alice (túnel 1 ou 2). Para tornar as coisas mais fáceis, a maioria das mensagens enviadas entre Alice e Bob são <a href="%(garlicrouting)s">garlic</a> encapsuladas, agrupando as próprias informações de concessão atuais do remetente para que o destinatário possa responder imediatamente sem ter que procurar no banco de dados da rede pelos dados atuais.
tr: Bob, Alice'e yanıt vermek isterse, aynı süreçten geçer. Gidiş tünellerinden birinden Alice'in geliş tünellerinden birini (tünel 1 veya 2) hedefleyen bir ileti gönderir. İşleri kolaylaştırmak için, Alice ve Bob arasında gönderilen iletilerin çoğu <a href="%(garlicrouting)s">garlic</a> olarak paketlenir ve göndericinin kendi geçerli kiralama bilgilerini bir araya getirir. Böylece alıcı geçerli veriler için ağ veri tabanına bakmak zorunda kalmadan hemen yanıt verebilir.

source: To deal with a wide range of attacks, I2P is fully distributed with no centralized resources - and hence there are no directory servers keeping statistics regarding the performance and reliability of routers within the network. As such, each router must keep and maintain profiles of various routers and is responsible for selecting appropriate peers to meet the anonymity, performance, and reliability needs of the users, as described in the <a href="%(peerselection)s">peer selection</a> page.
pt: Para lidar com uma ampla gama de ataques, o I2P é totalmente distribuído sem recursos centralizados - e portanto, não há servidores de diretório mantendo estatísticas sobre o desempenho e a confiabilidade de roteadores dentro da rede. Como tal, cada roteador deve manter e manter perfis de vários roteadores e é responsável por selecionar pares apropriados para atender às necessidades de anonimato, desempenho e confiabilidade dos usuários, conforme descrito na página <a href="%(peerselection)s">seleção de pares</a> .
tr: Çok çeşitli saldırılarla başa çıkmak için, I2P hiçbir merkezi kaynak olmadan tamamen dağıtılmış olarak çalışır ve bu yüzden ağ içindeki yönelticilerin başarımı ve güvenilirliği ile ilgili istatistikleri tutan dizin sunucuları bulunmaz. Bu nedenle her yönelticinin, çeşitli yönelticilerin profillerini tutması, güncellemesi ve <a href="%(peerselection)s">eş seçimi</a> bölümünde açıklandığı gibi, kullanıcıların anonimlik, başarım ve güvenilirlik gereksinimlerini karşılamak için uygun eşleri seçmesi gerekir.

source: The network itself makes use of a significant number of <a href="%(cryptography)s">cryptographic techniques and algorithms</a> - a full laundry list includes 2048bit ElGamal encryption, 256bit AES in CBC mode with PKCS#5 padding, 1024bit DSA signatures, SHA256 hashes, 2048bit Diffie-Hellman negotiated connections with station to station authentication, and <a href="%(elgamalaes)s">ElGamal / AES+SessionTag</a>.
pt: A rede em si faz uso de um número significativo de técnicas e algoritmos criptográficos <a href="%(cryptography)s"> </a> - uma lista completa inclui criptografia ElGamal de 2048 bits, AES de 256 bits no modo CBC com preenchimento PKCS#5, assinaturas DSA de 1024 bits, hashes SHA256, conexões negociadas Diffie-Hellman de 2048 bits com autenticação de estação para estação e <a href="%(elgamalaes)s">ElGamal / AES+SessionTag</a>.
tr: Ağın kendisi önemli sayıda <a href="%(cryptography)s">şifreleme tekniği ve algoritması</a> kullanır. Tam bir listede 2048 bit ElGamal şifrelemesi, PKCS#5 dolgu eklemesi CBC modunda 256 bit AES, 1024 bit DSA imzaları, SHA-256 karmaları, 2048 bit Diffie-Hellman, istasyondan istasyona kimlik doğrulaması ve <a href="%(elgamalaes)s">ElGamal / AES+Oturum etiketi</a> bulunur.

source: Content sent over I2P is encrypted through three layers garlic encryption (used to verify the delivery of the message to the recipient), tunnel encryption (all messages passing through a tunnel is encrypted by the tunnel gateway to the tunnel endpoint), and inter router transport layer encryption (e.g. the TCP transport uses AES256 with ephemeral keys).
pt: O conteúdo enviado por I2P é criptografado por meio de criptografia de três camadas: criptografia garlic (usada para verificar a entrega da mensagem ao destinatário), criptografia de túnel (todas as mensagens que passam por um túnel são criptografadas pelo gateway do túnel até o ponto final do túnel) e criptografia de camada de transporte entre roteadores (por exemplo, o transporte TCP usa AES256 com chaves efêmeras).
tr: I2P üzerinden gönderilen içerik üç katmanda şifrelenir. Garlic şifrelemesi (iletinin alıcıya teslim edildiğini doğrulamak için), tünel şifrelemesi (bir tünelden geçen tüm iletilerin tünel ağ geçidi tarafından tünel uç noktasına şifrelenmesi için) ve yönelticiler arası taşıyıcı katmanı şifrelemesi (kısa ömürlü anahtarlarla AES256 kullanan TCP taşıyıcısı için) kullanılır.

source: End-to-end (I2CP) encryption (client application to server application) was disabled in I2P release 0.6; end-to-end (garlic) encryption (I2P client router to I2P server router) from Alice's router "a" to Bob's router "h" remains. Notice the different use of terms! All data from a to h is end-to-end encrypted, but the I2CP connection between the I2P router and the applications is not end-to-end encrypted! A and h are the routers of Alice and Bob, while Alice and Bob in following chart are the applications running atop of I2P.
pt: Criptografia ponta a ponta (I2CP) (aplicativo cliente para aplicativo servidor) foi desabilitada na versão 0.6 do I2P; criptografia ponta a ponta (alho) (roteador cliente I2P para roteador servidor I2P) do roteador "a" de Alice para o roteador "h" de Bob permanece. Observe o uso diferente dos termos ! Todos os dados de a para h são criptografados ponta a ponta, mas a conexão I2CP entre o roteador I2P e os aplicativos não são criptografados ponta a ponta! A e h são os roteadores de Alice e Bob, enquanto Alice e Bob no gráfico a seguir são os aplicativos em execução no topo do I2P.
tr: I2P 0.6 sürümünde uçtan uca (I2CP) şifreleme (istemci uygulamasından sunucu uygulamasına) devre dışı bırakıldı; Alice'in yönelticisi "a" ile Bob'un yönelticisi "h" arasında uçtan uca (Garlic) şifreleme (I2P istemci yönelticisinden I2P sunucu yönelticisine) kalır. Terimlerin farklı kullanımına dikkat edin! A ile h arasındaki tüm veriler uçtan uca şifrelenir, ancak I2P yöneltici ile uygulamalar arasındaki I2CP bağlantısı uçtan uca şifrelenmiş değildir! A ve h, Alice ve Bob'un yönelticileridir. Aşağıdaki tabloda Alice ve Bob, I2P üzerinde çalışan uygulamalardır.

source: End to end layered encryption
pt: Criptografia em camadas de ponta a ponta
tr: Uçtan uca katmanlı şifreleme

source: The specific use of these algorithms are outlined <a href="%(cryptography)s">elsewhere</a>.
pt: O uso específico desses algoritmos é descrito <a href="%(cryptography)s">em outro lugar</a>.
tr: Bu algoritmaların özel kullanımı <a href="%(cryptography)s">başka bir yerde</a> açıklanmıştır.

source: The two main mechanisms for allowing people who need strong anonymity to use the network are explicitly delayed garlic routed messages and more comprehensive tunnels to include support for pooling and mixing messages. These are currently planned for release 3.0, but garlic routed messages with no delays and FIFO tunnels are currently in place. Additionally, the 2.0 release will allow people to set up and operate behind restricted routes (perhaps with trusted peers), as well as the deployment of more flexible and anonymous transports.
pt: Os dois principais mecanismos para permitir que pessoas que precisam de forte anonimato usem a rede são mensagens roteadas garlic explicitamente atrasadas e túneis mais abrangentes para incluir suporte para mensagens de pooling e mixagem. Eles estão atualmente planejados para a versão 3.0, mas mensagens roteadas garlic sem atrasos e túneis FIFO estão atualmente em vigor. Além disso, a versão 2.0 permitirá que pessoas configurem e operem atrás de rotas restritas (talvez com pares confiáveis), bem como a implantação de transportes mais flexíveis e anônimos.
tr: Güçlü anonimliğe gerek duyan kişilerin ağı kullanmasına izin veren iki ana mekanizma, açıkça geciktirilmiş Garlic yöneltmeli iletiler ve iletilerin birleştirilmesi ve karıştırılması için destek içeren daha kapsamlı tünellerdir. Bunlar şu anda 3.0 sürümü için planlanıyor. Ancak hiçbir gecikme olmaksızın Garlic yöneltmeli iletiler ve FIFO tünelleri şu anda yerinde. Ek olarak, 2.0 sürümü, insanların kısıtlanmış rotaların arkasında (belki de güvenilir eşlerle) kurulmasına ve çalışmasına ve ayrıca daha esnek ve anonim taşıyıcıların konuşlandırılmasına olanak sağlayacaktır.

source: Some questions have been raised with regards to the scalability of I2P, and reasonably so. There will certainly be more analysis over time, but peer lookup and integration should be bounded by <code>O(log(N))</code> due to the <a href="%(netdb)s">network database</a>'s algorithm, while end to end messages should be <code>O(1)</code> (scale free), since messages go out K hops through the outbound tunnel and another K hops through the inbound tunnel, with K no longer than 3. The size of the network (N) bears no impact.
pt: Algumas questões foram levantadas em relação à escalabilidade do I2P, e razoavelmente assim. Com certeza haverá mais análises ao longo do tempo, mas a busca e integração de pares devem ser limitadas por <code>O(log(N))</code> devido ao algoritmo do <a href="%(netdb)s">banco de dados da rede</a>, enquanto as mensagens de ponta a ponta devem ser <code>O(1)</code> (escala livre), uma vez que as mensagens saem em K saltos pelo túnel de saída e mais K saltos pelo túnel de entrada, com K não maior que 3. O tamanho da rede (N) não tem impacto.
tr: I2P ağının ölçeklenebilirliği ile ilgili bazı sorular ortaya atıldı ve bu mantıklı. Zamanla kesinlikle daha fazla inceleme yapılacak. Ancak <a href="%(netdb)s">"Ağ veri tabanı" (NetDB)</a> algoritması nedeniyle eş arama ve bütünleştirme <code>O(log(N))</code> ile sınırlandırılmalı, uçtan uca iletiler <code>O(1)</code> (ölçeksiz) olmalıdır. İletiler gidiş tünelinden K sıçrama ile gider ve geliş tünelinden K ile gelir. K 3 taneden uzun değildir. Ağın (N) boyutunun hiçbir etkisi yoktur.

source: When?
pt: Quando?
tr: Ne zaman?

source: I2P initially began in Feb 2003 as a proposed modification to <a href="http://freenetproject.org">Freenet</a> to allow it to use alternate transports, such as <a href="%(jms)s">JMS</a>, then grew into its own as an 'anonCommFramework' in April 2003, turning into I2P in July, with code being written in earnest starting in August '03. I2P is currently under development, following the <a href="%(roadmap)s">roadmap</a>.
pt: O I2P começou inicialmente em fevereiro de 2003 como uma modificação proposta para <a href="http://freenetproject.org">Freenet</a> para permitir que ele usasse transportes alternativos, como <a href="%(jms)s">JMS</a>, então cresceu e se tornou um 'anonCommFramework' em abril de 2003, transformando-se em I2P em julho, com o código sendo escrito a sério começando em agosto de 2003. O I2P está atualmente em desenvolvimento, seguindo o roteiro <a href="%(roadmap)s"></a>.
tr: I2P ilk olarak 2003 Şubat ayında <a href="http://freenetproject.org">Freenet</a> üzerinde <a href="%(jms)s">JMS</a> gibi alternatif taşıyıcıları kullanmasını sağlamak için önerilen bir değişiklik olarak başladı. Daha sonra 2003 Nisan ayında bir 'anonCommFramework' olarak kendi başına büyüdü, Temmuz ayında I2P projesine dönüştü ve 2003 Ağustos ayında kodun ciddi bir şekilde yazılmasıyla başlayarak, <a href="%(roadmap)s">yol haritasına</a> göre geliştiriliyor.

source: Who?
pt: Quem?
tr: Kim tarafından?

source: We have a small <a href="%(team)s">team</a> spread around several continents, working to advance different aspects of the project. We are very open to other developers who want to get involved and anyone else who would like to contribute in other ways, such as critiques, peer review, testing, writing I2P enabled applications, or documentation. The entire system is open source - the router and most of the SDK are outright public domain with some BSD and Cryptix licensed code, while some applications like I2PTunnel and I2PSnark are GPL. Almost everything is written in Java (1.5+), though some third party applications are being written in Python and other languages. The code works on <a href="http://java.com/en/">Sun Java SE</a> and other Java Virtual Machines.
pt: Temos uma pequena equipe <a href="%(team)s"></a> espalhada por vários continentes, trabalhando para avançar diferentes aspectos do projeto. Estamos muito abertos a outros desenvolvedores que queiram se envolver e qualquer outra pessoa que queira contribuir de outras maneiras, como críticas, revisão por pares, testes, escrevendo aplicativos habilitados para I2P ou documentação. Todo o sistema é de código aberto - o roteador e a maioria do SDK são de domínio público com algum código licenciado BSD e Cryptix, enquanto alguns aplicativos como I2PTunnel e I2PSnark são GPL. Quase tudo é escrito em Java (1.5+), embora alguns aplicativos de terceiros estejam sendo escritos em Python e outras linguagens. O código funciona em <a href="http://java.com/en/">Sun Java SE</a> e outras Java Virtual Machines.
tr: Projenin farklı yönlerini geliştirmek için çalışan, birkaç kıtaya yayılmış küçük bir <a href="%(team)s">ekibimiz</a> var. Katılmak isteyen geliştiriciler ile eleştiri, meslektaş incelemesi, test, I2P özellikli uygulamalar yazma veya belgelendirme gibi başka şekillerde katkıda bulunmak isteyen herkese çok açığız. Tüm sistem açık kaynak kodludur. Yöneltici ve SDK yazılımının çoğu, bazı BSD ve Cryptix lisanslı kodlarla tamamen herkese açık iken, I2PTunnel ve I2PSnark gibi bazı uygulamalar GPL lisansı ile sunulmaktadır. Hemen hemen her şey Java (1.5+) ile yazılmıştır, ancak bazı üçüncü taraf uygulamalar Python ve diğer dillerde yazılmaktadır. Kod, <a href="http://java.com/en/">Sun Java SE</a> ve diğer Java sanal makinelerinde çalışır.

source: Where?
pt: Onde?
tr: Nerede?
