Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: The current connection limits are higher for SSU than for NTCP, based on the assumption that the memory requirements for an NTCP connection are higher than that for SSU. However, as NTCP buffers are partially in the kernel and SSU buffers are on the Java heap, that assumption is difficult to verify.
pt: Os limites de conexão atuais são maiores para SSU do que para NTCP, com base na suposição de que os requisitos de memória para uma conexão NTCP são maiores do que para SSU. No entanto, como os buffers NTCP estão parcialmente no kernel e os buffers SSU estão no heap Java, essa suposição é difícil de verificar.
tr: Bir NTCP bağlantısı için bellek gereksinimlerinin SSU için olandan daha yüksek olduğu varsayımına göre, geçerli bağlantı sınırları SSU için NTCP kullanılmasına göre daha yüksektir. Ancak, NTCP ara bellekleri kısmen çekirdekte ve SSU ara bellekleri Java yığınında bulunduğundan, bu varsayımı doğrulamak zordur.

source: Analyze <a href="%(pdf)s">Breaking and Improving Protocol Obfuscation</a> and see how transport-layer padding may improve things.
pt: Analise <a href="%(pdf)s">Quebrando e Melhorando a Ofuscação de Protocolo</a> e veja como o preenchimento da camada de transporte pode melhorar as coisas.
tr: <a href="%(pdf)s">Kırma ve iletişim kuralı gizlemeyi iyileştirme</a> incelemesi ile taşıyıcı katmanı dolgu eklemesinin işleri nasıl iyileştirebileceğini görün.

source: NTCP (NIO-based TCP)
pt: NTCP (TCP baseado em NIO)
tr: NTCP (NIO temelli TCP)

source: DEPRECATED, NO LONGER SUPPORTED. Disabled by default as of 0.9.40 2019-05. Support removed as of 0.9.50 2021-05. Replaced by <a href="%(ntcp2)s">NTCP2</a>. NTCP is a Java NIO-based transport introduced in I2P release 0.6.1.22. Java NIO (new I/O) does not suffer from the 1 thread per connection issues of the old TCP transport. NTCP-over-IPv6 is supported as of version 0.9.8.
pt: DEPRECADO, SEM SUPORTE. Desativado por padrão a partir de 0.9.40 2019-05. Suporte removido a partir de 0.9.50 2021-05. Substituído por <a href="%(ntcp2)s">NTCP2</a>. NTCP é um transporte baseado em Java NIO introduzido na versão 0.6.1.22 do I2P. Java NIO (nova E/S) não sofre com os problemas de 1 thread por conexão do antigo transporte TCP. NTCP sobre IPv6 é suportado a partir da versão 0.9.8.
tr: KULLANIMDAN KALDIRILDI ARTIK DESTEKLENMİYOR 2019-05 tarihindeki 0.9.40 sürümü ile devre dışı bırakıldı. 2021-05 tarihindeki 0.9.50 sürümü ile desteği kaldırıldı. <a href="%(ntcp2)s">NTCP2</a> ile değiştirildi. NTCP, I2P 0.6.1.22 sürümünde tanıtılan Java NIO tabanlı bir aktarıcıdır. Java NIO (new I/O, yeni giriş/çıkış), eski TCP taşıyıcısının bağlantı başına 1 işlem sorunundan etkilenmez. IPv6 üzerinden NTCP, 0.9.8 sürümünden başlayarak destekleniyor.

source: By default, NTCP uses the IP/Port auto-detected by SSU. When enabled on config.jsp, SSU will notify/restart NTCP when the external address changes or when the firewall status changes. Now you can enable inbound TCP without a static IP or dyndns service.
pt: Por padrão, o NTCP usa o IP/Porta detectado automaticamente pelo SSU. Quando habilitado no config.jsp, o SSU notificará/reiniciará o NTCP quando o endereço externo mudar ou quando o status do firewall mudar. Agora você pode habilitar o TCP de entrada sem um IP estático ou serviço dyndns.
tr: Varsayılan olarak, NTCP, SSU tarafından otomatik olarak algılanan IP adresi ve bağlantı noktasını kullanır. config.jsp üzerinde etkinleştirildiğinde, SSU, dış adres değiştiğinde veya güvenlik duvarı durumu değiştiğinde NTCP katmanını bilgilendirir ya da yeniden başlatır. Artık durağan bir IP adresi ya da dyndns hizmeti olmadan gelen TCP bağlantısını etkinleştirebilirsiniz.

source: The NTCP code within I2P is relatively lightweight (1/4 the size of the SSU code) because it uses the underlying Java TCP transport for reliable delivery.
pt: O código NTCP dentro do I2P é relativamente leve (1/4 do tamanho do código SSU) porque ele usa o transporte Java TCP subjacente para entrega confiável.
tr: I2P içindeki NTCP kodu, güvenilir aktarım için temeldeki Java TCP taşıyıcısını kullandığından görece hafiftir (SSU kodunun 1/4 boyutundadır).

source: Router Address Specification
pt: Especificação do Endereço do Roteador
tr: Yöneltici Adresi Teknik Özellikleri

source: The following properties are stored in the network database.
pt: As propriedades a seguir são armazenadas no banco de dados da rede.
tr: Ağ veri tabanında aşağıdaki özellikler depolanır.

source: NTCP Protocol Specification
pt: Especificação do Protocolo NTCP
tr: NTCP İletişim Kuralı Teknik Özellikleri

source: Standard Message Format
pt: Formato de Mensagem Padrão
tr: Standart İleti Biçimi

source: After establishment, the NTCP transport sends individual I2NP messages, with a simple checksum. The unencrypted message is encoded as follows:
pt: Após o estabelecimento, o transporte NTCP envia mensagens I2NP individuais, com uma soma de verificação simples. A mensagem não criptografada é codificada da seguinte forma:
tr: Bağlantının kuruluşundan sonra, NTCP taşıyıcısı basit bir sağlama toplamı ile bireysel I2NP iletileri gönderir. Şifrelenmemiş ileti aşağıdaki gibi kodlanmıştır:

source: The data is then AES/256/CBC encrypted. The session key for the encryption is negotiated during establishment (using Diffie-Hellman 2048 bit). The establishment between two routers is implemented in the EstablishState class and detailed below. The IV for AES/256/CBC encryption is the last 16 bytes of the previous encrypted message.
pt: Os dados são então criptografados AES/256/CBC. A chave de sessão para a criptografia é negociada durante o estabelecimento (usando Diffie-Hellman 2048 bits). O estabelecimento entre dois roteadores é implementado na classe EstablishState e detalhado abaixo. O IV para criptografia AES/256/CBC são os últimos 16 bytes da mensagem criptografada anterior.
tr: Veriler daha sonra AES/256/CBC ile şifrelenir. Şifreleme için oturum anahtarı, bağlantı kuruluşu sırasında görüşülür (Diffie-Hellman 2048 bit kullanılarak). İki yöneltici arasındaki bağlantının kuruluşu, EstablishState sınıfında uygulanır ve ayrıntıları aşağıda verilmiştir. AES/256/CBC şifrelemesi için IV, önceki şifrelenmiş iletinin son 16 baytıdır.

source: 0-15 bytes of padding are required to bring the total message length (including the six size and checksum bytes) to a multiple of 16. The maximum message size is currently 16 KB. Therefore the maximum data size is currently 16 KB - 6, or 16378 bytes. The minimum data size is 1.
pt: São necessários 0 a 15 bytes de preenchimento para levar o comprimento total da mensagem (incluindo os seis bytes de tamanho e soma de verificação) a um múltiplo de 16. O tamanho máximo da mensagem atualmente é 16 KB. Portanto, o tamanho máximo dos dados atualmente é 16 KB - 6, ou 16378 bytes. O tamanho mínimo dos dados é 1.
tr: Toplam ileti uzunluğunu (altı boyut ve sağlama toplamı baytı dahil) 16'nın katına getirmek için 0-15 bayt dolgu eklenmesi gerekir. En büyük ileti boyutu şu anda 16 KB olabilir. Bu nedenle en büyük veri boyutu şu anda 16 KB - 6 veya 16378 bayttır. En küçük veri boyutu 1 olabilir.

source: Time Sync Message Format
pt: Formato de mensagem de sincronização de tempo
tr: Zaman Eşitleme İleti Biçimi

source: One special case is a metadata message where the sizeof(data) is 0. In that case, the unencrypted message is encoded as:
pt: Um caso especial é uma mensagem de metadados onde o sizeof(data) é 0. Nesse caso, a mensagem não criptografada é codificada como:
tr: Özel bir durum, sizeof(data) değerinin 0 olduğu bir üst veri iletisidir. Bu durumda, şifrelenmemiş ileti şu şekilde kodlanır:

source: Total length: 16 bytes. The time sync message is sent at approximately 15 minute intervals. The message is encrypted just as standard messages are.
pt: Comprimento total: 16 bytes. A mensagem de sincronização de tempo é enviada em intervalos de aproximadamente 15 minutos. A mensagem é criptografada assim como as mensagens padrão.
tr: Toplam uzunluk: 16 bayt. Zaman eşitleme iletisi yaklaşık 15 dakikalık aralıklarla gönderilir. İleti standart iletiler gibi şifrelenir.

source: Checksums
tr: Sağlamalar

source: The standard and time sync messages use the Adler-32 checksum as defined in the <a href="%(rfc1950)s">ZLIB Specification</a>.
pt: As mensagens de sincronização padrão e de tempo usam a soma de verificação Adler-32 conforme definido na <a href="%(rfc1950)s">Especificação ZLIB</a>.
tr: Standart ve zaman eşitleme iletileri <a href="%(rfc1950)s">ZLIB teknik özelliklerinde</a> tanımlandığı gibi Adler-32 sağlama toplamını kullanır.

source: Idle Timeout
pt: Tempo limite ocioso
tr: Boşta Bekleme Zaman Aşımı

source: Idle timeout and connection close is at the discretion of each endpoint and may vary. The current implementation lowers the timeout as the number of connections approaches the configured maximum, and raises the timeout when the connection count is low. The recommended minimum timeout is two minutes or more, and the recommended maximum timeout is ten minutes or more.
pt: O tempo limite de inatividade e o fechamento da conexão ficam a critério de cada ponto de extremidade e podem variar. A implementação atual diminui o tempo limite à medida que o número de conexões se aproxima do máximo configurado e aumenta o tempo limite quando a contagem de conexões é baixa. O tempo limite mínimo recomendado é de dois minutos ou mais, e o tempo limite máximo recomendado é de dez minutos ou mais.
tr: Boşta bekleme zaman aşımı ve bağlantı kapatmayı, her uç nokta kendi belirler ve değişiklik gösterebilir. Geçerli uygulamada, bağlantı sayısı yapılandırılan en fazla değere yaklaştıkça zaman aşımı azaltılır ve bağlantı sayısı düşük olduğunda zaman aşımı artırılır. Önerilen en az zaman aşımı iki dakika ve üzerindedir. Önerilen en fazla zaman aşımı on dakika ve üzerindedir.

source: RouterInfo Exchange
pt: Troca de informações do roteador
tr: "Yöneltici bilgileri" (RouterInfo) alış verişi

source: After establishment, and every 30-60 minutes thereafter, the two routers should generally exchange RouterInfos using a DatabaseStoreMessage. However, Alice should check if the first queued message is a DatabaseStoreMessage so as not to send a duplicate message; this is often the case when connecting to a floodfill router.
pt: Após o estabelecimento, e a cada 30-60 minutos depois disso, os dois roteadores geralmente devem trocar RouterInfos usando uma DatabaseStoreMessage. No entanto, Alice deve verificar se a primeira mensagem na fila é uma DatabaseStoreMessage para não enviar uma mensagem duplicada; esse geralmente é o caso ao se conectar a um roteador floodfill.
tr: Bağlantının kuruluşundan sonra ve daha sonra her 30-60 dakikada bir, iki yöneltici genellikle bir "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) kullanarak "Yöneltici bilgileri" (RouterInfo) alış verişi yapmalıdır. Ancak, yinelenen bir ileti göndermemek için Alice ilk kuyruğa alınan iletinin bir "Veri tabanı kaydetme iletisi" (DatabaseStoreMessage) olup olmadığını denetlemelidir. Bu durum genellikle bir otomatik doldurma yönelticisi ile bağlantı kurulurken geçerlidir.

source: Establishment Sequence
pt: Sequência de Estabelecimento
tr: Bağlantı Kuruluşu Sıralaması

source: In the establish state, there is a 4-phase message sequence to exchange DH keys and signatures. In the first two messages there is a 2048-bit Diffie Hellman exchange. Then, signatures of the critical data are exchanged to confirm the connection.
pt: No estado estabelecido, há uma sequência de mensagens de 4 fases para trocar chaves DH e assinaturas. Nas duas primeiras mensagens, há uma troca Diffie Hellman de 2048 bits. Então, as assinaturas dos dados críticos são trocadas para confirmar a conexão.
tr: Kurulum durumunda, Diffie-Hellman anahtar ve imza alış verişi için 4 aşamalı bir ileti dizisi kullanılır. İlk iki iletide 2048 bit Diffie Hellman alış verişi bulunur. Ardından, bağlantıyı doğrulamak için kritik verilerin imzaları alınıp verilir.

source: Legend:
pt: Legenda:
tr: İşaret:

source: 256 byte DH public keys
pt: chave pública DH de 256 byte
tr: 256 bayt Diffie-Hellman herkese açık anahtarları

source: timestamps (4 bytes, seconds since epoch)
pt: carimbos de data/hora (4 bytes, segundos desde a época)
tr: zaman damgaları (4 bayt, epoch sonrası saniye)

source: 32 byte Session key
pt: Chave de Sessão de 32 byte
tr: 32 bayt oturum anahtarı

source: 2 byte size of Alice identity to follow
pt: Tamanho de 2 bytes da identidade de Alice a seguir
tr: Alice'in 2 bayt boyutunda kimliği izler

source: DH Key Exchange
pt: Troca de Chave DH
tr: Diffie-Hellman anahtar alış verişi

source: The initial 2048-bit DH key exchange uses the same shared prime (p) and generator (g) as that used for I2P's <a href="%(cryptography)s#elgamal">ElGamal encryption</a>.
pt: A troca inicial de chaves DH de 2048 bits usa o mesmo primo compartilhado (p) e gerador (g) usado para a criptografia ElGamal <a href="%(cryptography)s#elgamal">do I2P</a>.
tr: Başlangıçtaki 2048 bit Diffie-Hellman anahtar alış verişi, I2P <a href="%(cryptography)s#elgamal">ElGamal şifrelemesi</a> için kullanılanla aynı paylaşılan asal (p) ve üreteç (g) değerlerini kullanır.

source: The DH key exchange consists of a number of steps, displayed below. The mapping between these steps and the messages sent between I2P routers, is marked in bold.
pt: A troca de chaves DH consiste em uma série de etapas, exibidas abaixo. O mapeamento entre essas etapas e as mensagens enviadas entre roteadores I2P, está marcado em negrito.
tr: Diffie-Hellman anahtar alış verişi, aşağıda açıklanan birkaç adımdan oluşur. Bu adımlar ve I2P yönelticileri arasında gönderilen iletiler arasındaki eşleme kalın olarak işaretlenmiştir.

source: Alice generates a secret integer x. She then calculates <code>X = g^x mod p</code>.
pt: Alice gera um inteiro secreto x. Ela então calcula <code>X = g^x mod p</code>.
tr: Alice gizli bir x tamsayısı üretir. Ardından şunu hesaplamayı yapar: <code>X = g^x mod p</code>.

source: Alice sends X to Bob <b>(Message 1)</b>.
pt: Alice envia X para Bob <b>(Mensagem 1)</b>.
tr: Alice, Bob tarafına X değerini gönderir <b>(1. ileti)</b>.

source: Bob generates a secret integer y. He then calculates <code>Y = g^y mod p</code>.
pt: Bob gera um numeral secreto y. Ele então calcula <code>Y = g^y mod p</code>.
tr: Bob gizli bir y tamsayısı üretir. Ardından şu hesaplamayı yapar: <code>Y = g^y mod p</code>.

source: Bob sends Y to Alice.<b>(Message 2)</b>
pt: Bob envia Y para Alice <b>(Mensagem 2)</b>.
tr: Bob, Alice tarafına Y değerini gönderir <b>(2. ileti)</b>.

source: Alice can now compute <code>sessionKey = Y^x mod p</code>.
pt: Alice agora pode calcular <code>sessionKey = Y^x mod p</code>.
tr: Alice oturum anahtarını hesaplar <code>sessionKey = Y^x mod p</code>.

source: Bob can now compute <code>sessionKey = X^y mod p</code>.
pt: Bob agora pode calcular <code>sessionKey = X^y mod p</code>.
tr: Bob oturum anahtarını hesaplar <code>sessionKey = X^y mod p</code>.

source: Both Alice and Bob now have a shared key <code>sessionKey = g^(x*y) mod p</code>.
pt: Agora Alice e Bob tem uma chave compartilhada <code>sessionKey = g^(x*y) mod p</code>.
tr: Artık Alice ve Bob paylaşılan bir oturum anahtarına sahiptir <code>sessionKey = g^(x*y) mod p</code>.

source: The sessionKey is then used to exchange identities in <b>Message 3</b> and <b>Message 4</b>. The exponent (x and y) length for the DH exchange is documented on the <a href="%(crypto)s#exponent">cryptography page</a>.
pt: A sessionKey é então usada para trocar identidades em <b>Mensagem 3</b> e <b>Mensagem 4</b>. O comprimento do expoente (x e y) para a troca de DH é documentado na página de criptografia <a href="%(crypto)s#exponent"></a>.
tr: Daha sonra "Oturum anahtarı" (sessionKey), <b>3. ileti</b> ve <b>4. ileti</b> ile kimlik alış verişi için kullanılır. Diffie-Hellman alış verişi için üs (x ve y) uzunluğu <a href="%(crypto)s#exponent">şifreleme sayfasında</a> açıklanmıştır.

source: Message 1 (Session Request)
pt: Mensagem 1 (Requisição de Sessão)
tr: 1. ileti (oturum isteği)

source: This is the DH request. Alice already has Bob's <a href="%(commonstructures)s#struct_RouterIdentity">Router Identity</a>, IP address, and port, as contained in his <a href="%(commonstructures)s#struct_RouterInfo">Router Info</a>, which was published to the <a href="%(netdb)s">network database</a>. Alice sends Bob:
pt: Esta é a solicitação DH. Alice já tem o endereço IP <a href="%(commonstructures)s#struct_RouterIdentity">Router Identity</a>, de Bob e a porta, conforme contido em seu <a href="%(commonstructures)s#struct_RouterInfo">Router Info</a>, que foi publicado no banco de dados de rede <a href="%(netdb)s"></a>. Alice envia a Bob:
tr: Bu Diffie-Hellman isteğidir. Alice zaten Bob'un <a href="%(commonstructures)s#struct_RouterIdentity">“Yöneltici kimliği” (RouterIdentity)</a>, IP adresi ve bağlantı noktası bilgilerini <a href="%(netdb)s">"Ağ veri tabanı" (NetDB)</a> ile yayınlanan <a href="%(commonstructures)s#struct_RouterInfo">"Yöneltici bilgileri" (RouterInfo)</a> üzerinden öğrenmiştir. Alice, Bob'a şunu gönderir:

source: Size:
pt: Tamanho:
tr: Boyut:

source: Contents:
pt: Conteúdo:
tr: İçerik:

source: 256 byte X from Diffie Hellman
pt: 256 byte X de Diffie Hellman
tr: Diffie-Hellman tarafından sağlanan 256 bayt X

source: SHA256 Hash(X) xored with SHA256 Hash(Bob's `RouterIdentity`)
pt: SHA256 Hash(X) 'xor'arizado com SHA256 Hash('Identidade do Roteador'de Bob)
tr: SHA256 Karması(X) xor SHA256 Karması(Bob'un `Yöneltici Kimliği` (RouterIdentity))

source: Notes:
pt: Notas:
tr: Notlar:

source: Bob verifies HXxorHI using his own router hash. If it does not verify, Alice has contacted the wrong router, and Bob drops the connection.
pt: Bob verifica HXxorHI usando seu próprio hash de roteador. Se não verificar, Alice contatou o roteador errado, e Bob interrompe a conexão.
tr: Bob kendi yöneltici karmasını kullanarak HXxorHI verisini doğrular. Doğrulama yapılamazsa, Alice yanlış yönelticiye bağlanmıştır ve Bob bağlantıyı keser.

source: Message 2 (Session Created)
pt: Mensagem 2 (Sessão Criada)
tr: 2. ileti (oturum oluşturuldu)

source: This is the DH reply. Bob sends Alice:
pt: Esta é a resposta DH. Bob manda para Alice:
tr: Bu Diffie-Hellman yanıtıdır. Bob, Alice'e şunu gönderir:

source: Unencrypted Contents:
pt: Conteúdo Não Criptografado:
tr: Şifrelenmemiş İçerik

source: 256 byte Y from Diffie Hellman
pt: 256 byte Y de Diffie Hellman
tr: Diffie-Hellman tarafından sağlanan 256 bayt Y

source: SHA256 Hash(X concatenated with Y)
pt: SHA256 Hash(X concatenado com Y)
tr: SHA256 Karması(X, Y ile birleştirilir)

source: 4 byte timestamp (seconds since the epoch)
pt: Carimbo de data/hora de 4 bytes (segundos desde a época)
tr: 4 bayt zaman damgası (epoch sonrası geçen saniye)

source: 12 bytes random data
pt: 12 bytes de dados rand6omicos
tr: 12 baytlık rastgele veriler

source: Encrypted Contents:
pt: Conteúdo Criptografado:
tr: Şifrelenmiş İçerik:

source: 48 bytes <a href="%(cryptography)s#AES">AES encrypted</a> using the DH session key and the last 16 bytes of Y as the IV
pt: 48 bytes <a href="%(cryptography)s#AES">criptografados em AES</a> usando a chave de sessão DH e os últimos 16 bytes de Y como IV
tr: Diffie-Hellman oturum anahtarı ve "Başlatma vektörü" (IV) olarak Y değerinin son 16 baytı kullanılarak <a href="%(cryptography)s#AES">AES ile şifrelenmiş</a> 48 bayt

source: Alice may drop the connection if the clock skew with Bob is too high as calculated using tsB.
pt: Alice pode interromper a conexão se o desvio de clock com Bob for muito alto, conforme calculado usando tsB.
tr: Bob ile tsB kullanılarak hesaplanan saat farkı çok yüksekse Alice bağlantıyı kesebilir.

source: Message 3 (Session Confirm A)
pt: Mensagem 3 (Confirmação de Sessão A)
tr: 3. ileti (A oturum onayı)

source: This contains Alice's router identity, and a signature of the critical data. Alice sends Bob:
pt: Isto contém a identidade do roteador de Alice e uma assinatura dos dados críticos. Alice envia a Bob:
tr: Bu iletide, Alice'in yöneltici kimliği ve kritik verilerin imzası bulunur. Alice Bob'a şunu gönderir:

source: 2 byte size of Alice's router identity to follow (387+)
pt: Tamanho de 2 bytes da identidade do roteador de Alice a seguir (387+)
tr: Alice'in izlenecek yöneltici kimliği 2 bayt boyutunda (387+)

source: Alice's 387+ byte `RouterIdentity`
pt: `RouterIdentity` de 387+ bytes de Alice
tr: Alice'in 387+ bayt `Yöneltici kimliği` (RouterIdentity)

source: 0-15 bytes random data
pt: 0-15 bytes de dados aleatórios
tr: 0-15 baytlık rastgele veriler

source: the `Signature` of the following concatenated data: X, Y, Bob's `RouterIdentity`, tsA, tsB. Alice signs it with the `SigningPrivateKey` associated with the `SigningPublicKey` in her `RouterIdentity`
pt: a `Assinatura` dos seguintes dados concatenados: X, Y, `RouterIdentity` de Bob, tsA, tsB. Alice assina com a `SigningPrivateKey` associada à `SigningPublicKey` em sua `RouterIdentity`
tr: Aşağıdaki birleştirilmiş verilerin `İmzası`: X, Y, Bob'un `Yöneltici kimliği` (RouterIdentity), tsA, tsB. Alice, iletiyi `Yöneltici kimliği` (RouterIdentity) içindeki `SigningPublicKey` ile ilişkili `SigningPrivateKey` ile imzalar.

source: 448 bytes <a href="%(cryptography)s#AES">AES encrypted</a> using the DH session key and the last 16 bytes of HXxorHI (i.e., the last 16 bytes of message #1) as the IV
pt: 448 bytes <a href="%(cryptography)s#AES">criptografados em AES</a> usando a chave de sessão DH e os últimos 16 bytes de HXxorHI (ou seja, os últimos 16 bytes da mensagem nº 1) como IV
tr: Diffie-Hellman oturum anahtarı ve "Başlatma vektörü" (IV) olarak HXxorHI değerinin son 16 baytı (1. iletinin son 16 baytı gibi) kullanılarak <a href="%(cryptography)s#AES">AES ile şifrelenmiş</a> 448 bayt

source: Bob verifies the signature, and on failure, drops the connection.
pt: Bob verifica a assinatura e, em caso de falha, interrompe a conexão.
tr: Bob imzayı doğrular ve başarısızlık durumunda bağlantıyı keser.

source: Bob may drop the connection if the clock skew with Alice is too high as calculated using tsA.
pt: Bob pode interromper a conexão se o desvio de clock com Alice for muito alto, conforme calculado usando tsA.
tr: Alice ile tsA kullanılarak hesaplanan saat farkı çok yüksekse Bob bağlantıyı kesebilir.

source: Alice will use the last 16 bytes of the encrypted contents of this message as the IV for the next message.
pt: Alice usará os últimos 16 bytes do conteúdo criptografado desta mensagem como IV para a próxima mensagem.
tr: Alice, bu iletinin şifrelenmiş içeriğinin son 16 baytını bir sonraki ileti için IV olarak kullanır.

source: Message 4 (Session Confirm B)
pt: Mensagem 4 (Confirmação de Sessão B)
tr: 4. ileti (B oturum onayı)

source: This is a signature of the critical data. Bob sends Alice:
pt: Esta é uma assinatura dos dados críticos. Bob envia para Alice:
tr: Bu ileti, kritik verilerin imzasıdır. Bob, Alice'e şunu gönderir:

source: the `Signature` of the following concatenated data: X, Y, Alice's `RouterIdentity`, tsA, tsB. Bob signs it with the `SigningPrivateKey` associated with the `SigningPublicKey` in his `RouterIdentity`
pt: a `Assinatura` dos seguintes dados concatenados: X, Y, `RouterIdentity` de Alice, tsA, tsB. Bob assina com a `SigningPrivateKey` associada à `SigningPublicKey` em sua `RouterIdentity`
tr: Aşağıdaki birleştirilmiş verilerin `İmzası`: X, Y, Alice'in `Yöneltici Kimliği`, tsA, tsB. Bob, iletiyi `Yöneltici Kimliğindeki` `SigningPublicKey` ile ilişkili `SigningPrivateKey` ile imzalar.
