Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Anyone interested should join us on the IRC channel #i2p-dev (hosted concurrently on irc.freenode.net, irc.postman.i2p, irc.echelon.i2p, irc.dg.i2p and irc.oftc.net). There are currently no scheduled development meetings, however <a href="%(meetings)s">archives are available</a>.
pt: Qualquer pessoa interessada deve se juntar a nós no canal IRC #i2p-dev (hospedado simultaneamente em irc.freenode.net, irc.postman.i2p, irc.echelon.i2p, irc.dg.i2p e irc.oftc.net). Atualmente não há reuniões de desenvolvimento agendadas, no entanto <a href="%(meetings)s">arquivos estão disponíveis</a>.
tr: İlgilenen herkes #i2p-dev IRC kanalında bize katılmalı (aynı anda irc.freenode.net, irc.postman.i2p, irc.echelon.i2p, irc.dg.i2p ve irc.oftc.net üzerinde bulunabilir). Şu anda planlanmış bir geliştirme toplantısı yok, ancak <a href="%(meetings)s">arşive bakabilirsiniz</a>.

source: The current source is available in <a href="%(monotone)s">monotone</a>.
pt: A fonte atual está disponível em <a href="%(monotone)s">monotonal</a>.
tr: Güncel kaynak kodu <a href="%(monotone)s">monotone</a> üzerinde bulunabilir.

source: See <a href="%(docs)s">the Index to Technical Documentation</a>.
pt: Ver o <a href="%(docs)s">Índice da Documentação Técnica</a>.
tr: <a href="%(docs)s">Teknik belgeler dizinine bakabilirsiniz</a>.

source: The Network Database
pt: O Banco de Dados da Rede
tr: Ağ veri tabanı

source: August 2019
pt: Agosto de 2019
tr: 2019 Ağustos

source: I2P's netDb is a specialized distributed database, containing just two types of data - router contact information (<b>RouterInfos</b>) and destination contact information (<b>LeaseSets</b>). Each piece of data is signed by the appropriate party and verified by anyone who uses or stores it. In addition, the data has liveliness information within it, allowing irrelevant entries to be dropped, newer entries to replace older ones, and protection against certain classes of attack.
pt: O netDb do I2P é um banco de dados distribuído especializado, contendo apenas dois tipos de dados - informações de contato do roteador (<b>RouterInfos</b>) e informações de contato de destino (<b>LeaseSets</b>). Cada pedaço de dados é assinado pela parte apropriada e verificado por qualquer um que o use ou armazene. Além disso, os dados têm informações de vivacidade dentro deles, permitindo que entradas irrelevantes sejam descartadas, entradas mais novas substituam as mais antigas e proteção contra certas classes de ataque.
tr: I2P "Ağ veri tabanı" (NetDB), özel bir dağıtılmış veri tabanıdır ve yalnızca iki tür veri içerir: Yöneltici iletişim bilgileri (<b>"Yöneltici bilgileri" (RouterInfo)</b>) ile hedef iletişim bilgileri (<b>"Kiralama kümeleri" (LeaseSets)</b>). Her veri parçası uygun tarafça imzalanır ve onu kullanan veya saklayan herkes tarafından doğrulanır. Ek olarak, verilerin içinde canlılık bilgileri bulunur. Böylece ilgisiz kayıtlar silinerek ve daha yeni kayıtlar eskilerin yerine geçirilerek belirli saldırı sınıflarına karşı koruma sağlanır.

source: The netDb is distributed with a simple technique called "floodfill", where a subset of all routers, called "floodfill routers", maintains the distributed database.
pt: O netDb é distribuído com uma técnica simples chamada "floodfill", onde um subconjunto de todos os roteadores, chamados "roteadores floodfill", mantém o banco de dados distribuído.
tr: "Ağ veri tabanı" (NetDB), "Otomatik doldurma" adı verilen basit bir yöntemle dağıtılır. Dağıtılmış veri tabanını "Otomatik doldurma yönelticileri" olarak adlandırılan tüm yönelticilerin bir alt kümesi korur.

source: When an I2P router wants to contact another router, they need to know some key pieces of data - all of which are bundled up and signed by the router into a structure called the "RouterInfo", which is distributed with the SHA256 of the router's identity as the key. The structure itself contains:
pt: Quando um roteador I2P quer contatar outro roteador, ele precisa saber algumas peças-chave de dados - todas as quais são agrupadas e assinadas pelo roteador em uma estrutura chamada "RouterInfo", que é distribuída com o SHA256 da identidade do roteador como a chave. A estrutura em si contém:
tr: "Bir I2P yönelticisi ile başka bir yöneltici iletişim kurmak istediğinde, karşılıklı olarak bazı önemli veri parçalarını bilmeleri gerekir. Bunların tümü yöneltici tarafından anahtar olarak yöneltici kimliğinin SHA-256 değeri ile dağıtılan "Yöneltici bilgileri" (RouterInfo) adlı bir yapı içine paketlenir ve imzalanır. Yapıda şunlar bulunur:

source: The router's identity (an encryption key, a signing key, and a certificate)
pt: A identidade do roteador (uma chave de criptografia, uma chave de assinatura e um certificado)
tr: Yönelticinin kimliği (bir şifreleme anahtarı, bir imzalama anahtarı ve bir sertifika)

source: The contact addresses at which it can be reached
pt: Os endereços de contato onde pode ser contatado
tr: Ulaşılabilecek iletişim adresleri

source: When this was published
pt: Quando isso foi publicado
tr: Bunun ne zaman yayınlandığı

source: A set of arbitrary text options
pt: Um conjunto de opções de texto arbitrárias
tr: İsteğe bağlı metin seçenekleri

source: The signature of the above, generated by the identity's signing key
pt: A assinatura do acima, gerada pela chave de assinatura da identidade
tr: Kimliğin imzalama anahtarı tarafından yukarıdakiler ile oluşturulmuş imza

source: Expected Options
pt: Opções esperadas
tr: Beklenen Ayarlar

source: The following text options, while not strictly required, are expected to be present:
pt: As seguintes opções de texto, embora não sejam estritamente necessárias, são esperadas estarem presentes:
tr: Şart olmamasına rağmen aşağıdaki metin seçeneklerinin var olması beklenir:

source: Capabilities flags - used to indicate floodfill participation, approximate bandwidth, and perceived reachability
pt: Sinalizadores de capacidades - usados para indicar participação de floodfill, largura de banda aproximada e acessibilidade percebida
tr: Yetenek işaretleri - Otomatik doldurma katılımını, yaklaşık bant genişliğini ve algılanan erişilebilirliği belirtmek için kullanılır

source: Floodfill
pt: Enchimento
tr: Otomatik doldurma

source: Hidden
pt: Oculto
tr: Gizli

source: Under %(amount)s shared bandwidth
pt: Menos de %(amount)s largura de banda compartilhada
tr: %(amount)s paylaşılan bant genişliğinin altında

source: %(amount)s shared bandwidth
pt: %(amount)s largura de banda compartilhada
tr: %(amount)s paylaşılan bant genişliği

source: default
pt: Padrão
tr: varsayılan

source: Reachable
pt: Contactáveis
tr: Erişilebilir

source: Unreachable
pt: Inalcançáveis
tr: Erişilemez

source: Over %(amount)s shared bandwidth
pt: Mais de %(amount)s largura de banda compartilhada
tr: %(amount)s paylaşılan bant genişliğinin üstünde

source: The core library version, always the same as the router version
pt: A versão da biblioteca principal, sempre a mesma que a versão do roteador
tr: Çekirdek kitaplığı sürümü. Her zaman yöneltici sürümüyle aynıdır

source: Basic network compatibility - A router will refuse to communicate with a peer having a different netId
pt: Compatibilidade básica de rede - Um roteador se recusará a se comunicar com um par que tenha um netId diferente
tr: Temel ağ uyumluluğu - Bir yöneltici farklı bir netId değerine sahip bir eşle iletişim kurmayı reddeder

source: Used to determine compatibility with newer features and messages
pt: Usado para determinar a compatibilidade com novos recursos e mensagens
tr: Daha yeni özellikler ve iletilerle uyumluluğu belirlemek için kullanılır

source: Always sent as 90m, for compatibility with an older scheme where routers published their actual uptime, and only sent tunnel requests to peers whose uptime was more than 60m
pt: Sempre enviado como 90m, para compatibilidade com um esquema mais antigo, onde os roteadores publicavam seu tempo de atividade real, e enviavam apenas solicitações de túnel para pares cujo tempo de atividade era superior a 60m
tr: Yönelticilerin gerçek çalışma sürelerini yayınladığı ve yalnızca çalışma süresi 60 dakikadan fazla olan eşlere tünel istekleri gönderdiği eski bir şema ile uyumluluk için her zaman 90 dakika olarak gönderilir

source: These values are used by other routers for basic decisions. Should we connect to this router? Should we attempt to route a tunnel through this router? The bandwidth capability flag, in particular, is used only to determine whether the router meets a minimum threshold for routing tunnels. Above the minimum threshold, the advertised bandwidth is not used or trusted anywhere in the router, except for display in the user interface and for debugging and network analysis.
pt: Esses valores são usados por outros roteadores para decisões básicas. Devemos nos conectar a este roteador? Devemos tentar rotear um túnel através deste roteador? O sinalizador de capacidade de largura de banda, em particular, é usado apenas para determinar se o roteador atende a um limite mínimo para túneis de roteamento. Acima do limite mínimo, a largura de banda anunciada não é usada ou confiável em nenhum lugar no roteador, exceto para exibição na interface do usuário e para depuração e análise de rede.
tr: Bu değerler, diğer yönelticiler tarafından temel kararlar için kullanılır. Bu yönelticiye bağlanmalı mıyız? Bu yöneltici üzerinden bir tünel yöneltmeye çalışmalı mıyız? Özellikle bant genişliği yeteneği bayrağı, yalnızca yönelticinin tünelleri yöneltmek için en az eşiği karşılayıp karşılamadığını belirlemek için kullanılır. En az eşiğin üzerinde, duyurulan bant genişliği değeri, kullanıcı arayüzünde görüntüleme ve hata ayıklama ile ağ analizi dışında yönelticinin hiçbir yerinde kullanılmaz veya güvenilmez.

source: Additional Options
pt: Opções adicionais
tr: Diğer Seçenekler

source: Additional text options include a small number of statistics about the router's health, which are aggregated by sites such as <a href="http://%(stats)s/">%(stats)s</a> for network performance analysis and debugging. These statistics were chosen to provide data crucial to the developers, such as tunnel build success rates, while balancing the need for such data with the side-effects that could result from revealing this data. Current statistics are limited to:
pt: Opções de texto adicionais incluem um pequeno número de estatísticas sobre a saúde do roteador, que são agregadas por sites como <a href="http://%(stats)s/">%(stats)s</a> para análise de desempenho de rede e depuração. Essas estatísticas foram escolhidas para fornecer dados cruciais para os desenvolvedores, como taxas de sucesso de construção de túneis, ao mesmo tempo em que equilibram a necessidade de tais dados com os efeitos colaterais que podem resultar da revelação desses dados. As estatísticas atuais são limitadas a:
tr: Ek metin seçeneklerinde, ağ başarımı analizi ve hata ayıklama için <a href="http://%(stats)s/">%(stats)s</a> gibi siteler tarafından toplanan, yöneltici sağlığı hakkında az sayıda istatistik bulunur. Bu istatistikler, geliştiriciler için önemli olan tünel oluşturma başarı oranları gibi verileri sağlamak ve bu tür verilere olan gereksinimi bu verilerin ortaya çıkarılmasından kaynaklanabilecek yan etkilerle dengelemek için seçildi. Geçerli istatistikler şunlarla sınırlıdır:

source: Exploratory tunnel build success, reject, and timeout rates
pt: Taxas de sucesso, rejeição e tempo limite de construção de túnel exploratório
tr: Keşif tüneli oluşturma başarısı, reddetme ve zaman aşımı oranları

source: 1 hour average number of participating tunnels
pt: Média de 1 hora de túneis participantes
tr: Katkıda bulunulan tünel sayısının 1 saatlik ortalaması

source: Floodfill routers publish additional data on the number of entries in their network database.
pt: Os roteadores Floodfill publicam dados adicionais sobre o número de entradas em seu banco de dados de rede.
tr: Otomatik doldurma yönelticileri ağ veri tabanlarındaki kayıt sayısı hakkında ek veriler yayınlar.

source: The data published can be seen in the router's user interface, but is not used or trusted within the router. As the network has matured, we have gradually removed most of the published statistics to improve anonymity, and we plan to remove more in future releases.
pt: Os dados publicados podem ser vistos na interface do usuário do roteador, , mas não são usados nem confiáveis dentro do roteador. Conforme a rede amadureceu, removemos gradualmente a maioria das estatísticas publicadas para melhorar o anonimato, e planejamos remover mais em versões futuras.
tr: Yayınlanan veriler yönelticinin kullanıcı arayüzünde görülebilir, ancak yöneltici içinde kullanılmaz veya güvenilmez. Ağ olgunlaştıkça, anonimliği iyileştirmek için yayınlanan istatistiklerin çoğunu kademeli olarak kaldırdık ve gelecekteki sürümlerde daha fazlasını kaldırmayı planlıyoruz.

source: Family Options
pt: Opções de família
tr: Aile Ayarları

source: As of release 0.9.24, routers may declare that they are part of a "family", operated by the same entity. Multiple routers in the same family will not be used in a single tunnel.
pt: A partir da versão 0.9.24, os roteadores podem declarar que fazem parte de uma "família", operada pela mesma entidade. Vários roteadores na mesma família não serão usados em um único túnel.
tr: 0.9.24 sürümüyle birlikte yönelticiler aynı varlık tarafından işletilen bir "ailenin" parçası olduklarını duyurabilir. Aynı ailedeki birden çok yöneltici tek bir tünelde kullanılmaz.

source: The family options are:
pt: As opções familiares são:
tr: Aile ayarları şunlardır:

source: The family name
pt: O sobrenome
tr: Aile adı

source: RouterInfo Expiration
pt: Expiração do RouterInfo
tr: "Yöneltici bilgileri" (RouterInfo) sona erme süresi

source: RouterInfos have no set expiration time. Each router is free to maintain its own local policy to trade off the frequency of RouterInfo lookups with memory or disk usage. In the current implementation, there are the following general policies:
pt: O RouterInfos não tem um tempo de expiração definido. Cada roteador é livre para manter sua própria política local para compensar a frequência de pesquisas do RouterInfo com o uso de memória ou disco. Na implementação atual, existem as seguintes políticas gerais:
tr: "Yöneltici bilgileri" (RouterInfo) kayıtlarının belirlenmiş bir geçerlilik süresi yoktur. Her yöneltici "Yöneltici bilgileri" aramalarının sıklığını bellek veya disk kullanımına göre belirlemek için kendi yerel ilkesini kullanmakta özgürdür. Geçerli uygulamada aşağıdaki genel ilkeler bulunur.

source: There is no expiration during the first hour of uptime, as the persistent stored data may be old.
pt: Não há expiração durante a primeira hora de atividade, pois os dados armazenados persistentemente podem ser antigos.
tr: Kalıcı olarak saklanan veriler eski olabileceğinden, ilk çalışma saatinde geçerlilik süresi kuıllanılmaz.

source: There is no expiration if there are 25 or less RouterInfos.
pt: Não há expiração se houver 25 ou menos RouterInfos.
tr: 25 veya daha az "Yöneltici bilgileri" (RouterInfo) kaydı varsa geçerlilik süresi yoktur.

source: As the number of local RouterInfos grows, the expiration time shrinks, in an attempt to maintain a reasonable number RouterInfos. The expiration time with less than 120 routers is 72 hours, while expiration time with 300 routers is around 30 hours.
pt: Conforme o número de RouterInfos locais cresce, o tempo de expiração diminui, em uma tentativa de manter um número razoável de RouterInfos. O tempo de expiração com menos de 120 roteadores é de 72 horas, enquanto o tempo de expiração com 300 roteadores é de cerca de 30 horas.
tr: Yerel "Yöneltici bilgileri" (RouterInfo) kaydı sayısı arttıkça, makul bir "Yöneltici bilgileri" sayısını korumak amacıyla geçerlilik süresi kısalır. 120 altında yöneltici için geçerlilik süresi 72 saat, 300 yöneltici için geçerlilik süresi yaklaşık 30 saattir.

source: RouterInfos containing <a href="%(ssu)s">SSU</a> introducers expire in about an hour, as the introducer list expires in about that time.
pt: RouterInfos contendo <a href="%(ssu)s">SSU</a> introdutores expiram em cerca de uma hora, enquanto a lista de introdutores expira aproximadamente nesse tempo.
tr: <a href="%(ssu)s">SSU</a> tanıtıcıları içeren "Yöneltici bilgileri" (RouterInfo) kayıtlarının geçerlilik, yaklaşık bir saattir. Çünkü tanıtıcı listesinin geçerlilik süresi yaklaşık olarak bu kadardır.

source: Floodfills use a short expiration time (1 hour) for all local RouterInfos, as valid RouterInfos will be frequently republished to them.
pt: Os floodfills usam um tempo de expiração curto (1 hora) para todos os RouterInfos locais, pois os RouterInfos válidos serão frequentemente republicados neles.
tr: Geçerli "Yöneltici bilgileri" (RouterInfo) kayıtları onlar için sık sık yeniden yayınlanacağından, otomatik doldurma sunucularında tüm yerel "Yöneltici bilgileri" kayıtları için kısa bir geçerlilik süresi (1 saat) kullanılır.

source: RouterInfo Persistent Storage
pt: Armazenamento persistente RouterInfo
tr: Kalıcı "Yöneltici bilgileri" (RouterInfo) depolama

source: RouterInfos are periodically written to disk so that they are available after a restart.
pt: Os RouterInfos são gravados periodicamente no disco para que fiquem disponíveis após uma reinicialização.
tr: Yeniden başlatmadan sonra kullanılabilmesi için "Yöneltici bilgileri (RouterInfo)" düzenli aralıklarla diske yazılır.

source: It may be desirable to persistently store Meta LeaseSets with long expirations. This is implementation-dependent.
pt: Pode ser desejável armazenar persistentemente Meta LeaseSets com expirações longas. Isso depende da implementação.
tr: "Üst Kiralama kümelerinin" (MetaLeaseSets) verilerinin uzun süreli olarak kalıcı olarak saklanması istenebilir. Bu durum, uygulamaya bağlıdır.

source: RouterInfo specification
pt: Especificação RouterInfo
tr: "Yöneltici bilgileri" (RouterInfo) teknik özellikleri

source: RouterInfo Javadoc
pt: Javadoc do RouterInfo
tr: "Yöneltici bilgileri" (RouterInfo) Java belgeleri

source: The second piece of data distributed in the netDb is a "LeaseSet" - documenting a group of <b>tunnel entry points (leases)</b> for a particular client destination. Each of these leases specify the following information:
pt: O segundo pedaço de dados distribuído no netDb é um "LeaseSet" - documentando um grupo de <b>pontos de entrada de túnel (leases)</b> para um destino de cliente específico. Cada um desses leases especifica as seguintes informações:
tr: "Ağ veri tabanında" (NetDB) dağıtılan ikinci veri parçası, belirli bir müşteri hedefi için bir grup <b>tünel giriş noktasını (kiralamaları)</b> belgeleyen bir "Kiralama kümesi" (LeaseSet) olur. Bu kiralamaların her birinde şu bilgiler bulunur:

source: The tunnel gateway router (by specifying its identity)
pt: O roteador do gateway do túnel (especificando sua identidade)
tr: Tünel ağ geçidi yönelticisi (kimliğini belirterek)

source: The tunnel ID on that router to send messages with (a 4 byte number)
pt: O ID do túnel naquele roteador para enviar mensagens com (um número de 4 bytes)
tr: İleti göndermek için bu yönelticideki tünel kimliği (4 baytlık bir sayı)

source: When that tunnel will expire.
pt: Quando esse túnel irá expirar.
tr: Bu tünelin geçerlilik süresi.

source: The LeaseSet itself is stored in the netDb under the key derived from the SHA256 of the destination.
pt: O próprio LeaseSet é armazenado no netDb em a chave derivada do SHA256 do destino.
tr: "Kiralama kümesi" (LeaseSet), hedefin SHA-256 değerinden türetilen anahtar altında "Ağ veri tabanı" (NetDB) üzerinde tutulur.

source: One exception is for Encrypted LeaseSets (LS2), as of release 0.9.38. The SHA256 of the type byte (3) followed by the blinded public key is used for the DHT key, and then rotated as usual.
pt: Uma exceção é para Encrypted LeaseSets (LS2), a partir da versão 0.9.38. O SHA256 do tipo byte (3) seguido pela chave pública cega é usado para a chave DHT, e então rotacionado como de costume.
tr: Bir istisna, 0.9.38 sürümünden başlayarak "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets, LS2) içindir. Bayt (3) türünün SHA-256 değeri ve ardından körleştirilmiş herkese açık anahtar, "Dağıtılmış karma tablosu" (DHT) anahtarı için kullanılır ve sonra her zamanki gibi döndürülür.

source: See the Kademlia Closeness Metric section below.
pt: Veja a seção Métrica de Proximidade do Kademlia abaixo.
tr: Aşağıdaki Kademlia yakınlık ölçümü bölümüne bakın.

source: In addition to these leases, the LeaseSet includes:
pt: Além desses arrendamentos, o LeaseSet inclui:
tr: Bu kiralamalara ek olarak, "Kiralama kümesi" (LeaseSet) şunları içerir:

source: The destination itself (an encryption key, a signing key and a certificate)
pt: O destino em si (uma chave de criptografia, uma chave de assinatura e um certificado)
tr: Hedefin kendisi (bir şifreleme anahtarı, bir imzalama anahtarı ve bir sertifika)

source: Additional encryption public key: used for end-to-end encryption of garlic messages
pt: Chave pública de criptografia adicional: usada para criptografia de ponta a ponta de mensagens de alho
tr: Ek herkese açık şifreleme anahtarı: Garlic iletilerinin uçtan uca şifrelenmesi için kullanılır

source: Additional signing public key: intended for LeaseSet revocation, but is currently unused.
pt: Chave pública de assinatura adicional: destinada à revogação do LeaseSet, mas não é utilizada no momento.
tr: Ek herkese açık imzalama anahtarı: "Kiralama kümesi" (LeaseSet) iptali için tasarlandı, ancak şu anda kullanılmıyor.

source: Signature of all the LeaseSet data, to make sure the Destination published the LeaseSet.
pt: Assinatura de todos os dados do LeaseSet, para garantir que o Destino publicou o LeaseSet.
tr: Hedefin bir "Kiralama kümesi" (LeaseSet) yayınladığından emin olmak için tüm "Kiralama kümesi" (LeaseSet) verilerinin imzası.

source: Lease specification
pt: Especificação de arrendamento
tr: Kiralama teknik özellikleri

source: LeaseSet specification
pt: Especificação LeaseSet
tr: "Kiralama kümesi" (LeaseSet) teknik özellikleri

source: Lease Javadoc
pt: Arrendamento Javadoc
tr: Kiralama Java belgeleri

source: LeaseSet Javadoc
tr: "Kiralama kümesi" (LeaseSet) Java belgeleri

source: As of release 0.9.38, three new types of LeaseSets are defined; LeaseSet2, MetaLeaseSet, and EncryptedLeaseSet. See below.
pt: A partir da versão 0.9.38, três novos tipos de LeaseSets são definidos; LeaseSet2, MetaLeaseSet e EncryptedLeaseSet. Veja abaixo.
tr: 0.9.38 sürümüyle, üç yeni "Kiralama kümesi" (LeaseSet) türü tanımlanmıştır; LeaseSet2, MetaLeaseSet ve EncryptedLeaseSet. Ayrıntılar için aşağıya bakın.

source: Unpublished LeaseSets
pt: LeaseSets não publicados
tr: Yayınlanmamış "Kiralama kümeleri" (LeaseSets)
