Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Peers are ordered within tunnels to deal with the <a href="%(pdf)s">predecessor attack</a> <a href="%(pdf2008)s">(2008 update)</a>.
pt: Os pares são ordenados dentro dos túneis para lidar com o ataque predecessor <a href="%(pdf)s"></a> <a href="%(pdf2008)s">(atualização de 2008)</a>.
tr: Eşler, tüneller içinde <a href="%(pdf)s">öncül saldırı</a> <a href="%(pdf2008)s">(2008 güncellemesi)</a> ile başa çıkacacak şekilde sıralanır.

source: To frustrate the predecessor attack, the tunnel selection keeps the peers selected in a strict order - if A, B, and C are in a tunnel for a particular tunnel pool, the hop after A is always B, and the hop after B is always C.
pt: Para frustrar o ataque predecessor , a seleção de túnel mantém os pares selecionados em uma ordem estrita - se A, B e C estiverem em um túnel para um pool de túneis específico, o salto após A é sempre B, e o salto após B é sempre C.
tr: Öncül saldırıyı boşa çıkarmak için, tünel seçimi eşleri katı bir sıralamayla seçilmiş olarak tutar. Eğer A, B ve C belirli bir tünel havuzu için bir tüneldeyse, A'dan sonraki sıçrama her zaman B'dir ve B'den sonraki sıçrama her zaman C olur.

source: Ordering is implemented by generating a random 32-byte key for each tunnel pool at startup. Peers should not be able to guess the ordering, or an attacker could craft two router hashes far apart to maximize the chance of being at both ends of a tunnel. Peers are sorted by XOR distance of the SHA256 Hash of (the peer's hash concatenated with the random key) from the random key
pt: A ordenação é implementada gerando uma chave aleatória de 32 bytes para cada pool de túneis na inicialização. Os pares não devem ser capazes de adivinhar a ordenação, ou um invasor pode criar dois hashes de roteador bem separados para maximizar a chance de estar em ambas as extremidades de um túnel. Os pares são classificados pela distância XOR do Hash SHA256 (o hash do par concatenado com a chave aleatória) da chave aleatória
tr: Sıralama, başlangıçta her tünel havuzu için rastgele bir 32 baytlık anahtar üretilerek uygulanır. Eşler sıralamayı öngörememelidir, yoksa bir saldırgan bir tünelin her iki ucunda olma şansını en üst düzeye çıkarmak için birbirinden çok uzak olan iki yönelticinin karmasını kullanabilir. Eşler, rastgele anahtardan SHA256 karmasının (eşin rastgele anahtarla birleştirilmiş karması) ile rastgele anahtarın XOR uzaklığına göre sıralanır

source: Because each tunnel pool uses a different random key, ordering is consistent within a single pool but not between different pools. New keys are generated at each router restart.
pt: Como cada pool de túneis usa uma chave aleatória diferente, a ordenação é consistente dentro de um único pool, mas não entre pools diferentes. Novas chaves são geradas a cada reinicialização do roteador.
tr: Her tünel havuzu farklı bir rastgele anahtar kullandığından, sıralama tek bir havuz içinde tutarlıdır. Ancak farklı havuzlar arasında tutarlı değildir. Her yöneltici yeniden başlatıldığında yeni anahtarlar oluşturulur.

source: Request delivery
pt: Entrega de requisição
tr: İstek aktarımı

source: A multi-hop tunnel is built using a single build message which is repeatedly decrypted and forwarded. In the terminology of <a href="%(pdf)s">Hashing it out in Public</a>, this is "non-interactive" telescopic tunnel building.
pt: Um túnel multi-hop é construído usando uma única mensagem de construção que é repetidamente descriptografada e encaminhada. Na terminologia de <a href="%(pdf)s">Hashing it out in Public</a>, esta é uma construção de túnel telescópico "não interativa".
tr: Yeniden ve yeniden şifresi çözülen ve iletilen tek bir oluşturma iletisi kullanılarak çok sıçramaları bir tünel oluşturulur. <a href="%(pdf)s">Hashing it out in Public</a> terminolojisinde bu, "etkileşimli olmayan" teleskopik tünel oluşturmadır.

source: This tunnel request preparation, delivery, and response method is <a href="%(tunnelcreation)s">designed</a> to reduce the number of predecessors exposed, cuts the number of messages transmitted, verifies proper connectivity, and avoids the message counting attack of traditional telescopic tunnel creation. (This method, which sends messages to extend a tunnel through the already-established part of the tunnel, is termed "interactive" telescopic tunnel building in the "Hashing it out" paper.)
pt: Este método de preparação, entrega e resposta de solicitação de túnel é <a href="%(tunnelcreation)s">projetado</a> para reduzir o número de predecessores expostos, corta o número de mensagens transmitidas, verifica a conectividade adequada e evita o ataque de contagem de mensagens da criação tradicional de túneis telescópicos . (Este método, que envia mensagens para estender um túnel através da parte já estabelecida do túnel, é denominado construção de túnel telescópico "interativo" no artigo "Hashing it out".)
tr: Bu tünel isteği hazırlama, teslim etme ve yanıtlama yöntemi, açığa çıkan öncüllerin sayısını azaltmak, aktarılan ileti sayısını sınırlamak, uygun bağlantıyı doğrulamak ve geleneksel teleskopik tünel oluşturmanın ileti sayma saldırısını önlemek için <a href="%(tunnelcreation)s">tasarlanmıştır</a>. (Bir tüneli tünelin önceden kurulmuş bölümüne göre genişletmek için iletiler gönderen bu yöntem, "Hashing it out" belgesinde "etkileşimli" teleskopik tünel oluşturma olarak adlandırılmaktadır.)

source: The details of tunnel request and response messages, and their encryption, <a href="%(tunnelcreation)s">are specified here</a>.
pt: Os detalhes das mensagens de solicitação e resposta do túnel e sua criptografia, <a href="%(tunnelcreation)s">são especificados aqui</a>.
tr: Tünel istek ve yanıt iletilerinin ayrıntıları ve bunların şifrelenmesi <a href="%(tunnelcreation)s"> burada açıklanmıştır</a>.

source: Peers may reject tunnel creation requests for a variety of reasons, though a series of four increasingly severe rejections are known: probabilistic rejection (due to approaching the router's capacity, or in response to a flood of requests), transient overload, bandwidth overload, and critical failure. When received, those four are interpreted by the tunnel creator to help adjust their profile of the router in question.
pt: Os pares podem rejeitar solicitações de criação de túneis por uma variedade de razões, embora uma série de quatro rejeições cada vez mais severas sejam conhecidas: rejeição probabilística (devido à aproximação da capacidade do roteador ou em resposta a uma enxurrada de solicitações), sobrecarga transitória, sobrecarga de largura de banda e falha crítica. Quando recebidas, essas quatro são interpretadas pelo criador do túnel para ajudar a ajustar seu perfil do roteador em questão.
tr: Eşler, çeşitli nedenlerle tünel oluşturma isteklerini reddedebilir. Ancak giderek daha ciddi hale gelen bir dizi dört reddetme bilinmektedir: Olasılıklı reddetme (yönelticinin kapasitesine yaklaşması nedeniyle veya bir istek akışına yanıt olarak), geçici aşırı yük, bant genişliği aşırı yüklemesi ve kritik başarısızlık. Alındığında, bu dördü, söz konusu yönelticinin profilini ayarlamaya yardımcı olmak için tünel oluşturucu tarafından yorumlanır.

source: For more information on peer profiling, see the <a href="%(peerselection)s">Peer Profiling and Selection page</a>.
pt: Para mais informações sobre a determinação de perfis, ver a <a href="%(peerselection)s">página da Determinação de perfis e seleção de pares</a>.
tr: Eş profilinin belirlenmesi, <a href="%(peerselection)s">Eş profilinin belirlenmesi ve seçimi sayfasında</a> ayrıntılı olarak ele alınmıştır.

source: Tunnel Pools
pt: Piscinas de Túnel
tr: Tünel Havuzları

source: To allow efficient operation, the router maintains a series of tunnel pools, each managing a group of tunnels used for a specific purpose with their own configuration. When a tunnel is needed for that purpose, the router selects one out of the appropriate pool at random. Overall, there are two exploratory tunnel pools - one inbound and one outbound - each using the router's default configuration. In addition, there is a pair of pools for each local destination - one inbound and one outbound tunnel pool. Those pools use the configuration specified when the local destination connects to the router via <a href="%(i2cp)s">I2CP</a>, or the router's defaults if not specified.
pt: Para permitir uma operação eficiente, o roteador mantém uma série de pools de túneis, cada um gerenciando um grupo de túneis usados para um propósito específico com sua própria configuração . Quando um túnel é necessário para esse propósito, o roteador seleciona um do pool apropriado aleatoriamente. No geral, há dois pools de túneis exploratórios - um de entrada e um de saída - cada um usando a configuração padrão do roteador. Além disso, há um par de pools para cada destino local - um pool de túneis de entrada e um de saída. Esses pools usam a configuração especificada quando o destino local se conecta ao roteador via <a href="%(i2cp)s">I2CP</a>, ou os padrões do roteador se não especificado.
tr: Yöneltici, verimli çalışmayı sağlamak için, her biri belirli bir amaç için kullanılan bir grup tüneli kendi yapılandırmasıyla yöneten bir dizi tünel havuzuna sahiptir. Bu amaçla bir tünel gerektiğinde, yöneltici uygun havuzdan rastgele birini seçer. Genel olarak, her biri yönelticinin varsayılan yapılandırmasını kullanan biri geliş ve biri gidiş olmak üzere iki keşif tüneli havuzu bulunur. Ayrıca, her yerel hedef için, biri geliş biri de gidiş için olmak üzere bir çift tünel havuzu vardır. Bu havuzlar, yerel hedef yönelticiye <a href="%(i2cp)s">I2CP</a> ile bağlandığında belirtilen yapılandırmayı veya belirtilmemişse yönelticinin varsayılanlarını kullanır.

source: Each pool has within its configuration a few key settings, defining how many tunnels to keep active, how many backup tunnels to maintain in case of failure, how long the tunnels should be, whether those lengths should be randomized, as well as any of the other settings allowed when configuring individual tunnels. Configuration options are specified on the <a href="%(i2cp)s">I2CP page</a>.
pt: Cada pool tem em sua configuração algumas configurações principais, definindo quantos túneis manter ativos, quantos túneis de backup manter em caso de falha, qual deve ser o comprimento dos túneis, se esses comprimentos devem ser randomizados, bem como quaisquer outras configurações permitidas ao configurar túneis individuais. As opções de configuração são especificadas na <a href="%(i2cp)s">página I2CP</a>.
tr: Her havuzun yapılandırmasında, kaç tünelin etkin tutulacağı, arıza durumunda kaç tane yedek tünelin korunacağı, tünellerin ne kadar uzun olması gerektiği, bu uzunlukların rastgele olup olmayacağı ve bunlardan herhangi birini tanımlayan birkaç anahtar gibi ayarlar bulunur. Bireysel tüneller yapılandırılırken diğer ayarlara izin verilir. Yapılandırma seçeneklerine <a href="%(i2cp)s">I2CP sayfasından</a> bakabilirsiniz.

source: Tunnel Lengths and Defaults
pt: Comprimentos e padrões do túnel
tr: Tünel Uzunlukları ve Varsayılanlar

source: On the tunnel overview page
pt: Na página de visão geral do túnel
tr: Tünel özeti sayfasında

source: Anticipatory Build Strategy and Priority
pt: Estratégia e prioridade de construção antecipatória
tr: Öngörülü Oluşturma Stratejisi ve Önceliği

source: Tunnel building is expensive, and tunnels expire a fixed time after they are built. However, when a pool that runs out of tunnels, the Destination is essentially dead. In addition, tunnel build success rate may vary greatly with both local and global network conditions. Therefore, it is important to maintain an anticipatory, adaptive build strategy to ensure that new tunnels are successfully built before they are needed, without building an excess of tunnels, building them too soon, or consuming too much CPU or bandwidth creating and sending the encrypted build messages.
pt: Construir túneis é caro, e os túneis têm um tempo fixo de expiração após serem construídos. No entanto, quando uma piscina fica sem túneis, o Destino está essencialmente morto. Além disso, a taxa de sucesso da construção de túneis pode variar muito, tanto com condições locais quanto globais da rede. Portanto, é importante manter uma estratégia de construção antecipatória e adaptativa para garantir que novos túneis sejam construídos com sucesso antes que sejam necessários, sendo cuidadoso para não construir um excesso de túneis, construí-los muito cedo, ou consumir muito CPU ou largura de banda criando e enviando as mensagens de construção criptografadas.
tr: Tünel oluşturma işlemi pahalıdır ve tüneller oluşturulduktan belirli bir süre sonra sona erer. Bununla birlikte, bir havuzda tünel kalmadığında, aslında hedef ölüdür. Ayrıca, tünel oluşturma başarı oranı hem yerel hem de küresel ağ koşullarına göre büyük ölçüde değişebilir. Bu nedenle, yeni tünellerin gerek duyulmadan önce, fazla tünel oluşturmadan, onları çok erken oluşturmadan veya çok fazla işlemci veya bant genişliği tüketmeden, şifrelenmiş tüneller oluşturup göndermeden başarıyla oluşturulmasını ve oluşturma iletlerinin gönderilmesini sağlamak için ileriye dönük, uyarlanabilir bir oluşturma stratejisini sürdürmek önemlidir.

source: For each tuple {exploratory/client, in/out, length, length variance} the router maintains statistics on the time required for a successful tunnel build. Using these statistics, it calculates how long before a tunnel's expiration it should start attempting to build a replacement. As the expiration time approaches without a successful replacement, it starts multiple build attempts in parallel, and then will increase the number of parallel attempts if necessary.
pt: Para cada tupla {exploratory/client, in/out, length, length variance} o roteador mantém estatísticas sobre o tempo necessário para uma construção de túnel bem-sucedida. Usando essas estatísticas, ele calcula quanto tempo antes da expiração de um túnel ele deve começar a tentar construir uma substituição. À medida que o tempo de expiração se aproxima sem uma substituição bem-sucedida, ele inicia várias tentativas de construção em paralelo e, então, aumentará o número de tentativas paralelas, se necessário.
tr: Yöneltici, her bir grup {keşif/istemci, giriş/çıkış, uzunluk, uzunluk farkı} için başarılı bir tünel oluşturmak amacıyla gereken süre hakkında istatistik tutar. Bu istatistikleri kullanarak, bir tünelin süresinin dolmasına ne kadar süre kaldığında yeni bir tünel oluşturmaya çalışması gerektiğini hesaplar. Başarılı bir değiştirme olmadan sona erme süresi yaklaştıkça, paralel olarak birden çok derleme denemesi başlatır ve ardından gerekirse paralel denemelerin sayısını artırır.

source: To cap bandwidth and CPU usage, the router also limits the maximum number of build attempts outstanding across all pools. Critical builds (those for exploratory tunnels, and for pools that have run out of tunnels) are prioritized.
pt: Para limitar a largura de banda e o uso da CPU, o roteador também limita o número máximo de tentativas de compilação pendentes em todos os pools. As compilações críticas (aquelas para túneis exploratórios e para pools que ficaram sem túneis) são priorizadas.
tr: Bant genişliğini ve işlemci kullanımını sınırlamak için yöneltici, tüm havuzlarda bekleyen en fazla derleme denemesi sayısını da sınırlar. Kritik yapılara (keşif tünelleri ve tünelleri kalmamış havuzlar için olanlar) öncelik verilir.

source: Tunnel Message Throttling
pt: Limitação de mensagens de túnel
tr: Tünel İletisi Kısıtlaması

source: Even though the tunnels within I2P bear a resemblance to a circuit switched network, everything within I2P is strictly message based - tunnels are merely accounting tricks to help organize the delivery of messages. No assumptions are made regarding reliability or ordering of messages, and retransmissions are left to higher levels (e.g. I2P's client layer streaming library). This allows I2P to take advantage of throttling techniques available to both packet switched and circuit switched networks. For instance, each router may keep track of the moving average of how much data each tunnel is using, combine that with all of the averages used by other tunnels the router is participating in, and be able to accept or reject additional tunnel participation requests based on its capacity and utilization. On the other hand, each router can simply drop messages that are beyond its capacity, exploiting the research used on the normal Internet.
pt: Embora os túneis dentro do I2P tenham semelhança com uma rede de comutação de circuitos , tudo dentro do I2P é estritamente baseado em mensagens - os túneis são meramente truques de contabilidade para ajudar a organizar a entrega de mensagens. Nenhuma suposição é feita em relação à confiabilidade ou ordenação de mensagens, e as retransmissões são deixadas para níveis mais altos (por exemplo, a biblioteca de streaming da camada cliente do I2P). Isso permite que o I2P aproveite as técnicas de limitação disponíveis para redes de comutação de pacotes e de circuitos. Por exemplo, cada roteador pode manter o controle da média móvel de quantos dados cada túnel está usando, combinar isso com todas as médias usadas por outros túneis dos quais o roteador está participando e ser capaz de aceitar ou rejeitar solicitações adicionais de participação no túnel com base em sua capacidade e utilização. Por outro lado, cada roteador pode simplesmente descartar mensagens que estão além de sua capacidade, explorando a pesquisa usada na Internet normal.
tr: I2P içindeki tüneller devre anahtarlamalı bir ağa benzese de, I2P içindeki her şey kesinlikle ileti tabanlıdır. Tüneller yalnızca iletilerin dağıtımını organize etmeye yardımcı olan hesaplama hileleridir. İletilerin güvenilirliği veya sıralanması ile ilgili herhangi bir varsayım yapılmaz ve yeniden aktarım işlemleri daha yüksek düzeylere bırakılır (I2P istemci katmanı "Streaming kitaplığı" gibi). Bu yapı, I2P ağının hem paket anahtarlamalı hem de devre anahtarlamalı ağlar için var olan kısma tekniklerinden faydalanmasını sağlar. Örneğin, her yöneltici, her tünelin ne kadar veri kullandığının hareketli ortalamasını izleyebilir. Bunu yönelticinin katıldığı diğer tüneller tarafından kullanılan tüm ortalamalarla birleştirebilir ve kapasitesi ile kullanımına bağlı olarak ek tünel katılım isteklerini kabul veya red edebilir. Diğer yandan, her yöneltici, normal İnternet üzerinde kullanılan araştırmadan yararlanarak, kapasitesini aşan iletileri kolayca atabilir.

source: In the current implementation, routers implement a weighted random early discard (WRED) strategy. For all participating routers (internal participant, inbound gateway, and outbound endpoint), the router will start randomly dropping a portion of messages as the bandwidth limits are approached. As traffic gets closer to, or exceeds, the limits, more messages are dropped. For an internal participant, all messages are fragmented and padded and therefore are the same size. At the inbound gateway and outbound endpoint, however, the dropping decision is made on the full (coalesced) message, and the message size is taken into account. Larger messages are more likely to be dropped. Also, messages are more likely to be dropped at the outbound endpoint than the inbound gateway, as those messages are not as "far along" in their journey and thus the network cost of dropping those messages is lower.
pt: Na implementação atual, os roteadores implementam uma estratégia de descarte antecipado aleatório ponderado (WRED) . Para todos os roteadores participantes (participante interno, gateway de entrada e ponto de extremidade de saída), o roteador começará a descartar aleatoriamente uma parte das mensagens conforme os limites de largura de banda forem atingidos. Conforme o tráfego se aproxima ou excede os limites, mais mensagens são descartadas. Para um participante interno, todas as mensagens são fragmentadas e preenchidas e, portanto, têm o mesmo tamanho. No gateway de entrada e no ponto de extremidade de saída, no entanto, a decisão de descarte é tomada na mensagem completa (coalescida), e o tamanho da mensagem é levado em consideração. Mensagens maiores têm maior probabilidade de serem descartadas. Além disso, é mais provável que as mensagens sejam descartadas no ponto de extremidade de saída do que no gateway de entrada, pois essas mensagens não estão tão "avançadas" em sua jornada e, portanto, o custo de rede de descartar essas mensagens é menor.
tr: Var olan uygulamada, yönelticiler ağırlıklı rastgele erken atma (WRED) stratejisi uygular. Katılan tüm yönelticiler için (iç katılımcı, geliş ağ geçidi ve gidiş uç noktası), yöneltici, bant genişliği sınırlarına yaklaşıldığında iletilerin bir kısmını rasgele atmaya başlar. Trafik sınırlara yaklaştıkça veya sınırları aştıkça daha fazla ileti atılır. Bir iç katılımcı için tüm iletiler parçalanır ve dolgu eklenir. Bu nedenle tüm iletiler aynı boyuttadır. Ancak geliş ağ geçidinde ve gidiş uç noktasında, atma kararı tam (birleştirilmiş) ileti üzerinde verilir ve ileti boyutu dikkate alınır. Daha büyük iletilerin atılma olasılığı daha yüksektir. Ayrıca, bu iletiler yolculuklarında "uzak" olmadığından ve dolayısıyla bu iletileri bırakmanın ağ maliyeti daha düşük olduğundan, iletilerin geliş ağ geçidine göre gidiş uç noktasında atılması daha olasıdır.

source: Mixing/batching
pt: Mistura/dosagem
tr: Karıştırma/toplu işlem

source: What strategies could be used at the gateway and at each hop for delaying, reordering, rerouting, or padding messages? To what extent should this be done automatically, how much should be configured as a per tunnel or per hop setting, and how should the tunnel's creator (and in turn, user) control this operation? All of this is left as unknown, to be worked out for a distant future release.
pt: Quais estratégias poderiam ser usadas no gateway e em cada salto para atrasar, reordenar, redirecionar ou preencher mensagens? Até que ponto isso deve ser feito automaticamente, quanto deve ser configurado como uma configuração por túnel ou por salto, e como o criador do túnel (e, por sua vez, o usuário) deve controlar essa operação? Tudo isso é deixado como desconhecido, a ser trabalhado para uma versão futura distante.
tr: İletileri geciktirmek, yeniden sıralamak, yeniden yöneltmek veya dolgu eklemek için ağ geçidinde ve her sıçramada hangi stratejiler kullanılabilir? Bu ne ölçüde otomatik olarak yapılmalı, ne kadarı tünel başına veya sıçrama başına ayar olarak yapılandırılmalı ve tünel oluşturucu (dolayısıyla kullanıcı) bu işlemi nasıl denetlemelidir? Tüm bunlar, uzak bir gelecekteki sürümde üzerinde çalışılacak bilinmeyenler olarak bırakıldı.

source: Padding
pt: Acolchoamento
tr: Dolgu Ekleme
