Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Data integrity is verified with the standard gzip CRC-32 as specified by <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>.
pt: A integridade dos dados é verificada com o padrão gzip CRC-32 como especificado por <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>.
tr: Veri bütünlüğü, standart gzip CRC-32 kullanılarak <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a> ile belirtildiği şekilde şöyle doğrulanır:

source: The current authorization mechanism could be modified to use hashed passwords.
pt: O mecanismo de autorização atual pode ser modificado para usar senhas com hash.
tr: Geçerli kimlik doğrulama yöntemi, karma şifreleri kullanacak şekilde değiştirilebilir.

source: The Signing Private Keys is included in the Create Lease Set message, it is not required. Revocation is unimplemented. It should be replaced with random data or removed.
pt: As Chaves Privadas de Assinatura estão incluídas na mensagem Criar Conjunto de Locação, não é necessário. A revogação não foi implementada. Deve ser substituído por dados aleatórios ou removido.
tr: Kişisel anahtarların imzalanması, kiralama kümesi oluşturma iletisinde yapılır. Zorunlu değildir. Geri çekme özelliği eklenmemiştir. Rastgele verilerle değiştirilmeli veya kaldırılmalıdır.

source: Some improvements may be able to use messages previously defined but not implemented. For reference, here is the <a href="%(pdf1)s">I2CP Protocol Specification Version 0.9</a> (PDF) dated August 28, 2003. That document also references the <a href="%(pdf2)s">Common Data Structures Specification Version 0.9</a>.
pt: Algumas melhorias podem usar mensagens definidas anteriormente, mas não implementadas. Para referência, aqui está a <a href="%(pdf1)s">Especificação do Protocolo I2CP Versão 0.9</a> (PDF) datada de 28 de agosto de 2003. Esse documento também faz referência à <a href="%(pdf2)s">Especificação de Estruturas de Dados Comuns Versão 0.9</a>.
tr: Bazı iyileştirmeler, önceden tanımlanmış ancak uygulanmamış iletileri kullanabilir. Referans olarak, 28 Ağustos 2003 tarihli <a href="%(pdf1)s">I2CP iletişim kuralı teknik özellikleri 0.9 sürümü</a> (PDF) belgesine bakabilirsiniz. Bu belge ayrıca <a href="%(pdf2)s">Ortak veri yapıları teknik özellikleri 0.9 sürümüne</a> atıfta bulunur.

source: I2P Network Protocol
pt: Protocolo de rede I2P
tr: I2P Ağ İletişim Kuralı

source: October 2018
pt: Outubro de 2018
tr: 2018 Ekim

source: The I2P Network Protocol (I2NP), which is sandwiched between I2CP and the various I2P transport protocols, manages the routing and mixing of messages between routers, as well as the selection of what transports to use when communicating with a peer for which there are multiple common transports supported.
pt: O Protocolo de Rede I2P (I2NP), que fica entre o I2CP e os vários protocolos de transporte I2P, gerencia o roteamento e a mistura de mensagens entre roteadores, bem como a seleção de quais transportes usar ao se comunicar com um par para o qual há vários transportes comuns suportados.
tr: I2CP ve çeşitli I2P taşıyıcı iletişim kuralları arasında sıkıştırılmış olan I2P ağ iletişim kuralı (I2NP), yönelticiler arasında iletilerin yöneltilmesi ve karıştırılması işlemlerinin yanında, birden fazla bağlantı noktası bulunan bir eş ile iletişim kurarken hangi taşıyıcıların kullanılacağının seçilmesini sağlar. Yaygın taşıyıcılar desteklenir.

source: I2NP Definition
pt: Definição do I2NP
tr: I2NP Tanımı

source: I2NP (I2P Network Protocol) messages can be used for one-hop, router-to-router, point-to-point messages. By encrypting and wrapping messages in other messages, they can be sent in a secure way through multiple hops to the ultimate destination. Priority is only used locally at the origin, i.e. when queuing for outbound delivery.
pt: As mensagens I2NP (I2P Network Protocol) podem ser usadas para mensagens de um salto, de roteador para roteador, ponto a ponto. Ao criptografar e encapsular mensagens em outras mensagens, elas podem ser enviadas de forma segura por vários saltos até o destino final. A prioridade é usada apenas localmente na origem, ou seja, ao enfileirar para entrega de saída.
tr: I2NP (I2P ağ iletişim kuralı) iletileri tek sıçramalı, yönelticiden yönelticiye, noktadan noktaya iletiler için kullanılabilir. İletiler, şifrelenerek ve diğer iletilere sarmalanarak, çoklu sıçrama yoluyla son hedefe güvenli bir şekilde gönderilebilirler. Öncelik yalnızca kaynakta yerel olarak, yani ileti gidiş aktarım için kuyruğa alınırken kullanılır.

source: The priorities listed below may not be current and are subject to change. See the <a href="%(outnetmessage)s">OutNetMessage Javadocs</a> for the current priority settings. Priority queueing implementation may vary.
pt: As prioridades listadas abaixo podem não ser atuais e estão sujeitas a alterações. Consulte os <a href="%(outnetmessage)s">Javadocs OutNetMessage</a> para as configurações de prioridade atuais. A implementação do enfileiramento de prioridades pode variar.
tr: Aşağıda listelenen öncelikler güncel olmayabilir ve değişebilir. Geçerli öncelik ayarları için <a href="%(outnetmessage)s">OutNetMessage Javadocs</a> belgesine bakabilirsiniz. Öncelikli sıraya alma uygulaması değişebilir.

source: Message Format
pt: Formato de mensagem
tr: İleti Biçimi

source: The following table specifies the traditional 16-byte header used in NTCP. The SSU and NTCP2 transports use modified headers.
pt: A tabela a seguir especifica o cabeçalho tradicional de 16 bytes usado no NTCP. Os transportes SSU e NTCP2 usam cabeçalhos modificados.
tr: Aşağıdaki tabloda, NTCP içinde kullanılan geleneksel 16 baytlık üst bilgiyi görebilirsiniz. SSU ve NTCP2 taşıyıcılarında değiştirilmiş üst bilgiler kullanılır.

source: Field
pt: Campo
tr: Alan

source: Type
pt: Tipo
tr: Tür

source: Unique ID
pt: ID único
tr: Benzersiz kod

source: Expiration
pt: Expiração
tr: Sona erme

source: Payload Length
pt: Comprimento da carga útil
tr: Yük uzunluğu

source: Checksum
tr: Sağlama

source: Payload
pt: Carga útil
tr: Yük

source: While the maximum payload size is nominally 64KB, the size is further constrained by the method of fragmenting I2NP messages into multiple 1KB tunnel messages as described on <a href="%(tunnelimpl)s">the tunnel implementation page</a>. The maximum number of fragments is 64, and the message may not be perfectly aligned, So the message must nominally fit in 63 fragments.
pt: Embora o tamanho máximo da carga útil seja nominalmente 64 KB, o tamanho é ainda mais restrito pelo método de fragmentação de mensagens I2NP em várias mensagens de túnel de 1 KB, conforme descrito em <a href="%(tunnelimpl)s">a página de implementação do túnel</a>. O número máximo de fragmentos é 64, e a mensagem pode não estar perfeitamente alinhada, Portanto, a mensagem deve caber nominalmente em 63 fragmentos.
tr: En fazla yük boyutu nominal olarak 64 KB olsa da, boyut, <a href="%(tunnelimpl)s">tünel uygulama sayfasında</a> açıklandığı gibi I2NP iletilerini birden fazla 1 KB tünel iletisine bölme yöntemiyle daha da kısıtlanır. En fazla 64 parça olur ve ileti tam olarak hizalanmayabilir, Yani ileti nominal olarak 63 parçaya sığmalıdır.

source: The maximum size of an initial fragment is 956 bytes (assuming TUNNEL delivery mode); the maximum size of a follow-on fragment is 996 bytes. Therefore the maximum size is approximately 956 + (62 * 996) = 62708 bytes, or 61.2 KB.
pt: O tamanho máximo de um fragmento inicial é 956 bytes (assumindo o modo de entrega TUNNEL); o tamanho máximo de um fragmento subsequente é 996 bytes. Portanto, o tamanho máximo é aproximadamente 956 + (62 * 996) = 62708 bytes, ou 61,2 KB.
tr: Bir ilk parçanın en fazla boyutu 956 bayttır (TÜNEL aktarım kipi varsayılarak); bir izleme parçasının en fazla boyutu 996 bayttır. Bu nedenle en fazala boyut yaklaşık 956 + (62 * 996) = 62708 bayt veya 61.2 KB olur.

source: In addition, the transports may have additional restrictions. The NTCP limit is 16KB - 6 = 16378 bytes. The SSU limit is approximately 32 KB. The NTCP2 limit is approximately 64KB - 20 = 65516 bytes, which is higher than what a tunnel can support.
pt: Além disso, os transportes podem ter restrições adicionais. O limite NTCP é 16 KB - 6 = 16378 bytes. O limite SSU é aproximadamente 32 KB. O limite NTCP2 é aproximadamente 64 KB - 20 = 65516 bytes, o que é maior do que um túnel pode suportar.
tr: Ek olarak, taşıyıcıların ek kısıtlamaları olabilir. NTCP sınırı 16KB - 6 = 16378 bayttır. SSU sınırı yaklaşık 32 KB değerindedir. NTCP2 sınırı yaklaşık olarak 64KB - 20 = 65516 bayttır ve bu, bir tünelin destekleyebileceğinden daha fazladır.

source: Note that these are not the limits for datagrams that the client sees, as the router may bundle a reply leaseset and/or session tags together with the client message in a garlic message. The leaseset and tags together may add about 5.5KB. Therefore the current datagram limit is about 10KB. This limit will be increased in a future release.
pt: Note que estes não são os limites para datagramas que o cliente vê, pois o roteador pode agrupar um leaseset de resposta e/ou tags de sessão junto com a mensagem do cliente em uma mensagem garlic. O leaseset e as tags juntos podem adicionar cerca de 5,5 KB. Portanto, o limite atual de datagramas é de cerca de 10 KB. Este limite será aumentado em uma versão futura.
tr: Yöneltici bir yanıt "Kiralama kümesini" (LeaseSet) ve/veya oturum etiketlerini istemci iletisiyle birlikte bir Garlic iletisinde paketleyebileceğinden, bunların istemcinin gördüğü veri şemalarının sınırları olmadığını unutmayın. "Kiralama kümesi" (LeaseSet) ve etiketler birlikte yaklaşık 5.5 KB ekleyebilir. Bu nedenle var olan veri şeması sınırı yaklaşık 10KB olur. Bu sınır gelecekteki bir sürümde artırılacaktır.

source: Message Types
pt: Tipos de mensagens
tr: İleti Türleri

source: Higher-numbered priority is higher priority. The majority of traffic is TunnelDataMessages (priority 400), so anything above 400 is essentially high priority, and anything below is low priority. Note also that many of the messages are generally routed through exploratory tunnels, not client tunnels, and therefore may not be in the same queue unless the first hops happen to be on the same peer.
pt: Prioridade de número mais alto é prioridade mais alta. A maioria do tráfego é TunnelDataMessages (prioridade 400), então qualquer coisa acima de 400 é essencialmente alta prioridade, e qualquer coisa abaixo é baixa prioridade. Observe também que muitas das mensagens são geralmente roteadas através de túneis exploratórios, não túneis de cliente, e portanto podem não estar na mesma fila, a menos que os primeiros saltos estejam no mesmo peer.
tr: Daha yüksek numaralı öncelik değeri, daha yüksek öncelik anlamına gelir. Trafiğin çoğunluğu tünel veri iletileridir (TunnelDataMessages) (öncelik 400). Bu nedenle 400 üzerindeki her şey aslında yüksek önceliklidir ve altındaki her şey düşük önceliklidir. Ayrıca iletilerin çoğunun genellikle istemci tünelleri yerine keşif tünelleri üzerinden yöneltildiğini ve bu nedenle ilk sıçramalar aynı eşte olmadıkça aynı kuyrukta olmayabileceğini unutmayın.

source: Also, not all message types are sent unencrypted. For example, when testing a tunnel, the router wraps a DeliveryStatusMessage, which is wrapped in a GarlicMessage, which is wrapped in a DataMessage.
pt: Além disso, nem todos os tipos de mensagens são enviados sem criptografia. Por exemplo, ao testar um túnel, o roteador encapsula uma DeliveryStatusMessage, que é encapsulada em uma GarlicMessage, que é encapsulada em uma DataMessage.
tr: Ayrıca, tüm ileti türleri şifrelenmemiş olarak gönderilmez. Örneğin, bir tüneli sınarken, yöneltici bir "Veri iletisi" (DataMessage) içine sarmalanmış bir "Garlic iletisi" (GarlicMessage) içine sarmalanmış bir "Aktarım durumu iletisi" (DeliveryStatusMessage) sarmalar.

source: Message
pt: Mensagem
tr: İleti

source: Comments
pt: Comentários
tr: Açıklamalar

source: May vary
pt: Pode variar
tr: Değişebilir

source: Size is 65 + 32*(number of hashes) where typically, the hashes for three floodfill routers are returned.
pt: O tamanho é 65 + 32*(número de hashes), onde normalmente são retornados os hashes para três roteadores de floodfill.
tr: Boyut 65 + 32*(karma sayısı) olup, burada tipik olarak üç otomatik doldurma yönelticisi için karmalar döndürülür.

source: Varies
pt: Varia
tr: Değişir

source: Priority may vary. Size is 898 bytes for a typical 2-lease leaseSet. RouterInfo structures are compressed, and size varies; however there is a continuing effort to reduce the amount of data published in a RouterInfo as we approach release 1.0.
pt: A prioridade pode variar. O tamanho é 898 bytes para um leaseSet típico de 2 arrendamentos. As estruturas RouterInfo são compactadas e o tamanho varia; no entanto há um esforço contínuo para reduzir a quantidade de dados publicados em um RouterInfo à medida que nos aproximamos da versão 1.0.
tr: Öncelik değişebilir. Tipik bir 2 kiralamalı "Kiralama kümesi" (LeaseSet) için boyut 898 bayttır. "Yöneltici bilgileri" (RouterInfo) yapıları sıkıştırılır ve boyut değişir. Bununla birlikte, 1.0 sürümüne yaklaşırken "Yöneltici bilgileri" (RouterInfo) ile yayınlanan veri miktarını azaltmak için süregelen bir çaba var.

source: Priority may vary on a per-destination basis
pt: A prioridade pode variar dependendo do destino
tr: Öncelik, her hedef bazında değişebilir

source: Used for message replies, and for testing tunnels - generally wrapped in a GarlicMessage
pt: Usado para respostas de mensagens e para testar túneis - geralmente encapsulado em um GarlicMessage
tr: İleti yanıtları ve tünelleri sınamak için kullanılır. Genellikle bir Garlic iletisi (GarlicMessage) içine sarmalanır

source: Generally wrapped in a DataMessage - but when unwrapped, given a priority of 100 by the forwarding router
pt: Geralmente encapsulado em um DataMessage - , mas quando descompactado, recebe uma prioridade de 100 do roteador de encaminhamento
tr: Genellikle bir veri iletisi (DataMessage) içine sarmalanır. Ancak paket açıldığında, aktaran yöneltici tarafından 100 önceliği verilir

source: The most common message. Priority for tunnel participants, outbound endpoints, and inbound gateways was reduced to 200 as of release 0.6.1.33. Outbound gateway messages (i.e. those originated locally) remains at 400.
pt: A mensagem mais comum. A prioridade para participantes do túnel, endpoints de saída e gateways de entrada foi reduzida para 200 a partir da versão 0.6.1.33. Mensagens de gateway de saída (ou seja, aquelas originadas localmente) permanecem em 400.
tr: En yaygın ileti. Tünel katılımcıları, gidiş uç noktaları ve geliş ağ geçitleri için öncelik, 0.6.1.33 sürümünden başlayarak 200 olacak şekilde düşürüldü. Gidiş ağ geçidi iletileri (yani yerel olarak oluşturulanlar) 400 olarak kaldı.

source: Shorter TunnelBuildMessage as of 0.7.12
pt: TunnelBuildMessage mais curto a partir de 0.7.12
tr: 0.7.12 sürümünde tünel oluşturma iletisi (TunnelBuildMessage) kısaltıldı

source: Shorter TunnelBuildReplyMessage as of 0.7.12
pt: TunnelBuildReplyMessage mais curto a partir de 0.7.12
tr: 0.7.12 sürümünde tünel oluşturma iletisi (TunnelBuildMessage) kısaltıldı

source: Others listed in <a href="%(pdf)s">2003 Spec</a>
pt: Outros listados em <a href="%(pdf)s">2003 Spec</a>
tr: Diğerleri <a href="%(pdf)s">2003 teknik özelliklerinde</a> bulunabilir

source: Obsolete, Unused
pt: Obsoleto, Desusado
tr: Kullanımdan kaldırıldı, kullanılmıyor

source: Full Protocol Specification
pt: Especificação completa do protocolo
tr: Tam İletişim Kuralı Teknik Özellikleri

source: <a href="%(i2npspec)s">On the I2NP Specification page</a>. See also the <a href="%(commonstructures)s">Common Data Structure Specification page</a>.
pt: <a href="%(i2npspec)s">Na página da Especificação do I2NP</a>. Ver também a <a href="%(commonstructures)s">página da Especificação das Estruturas de Dados Comuns</a>.
tr: <a href="%(i2npspec)s">I2NP teknik özellikleri sayfasında</a>. Ayrıca <a href="%(commonstructures)s">Ortak veri yapıları teknik özellikleri sayfasına</a> bakabilirsiniz.

source: It isn't clear whether the current priority scheme is generally effective, and whether the priorities for various messages should be adjusted further. This is a topic for further research, analysis and testing.
pt: Não está claro se o esquema de prioridade atual é geralmente eficaz, e se as prioridades para várias mensagens devem ser ajustadas ainda mais. Este é um tópico para pesquisas, análises e testes adicionais.
tr: Geçerli öncelik şemasının genel olarak etkili olup olmadığı ve çeşitli iletiler için önceliklerin daha fazla ayarlanması gerekip gerekmediği açık değildir. Bu konuda, daha fazla araştırma, analiz ve test gerekiyor.

source: Protocol Stack
pt: Pilha de Protocolos
tr: İletişim Kuralı Yığını

source: Here is the protocol stack for I2P. See also the <a href="%(docs)s">Index to Technical Documentation</a>.
pt: Aqui está a pilha de protocolos para I2P. Veja também o <a href="%(docs)s">Índice de Documentação Técnica</a>.
tr: I2P iletişim kuralı yığını. Ayrıca <a href="%(docs)s">Teknik belgeler dizini</a> bölümüne de bakabilirsiniz.

source: Each of the layers in the stack provides extra capabilities. The capabilities are listed below, starting at the bottom of the protocol stack.
pt: Cada uma das camadas na pilha fornece recursos extras. Os recursos estão listados abaixo, começando na parte inferior da pilha de protocolos.
tr: Yığındaki katmanların her biri ek yetenekler sağlar. Yetenekleri, iletişim kuralı yığınının altından başlayarak aşağıda görebilirsiniz.

source: Internet Layer:
pt: Camada de Internet:
tr: İnternet Katmanı:

source: IP: Internet Protocol, allow addressing hosts on the regular internet and routing packets across the internet using best-effort delivery.
pt: IP: Protocolo de Internet, permite endereçar hosts na Internet regular e rotear pacotes pela Internet usando entrega de melhor esforço.
tr: IP: İnternet iletişim kuralı (Internet Protocol). Normal internet üzerindeki sunucuların adreslenmesini ve en iyi çabayı kullanarak internet üzerinden paketlerin yöneltilmesini sağlar.

source: Transport Layer:
pt: Camada de transporte:
tr: Taşıyıcı Katmanı:

source: TCP: Transmission Control Protocol, allow reliable, in-order delivery of packets across the internet.
pt: TCP: Protocolo de Controle de Transmissão, permite a entrega confiável e ordenada de pacotes pela internet.
tr: TCP: "Aktarım denetimi iletişim kuralı" (Transmission Control Protocol), paketlerin internet üzerinden güvenilir şekilde gönderilmesini ve sırayla teslim edilmesini sağlar.

source: UDP: User Datagram Protocol, allow unreliable, out-of-order delivery of packets across the internet.
pt: UDP: User Datagram Protocol, permite a entrega não confiável e fora de ordem de pacotes pela Internet.
tr: UDP: Kullanıcı veri şeması iletişim kuralı (User Datagram Protocol), paketlerin internet üzerinden güvenilmez şekilde, sıralamaya uymadan teslim edilmesini sağlar.

source: <b>I2P Transport Layer:</b> provide encrypted connections between 2 I2P routers. These are not anonymous yet, this is strictly a hop-to-hop connection. Two protocols are implemented to provide these capabilities. NTCP2 builds on top of TCP, while SSU uses UDP.
pt: <b>Camada de Transporte I2P:</b> fornece conexões criptografadas entre 2 roteadores I2P. Eles ainda não são anônimos, é estritamente uma conexão hop-to-hop. Dois protocolos são implementados para fornecer esses recursos. O NTCP2 é construído sobre o TCP, enquanto o SSU usa o UDP.
tr: <b>I2P taşıyıcı katmanı:</b>, 2 I2P yönelticisi arasında şifrelenmiş bağlantılar sağlar. Bunlar henüz anonim değildir ve bu kesinlikle bir sıçramadan sıçramaya bağlantısıdır. Bu yetenekleri sağlamak için iki iletişim kuralı uygulanır. NTCP2, TCP üzerinden kullanılırken, SSU UDP üzerinden kullanılır.

source: NIO-based TCP
pt: TCP baseado em NIO
tr: NIO temelli TCP

source: Secure Semi-reliable UDP
pt: UDP semi-confiável seguro
tr: Güvenli yarı güvenilir UDP

source: <b>I2P Tunnel Layer:</b> provide full encrypted tunnel connections.
pt: <b>Camada de túnel I2P:</b> fornece conexões de túnel totalmente criptografadas.
tr: <b>I2P tünel katmanı:</b> Tam olarak şifrelenmiş tünel bağlantıları sağlar.

source: <a href="%(tunnelmessage)s">Tunnel messages</a>: tunnel messages are large messages containing encrypted I2NP (see below) messages and encrypted instructions for their delivery. The encryption is layered. The first hop will decrypt the tunnel message and read a part. Another part can still be encrypted (with another key), so it will be forwarded.
pt: <a href="%(tunnelmessage)s">Mensagens de túnel</a>: mensagens de túnel são mensagens grandes contendo mensagens I2NP criptografadas (veja abaixo) e instruções criptografadas para sua entrega. A criptografia é em camadas. O primeiro salto descriptografará a mensagem de túnel e lerá uma parte. Outra parte ainda pode ser criptografada (com outra chave), então ela será encaminhada.
tr: <a href="%(tunnelmessage)s">Tünel iletileri</a>: Tünel iletileri, şifrelenmiş I2NP (aşağıya bakın) iletilerini ve bunların teslimi için şifrelenmiş yönergeleri içeren büyük iletilerdir. Şifreleme çok katmanlıdır. İlk sıçrama tünel iletisinin şifresini çözer ve bir bölümünü okur. İletinin kalan bölümü hala şifrelidir (başka bir anahtarla) ve bu şekilde iletilir.

source: <a href="%(i2np)s">I2NP messages</a>: I2P Network Protocol messages are used to pass messages through multiple routers. These I2NP messages are combined in tunnel messages.
pt: <a href="%(i2np)s">Mensagens I2NP</a>: Mensagens do Protocolo de Rede I2P são usadas para passar mensagens por vários roteadores. Essas mensagens I2NP são combinadas em mensagens de túnel.
tr: <a href="%(i2np)s">I2NP iletileri</a>: I2P ağ iletişim kuralı iletileri, iletileri birden çok yönelticiden geçirmek için kullanılır. Bu I2NP iletileri, tünel iletilerinde birleştirilir.

source: <b>I2P Garlic Layer:</b> provide encrypted and anonymous end-to-end I2P message delivery.
pt: <b>Camada I2P Garlic:</b> fornece entrega de mensagens I2P criptografadas e anônimas de ponta a ponta.
tr: <b>I2P Garlic katmanı:</b> I2P iletilerinin şifrelenmiş ve anonim olarak uçtan uca aktarılmasını sağlar.

source: <a href="%(i2np)s">I2NP messages</a>: I2P Network Protocol messages are wrapped in each other and used to ensure encryption between two tunnels and are passed along from source to destination, keeping both anonymous.
pt: <a href="%(i2np)s">Mensagens I2NP</a>: As mensagens do protocolo de rede I2P são encapsuladas umas nas outras e usadas para garantir a criptografia entre dois túneis e são passadas da origem para o destino, mantendo ambos anônimos.
tr: <a href="%(i2np)s">I2NP iletileri</a>: I2P ağ iletişim kuralı iletileri birbirine sarmalanır ve iki tünel arasında şifrelemeyi sağlamak için kullanılır. Her ikisi de anonim tutularak kaynaktan hedefe iletilir.

source: The following layers are strictly speaking no longer part of the I2P Protocol stack, they are not part of the core 'I2P router' functionality. However, each of these layers adds additional functionality, to allow applications simple and convenient I2P usage.
pt: As camadas a seguir, estritamente falando, não fazem mais parte da pilha do protocolo I2P e não fazem parte da funcionalidade principal do "roteador I2P". No entanto, cada uma dessas camadas adiciona funcionalidade adicional para permitir que os aplicativos usem o I2P de forma simples e conveniente.
tr: Aşağıdaki katmanlar kesinlikle artık I2P iletişim kuralı yığınının bir parçası değildir. Bunlar çekirdek 'I2P yöneltici' işlevlerinin bir parçası değildir. Bununla birlikte, bu katmanların her biri, uygulamaların basit ve kullanışlı şekilde I2P kullanmasını sağlamak için ek işlevler sunar.
