Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Index to Technical Documentation
pt: Índex para a Documentação Técnica
tr: Teknik Belgeler Dizini

source: Following is an index to the technical documentation for I2P.
pt: 'Seguir' é um índex para a documentação técnica para o I2P.
tr: I2P için teknik belgeler dizinini aşağıda bulabilirsiniz.

source: This index is ordered from the highest to lowest layers. The higher layers are for "clients" or applications; the lower layers are inside the router itself. The interface between applications and the router is the I2CP (I2P Control Protocol) API.
pt: Este índice é ordenado da camada mais alta para a mais baixa. As camadas mais altas são para "clientes" ou aplicações; as camadas mais baixas são internas ao próprio roteador. A interface entre as aplicações e o roteador é a API do protocolo I2CP (Protocolo de Controle da I2P).
tr: Bu dizin en yüksekten en alçağa doğru sıralanır. Daha yüksek katmanlar "istemciler" veya uygulamalar içindir. Alt katmanlar yönelticinin içindedir. Uygulamalar ve yöneltici arasındaki arayüz, I2CP (I2P denetim iletişim kuralı) API yazılımıdır.

source: Proposals
pt: Propostas
tr: Öneriler

source: The I2P Project is committed to maintaining accurate, current documentation. If you find any inaccuracies in the documents linked below, please <a href="%(trac)s">enter a ticket identifying the problem</a>.
pt: O Projeto I2P é comitado de maneira a manter a documentação disponível sempre atual. Se você encontrar alguma informação improcedente nos documentos listados abaixo, por favor, <a href="%(trac)s">produza uma nota identificando o problema</a>.
tr: I2P projesi, doğru ve güncel belgeler sağlamayı amaçlar. Aşağıda bağlantısı verilen belgelerde herhangi bir yanlışlık bulursanız, lütfen <a href="%(trac)s">sorunu belirten bir destek kaydı gönderin</a>.

source: Overview
pt: Sinopse
tr: Özet

source: Technical Introduction
pt: Introdução Técnica
tr: Teknik yönergeler

source: A Less-Technical Introduction
pt: Uma Introdução Menos Técnica
tr: Daha az teknik bir giriş

source: Threat model and analysis
pt: Modelos de risco e Análises
tr: Tehdit modeli ve incelemesi

source: Comparisons to other anonymous networks
pt: Comparações para outras redes anónimas
tr: Diğer anonimlik sağlayan ağlarla karşılaştırma

source: Specifications
pt: Especificações
tr: Teknik özellikler

source: Protocol stack chart
pt: Gráfico da pilha de protocolos
tr: İletişim kuralı yığını çizelgesi

source: Papers on I2P
pt: Papéis no I2P
tr: I2P üzerine makaleler

source: Presentations, articles, tutorials, videos, and interviews
pt: Apresentações, artigos, tutoriais, vídeos e entrevistas
tr: Sunumlar, makaleler, eğitimler, videolar ve röportajlar

source: <a href="%(pdf)s">Invisible Internet Project (I2P) Project Overview</a> August 28, 2003 (pdf)
pt: <a href="%(pdf)s">Visão geral do Projeto Internet Invisível (I2P)</a>, 28 de agosto de 2003 (pdf)
tr: <a href="%(pdf)s">Invisible Internet Project (I2P) proje özeti</a> 28 Ağustos 2003 (pdf)

source: Application-Layer Topics
pt: Tópicos sobre a Camada de aplicação
tr: Uygulama Katmanı Konuları

source: Naming and Address Book
pt: Nomenclatura e Catálogo de Endereços
tr: Adlandırma ve Adres Defteri

source: Address Book Subscription Feed Commands
pt: Comandos de feed de assinatura do catálogo de endereços
tr: Adres defteri aboneliği akış komutları

source: Plugins Overview
pt: Resumo de Plug-ins
tr: Uygulama ekleri özeti

source: Plugin Specification
pt: Especificação de Plug-in
tr: Uygulama eki özellikleri

source: Managed Clients
pt: Clientes Geridos
tr: Yönetilen istemciler

source: Embedding the router in your application
pt: Integrando o roteador no seu aplicativo
tr: Yönelticiyi uygulamanıza gömmek

source: Bittorrent over I2P
pt: Bittorrent sob I2P
tr: I2P üzerinden Bittorent

source: I2PControl Plugin API
pt: API da extensão I2PControl
tr: I2PControl uygulama eki API

source: hostsdb.blockfile Format
pt: Formato hostsdb.blockfile
tr: hostsdb.blockfile biçimi

source: Configuration File Format
pt: Formato do arquivo de configuração
tr: Yapılandırma dosyası biçimi

source: Application Layer API and Protocols
pt: API da Camada de Aplicação e Protocolos
tr: Uygulama Katmanı API ve İletişim Kuralları

source: High-level, easy-to-use APIs for applications written in any language to send and receive data.
pt: Alto nível, APIs fáceis de usar para escrever aplicações em qualquer linguagem para enviar e receber dados
tr: Her dilde yazılmış uygulamalarda veri almak ve göndermek için yüksek düzeyli, kullanımı kolay API yazılımları.

source: Application Development Overview and Guide
pt: Guia e Visão Geral do Desenvolvimento de Aplicações
tr: Uygulama geliştirme özeti ve rehberi

source: I2PTunnel Configuration
pt: Configuração de I2PTunnel
tr: I2PTunnel yapılandırması

source: SAM Protocol
pt: Protocolo SAM
tr: SAM iletişim kuralı

source: SAMv2 Protocol
pt: Protocolo SAMv2
tr: SAMv2 iletişim kuralı

source: SAMv3 Protocol
pt: Protocolo SAMv3
tr: SAMv3 iletişim kuralı

source: BOB Protocol
pt: Protocolo BOB
tr: BOB iletişim kuralı

source: End-to-End Transport API and Protocols
pt: API do transporte ponta-a-ponta e Protocolos
tr: Uçtan Uca Taşıyıcı API ve İletişim Kuralları

source: The end-to-end protocols used by clients for reliable and unreliable communication.
pt: Os protocolos ponta-a-ponta usados por clientes para comunicações confiáveis e não-confiáveis.
tr: İstemciler tarafından güvenilir ve güvenilir olmayan iletişim için kullanılan uçtan uca iletişim kuralları.

source: Streaming Protocol Overview
pt: Visão geral do protocolo de streaming
tr: Streaming iletişim kuralı özeti

source: Streaming Protocol Specification
pt: Especificação do protocolo de streaming
tr: Streaming iletişim kuralı teknik özellikleri

source: Streaming Javadoc
pt: Javadoc da biblioteca de streaming
tr: Streaming Java belgeleri

source: Datagrams
pt: Datagramas
tr: Veri şemaları

source: Datagram Javadoc
pt: Javadoc do datagrama
tr: Veri şeması Java belgeleri

source: Client-to-Router Interface API and Protocol
pt: API e protocolo de Interface Cliente-para-Roteador
tr: İstemci-Yöneltici Arayüz API ve İletişim Kuralı

source: The lowest-level API used for clients (applications) to send and receive traffic to a router. Traditionally used only by Java applications and higher-level APIs.
pt: A API de baixo-nivel usada por clientes (aplicações) para enviar e receber trafego para um roteador. Tradicionalmente usado apenas por aplicações Java e APIs de alto-nível.
tr: İstemcilerin (uygulamalar) bir yönelticiye trafik göndermek ve almak için kullandığı en alt düzey API . Geleneksel olarak yalnızca Java uygulamaları ve daha yüksek düzeydeki API yazılımları tarafından kullanılır.

source: I2CP - I2P Control Protocol / API overview
pt: I2CP - Protocolo de Controle da I2P / Uma visão geral da API
tr: I2CP - I2P Control iletişim kuralı / API özeti

source: I2CP Specification
pt: Especificação do I2CP
tr: I2CP teknik özellikleri

source: I2CP API Javadoc
pt: Javadoc da API do I2CP
tr: I2CP API Java belgeleri

source: Common data structures specification
pt: Especificação das estruturas de dados comuns
tr: Ortak veri yapılarının teknik özellikleri

source: Data Structures Javadoc
pt: Javadoc das Estruturas de Dados
tr: Veri yapıları Java belgeleri

source: End-to-End Encryption
tr: Uçtan Uca Şifreleme

source: How client messages are end-to-end encrypted by the router.
pt: Como as mensagens de cliente são criptografadas de ponta a ponta pelo roteador
tr: İstemci iletileri yöneltici tarafından uçtan uca nasıl şifrelenir.

source: ECIES-X25519-AEAD-Ratchet encryption for destinations
pt: ECIES-X25519-AEAD-Criptografia de catraca para destinos
tr: Hedefler için ECIES-X25519-AEAD-Ratchet şifrelemesi

source: ECIES-X25519 encryption for routers
pt: Criptografia ECIES-X25519 para roteadores
tr: Yönelticiler için YECIES-X25519 şifrelemesi

source: ElGamal/AES+SessionTag encryption
pt: Criptografia ElGamal/AES+SessionTag
tr: ElGamal/AES+Oturum etiketi şifrelemesi

source: ElGamal and AES cryptography details
pt: Detalhes sobre as criptografias AES e ElGamal
tr: ElGamal ve AES şifreleme ayrıntıları

source: Network Database
pt: Banco de dados da rede
tr: Ağ veri tabanı

source: Distributed storage and retrieval of information about routers and clients.
pt: Armazenamento distribuído e recuperação de informações relativas aos roteadores e clientes.
tr: Dağıtılmış depolama ve yönelticiler ile istemciler hakkında bilgi almak.

source: Network database overview, details, and threat analysis
pt: Uma visão geral do banco de dados da rede, detalhes e análise de risco
tr: Ağ veri tabanı özeti, ayrıntıları ve tehdit analizi

source: Cryptographic hashes
pt: Hashes criptográficas
tr: Şifreleme karmaları

source: Cryptographic signatures
pt: Assinaturas criptográficas
tr: Şifreleme imzaları

source: Red25519 signatures
pt: Assinaturas Red25519
tr: Red25519 imzaları

source: Router reseed specification
pt: Especificação da repropagação do roteador
tr: Yöneltici yeniden tohumlama özelliği

source: Base32 Addresses for Encrypted Leasesets
pt: Endereços Base32 para conjuntos de arrendamento criptografados
tr: "Şifrelenmiş kiralama kümeleri" (EncryptedLeaseSets) Base32 adresleri

source: Router Message Protocol
pt: Protocolo de mensagens do roteador
tr: Yöneltici İleti İletişim Kuralı

source: I2P is a message-oriented router. The messages sent between routers are defined by the I2NP protocol.
pt: A I2P é baseada em roteamento orientado-a-mensagens. As mensagens enviadas entre os roteadores são definidas pelo protocolo I2NP.
tr: I2P, ileti odaklı bir yönelticidir. Yönelticiler arasında gönderilen iletiler I2NP iletişim kuralı ile tanımlanır.

source: I2NP - I2P Network Protocol Overview
pt: I2NP - Uma visão geral do protocolo de rede I2P
tr: I2NP - I2P ağ iletişim kuralı özeti

source: I2NP Specification
pt: Especificação do I2NP
tr: I2NP teknik özellikleri

source: I2NP Javadoc
pt: Javadoc do I2NP
tr: I2NP Java belgeleri

source: Encrypted Leaseset specification
pt: Especificação do Leaseset criptografado
tr: "Şifrelenmiş kiralama kümesi (EncryptedLeaseSet) teknik özellikleri

source: Tunnels
pt: Tuneis
tr: Tüneller

source: Selecting peers, requesting tunnels through those peers, and encrypting and routing messages through these tunnels.
pt: Selecionando pares, requisitando túneis através de tais pares, criptografando e roteando mensagens através desses túneis.
tr: Eşlerin seçilmesi, bu eşler üzerinden tünellerin istenmesi ve bu tüneller üzerinden iletilerin şifrelenerek yöneltilmesi.

source: Peer profiling and selection
pt: Determinação de perfis e seleção de pares
tr: Eş profilinin belirlenmesi ve seçimi

source: Tunnel routing overview
pt: Uma visão geral do roteamento via túneis
tr: Tünel yöneltme özeti

source: Garlic routing and "garlic" terminology
pt: Roteamento e terminologia "alho"
tr: Garlic yöneltme ve "garlic" terminolojisi

source: Tunnel building and encryption
pt: Construção de túneis e criptografia
tr: Tünel oluşturma ve şifreleme

source: for build request encryption
pt: para construir requisição de encriptação
tr: oluşturma isteği şifrelemesi için

source: Tunnel building specification
pt: Especificação para a construção de túneis
tr: Tünel oluşturma teknik özellikleri

source: Low-level tunnel message specification
pt: Especificação da mensagem de túnel de baixo-nível
tr: Düşük düzey tünel iletisi teknik özellikleri

source: Unidirectional Tunnels
pt: Túneis unidirecionais
tr: Çift yönlü tüneller

source: Peer Profiling and Selection in the I2P Anonymous Network
pt: Determinação de perfis e seleção de pares na Rede anônima I2P
tr: I2P anonim ağında eş profilinin belirlenmesi ve seçimi

source: 2009 paper (pdf), not current but still generally accurate
pt: artigo de 2009 (pdf), desatualizado mas, em linhas gerais, ainda correto
tr: 2009 makalesi (pdf), güncel değil ancak genel olarak oldukça doğru

source: Transport Layer
pt: Camada de transporte
tr: Taşıyıcı Katman

source: The protocols for direct (point-to-point) router to router communication.
pt: Os protocolos para a comunicação direta (ponto-a-ponto) de roteador para roteador
tr: Doğrudan (uçtan uca) yönelticiden yönelticiye iletişim için iletişim kuralları.

source: Transport layer overview
pt: Resumo da camada de transporte
tr: Taşıyıcı katmanı özeti

source: TCP-based transport overview and specification
pt: Especificação e visão geral do transporte baseado em TCP
tr: TCP tabanlı taşıyıcı özeti ve teknik özellikleri

source: NTCP2 specification
pt: Especificação NTCP2
tr: NTCP2 teknik özellikleri

source: UDP-based transport overview
pt: Uma visão geral do transporte baseado em UDP
tr: UDP temelli taşıyıcı özeti

source: SSU specification
pt: Especificação SSU
tr: SSU teknik özellikleri

source: SSU2 specification
pt: Especificação SSU2
tr: SSU2 teknik özellikleri

source: NTCP transport encryption
pt: Criptografia de transporte NTCP
tr: NTCP taşıyıcı şifrelemesi

source: SSU transport encryption
pt: Criptografia do transporte SSU
tr: SSU taşıyıcı şifrelemesi

source: Transport Javadoc
pt: Javadoc da biblioteca de transporte
tr: Taşıyıcı Java belgeleri

source: NTCP Javadoc
pt: Javadoc do NTCP
tr: NTCP Java belgeleri

source: SSU Javadoc
pt: Javadoc do SSU
tr: SSU Java belgeleri

source: Other Router Topics
pt: Outros tópicos sobre o roteador
tr: Diğer Yöneltici Konuları

source: Router software updates
pt: Atualizações do software do roteador
tr: Yöneltici yazılım güncellemeleri

source: Native BigInteger Library
pt: Biblioteca BigInteger nativa
tr: Doğal BigInteger kitaplığı

source: Time synchronization and NTP
pt: Sincronização de tempo e NTP
tr: Zaman eşitlemesi ve NTP

source: Performance
pt: Desempenho
tr: Başarım

source: Developer's Guides and Resources
pt: Guia para Desenvolvedores e Recursos
tr: Geliştirici Rehberleri ve Kaynakları

source: New Developer's Guide
pt: Guia para novos desenvolvedores
tr: Yeni başlayan geliştiriciler rehberi

source: New Translator's Guide
pt: Guia para novos tradutores
tr: Yeni başayan çevirmenler rehberi

source: Monotone Guide
pt: Guia do Monotone
tr: Monotone rehberi

source: Developer Guidelines
pt: Diretrizes para os desenvolvedores
tr: Geliştirici yönergeleri

source: Javadocs on the standard internet:
pt: Javadocs na internet ordinária:
tr: Standart İnternet üzerinde Java belgeleri:

source: Server %(num)s
pt: Servidor %(num)s
tr: Sunucu %(num)s

source: Note: always verify that javadocs are current by checking the release number.
pt: Nota: sempre verifique qual javadocs é o atual, verificando o número do lançamento.
tr: Not: Her zaman Java belgelerinin yayın numaralarına bakarak güncel olup olmadıklarını denetleyin.

source: Javadocs inside I2P:
pt: Javadocs na I2P:
tr: I2P içindeki Java belgeleri.

source: How to Set up a Reseed Server
pt: Como configurar um servidor Reseed
tr: Bir yeniden tohumlama sunucusu nasıl kurulur

source: Ports used by I2P
pt: Portas usadas pela I2P
tr: I2P tarafından kullanılan bağlantı noktaları

source: Updating the wrapper manually
pt: Atualizando o encapsulador manualmente
tr: El ile Wrapper güncellemesi

source: User forum
pt: Fórum de usuários
tr: Kullanıcı forumu

source: Developer forum inside I2P
pt: Fórum de desenvolvedores na I2P
tr: I2P içindeki geliştirici forumu

source: Bug tracker
pt: Rastreador de Erros
tr: Hata izleyici

source: I2P Source exported to GitHub
pt: Código-fonte da I2P exportado para o GitHub
tr: GitHub üzerine aktarılan I2P kaynağı

source: I2P Source Git Repo inside I2P
pt: Repositório Git de código-fonte da I2P dentro da I2P
tr: I2P içindeki I2P kaynağı Git deposu

source: Source translation at Transifex
pt: Tradução do código-fonte no Transifex
tr: Transifex üzerindeki kaynak çevirisi

source: Roadmap
pt: Mapa de Desenvolvimento
tr: Yol haritası

source: To Do List
pt: Lista de tarefas por fazer
tr: Yapılacaklar listesi

source: not current
pt: em desuso
tr: güncel değil

source: I2P ships with a generic naming library and a base implementation designed to work off a local name to destination mapping, as well as an add-on application called the <a href="#addressbook">address book</a>. I2P also supports <a href="#base32">Base32 hostnames</a> similar to Tor's .onion addresses.
pt: O I2P vem com uma biblioteca de nomenclatura genérica e uma implementação base projetada para trabalhar com um mapeamento de nome local para destino, bem como um aplicativo complementar chamado de <a href="#addressbook">catálogo de endereços</a>. O I2P também oferece suporte a <a href="#base32">nomes de host Base32</a> semelhantes aos endereços .onion do Tor.
tr: I2P, genel bir adlandırma kitaplığı ve yerel bir adla hedef eşleme arasında çalışmak üzere tasarlanmış bir temel uygulamanın yanında <a href="#addressbook">adres defteri</a> adlı bir eklenti uygulamasıyla birlikte gelir. I2P ayrıca Tor .onion adreslerine benzer <a href="#base32">Base32 sunucu adlarını</a> destekler.

source: The address book is a web-of-trust driven secure, distributed, and human readable naming system, sacrificing only the call for all human readable names to be globally unique by mandating only local uniqueness. While all messages in I2P are cryptographically addressed by their destination, different people can have local address book entries for "Alice" which refer to different destinations. People can still discover new names by importing published address books of peers specified in their web of trust, by adding in the entries provided through a third party, or (if some people organize a series of published address books using a first come first serve registration system) people can choose to treat these address books as name servers, emulating traditional DNS.
pt: O catálogo de endereços é um sistema de nomenclatura seguro, distribuído e legível por humanos, conduzido por uma rede de confiança , sacrificando apenas a chamada para que todos os nomes legíveis por humanos sejam globalmente únicos, exigindo apenas a exclusividade local. Enquanto todas as mensagens no I2P são criptograficamente endereçadas por seu destino, pessoas diferentes podem ter entradas no catálogo de endereços local para "Alice" que se referem a destinos diferentes. As pessoas ainda podem descobrir novos nomes importando catálogos de endereços publicados de pares especificados em sua rede de confiança, adicionando as entradas fornecidas por terceiros ou (se algumas pessoas organizarem uma série de catálogos de endereços publicados usando um sistema de registro por ordem de chegada ) as pessoas podem escolher tratar esses catálogos de endereços como servidores de nomes, emulando o DNS tradicional.
tr: Adres defteri, yerel benzersizliği zorunlu kılarak insan tarafından okunabilir tüm adların küresel olarak benzersiz olmasını şart koşamayan, güvenli, dağıtılmış ve insan tarafından okunabilir bir adlandırma sistemidir. I2P üzerindeki tüm iletiler, hedefleri tarafından şifrelenerek adreslendiğinden, farklı kişilerde, farklı hedeflere atıfta bulunan "Alice" yerel adres defteri kayıtları olabilir. İnsanlar, güven ağlarında belirtilen eşlerin yayınlanmış adres defterlerini içe aktararak veya üçüncü bir taraf aracılığıyla sağlanan kayıtları ekleyerek (bazı kişiler ilk gelen ilk alır kayıt sistemini kullanarak bazı adres defterleri düzenlemişse) yeni adlar keşfedebilir. Bu adres defterleri geleneksel DNS sunucusuna benzeyen ad sunucuları olarak düşünülebilir.

source: NOTE: For the reasoning behind the I2P naming system, common arguments against it and possible alternatives see the <a href="%(namingdiscussion)s">naming discussion</a> page.
pt: NOTA: Para as razões por trás do sistema de nomes da I2P, argumentos contrários e possíveis alternativas, dê uma olhada na página de <a href="%(namingdiscussion)s">discussão do sistema de nomes</a>.
tr: NOT: I2P adlandırma sisteminin arkasındaki mantık, buna karşı genel argümanlar ve olası alternatifler için <a href="%(namingdiscussion)s">adlandırma tartışması</a> sayfasına bakabilirsiniz.

source: Naming System Components
pt: Componentes do Sistema de nomes
tr: Adlandırma Sistemi Bileşenleri

source: There is no central naming authority in I2P. All hostnames are local.
pt: Não há qualquer autoridade de nomes centralizada na I2P. Todos os nomes de hosts são locais.
tr: I2P ağında merkezi bir adlandırma otoritesi yoktur. Tüm sunucu adları yereldir.

source: The naming system is quite simple and most of it is implemented in applications external to the router, but bundled with the I2P distribution. The components are:
pt: O sistema de nomenclatura é bem simples e a maioria disso é implementada em aplicações externas ao roteador, mas empacotada com o distribuidor I2P. Os componentes são:
tr: Adlandırma sistemi oldukça basittir ve çoğu yöneltici dışındaki uygulamalarda bulunur, ancak I2P dağıtımıyla birlikte gelir. Bileşenleri şunlardır:

source: The local <a href="#lookup">naming service</a> which does lookups and also handles <a href="#base32">Base32 hostnames</a>.
pt: O serviço de nomenclatura local <a href="#lookup"></a> que faz pesquisas e também manipula <a href="#base32">nomes de host Base32</a>.
tr: Aramaları yapan ve <a href="#base32">Base32 sunucu adlarını</a> işleyen yerel <a href="#lookup">adlandırma hizmeti</a>.

source: The <a href="#httpproxy">HTTP proxy</a> which asks the router for lookups and points the user to remote jump services to assist with failed lookups.
pt: O proxy HTTP <a href="#httpproxy"></a> que solicita pesquisas ao roteador e aponta o usuário para serviços de salto remoto para auxiliar com pesquisas com falha.
tr: Yönelticiden aramalar isteyen ve başarısız aramalara yardımcı olması için kullanıcıyı uzaktan atlama hizmetlerine yönlendiren <a href="#httpproxy">HTTP vekil sunucusu</a>.

source: HTTP <a href="#add-services">host-add forms</a> which allow users to add hosts to their local hosts.txt
pt: HTTP <a href="#add-services">formulários de adição de host</a> que permitem que os usuários adicionem hosts ao seu hosts.txt local
tr: Kullanıcıların yerel hosts.txt dosyalarına sunucu eklemesini sağlayan HTTP <a href="#add-services">host-add formları</a>

source: HTTP <a href="#jump-services">jump services</a> which provide their own lookups and redirection.
pt: Serviços de salto HTTP <a href="#jump-services"></a> que fornecem suas próprias pesquisas e redirecionamentos.
tr: Kendi aramalarını ve yönlendirmelerini sağlayan HTTP <a href="#jump-services">sıçrama hizmetleri</a>.

source: The <a href="#addressbook">address book</a> application which merges external host lists, retrieved via HTTP, with the local list.
pt: O aplicativo <a href="#addressbook">do catálogo de endereços</a> que mescla listas de hosts externos , recuperadas via HTTP, com a lista local.
tr: HTTP aracılığıyla alınan dış sunucu listelerini yerel listeyle birleştiren <a href="#addressbook">adres defteri</a> uygulaması.

source: The <a href="#susidns">SusiDNS</a> application which is a simple web front-end for address book configuration and viewing of the local host lists.
pt: O aplicativo <a href="#susidns">SusiDNS</a> que é um front-end web simples para configuração do catálogo de endereços e visualização das listas de hosts locais.
tr: Adres defteri yapılandırması ve yerel sunucu listelerinin görüntülenmesi için basit bir site ön yüzü olan <a href="#susidns">SusiDNS</a> uygulaması.

source: Naming Services
pt: Serviços de Nomeação
tr: Adlandırma Hizmetleri
