Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: In the compact response, the value of the "peers" dictionary key is a single byte string, whose length is a multiple of 32 bytes. This string contains the concatenated <a href="%(commonstructures)s#type_Hash">32-byte SHA-256 Hashes</a> of the binary <a href="%(commonstructures)s#struct_Destination">Destinations</a> of the peers. This hash must be computed by the tracker, unless destination enforcement (see below) is used, in which case the hash delivered in the X-I2P-DestHash or X-I2P-DestB32 HTTP headers may be converted to binary and stored. The peers key may be absent, or the peers value may be zero-length.
pt: Na resposta compacta, o valor da chave do dicionário "peers" é uma sequência de bytes simples, cujo comprimento é um múltiplo de 32 bytes. Esta sequência contém os Hashes SHA-256 de 32 bytes concatenados <a href="%(commonstructures)s#type_Hash"></a> do binário <a href="%(commonstructures)s#struct_Destination">Destinos</a> dos pares. Este hash deve ser computado pelo rastreador, a menos que a aplicação de destino (veja abaixo) seja usada, caso em que o hash entregue nos cabeçalhos HTTP X-I2P-DestHash ou X-I2P-DestB32 pode ser convertido em binário e armazenado. A chave peers pode estar ausente, ou o valor peers pode ter comprimento zero.
tr: Kısa yanıtta, "eşler" sözlük anahtarının değeri, uzunluğu 32 baytın katı olan bir tek baytlık dizgedir. Bu dizgede, eşlerin ikili <a href="%(commonstructures)s#struct_Destination">Hedeflerinin</a> birleştirilmiş <a href="%(commonstructures)s#type_Hash">32 baytlık SHA-256 karması</a> bulunur. Bu karmanın, hedef dayatması (aşağıya bakın) kullanılmadığı sürece izleyici tarafından hesaplanması gerekir. Bu durumda X-I2P-DestHash veya X-I2P-DestB32 HTTP üst bilgilerinde aktarılan karma, binary olarak dönüştürülebilir ve depolanabilir. Eşler anahtarı var olmayabilir ya da eşler değeri sıfır uzunlukta olabilir.

source: While compact response support is optional for both clients and trackers, it is highly recommended as it reduces the nominal response size by over 90&#37;.
pt: Embora o suporte de resposta compacta seja opcional para clientes e rastreadores, ele é altamente recomendado, pois reduz o tamanho nominal da resposta em mais de 90&#37;.
tr: Kısa yanıt desteğinin kullanımı istemciler ve izleyiciler için isteğe bağlı olsa da, normal yanıt boyutunu 90&#37; kadar azalttığı için kullanılması önemle önerilir.

source: Destination Enforcement
pt: Aplicação do Destino
tr: Hedef Dayatma

source: Some, but not all, I2P bittorrent clients announce over their own tunnels. Trackers may choose to prevent spoofing by requiring this, and verifying the client's <a href="%(commonstructures)s#struct_Destination">Destination</a> using HTTP headers added by the I2PTunnel HTTP Server tunnel. The headers are X-I2P-DestHash, X-I2P-DestB64, and X-I2P-DestB32, which are different formats for the same information. These headers cannot be spoofed by the client. A tracker enforcing destinations need not require the ip announce parameter at all.
pt: Alguns, mas não todos, clientes I2P bittorrent anunciam em seus próprios túneis. Os rastreadores podem escolher impedir a falsificação exigindo isso e verificando o <a href="%(commonstructures)s#struct_Destination">Destino</a> do cliente usando cabeçalhos HTTP adicionados pelo túnel do servidor HTTP I2PTunnel. Os cabeçalhos são X-I2P-DestHash, X-I2P-DestB64 e X-I2P-DestB32, que são formatos diferentes para as mesmas informações. Esses cabeçalhos não podem ser falsificados pelo cliente. Um rastreador que impõe destinos não precisa exigir o parâmetro ip announce.
tr: Hepsi olmasa da bazı I2P bittorrent istemcileri kendi tünelleri üzerinden duyuru yapar. İzleyiciler, bunu zorunlu kılarak ve I2PTunnel HTTP sunucusu tüneli tarafından eklenen HTTP üst bilgilerini kullanarak istemcinin <a href="%(commonstructures)s#struct_Destination">Hedefini</a> doğrulamayı ve sızdırılmasını önlemeyi seçebilirler. Üst bilgiler, aynı bilgi için farklı X-I2P-DestHash, X-I2P-DestB64 ve X-I2P-DestB32 biçimlerindedir. Bu üst bilgiler istemci tarafından taklit edilemez. Hedefleri zorunlu kılan bir izleyici IP duyuru parametresine gerek duymaz.

source: As several clients use the HTTP proxy instead of their own tunnel for announces, destination enforcement will prevent usage by those clients unless or until those clients are converted to announcing over their own tunnel.
pt: Como vários clientes usam o proxy HTTP em vez de seu próprio túnel para anúncios, a imposição de destino impedirá o uso por esses clientes, a menos que ou até que esses clientes sejam convertidos para anúncios em seu próprio túnel.
tr: Birkaç istemci, duyurular için kendi tünelleri yerine HTTP vekil sunucusunu kullandığından, hedefleri zorunlu kılmak, kendi tünelleri üzerinden duyuru yapmaya dönüştürülmemiş istemciler tarafından kullanılmasını önler.

source: Unfortunately, as the network grows, so will the amount of maliciousness, so we expect that all trackers will eventually enforce destinations. Both tracker and client developers should anticipate it.
pt: Infelizmente, à medida que a rede cresce, a quantidade de malícia também cresce, então esperamos que todos os rastreadores eventualmente imponham destinos. Tanto os desenvolvedores de rastreadores quanto os de clientes devem prever isso.
tr: Ne yazık ki, ağ büyüdükçe kötü niyetli davranış miktarı da artacak. Bu nedenle sonunda tüm izleyicilerin hedefleri zorunlu kılmasını bekliyoruz. Hem izleyici hem de istemci geliştiricileri bunu öngörmelidir.

source: Announce Host Names
pt: Anunciar nomes de anfitriões
tr: Sunucu Adlarını Duyurma

source: Announce URL host names in torrent files generally follow the <a href="%(naming)s">I2P naming standards</a>. In addition to host names from address books and ".b32.i2p" Base 32 hostnames, the full Base 64 Destination (with [or without?] ".i2p" appended) should be supported. Non-open trackers should recognize their own host name in any of these formats.
pt: Os nomes de host de URL anunciados em arquivos torrent geralmente seguem os padrões de nomenclatura I2P <a href="%(naming)s"></a>. Além dos nomes de host dos catálogos de endereços e nomes de host Base 32 ".b32.i2p", o Destino Base 64 completo (com [ou sem?] ".i2p" anexado) deve ser suportado. Rastreadores não abertos devem reconhecer seu próprio nome de host em qualquer um desses formatos.
tr: Torrent dosyalarındaki adres sunucu adlarını duyurusu, genellikle <a href="%(naming)s">I2P adlandırma standartlarını</a> izler. Adres defterlerindeki sunucu adlarına ve ".b32.i2p" Base 32 sunucu adlarına ek olarak, tam Base 64 hedefi (".i2p" eklenmiş [ya da eklenmemiş?]) desteklenmelidir. Açık olmayan izleyiciler, bu biçimlerden herhangi birinde kendi sunucu adlarını tanımalıdır.

source: To preserve anonymity, clients should generally ignore non-I2P announce URLs in torrent files.
pt: Para preservar o anonimato, os clientes geralmente devem ignorar URLs de anúncios não-I2P em arquivos torrent.
tr: Anonimliği korumak için, istemciler genellikle torrent dosyalarındaki I2P olmayan duyuru adreslerini yok saymalıdır.

source: Client Connections
pt: Conexões dos Clientes
tr: İstemci Bağlantıları

source: Client-to-client connections use the standard protocol over TCP. There are no known I2P clients that currently support uTP communication.
pt: As conexões cliente-cliente usam o protocolo padrão sobre TCP. Não há clientes I2P conhecidos que atualmente suportem comunicação uTP.
tr: İstemciden istemciye bağlantılar, standart TCP üzerinden iletişim kuralını kullanır. Şu anda bilinen bir uTP iletişimi destekleyen I2P istemcisi yok.

source: I2P uses 387+ byte <a href="%(commonstructures)s#struct_Destination">Destinations</a> for addresses, as explained above.
pt: O I2P usa 387+ bytes <a href="%(commonstructures)s#struct_Destination">Destinos</a> para endereços, conforme explicado acima.
tr: I2P, yukarıda açıklandığı gibi adresler için 387+ bayt <a href="%(commonstructures)s#struct_Destination">Hedefler</a> kullanır.

source: If the client has only the hash of the destination (such as from a compact response or PEX), it must perform a lookup by encoding it with Base 32, appending ".b32.i2p", and querying the Naming Service, which will return the full Destination if available.
pt: Se o cliente tiver apenas o hash do destino (como de uma resposta compacta ou PEX), ele deverá executar uma pesquisa codificando-o com Base 32, anexando ".b32.i2p" e consultando o Serviço de Nomenclatura, , que retornará o Destino completo, se disponível.
tr: İstemci yalnızca hedefin karma değerine sahipse (bir kısa yanıt ya da PEX gibi), bunu Base 32 ile kodlayıp, ".b32.i2p" ekleyerek, varsa tam hedefi döndürecek olan adlandırma hizmetini sorgulayan bir arama yapmalıdır.

source: If the client has a peer's full Destination it received in a non-compact response, it should use it directly in the connection setup. Do not convert a Destination back to a Base 32 hash for lookup, this is quite inefficient.
pt: Se o cliente tiver o Destino completo de um peer recebido em uma resposta não compacta, ele deverá usá-lo diretamente na configuração da conexão. Não converta um Destino de volta para um hash Base 32 para pesquisa, isso é bastante ineficiente.
tr: İstemci, kısa olmayan bir yanıtta aldığı bir eşin tam Hedefine sahipse, bunu doğrudan bağlantı kurulumunda kullanmalıdır. Arama için bir Hedefi tekrar Base 32 karma değerine dönüştürmeyin, bu oldukça verimsiz olur.

source: Cross-Network Prevention
pt: Prevenção entre redes
tr: Ağ Geçişini Engelleme

source: To preserve anonymity, I2P bittorrent clients generally do not support non-I2P announces or peer connections. I2P HTTP outproxies often block announces. There are no known SOCKS outproxies supporting bittorrent traffic.
pt: Para preservar o anonimato, clientes bittorrent I2P geralmente não suportam anúncios não-I2P ou conexões de pares. Os outproxies HTTP I2P geralmente bloqueiam anúncios. Não há outproxies SOCKS conhecidos que suportem tráfego bittorrent.
tr: Anonimliği korumak için, I2P bittorrent istemcileri genellikle I2P dışındaki duyuruları ya da eş bağlantıları desteklemez. I2P HTTP vekil sunucuları genellikle duyuruları engeller. Bilinen bir Bittorrent trafiği destekleyen SOCKS vekil sunucusu yok.

source: To prevent usage by non-I2P clients via an HTTP inproxy, I2P trackers often block accesses or announces that contain an X-Forwarded-For HTTP header. Trackers should reject standard network announces with IPv4 or IPv6 IPs, and not deliver them in responses.
pt: Para evitar o uso por clientes não I2P por meio de um proxy HTTP, os rastreadores I2P geralmente bloqueiam acessos ou anúncios que contêm um cabeçalho HTTP X-Forwarded-For. Os rastreadores devem rejeitar anúncios de rede padrão com IPs IPv4 ou IPv6 e não entregá-los em respostas.
tr: I2P olmayan istemcilerin bir HTTP vekil sunucusu aracılığıyla kullanılmasını önlemek için, I2P izleyicileri genellikle bir X-Forwarded-For HTTP üst bilgisi içeren erişimleri veya duyuruları engeller. İzleyiciler, IPv4 veya IPv6 IP adresleri olan standart ağ duyurularını reddetmeli ve bunları yanıt olarak aktarmamalıdır.

source: I2P PEX is based on ut_pex. As there does not appear to be a formal specification of ut_pex available, it may be necessary to review the libtorrent source for assistance. It is an extension message, identified as "i2p_pex" in <a href="http://www.bittorrent.org/beps/bep_0010.html">the extension handshake</a>. It contains a bencoded dictionary with up to 3 keys, "added", "added.f", and "dropped". The added and dropped values are each a single byte string, whose length is a multiple of 32 bytes. These byte strings are the concatenated SHA-256 Hashes of the binary <a href="%(commonstructures)s#struct_Destination">Destinations</a> of the peers. This is the same format as the peers dictionary value in the i2p compact response format specified above. The added.f value, if present, is the same as in ut_pex.
pt: O I2P PEX é baseado em ut_pex. Como não parece haver uma especificação formal de ut_pex disponível, pode ser necessário revisar a fonte libtorrent para obter assistência. É uma mensagem de extensão, identificada como "i2p_pex" em <a href="http://www.bittorrent.org/beps/bep_0010.html">o handshake de extensão</a>. Ele contém um dicionário codificado com até 3 chaves, "added", "added.f" e "dropped". Os valores adicionados e descartados são cada um uma única sequência de bytes, cujo comprimento é um múltiplo de 32 bytes. Essas sequências de bytes são os Hashes SHA-256 concatenados dos Destinos binários <a href="%(commonstructures)s#struct_Destination"></a> dos pares. Este é o mesmo formato que o valor do dicionário de pares no formato de resposta compacto i2p especificado acima. O valor added.f, se presente, é o mesmo que em ut_pex.
tr: I2P PEX, temel olarak ut_pex kullanır. Resmi bir ut_pex teknik özelliği varmış gibi görünmediğinden, yardım almak için libtorrent kaynağına bakmak gerekebilir. <a href="http://www.bittorrent.org/beps/bep_0010.html">eklenti el sıkışmasında</a> "i2p_pex" olarak tanımlanan bir eklenti iletisidir. "added", "added.f" ve "dropped" olmak üzere 3 anahtara kadar kodlanmış bir sözlük içerir. Eklenen ve bırakılan değerlerin her biri, uzunluğu 32 baytın katı olan tek bir bayt dizgesidir. Bu bayt dizgeleri, eşlerin ikili <a href="%(commonstructures)s#struct_Destination">hedeflerinin</a> birleştirilmiş SHA-256 karmalarıdır. Bu, yukarıda belirtilen i2p eşlerinin kısa yanıt biçimindeki sözlük değeriyle aynı biçimdedir. added.f değeri, varsa, ut_pex üzerindekiyle aynıdır.

source: DHT support is included in the i2psnark client as of version 0.9.2. Preliminary differences from <a href="http://www.bittorrent.org/beps/bep_0005.html">BEP 5</a> are described below, and are subject to change. Contact the I2P developers if you wish to develop a client supporting DHT.
pt: O suporte a DHT está incluído no cliente i2psnark a partir da versão 0.9.2. As diferenças preliminares de <a href="http://www.bittorrent.org/beps/bep_0005.html">BEP 5</a> são descritas abaixo e estão sujeitas a alterações. Entre em contato com os desenvolvedores do I2P se desejar desenvolver um cliente com suporte a DHT.
tr: "Dağıtılmış karma tablosu" (DHT) desteği, 0.9.2 sürümünden başlayarak i2psnark istemcisine eklenmiştir. <a href="http://www.bittorrent.org/beps/bep_0005.html">BEP 5</a> ile öngörülen farklılıklar aşağıda açıklanmıştır ve değişebilir. "Dağıtılmış karma tablosu" (DHT) destekleyen bir istemci geliştirmek istiyorsanız I2P geliştiricileri ile görüşün.

source: Unlike standard DHT, I2P DHT does not use a bit in the options handshake, or the PORT message. It is advertised with an extension message, identified as "i2p_dht" in <a href="http://www.bittorrent.org/beps/bep_0010.html">the extension handshake</a>. It contains a bencoded dictionary with two keys, "port" and "rport", both integers.
pt: Diferentemente do DHT padrão, o I2P DHT não usa um bit no handshake de opções ou na mensagem PORT. Ele é anunciado com uma mensagem de extensão, identificada como "i2p_dht" em <a href="http://www.bittorrent.org/beps/bep_0010.html">o handshake de extensão</a>. Ele contém um dicionário codificado com duas chaves, "port" e "rport", ambas inteiras.
tr: Standart "Dağıtılmış karma tablosu" (DHT) ile farklı olarak, I2P "Dağıtılmış karma tablosu" (DHT), el sıkışma seçeneklerinde veya PORT iletisinde bir bit kullanmaz. <a href="http://www.bittorrent.org/beps/bep_0010.html">Eklenti el sıkışmasında</a> "i2p_dht" olarak tanımlanan bir eklenti iletisiyle tanıtılır. Her ikisi de tamsayı olan "port" ve "rport" olmak üzere iki anahtarlı kodlanmış bir sözlük içerir.

source: The UDP (datagram) port listed in the compact node info is used to receive repliable (signed) datagrams. This is used for queries, except for announces. We call this the "query port". This is the "port" value from the extension message. Queries use <a href="%(i2cp_pages)s">I2CP</a> protocol number 17.
pt: A porta UDP (datagrama) listada nas informações do nó compacto é usada para receber datagramas confiáveis (assinados). Ela é usada para consultas, exceto para anúncios. Nós a chamamos de "porta de consulta". Este é o valor de "porta" da mensagem de extensão. As consultas usam <a href="%(i2cp_pages)s">I2CP</a> número de protocolo 17.
tr: Kısa düğüm bilgisinde listelenen UDP veri şeması) bağlantı noktası, yinelenebilir (imzalı) veri şemalarını almak için kullanılır. Bu, duyurular dışında sorgular için kullanılır. Buna "sorgu bağlantı noktası" diyoruz. Bu, eklenti iletisindeki "port" değeridir. Sorgular, 17 numaralı <a href="%(i2cp_pages)s">I2CP</a> iletişim kuralını kullanır.

source: In addition to that UDP port, we use a second datagram port equal to the query port + 1. This is used to receive unsigned (raw) datagrams for replies, errors, and announces. This port provides increased efficiency since replies contain tokens sent in the query, and need not be signed. We call this the "response port". This is the "rport" value from the extension message. It must be 1 + the query port. Responses and announces use <a href="%(i2cp_pages)s">I2CP</a> protocol number 18.
pt: Além dessa porta UDP, usamos uma segunda porta de datagrama igual à porta de consulta + 1. Ela é usada para receber datagramas não assinados (brutos) para respostas, erros e anúncios. Esta porta fornece maior eficiência, pois as respostas contêm tokens enviados na consulta e não precisam ser assinados. Chamamos isso de "porta de resposta". Este é o valor "rport" da mensagem de extensão. Deve ser 1 + a porta de consulta. Respostas e anúncios usam <a href="%(i2cp_pages)s">I2CP</a> número de protocolo 18.
tr: Bu UDP bağlantı noktasına ek olarak, sorgu bağlantı noktası + 1 değerine eşit ikinci bir veri birimi bağlantı noktası kullanıyoruz. Bu bağlantı noktası, yanıtlar, hatalar ve duyurular için imzasız (ham) veri birimlerini almak için kullanılıyor. Yanıtlar sorguda gönderilen belirteçleri içerdiğinden ve imzalanması gerekmediğinden bu bağlantı noktası verimliliği artırır. Buna "yanıt bağlantı noktası" diyoruz. Bu, eklenti iletisindeki "rport" değeridir. 1 + sorgu bağlantı noktası olmalıdır. Yanıtlar ve duyurular, 18 numaralı <a href="%(i2cp_pages)s">I2CP</a> iletişim kuralını kullanır.

source: Compact peer info is 32 bytes (32 byte SHA256 Hash) instead of 4 byte IP + 2 byte port. There is no peer port. In a response, the "values" key is a list of strings, each containing a single compact peer info.
pt: As informações compactas de peer são 32 bytes (hash SHA256 de 32 bytes) em vez de 4 bytes de IP + 2 bytes de porta. Não há porta de peer. Em uma resposta, a chave "values" é uma lista de strings, cada uma contendo uma única informação compacta de peer.
tr: Kısa eş bilgisi 4 bayt IP + 2 bayt bağlantı noktası yerine 32 bayttır (32 bayt SHA-256 karma). Eş bağlantı noktası yoktur. Bir yanıtta, "değerler" anahtarı, her biri tek bir kısa eş bilgisi içeren dizgelerin bir listesidir.

source: Compact node info is 54 bytes (20 byte Node ID + 32 byte SHA256 Hash + 2 byte port) instead of 20 byte Node ID + 4 byte IP + 2 byte port. In a response, the "nodes" key is a single byte string with concatenated compact node info.
pt: As informações do nó compacto têm 54 bytes (ID do nó de 20 bytes + Hash SHA256 de 32 bytes + porta de 2 bytes) em vez de ID do nó de 20 bytes + IP de 4 bytes + porta de 2 bytes. Em uma resposta, a chave "nodes" é uma string de byte único com informações do nó compacto concatenadas.
tr: Kısa düğüm bilgisi, 20 bayt düğüm kodu + 4 bayt IP + 2 bayt bağlantı noktası yerine 54 bayttır (20 bayt düğüm kodu + 32 bayt SHA-256 karması + 2 bayt bağlantı noktası). Bir yanıtta, "düğümler" anahtarı, birleştirilmiş kısa düğüm bilgisini içeren tek baytlık bir dizgedir.

source: Secure node ID requirement: To make various DHT attacks more difficult, the first 4 bytes of the Node ID must match the first 4 bytes of the destination Hash, and the next two bytes of the Node ID must match the next two bytes of the destination hash exclusive-ORed with the port.
pt: Requisito de ID de nó seguro: para dificultar vários ataques DHT, os primeiros 4 bytes do ID do nó devem corresponder aos primeiros 4 bytes do hash de destino, e os próximos dois bytes do ID do nó devem corresponder aos próximos dois bytes do hash de destino em OR exclusivo com a porta.
tr: Güvenli düğüm kimliği gereksinimi: Çeşitli "Dağıtılmış karma tablosu" (DHT) saldırılarını daha zor hale getirmek için, düğüm kimliğinin ilk 4 baytı, hedef karmasının ilk 4 baytı ile eşleşmelidir ve düğüm kimliğinin sonraki iki baytı, hedef karmasının bağlantı noktası ile exclusive-ORed değerinin sonraki iki baytı ile eşleşmelidir.

source: In a torrent file, the trackerless torrent dictionary "nodes" key is TBD. It could be a list of 32 byte binary strings (SHA256 Hashes) instead of a list of lists containing a host string and a port integer. Alternatives: A single byte string with concatenated hashes, or a list of strings alone.
pt: Em um arquivo torrent, a chave "nodes" do dicionário torrent sem rastreador é TBD. Poderia ser uma lista de strings binárias de 32 bytes (hashes SHA256) em vez de uma lista de listas contendo uma string de host e um inteiro de porta. Alternativas: Uma string de byte único com hashes concatenados, ou uma lista de strings sozinhas.
tr: Bir torrent dosyasında, izleyicisiz torrent sözlüğü "düğümler" anahtarı TBD'dir. Bir sunucu dizgesi ve bir bağlantı noktası tamsayısını içeren bir liste listesi yerine 32 baytlık ikili dizgelerin (SHA-256 karmaları) bir listesi olabilir. Alternatifler: Birleştirilmiş karmalara sahip tek bir bayt dizgesi ya da yalnızca dizgelerin bir listesi.

source: Datagram (UDP) Trackers
pt: Rastreadores de Datagrama (UDP)
tr: Veri Şeması (UDP) İzleyicileri

source: UDP tracker support in clients and trackers is not yet available. Preliminary differences from <a href="http://www.bittorrent.org/beps/bep_0015.html">BEP 15</a> are described below, and are subject to change. Contact the I2P developers if you wish to develop a client or tracker supporting datagram announces.
pt: O suporte ao rastreador UDP em clientes e rastreadores ainda não está disponível. As diferenças preliminares de <a href="http://www.bittorrent.org/beps/bep_0015.html">BEP 15</a> são descritas abaixo e estão sujeitas a alterações. Entre em contato com os desenvolvedores do I2P se desejar desenvolver um cliente ou rastreador que suporte anúncios de datagramas.
tr: İstemcilerde ve izleyicilerde henüz UDP izleyici desteği bulunmuyor. <a href="http://www.bittorrent.org/beps/bep_0015.html">BEP 15</a> ile öngörülen farklılıklar aşağıda açıklanmıştır ve değişebilir. Veri şeması duyurularını destekleyen bir istemci veya izleyici geliştirmek istiyorsanız, I2P geliştiricileri ile görüşün.

source: See <a href="%(prop160)s">Proposal 160</a>.
pt: Veja <a href="%(prop160)s">Proposta 160</a>.
tr: <a href="%(prop160)s">160. öneri</a> bölümüne bakın.

source: Additional Information
pt: Informação Adicional
tr: Ek Bilgiler

source: I2P bittorrent standards are generally discussed on <a href="http://%(zzz)s/">%(zzz)s</a>.
pt: Os padrões I2P bittorrent são geralmente discutidos em <a href="http://%(zzz)s/">%(zzz)s</a>.
tr: I2P bittorrent standartları genellikle <a href="http://%(zzz)s/">%(zzz)s</a> üzerinde tartışılır.

source: A chart of current tracker software capabilities is <a href="http://%(zzz)s/files/trackers.html">also available there</a>.
pt: Um gráfico dos recursos atuais do software rastreador também está disponível lá <a href="http://%(zzz)s/files/trackers.html"></a>.
tr: Geçerli izleyici yazılımının yeteneklerinin çizelgesi <a href="http://%(zzz)s/files/trackers.html">buradan da görülebilir</a>.
