Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: The padding strategies can be used on a variety of levels, addressing the exposure of message size information to different adversaries. The current fixed tunnel message size is 1024 bytes. Within this however, the fragmented messages themselves are not padded by the tunnel at all, though for end to end messages, they may be padded as part of the garlic wrapping.
pt: As estratégias de preenchimento podem ser usadas em vários níveis, abordando a exposição de informações de tamanho de mensagem para diferentes adversários. O tamanho atual da mensagem de túnel fixo é de 1024 bytes. Dentro disso, no entanto, as mensagens fragmentadas em si não são preenchidas pelo túnel, embora para mensagens de ponta a ponta , elas possam ser preenchidas como parte do envoltório de alho.
tr: Dolgu ekleme stratejileri, ileti boyutu bilgilerinin farklı saldırganlar tarafından görülmesini ele alarak çeşitli düzeylerde kullanılabilir. Geçerli sabit tünel iletisinin boyutu 1024 bayttır. Bununla birlikte, bunun içinde, parçalanmış iletilerin kendilerine tünel tarafından herhangi bir dolgu eklenmez. Ancak uçtan uca iletiler için Garlic sarmalamasının bir parçası olarak dolgu eklenebilir.

source: WRED strategies have a significant impact on end-to-end performance, and prevention of network congestion collapse. The current WRED strategy should be carefully evaluated and improved.
pt: As estratégias WRED têm um impacto significativo no desempenho de ponta a ponta, e na prevenção do colapso do congestionamento da rede. A estratégia WRED atual deve ser cuidadosamente avaliada e aprimorada.
tr: WRED stratejilerinin, uçtan uca başarım ve ağ tıkanıklığı çöküşünün önlenmesi üzerinde önemli bir etkisi vardır. Geçerli WRED stratejisi dikkatle değerlendirilmeli ve geliştirilmelidir.

source: Old Tunnel Implementation
pt: Implementação do Túnel Antigo
tr: Eski Tünel Uygulaması

source: Note: Obsolete - NOT used! Replaced in 0.6.1.10 - see <a href="%(tunnelimpl)s">here</a> for the current implementation
pt: Nota: Obsoleto - NÃO usado! Substituído em 0.6.1.10 - veja <a href="%(tunnelimpl)s">aqui</a> para a implementação atual
tr: Not: Eski - KULLANILMIYOR! 0.6.1.10 sürümünde değiştirildi. Güncel uygulama için <a href="%(tunnelimpl)s">buraya</a> bakabilirsiniz

source: November 2016
pt: Novembro de 2016
tr: 2016 Kasım

source: This page describes the origins and design of I2P's unidirectional tunnels. For further information see:
pt: Esta página descreve as origens e o design dos túneis unidirecionais do I2P. Para mais informações, consulte:
tr: Bu sayfa, çift yönlü I2P tünellerinin kökenlerini ve tasarımını açıklar. Ayrıntılı bilgi almak için şuraya bakabilirsiniz:

source: Tunnel overview page
pt: Página de visão geral do túnel
tr: Tünel özeti sayfası

source: Tunnel design discussion
pt: Discussão sobre o projeto do túnel
tr: Tünel tasarımı tartışması

source: Peer selection
pt: Seleção de ponto
tr: Eş seçimi

source: Meeting 125 (~13:12-13:30)
pt: Encontro 125 (~13:12-13:30)
tr: Toplantı 125 (~13:12-13:30)

source: Review
pt: Rever
tr: Gözden geçirme

source: While we aren't aware of any published research on the advantages of unidirecdtional tunnels, they appear to make it harder to detect a request/response pattern, which is quite possible to detect over a bidirectional tunnel. Several apps and protocols, notably HTTP, do transfer data in such manner. Having the traffic follow the same route to its destination and back could make it easier for an attacker who has only timing and traffic volume data to infer the path a tunnel is taking. Having the response come back along a different path arguably makes it harder.
pt: Embora não tenhamos conhecimento de nenhuma pesquisa publicada sobre as vantagens dos túneis unidirecionais , eles parecem dificultar a detecção de um padrão de solicitação/resposta, o que é bem possível de detectar em um túnel bidirecional. Vários aplicativos e protocolos, notavelmente HTTP, transferem dados dessa maneira. Ter o tráfego seguindo a mesma rota para seu destino e de volta pode tornar mais fácil para um invasor que tem apenas dados de tempo e volume de tráfego inferir o caminho que um túnel está tomando. Ter a resposta retornando por um caminho diferente, sem dúvida torna isso mais difícil.
tr: Tek yönlü tünellerin avantajları hakkında yayınlanmış herhangi bir araştırma hakkında bilgi sahibi olmasak da, çift yönlü bir tünel üzerinden algılanabilecek bir istek/yanıt modelinin algılanmasını zorlaştırıyor gibi görünüyor. Birçok uygulama ve iletişim kuralı, özellikle HTTP, verileri bu şekilde aktarır. Trafiğin hedefe doğru ve hedeften geriye doğru aynı rotayı izlemesi, yalnızca zamanlama ve trafik hacmi verilerine sahip bir saldırganın bir tünelin izlediği yolu belirlemesini kolaylaştırabilir. Yanıtın farklı bir yoldan geri gelmesi tartışmaya açık olsa da bu belirlemeyi zorlaştırır.

source: When dealing with an internal adversary or most external adversaries, I2P's undirectional tunnels expose half as much traffic data than would be exposed with bidirectional circuits by simply looking at the flows themselves - an HTTP request and response would follow the same path in Tor, while in I2P the packets making up the request would go out through one or more outbound tunnels and the packets making up the response would come back through one or more different inbound tunnels.
pt: Ao lidar com um adversário interno ou a maioria dos adversários externos, os túneis unidirecionais do I2P expõem metade dos dados de tráfego que seriam expostos com circuitos bidirecionais simplesmente observando os fluxos em si - uma solicitação e resposta HTTP seguiriam o mesmo caminho no Tor, enquanto no I2P os pacotes que compõem a solicitação sairiam por um ou mais túneis de saída e os pacotes que compõem a resposta retornariam por um ou mais túneis de entrada diferentes.
tr: Bir iç saldırganla veya çoğu dış saldırganla uğraşırken, I2P ağının yönü olmayan tünelleri, yalnızca akışların kendilerine bakarak çift yönlü devrelerde olacağının yarısı kadar trafik verisi oluşturur. Bir HTTP isteği ve yanıtı Tor üzerinde aynı yolu izler. I2P, isteği oluşturan paketler bir ya da birkaç gidiş tünelinden dışarı çıkar ve yanıtı oluşturan paketler bir ya da birkaç farklı geliş tünelinden geri gelir.

source: The strategy of using two separate tunnels for inbound and outbound communication is not the only technique available, and it does have anonymity implications. On the positive side, by using separate tunnels it lessens the traffic data exposed for analysis to participants in a tunnel - for instance, peers in an outbound tunnel from a web browser would only see the traffic of an HTTP GET, while the peers in an inbound tunnel would see the payload delivered along the tunnel. With bidirectional tunnels, all participants would have access to the fact that e.g. 1KB was sent in one direction, then 100KB in the other. On the negative side, using unidirectional tunnels means that there are two sets of peers which need to be profiled and accounted for, and additional care must be taken to address the increased speed of predecessor attacks. The tunnel pooling and building process (peer selection and ordering strategies) should minimize the worries of the predecessor attack.
pt: A estratégia de usar dois túneis separados para comunicação de entrada e saída não é a única técnica disponível, e tem implicações de anonimato . No lado positivo, usar túneis separados diminui os dados de tráfego expostos para análise aos participantes em um túnel - por exemplo, pares em um túnel de saída de um navegador da web veriam apenas o tráfego de um HTTP GET, enquanto os pares em um túnel de entrada veriam a carga útil entregue ao longo do túnel. Com túneis bidirecionais, todos os participantes teriam acesso ao fato de que, por exemplo, 1 KB foi enviado em uma direção, então 100 KB na outra. No lado negativo, usar túneis unidirecionais significa que há dois conjuntos de pares que precisam ser perfilados e contabilizados, e cuidado adicional deve ser tomado para lidar com a velocidade aumentada de ataques predecessores . O processo de pooling e construção de túneis (estratégias de seleção e ordenação de pares) deve minimizar as preocupações do ataque predecessor.
tr: Geliş ve gidiş iletişimleri için iki ayrı tünel kullanma stratejisi, var olan tek teknik değildir ve anonimlik etkileri vardır. Olumlu tarafı, ayrı tüneller kullanmak, bir tüneldeki katılımcıların analiz yapabileceği trafik verilerini azaltır. Örneğin, bir tarayıcıdan bir gidiş tünelindeki eşler yalnızca bir HTTP GET trafiğini görürken, bir geliş tüneli, tünel boyunca teslim edilen yükü görür. Çift yönlü tünellerle, tüm katılımcılar, örneğin bir yöne 1KB, diğer yöne 100KB gönderildiğini görebilir. Olumsuz tarafı, tek yönlü tünellerin kullanılması, profilinin çıkarılması ve hesaba katılması gereken iki eş grubunın olması ve önceki saldırıların artan hızına yönelik ek özen gösterilmesinin gerekmesidir. Tünel havuzlama ve oluşturma süreci (eş seçimi ve sıralama stratejileri), öncül saldırı endişelerini en aza indirmelidir.

source: Anonymity
pt: Anonimato
tr: Anonimlik

source: A recent <a href="%(pdf)s">paper by Hermann and Grothoff</a> declared that I2P's unidirectional tunnels "seems to be a bad design decision".
pt: Um artigo recente <a href="%(pdf)s">de Hermann e Grothoff</a> declarou que os túneis unidirecionais do I2P "parecem ser uma má decisão de projeto".
tr: Yakın zamanda yayınlanmış olan <a href="%(pdf)s">Hermann ve Grothoff makalesi</a>, I2P ağının tek yönlü tünellerinin "kötü bir tasarım kararı gibi göründüğünü" belirtiyor.

source: The paper's main point is that deanonymizations on unidirectional tunnels take a longer time, which is an advantage, but that an attacker can be more certain in the unidirectional case. Therefore, the paper claims it isn't an advantage at all, but a disadvantage, at least with long-living I2P Sites.
pt: O ponto principal do artigo é que desanonimizações em túneis unidirecionais levam mais tempo, o que é uma vantagem, mas que um invasor pode ter mais certeza no caso unidirecional. Portanto, o artigo afirma que não é uma vantagem, mas uma desvantagem, pelo menos com sites I2P de longa duração.
tr: Makalenin ana noktası, tek yönlü tünellerdeki anonimleştirmelerin daha uzun zaman alması ve bir avantaj sağlaması, ancak tek yönlü tünellerde bir saldırganın daha emin olabileceğidir. Bu nedenle, makale bunun bir avantaj olmadığını, en azından uzun ömürlü I2P sitelerinde bir dezavantaj olduğunu iddia ediyor.

source: This conclusion is not fully supported by the paper. Unidirectional tunnels clearly mitigate other attacks and it's not clear how to trade off the risk of the attack in the paper with attacks on a bidirectional tunnel architecture.
pt: Esta conclusão não é totalmente suportada pelo artigo. Túneis unidirecionais claramente mitigam outros ataques e não está claro como negociar o risco do ataque no artigo com ataques em uma arquitetura de túnel bidirecional.
tr: Bu sonuç makale tarafından tam olarak desteklenmiyor. Tek yönlü tüneller, açıkça diğer saldırıları azaltır ve makaledeki saldırı riskinin çift yönlü bir tünel mimarisine yapılan saldırılarla bedelinin nasıl ödeneceği açık değildir.

source: This conclusion is based on an arbitrary certainty vs. time weighting (tradeoff) that may not be applicable in all cases. For example, somebody could make a list of possible IPs then issue subpoenas to each. Or the attacker could DDoS each in turn and via a simple intersection attack see if the I2P Site goes down or is slowed down. So close may be good enough, or time may be more important.
pt: Esta conclusão é baseada em uma certeza arbitrária vs. ponderação de tempo (tradeoff) que pode não ser aplicável em todos os casos. Por exemplo, alguém poderia fazer uma lista de IPs possíveis e então emitir intimações para cada. Ou o invasor poderia fazer DDoS em cada um deles e por meio de um simples ataque de interseção ver se o Site I2P cai ou fica mais lento. Então, fechar pode ser bom o suficiente, ou o tempo pode ser mais importante.
tr: Bu sonuç, her durumda geçerli olmayabilecek keyfi bir kesinliğe karşı zaman ağırlığına (bedel ödeme) dayanmaktadır. Örneğin, biri olası IP adreslerinin bir listesini yapabilir ve ardından her birine bir mahkeme celbi gönderebilir. Veya saldırgan sırayla DDoS yapabilir ve basit bir kavşak saldırısı yoluyla I2P sitesinin kapanıp kapanmadığını görebilir. Bu kadar yakınlık yeterince iyi olabilir veya zaman daha önemli olabilir.

source: The conclusion is based on a specific weighting of the importance of certainty vs. time, and that weighting may be wrong, and it's definitely debatable, especially in a real world with subpoenas, search warrants, and other methods available for final confirmation.
pt: A conclusão é baseada em uma ponderação específica da importância da certeza vs. tempo, e essa ponderação pode estar errada, e é definitivamente discutível, especialmente em um mundo real com intimações, mandados de busca e outros métodos disponíveis para confirmação final.
tr: Sonuç, kesinliğin zamana karşı belirli bir şekilde ağırlığının belirlenmesine dayanmaktadır ve bu ağırlık değerlendirmesi yanlış olabilir. Özellikle mahkeme celbi, arama emri ve nihai onay için geçerli diğer yöntemlerin bulunduğu gerçek dünya örneğinde kesinlikle tartışmalıdır.

source: A full analysis of the tradeoffs of unidirectional vs. bidirectional tunnels is clearly outside the scope of the paper, and has not been done elsewhere. For example, how does this attack compare to the numerous possible timing attacks published about onion-routed networks? Clearly the authors have not done that analysis, if it's even possible to do it effectively.
pt: Uma análise completa das compensações de túneis unidirecionais vs. bidirecionais está claramente fora do escopo do artigo e não foi feita em nenhum outro lugar. Por exemplo, como esse ataque se compara aos numerosos ataques de temporização possíveis publicados sobre redes roteadas por onion? Claramente, os autores não fizeram essa análise, se é que é possível fazê-la efetivamente.
tr: Tek yönlü ve çift yönlü tünellerin bedellerinin ödenmesinin tam bir analizi, açıkça makalenin kapsamı dışındadır ve başka bir yerde yapılmamıştır. Örneğin, bu saldırı, Onion yöneltmeli ağlar hakkında yayınlanan çok sayıda olası zamanlama saldırısıyla nasıl karşılaştırılır? Yazarların, etkili bir şekilde yapılabilecek olsa bile, bu analizi yapmadıkları görülebilir.

source: Tor uses bidirectional tunnels and has had a lot of academic review. I2P uses unidirectional tunnels and has had very little review. Does the lack of a research paper defending unidirectional tunnels mean that it is a poor design choice, or just that it needs more study? Timing attacks and distributed attacks are difficult to defend against in both I2P and Tor. The design intent (see references above) was that unidirectional tunnels are more resistant to timing attacks. However, the paper presents a somewhat different type of timing attack. Is this attack, innovative as it is, sufficient to label I2P's tunnel architecture (and thus I2P as a whole) a "bad design", and by implication clearly inferior to Tor, or is it just a design alternative that clearly needs further investigation and analysis? There are several other reasons to consider I2P currently inferior to Tor and other projects (small network size, lack of funding, lack of review) but is unidirectional tunnels really a reason?
pt: Tor usa túneis bidirecionais e teve muita revisão acadêmica. I2P usa túneis unidirecionais e teve muito pouca revisão. A falta de um artigo de pesquisa defendendo túneis unidirecionais significa que é uma escolha de design ruim ou apenas que precisa de mais estudo? Ataques de temporização e ataques distribuídos são difíceis de se defender tanto no I2P quanto no Tor. A intenção do design (veja as referências acima) era que os túneis unidirecionais são mais resistentes a ataques de temporização. No entanto, o artigo apresenta um tipo um pouco diferente de ataque de temporização . Este ataque, inovador como é, é suficiente para rotular a arquitetura de túnel do I2P (e, portanto, o I2P como um todo) como um "design ruim" e, por implicação, claramente inferior ao Tor, ou é apenas uma alternativa de design que claramente precisa de mais investigação e análise? Existem várias outras razões para considerar o I2P atualmente inferior ao Tor e outros projetos (tamanho pequeno da rede , falta de financiamento, falta de revisão), mas os túneis unidirecionais são realmente uma razão?
tr: Tor, çift yönlü tüneller kullanır ve birçok akademik incelemeden geçmiştir. I2P tek yönlü tüneller kullanır ve yayınlanmış çok az inceleme vardır. Tek yönlü tünelleri savunan bir araştırma belgesinin olmaması, bunun kötü bir tasarım seçimi olduğu ya da yalnızca üzerinde daha fazla çalışmaya gerek olduğu anlamına mı gelir? Hem I2P hem de Tor üzerinde zamanlama saldırılarına ve dağıtılmış saldırılara karşı savunma oluşturmak zordur. Tasarım amacı (yukarıdaki referanslara bakın), tek yönlü tünellerin zamanlama saldırılarına karşı daha dirençli olmasıydı. Bununla birlikte, makale biraz farklı bir zamanlama saldırısı türü sunuyor. Bu saldırı, yenilikçi olduğu kadar, I2P ağının tünel mimarisini (ve dolayısıyla bir bütün olarak I2P ağını) "kötü tasarım" olarak etiketlemek için yeterli mi? Dolaylı olarak Tor ağından açıkça daha zayıf mı, yoksa yalnızca daha fazla araştırma ve inceleme gerektiren bir tasarım alternatifi mi? I2P ağının şu anda Tor ve diğer projelerden daha zayıf olduğunu düşünmek için başka nedenler var (ağ boyutunun küçük olması, finansman eksikliği, inceleme eksikliği gibi) ama tek yönlü tüneller gerçekten bir zayıflık nedeni mi?

source: In summary, "bad design decision" is apparently (since the paper does not label bidirectional tunnels "bad") shorthand for "unidirectional tunnels are unequivocally inferior to bidirectional tunnels", yet this conclusion is not supported by the paper.
pt: Em resumo, "má decisão de projeto" é aparentemente (já que o artigo não rotula túneis bidirecionais como "ruins") uma abreviação para "túneis unidirecionais são inequivocamente inferiores aos túneis bidirecionais", mas esta conclusão não é apoiada pelo artigo.
tr: Özetle, "kötü tasarım kararı" görünüşe göre (makale çift yönlü tünelleri "kötü" olarak etiketlemediğinden) "tek yönlü tüneller kesinlikle çift yönlü tünellerden daha zayıftır" ifadesinin kısaltılmış halidir. Ancak makale bu sonucu desteklememektedir.

source: Set:
pt: Por:

source: Get:
pt: Obter:

source: GetAll:
pt: Obter tudo:

source: wrapper
pt: empacotador
