Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Delivery of too few tags causes the router to fall back to an expensive ElGamal encryption.
pt: A entrega de poucas tags faz com que o roteador recorra a uma criptografia ElGamal cara.
tr: Teslim edilen etiket sayısının çok az olması, yönelticinin pahalı ElGamal şifrelemesine geri dönmesine neden olur.

source: The router may assume delivery of Session Tags, or await acknowledgement before using them; there are tradeoffs for each strategy.
pt: O roteador pode assumir a entrega de tags de sessão ou aguardar o reconhecimento antes de usá-las; há compensações para cada estratégia.
tr: Yöneltici, oturum etiketlerinin teslim edildiğini varsayabilir ya da bunları kullanmadan önce onay bekleyebilir. Her strateji için uzlaşmalar vardır.

source: For very brief messages, almost the full 222 bytes of the pre-IV and padding fields in the ElGamal block could be used for the entire message, instead of establishing a session.
pt: Para mensagens muito breves, quase todos os 222 bytes dos campos pré-IV e de preenchimento no bloco ElGamal poderiam ser usados para a mensagem inteira, em vez de estabelecer uma sessão.
tr: Çok kısa iletiler için, ElGamal bloğundaki pre-IV ve dolgu ekleme (padding( alanlarının neredeyse tam 222 baytı, bir oturum kurmak yerine iletinin tamamı için kullanılabilir.

source: Evaluate padding strategy; currently we pad to a minimum of 128 bytes. Would be better to add a few tags to small messages than pad.
pt: Avalie a estratégia de preenchimento; atualmente, preenchemos com um mínimo de 128 bytes. Seria melhor adicionar algumas tags a mensagens pequenas do que preencher.
tr: Dolgu ekleme stratejisini değerlendirin. Şu anda en az 128 bayt olacak şekilde dolgu ekliyoruz. Küçük iletilere dolgu yerine birkaç etiket eklemek daha iyi olur.

source: Perhaps things could be more efficient if the Session Tag system was bidirectional, so tags delivered in the 'forward' path could be used in the 'reverse' path, thus avoiding ElGamal in the initial response. The router currently plays some tricks like this when sending tunnel test messages to itself.
pt: Talvez as coisas pudessem ser mais eficientes se o sistema de tags de sessão fosse bidirecional, para que as tags entregues no caminho "direto" pudessem ser usadas no caminho "reverso", evitando assim o ElGamal na resposta inicial. Atualmente, o roteador faz alguns truques como esse ao enviar mensagens de teste de túnel para si mesmo.
tr: Oturum etiketi sistemi çift yönlü olsaydı belki işler daha verimli olabilirdi, bu nedenle 'ileri' yolda teslim edilen etiketler 'geri' yolda kullanılabilir. Böylece ilk yanıtta ElGamal şifrelemesinden kaçınılabilir. Şu anda yöneltici kendisine tünel test iletileri gönderirken bunun gibi incelikler yapıyor.

source: Change from Session Tags to <a href="%(futureperf)s#prng">a synchronized PRNG</a>.
pt: Alterar de Tags de Sessão para <a href="%(futureperf)s#prng">um PRNG sincronizado</a>.
tr: Oturum etiketleri yerine <a href="%(futureperf)s#prng">eşitlenmiş PRNG</a> kullanın.

source: Several of these ideas may require a new I2NP message type, or set a flag in the <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">Delivery Instructions</a>, or set a magic number in the first few bytes of the Session Key field and accept a small risk of the random Session Key matching the magic number.
pt: Várias dessas ideias podem exigir um novo tipo de mensagem I2NP, ou definir um sinalizador nas <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">Instruções de Entrega</a>, ou definir um número mágico nos primeiros bytes do campo Chave de Sessão e aceitar um pequeno risco da Chave de Sessão aleatória corresponder ao número mágico.
tr: Bu fikirlerin birçoğu için yeni bir I2NP ileti türü ya da <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">teslimat bilgilerinde</a> bir işaret ayarlanması ya da oturum anahtarı alanının ilk birkaç baytının sihirli bir sayı olarak ayarlanmasıyla sihirli bir sayıyla eşleşen rastgele oturum anahtarının küçük bir risk olarak kabul edilmesi gerekebilir.

source: Garlic Routing
pt: Roteamento Alho
tr: Garlic Yöneltme

source: March 2014
pt: março de 2014
tr: 2014 Mart

source: Garlic Routing and "Garlic" Terminology
pt: Roteamento e Terminologia "Alho"
tr: Garlic Yöneltme ve "Garlic" Terminolojisi

source: The terms "garlic routing" and "garlic encryption" are often used rather loosely when referring to I2P's technology. Here, we explain the history of the terms, the various meanings, and the usage of "garlic" methods in I2P.
pt: Os termos "roteamento de alho" e "criptografia de alho" são frequentemente usados de forma bastante vaga quando se referem à tecnologia do I2P. Aqui, explicamos a história dos termos, os vários significados e o uso dos métodos "de alho" no I2P.
tr: "Garlic yöneltme" ve "garlic şifreleme" terimleri, I2P teknolojisinden bahsederken genellikle oldukça gevşek bir şekilde kullanılır. Burada terimlerin tarihçesini, çeşitli anlamlarını ve "garlic" yöntemlerinin I2P içindeki kullanımını açıklıyoruz.

source: "Garlic routing" was first coined by <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a> in Roger Dingledine's Free Haven <a href="http://www.freehaven.net/papers.html">Master's thesis</a> Section 8.1.1 (June 2000), as derived from <a href="http://www.onion-router.net/">Onion Routing</a>.
pt: "Roteamento de alho" foi primeiramente mencionado por <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a> na &nbsp;dissertação de mestrado de Roger Dingledine no Free Haven <a href="http://www.freehaven.net/papers.html">Seção 8.1.1</a> (junho de 2000), derivado de <a href="http://www.onion-router.net/">Roteamento Onion</a>.
tr: "Garlic yöneltme" ilk olarak <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a> tarafından Roger Dingledine'nin Free Haven <a href="http://www.freehaven.net/papers.html">Yüksek Lisans tezinin</a> 8.1.1 bölümündeki (Haziran 2000), <a href="http://www.onion-router.net/">Onion yöneltmeden</a> türetilmiştir.

source: "Garlic" may have been used originally by I2P developers because I2P implements a form of bundling as Freedman describes, or simply to emphasize general differences from Tor. The specific reasoning may be lost to history. Generally, when referring to I2P, the term "garlic" may mean one of three things:
pt: "Alho" pode ter sido usado originalmente por desenvolvedores do I2P porque o I2P implementa uma forma de agrupamento como Freedman descreve, ou simplesmente para enfatizar diferenças gerais do Tor. O raciocínio específico pode estar perdido na história. Geralmente, ao se referir ao I2P, o termo "alho" pode significar uma de três coisas:
tr: "Garlic" Freedman'ın tanımladığı gibi bir paketleme biçimi uyguladığı ya da yalnızca Tor ile genel farklılıkları vurgulamak için özgün olarak I2P geliştiricileri tarafından kullanılmış olabilir. Gerçek nedenleri tarihte kaybolmuş olabilir. Genel olarak, I2P ağında "garlic" terimi üç şeyden biri anlamına gelebilir:

source: Layered Encryption
pt: Criptografia em camadas
tr: Katmanlı Şifreleme

source: Bundling multiple messages together
pt: Agrupando várias mensagens
tr: Bir kaç iletinin bir arada paketlenmesi

source: ElGamal/AES Encryption
pt: Criptografia ElGamal/AES
tr: ElGamal/AES Şifrelemesi

source: Unfortunately, I2P's usage of "garlic" terminology over the past seven years has not always been precise; therefore the reader is cautioned when encountering the term. Hopefully, the explanation below will make things clear.
pt: Infelizmente, o uso da terminologia "alho" pelo I2P nos últimos sete anos nem sempre foi preciso; portanto, o leitor é advertido ao se deparar com o termo. Espero que a explicação abaixo esclareça as coisas.
tr: Ne yazık ki, I2P geçen yedi yılda "garlic" terminolojisini her zaman aynı kesinlikte kullanmadı. Bu nedenle okuyucu, bu terimle karşılaştığında dikkatli olmalıdır. Umarım, aşağıdaki açıklama her şeyi açıklığa kavuşturur.

source: Onion routing is a technique for building paths, or tunnels, through a series of peers, and then using that tunnel. Messages are repeatedly encrypted by the originator, and then decrypted by each hop. During the building phase, only the routing instructions for the next hop are exposed to each peer. During the operating phase, messages are passed through the tunnel, and the message and its routing instructions are only exposed to the endpoint of the tunnel.
pt: O roteamento cebola é uma técnica para construir caminhos, ou túneis, através de uma série de pares, e então usar esse túnel. As mensagens são criptografadas repetidamente pelo originador e então descriptografadas por cada salto. Durante a fase de construção, somente as instruções de roteamento para o próximo salto são expostas a cada par. Durante a fase operacional, as mensagens são passadas através do túnel, e a mensagem e suas instruções de roteamento são expostas somente ao ponto final do túnel.
tr: Onion yöneltme, bir dizi eş aracılığıyla yollar veya tüneller oluşturmak ve ardından bu tüneli kullanmak için kullanılan bir yöntemdir. İletiler, oluşturucu tarafından üst üste şifrelenir ve ardından her sıçramada şifresi çözülür. Tünel oluşturulurken, her bir eşte yalnızca bir sonraki sıçramanın yöneltme yönergeleri açığa çıkar. İşlem sırasında, iletiler tünelden geçirilir ve ileti ile yöneltme yönergeleri yalnızca tünelin uç noktasında açığa çıkar.

source: This is similar to the way Mixmaster (see <a href="%(comparisons)s">network comparisons</a>) sends messages - taking a message, encrypting it to the recipient's public key, taking that encrypted message and encrypting it (along with instructions specifying the next hop), and then taking that resulting encrypted message and so on, until it has one layer of encryption per hop along the path.
pt: Isso é semelhante à maneira como o Mixmaster (veja <a href="%(comparisons)s">comparações de rede</a>) envia mensagens - pegando uma mensagem, criptografando-a para a chave pública do destinatário, pegando essa mensagem criptografada e criptografando-a (junto com instruções especificando o próximo salto) e então pegando essa mensagem criptografada resultante e assim por diante, até que tenha uma camada de criptografia por salto ao longo do caminho.
tr: Bu, Mixmaster (<a href="%(comparisons)s">ağ karşılaştırmasına bakın</a>) ileti gönderme şekline benzer. Bir ileti alınır, alıcının herkese açık anahtarıyla şifrelenir, bu şifrelenmiş ileti alınır ve şifrelenir (bir sonraki sıçramayı belirten yönergelerle birlikte) ve ardından elde edilen şifrelenmiş ileti alınır. Yol boyunca her sıçrama için bir şifreleme katmanı olana kadar bu şekilde ilerlenir.

source: In this sense, "garlic routing" as a general concept is identical to "onion routing". As implemented in I2P, of course, there are several differences from the implementation in Tor; see below. Even so, there are substantial similarities such that I2P benefits from a <a href="http://www.onion-router.net/Publications.html">large amount of academic research on onion routing</a>, <a href="http://freehaven.net/anonbib/topic.html">Tor, and similar mixnets</a>.
pt: Nesse sentido, "roteamento alho" como um conceito geral é idêntico ao "roteamento cebola". Conforme implementado no I2P, é claro, há várias diferenças em relação à implementação no Tor; veja abaixo. Mesmo assim, há semelhanças substanciais, de modo que o I2P se beneficia de uma <a href="http://www.onion-router.net/Publications.html">grande quantidade de pesquisa acadêmica sobre roteamento cebola</a>, <a href="http://freehaven.net/anonbib/topic.html">Tor e mixnets semelhantes</a>.
tr: Bu anlamda, genel bir kavram olarak "garlic yöneltme", "onion yöneltme" ile aynıdır. I2P üzerinde uygulandığı gibi, elbette Tor uygulamasına göre aşağıdaki gibi birkaç fark vardır. Öyle olsa bile, I2P <a href="http://www.onion-router.net/Publications.html">onion yöneltme ve</a>, <a href="http://freehaven.net/anonbib/topic.html">Tor ve benzeri karma ağlar üzerine yapılan çok sayıda akademik araştırmadan</a> yarar sağlar.

source: Bundling Multiple Messages
pt: Agrupando várias mensagens
tr: Birkaç İletiyi Paketlemek

source: Michael Freedman defined "garlic routing" as an extension to onion routing, in which multiple messages are bundled together. He called each message a "bulb". All the messages, each with its own delivery instructions, are exposed at the endpoint. This allows the efficient bundling of an onion routing "reply block" with the original message.
pt: Michael Freedman definiu "roteamento alho" como uma extensão do roteamento cebola, no qual várias mensagens são agrupadas. Ele chamou cada mensagem de "bulbo". Todas as mensagens, cada uma com suas próprias instruções de entrega, são expostas no ponto final . Isso permite o agrupamento eficiente de um "bloco de resposta" de roteamento cebola com a mensagem original.
tr: Michael Freedman, "garlic yöneltmesini", birden fazla iletinin bir araya getirildiği onion yöneltmesinin geliştirilmiş bir şekli olarak tanımladı. Her iletiye "ampul" dedi. Her biri kendi teslim yönergelerini taşıyan tüm iletiler, uç noktada açığa çıkar. Böylece özgün iletiyle onion yöneltmesi "yanıt bloğu" verimli bir şekilde paketlenir.

source: This concept is implemented in I2P, as described below. Our term for garlic "bulbs" is "cloves". Any number of messages can be contained, instead of just a single message. This is a significant distinction from the onion routing implemented in Tor. However, it is only one of many major architectural differences between I2P and Tor; perhaps it is not, by itself, enough to justify a change in terminology.
pt: Este conceito é implementado no I2P, conforme descrito abaixo. Nosso termo para "bulbos" de alho é "dentes". Qualquer número de mensagens pode ser contido, em vez de apenas uma única mensagem. Esta é uma distinção significativa do roteamento de cebola implementado no Tor. No entanto, é apenas uma das muitas diferenças arquitetônicas importantes entre I2P e Tor; talvez não seja, por si só, suficiente para justificar uma mudança na terminologia.
tr: Bu kavram I2P üzerinde aşağıda açıklandığı gibi uygulanır. Garlic "ampulleri" için "dişler" terimini kullanıyoruz. Tek bir ileti yerine herhangi bir sayıda ileti yer alabilir. Bu, Tor üzerinde uygulanan onion yöneltmesine göre önemli bir farktır. Ancak, I2P ve Tor arasındaki birçok önemli mimari farklılıktan yalnızca biridir. Belki de tek başına terminoloji değişikliğini haklı çıkarmaya yeterli değildir.

source: Another difference from the method described by Freedman is that the path is unidirectional - there is no "turning point" as seen in onion routing or mixmaster reply blocks, which greatly simplifies the algorithm and allows for more flexible and reliable delivery.
pt: Outra diferença do método descrito por Freedman é que o caminho é unidirecional - não há "ponto de virada" como visto no roteamento onion ou nos blocos de resposta do mixmaster, o que simplifica muito o algoritmo e permite uma entrega mais flexível e confiável.
tr: Freedman tarafından açıklanan yönteme göre bir başka fark, yolun tek yönlü olmasıdır. Onion yöneltme veya mixmaster yanıt bloklarında görüldüğü gibi, algoritmayı büyük ölçüde basitleştirerek daha esnek ve güvenilir aktarım sağlayan bir "dönüm noktası" yoktur.

source: In some cases, "garlic encryption" may simply mean <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> encryption (without multiple layers).
pt: Em alguns casos, "criptografia alho" talvez signifique simplesmente criptografia <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> (sem múltiplas camadas).
tr: Bazı durumlarda, "garlic şifrelemesi" basitçe <a href="%(elgamalaes)s">ElGamal/AES+Oturum etiketi</a> şifrelemesi (birden çok katman olmadan) anlamına gelebilir.

source: "Garlic" Methods in I2P
pt: Métodos "Alho" em I2P
tr: I2P içindeki "Garlic" Yöntemleri

source: Now that we've defined various "garlic" terms, we can say that I2P uses garlic routing, bundling and encryption in three places:
pt: Agora que definimos vários termos "alho", podemos dizer que I2P usa roteamento, agrupamento e criptografia de alho em três lugares:
tr: Artık çeşitli "garlic" terimlerini tanımladığımıza göre, I2P garlic yöneltmesinin paketleme ve şifreleme için üç yerde kullandığını söyleyebiliriz:

source: For building and routing through tunnels (layered encryption)
pt: Para construção e roteamento através de túneis (criptografia em camadas)
tr: Tüneller oluşturmak ve yöneltmek için (katmanlı şifreleme)

source: For determining the success or failure of end to end message delivery (bundling)
pt: Para determinar o sucesso ou o fracasso da entrega de mensagens de ponta a ponta (agrupamento)
tr: Uçtan uca ileti tesliminin (paketleme) başarısını veya başarısızlığını belirlemek için

source: For publishing some network database entries (dampening the probability of a successful traffic analysis attack) (ElGamal/AES)
pt: Para publicar algumas entradas de banco de dados de rede (reduzindo a probabilidade de um ataque de análise de tráfego bem-sucedido) (ElGamal/AES)
tr: Bazı ağ veri tabanı kayıtlarını yayınlamak için (başarılı bir trafik analizi saldırısı olasılığını azaltmak) (ElGamal/AES)

source: There are also significant ways that this technique can be used to improve the performance of the network, exploiting transport latency/throughput tradeoffs, and branching data through redundant paths to increase reliability.
pt: Há também maneiras significativas pelas quais essa técnica pode ser usada para melhorar o desempenho da rede, explorando compensações entre latência de transporte/taxa de transferência e ramificando dados por caminhos redundantes para aumentar a confiabilidade.
tr: Bu yöntemin, ağın başarımını iyileştirmek, taşıma gecikmesinden/çıkış takaslarından yararlanmak ve güvenilirliği artırmak için yedekli yollar aracılığıyla verileri dallandırmak için kullanılabileceği önemli yolları da vardır.

source: Tunnel Building and Routing
pt: Construção e roteamento de túneis
tr: Tünel Oluşturma ve Yöneltme

source: In I2P, tunnels are unidirectional. Each party builds two tunnels, one for outbound and one for inbound traffic. Therefore, four tunnels are required for a single round-trip message and reply.
pt: No I2P, os túneis são unidirecionais. Cada parte constrói dois túneis, um para tráfego de saída e um para tráfego de entrada. Portanto, quatro túneis são necessários para uma única mensagem de ida e volta e resposta.
tr: I2P üzerinde tüneller tek yönlüdür. Her bir taraf, biri gidiş ve biri geliş trafiği için olmak üzere iki tünel oluşturur. Bu nedenle, tek bir gidiş-dönüş iletisi ve yanıtı için dört tünel gerekir.

source: Tunnels are built, and then used, with layered encryption. This is described on the <a href="%(tunnelimpl)s">tunnel implementation page</a>. Tunnel building details are defined on <a href="%(tunnelcreation)s">this page</a>. We use <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> for the encryption.
pt: Os túneis são construídos e, então, usados com criptografia em camadas. Isso é descrito na página de implementação do túnel <a href="%(tunnelimpl)s"></a>. Os detalhes da construção do túnel são definidos em <a href="%(tunnelcreation)s">esta página</a>. Usamos <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> para a criptografia.
tr: Tüneller, katmanlı şifreleme ile oluşturulduktan sonra kullanılır. Bu durum, <a href="%(tunnelimpl)s">tunnel uygulama sayfasında</a> açıklanmıştır. Tünel oluşturma ayrıntıları da <a href="%(tunnelcreation)s">bu sayfada</a> açıklanmıştır. Şifreleme için <a href="%(elgamalaes)s">ElGamal/AES+Oturum etiketi</a> kullanıyoruz.

source: Tunnels are a general-purpose mechanism to transport all <a href="%(i2np)s">I2NP messages</a>, and <a href="%(i2npspec)s#msg_Garlic">Garlic Messages</a> are not used to build tunnels. We do not bundle multiple <a href="%(i2np)s">I2NP messages</a> into a single <a href="%(i2npspec)s#msg_Garlic">Garlic Message</a> for unwrapping at the outbound tunnel endpoint; the tunnel encryption is sufficient.
pt: Os túneis são um mecanismo de uso geral para transportar todas as <a href="%(i2np)s">mensagens I2NP</a>e <a href="%(i2npspec)s#msg_Garlic">Mensagens Garlic</a> não são usadas para construir túneis. Não agrupamos várias <a href="%(i2np)s">mensagens I2NP</a> em uma única <a href="%(i2npspec)s#msg_Garlic">Mensagem Garlic</a> para desembrulhar no ponto final do túnel de saída; a criptografia do túnel é suficiente.
tr: Tüneller, tüm <a href="%(i2np)s">I2NP iletilerini</a> taşımak için genel amaçlı bir mekanizmadır ve <a href="%(i2npspec)s#msg_Garlic">Garlic iletileri</a> tünel oluşturmak için kullanılmaz. Gidiş tüneli uç noktasında paketi açmak için birden fazla <a href="%(i2np)s">I2NP iletisini</a> tek bir <a href="%(i2npspec)s#msg_Garlic">Garlic iletisi</a> içinde paketlemiyoruz. Tünel şifrelemesi yeterlidir.

source: End-to-End Message Bundling
pt: Agrupamento de mensagens de ponta a ponta
tr: Uçtan Uca İleti Paketleme

source: At the layer above tunnels, I2P delivers end-to-end messages between <a href="%(commonstructures)s#struct_Destination">Destinations</a>. Just as within a single tunnel, we use <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> for the encryption. Each client message as delivered to the router through the <a href="%(i2cp)s">I2CP interface</a> becomes a single <a href="%(i2npspec)s#struct_GarlicClove">Garlic Clove</a> with its own <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Delivery Instructions</a>, inside a <a href="%(i2npspec)s#msg_Garlic">Garlic Message</a>. Delivery Instructions may specify a Destination, Router, or Tunnel.
pt: Na camada acima dos túneis, o I2P entrega mensagens de ponta a ponta entre <a href="%(commonstructures)s#struct_Destination">Destinos</a>. Assim como em um único túnel, usamos <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> para a criptografia. Cada mensagem do cliente entregue ao roteador através da interface I2CP <a href="%(i2cp)s"></a> se torna um único <a href="%(i2npspec)s#struct_GarlicClove">Dente de Alho</a> com suas próprias <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Instruções de Entrega</a>, dentro de uma <a href="%(i2npspec)s#msg_Garlic">Mensagem de Alho</a>. As Instruções de Entrega podem especificar um Destino, Roteador ou Túnel.
tr: Tünellerin üzerindeki katmanda I2P, <a href="%(commonstructures)s#struct_Destination">Hedefler</a> arasında uçtan uca iletiler aktarır. Tıpkı tek bir tünel içinde olduğu gibi, şifreleme için <a href="%(elgamalaes)s">ElGamal/AES+Oturum etiketi</a> kullanıyoruz. <a href="%(i2cp)s">I2CP arabirimi</a> aracılığıyla yönelticiye iletilen her istemci iletisi, bir <a href="%(i2npspec)s#struct_GarlicClove">Garlic dişi</a> içinde kendi <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Teslim yönergeleri</a> ile tek bir <a href="%(i2npspec)s#msg_Garlic">Garlic iletisi</a> haline gelir. Teslimat yönergelerinde bir hedef, yöneltici veya tünel belirtilebilir.

source: Generally, a Garlic Message will contain only one clove. However, the router will periodically bundle two additional cloves in the Garlic Message:
pt: Geralmente, uma mensagem de alho conterá apenas um dente. No entanto, o roteador agrupará periodicamente dois dentes adicionais na mensagem de alho:
tr: Genellikle, bir Garlic iletisinde yalnızca bir diş bulunur. Bununla birlikte yöneltici Garlic iletisinde düzenli olarak pakete iki diş daha ekler:

source: Garlic Message Cloves
pt: Mensagem de alho Cravos
tr: Garlic İletisi Dişleri
