Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: I2P enables a <a href="http://en.wikipedia.org/wiki/JSON-RPC">JSONRPC2</a> interface via the plugin <a href="%(itoopie)s">I2PControl</a>. The aim of the interface is to provide simple way to interface with a running I2P node. A client, itoopie, has been developed in parallel. The JSONRPC2 implementation for the client as well as the plugin is provided by the java libraries <a href="http://software.dzhuvinov.com/json-rpc-2.0.html">JSON-RPC 2.0</a>. A list of implementations of JSON-RPC for various languages can be found at <a href="http://json-rpc.org/wiki/implementations">the JSON-RPC wiki</a>.
pt: O I2P habilita uma interface <a href="http://en.wikipedia.org/wiki/JSON-RPC">JSONRPC2</a> por meio do plugin <a href="%(itoopie)s">I2PControl</a>. O objetivo da interface é fornecer uma maneira simples de interagir com um nó I2P em execução. Um cliente, itoopie, foi desenvolvido em paralelo. A implementação JSONRPC2 para o cliente, bem como o plugin, é fornecida pelas bibliotecas Java <a href="http://software.dzhuvinov.com/json-rpc-2.0.html">JSON-RPC 2.0</a>. Uma lista de implementações de JSON-RPC para várias linguagens pode ser encontrada em <a href="http://json-rpc.org/wiki/implementations">o wiki JSON-RPC</a>.
tr: I2P, <a href="%(itoopie)s">I2PControl</a> uygulama eki ile <a href="http://en.wikipedia.org/wiki/JSON-RPC">JSONRPC2</a> arayüzünü etkinleştirir. Böylece çalışan bir I2P düğümü ile basit bir şekilde arayüz oluşturulabilir. Paralel olarak bir istemci olan itoopie geliştirildi. İstemci için JSONRPC2 uygulaması ve uygulama eki, <a href="http://software.dzhuvinov.com/json-rpc-2.0.html">JSON-RPC 2.0</a> java kitaplıkları tarafından sağlanır. Çeşitli diller için JSON-RPC uygulamalarının bir listesi <a href="http://json-rpc.org/wiki/implementations">JSON-RPC wiki</a> üzerinde bulunabilir.

source: I2PControl is by default listening on https://localhost:7650
pt: O I2PControl está escutando por padrão em https://localhost:7650
tr: I2PControl varsayılan olarak https://localhost:7650 bağlantı noktasını dinler

source: API, version 1.
pt: API, versão 1.
tr: API, 1. sürüm.

source: Parameters are only provided in a named way (maps).
pt: Os parâmetros são fornecidos apenas de forma nomeada (mapas).
tr: Parametreler yalnızca adlandırılmış bir şekilde sağlanır (haritalar).

source: JSON-RPC 2 format
pt: formato JSON-RPC 2
tr: JSON-RPC 2 biçimi

source: Request:
pt: Pedido:
tr: İstek:

source: Response:
pt: Resposta:
tr: Yanıt:

source: Description
pt: Descrição
tr: Açıklama

source: Token used for authenticating every request (excluding the 'Authenticate' RPC method)
pt: Token usado para autenticar cada solicitação (excluindo o método RPC 'Authenticate')
tr: Her isteğin kimliğini doğrulamak için kullanılan kod ('Authenticate' RPC yöntemi dışında)

source: Implemented methods
pt: Métodos implementados
tr: Uygulanan yöntemler

source: Creates and returns an authentication token used for further communication.
pt: Cria e retorna um token de autenticação usado para comunicação posterior.
tr: Sonraki iletişimler için kullanılan bir kimlik doğrulama kodu oluşturur ve döndürür.

source: The version of the I2PControl API used by the client.
pt: A versão da API de I2PControl usada pelo cliente.
tr: İstemci tarafından kullanılan I2PControl API sürümü.

source: The password used for authenticating against the remote server.
pt: A senha usada para autenticação no servidor remoto.
tr: Uzak sunucu üzerinde kimlik doğrulaması için kullanılan parola.

source: The primary I2PControl API version implemented by the server.
pt: A versão primária da API de I2PControl implementada pelo servidor.
tr: Sunucu tarafından uygulanan birincil I2PControl API sürümü.

source: The token used for further communication.
pt: O token usado para comunicação futura.
tr: Sonraki iletişimler için kullanılan kod.

source: Echoes the value of the echo key, used for debugging and testing.
pt: Ecoa o valor da chave echo, usada para depuração e testes.
tr: Hata ayıklama ve deneme için kullanılan yankı anahtarının değerini görüntüler.

source: Value will be returned in response.
pt: Valor será retornado em resposta.
tr: Değer yanıt olarak döndürülür.

source: Token used for authenticating the client. Is provided by the server via the 'Authenticate' RPC method.
pt: Token usado para autenticar o cliente. É fornecido pelo servidor via método RPC 'Authenticate'.
tr: İstemcinin kimliğini doğrulamak için kullanılan kod. Sunucu tarafından 'Authenticate' RPC yöntemi ile sağlanır.

source: Value of the key 'echo' in the request.
pt: Valor da chave 'echo' na requisição.
tr: İstekteki 'echo' anahtarının değeri.

source: Fetches rateStat from router statManager. Creates stat if not already created.
pt: Busca rateStat do roteador statManager. Cria stat se ainda não tiver sido criado.
tr: statManager üzerinden rateStat değerini alır. Henüz oluşturulmadıysa stat oluşturulur.

source: Determines which rateStat to fetch, see <a href="%(ratestats)s">ratestats</a>.
pt: Determina qual rateStat buscar, veja <a href="%(ratestats)s">ratestats</a>.
tr: Hangi rateStat değerinin alınacağını belirler, <a href="%(ratestats)s">ratestats</a> bilgilerine bakın.

source: Determines which period a stat is fetched for. Measured in ms.
pt: Determina para qual período uma estatística é buscada. Medido em ms.
tr: Milisaniye cinsinden, bir stat değerinin hangi dönem için alınacağını belirler.

source: Returns the average value for the reuested rateStat and period.
pt: Retorna o valor médio para a taxaStat e o período solicitados.
tr: İstenen rateStat ve dönem için ortalama değeri döndürür.

source: Manages I2PControl. Ports, passwords and the like.
pt: Gerencia I2PControl. Portas, senhas e afins.
tr: I2PControl yönetimi. Bağlantı noktaları, parolalar ve benzerleri.

source: Sets a new listen address for I2PControl (only 127.0.0.1 and 0.0.0.0 are implemented in I2PControl currently).
pt: Define um novo endereço de escuta para I2PControl (somente 127.0.0.1 e 0.0.0.0 são implementados no I2PControl atualmente).
tr: I2PControl için yeni bir dinleme adresi ayarlar (şu anda I2PControl yalnızca 127.0.0.1 ve 0.0.0.0 kullanıyor).

source: Sets a new password for I2PControl, all Authentication tokens will be revoked.
pt: Define uma nova senha para I2PControl, todos os tokens de autenticação serão revogados.
tr: I2PControl parolasını değiştirir. Tüm kimlik doğrulama kodları geçersiz kılınır.

source: Switches which port I2PControl will listen for connections on.
pt: Alterna em qual porta o I2PControl escutará as conexões.
tr: I2PControl tarafından bağlantıların dinleneceği bağlantı noktasını değiştirir.

source: Returned if address was changed
pt: Retornado se o endereço mudou
tr: Adres değiştirilmişse geri döndürür

source: Returned if setting was changed
pt: Retornado se as configurações mudaram
tr: Ayar değiştirilmişse geri döndürür

source: Returns true if any changes were made.
pt: Retorna verdadeiro se alguma alteração foi feita.
tr: Herhangi bir değişiklik yapılmışsa true döndürür.

source: Returns true if any changes requiring a restart to take effect were made.
pt: Retorna verdadeiro se alguma alteração que exija uma reinicialização para entrar em vigor foi feita.
tr: Etkili olması için yeniden başlatma gerektiren herhangi bir değişiklik yapıldıysa true döndürür.

source: Fetches basic information about the I2P router. Uptime, version etc.
pt: Busca informações básicas sobre o roteador I2P. Uptime, versão etc.
tr: I2P yöneltici ile ilgili temel bilgileri getirir. Çalışma süresi, sürüm vb.

source: What the status of the router is.
pt: Qual o status do roteador.
tr: Yöneltcinin durumu nedir.

source: What the uptime of the router is in ms.
pt: Qual o tempo de operação do roteador em ms.
tr: Milisaniye cinsinden, yönelticinin çalışma süresi nedir.

source: What version of I2P the router is running.
pt: Qual versão do I2P que o roteador está rodando.
tr: Yöneltcinin hangi I2P sürümünü çalıştırdığı.

source: The 1 second average inbound bandwidth in Bps.
pt: A largura de banda de entrada média de 1 segundo em Bps.
tr: Bps cinsinden 1 saniyelik ortalama geliş bant genişliği.

source: The 15 second average inbound bandwidth in Bps.
pt: A largura de banda de entrada média de 15 segundos em Bps.
tr: Bps cinsinden 15 saniyelik ortalama geliş bant genişliği.

source: The 1 second average outbound bandwidth in Bps.
pt: A largura de banda média de saída de 1 segundo em Bps.
tr: Bps cinsinden 1 saniyelik ortalama gidiş bant genişliği.

source: The 15 second average outbound bandwidth in Bps.
pt: A largura de banda média de saída de 15 segundos em Bps.
tr: Bps cinsinden 15 saniyelik ortalama gidiş bant genişliği.

source: What the current network status is. According to the below enum:
pt: Qual é o status atual da rede. De acordo com o enum abaixo:
tr: Geçerli ağ durumu nedir. Aşağıdaki numaralandırmaya göre:

source: How many tunnels on the I2P net are we participating in.
pt: Em quantos túneis na rede I2P estamos participando?
tr: I2P ağındaki kaç tünele katkıda bulunuyoruz.

source: How many peers have we communicated with recently.
pt: Com quantos colegas nos comunicamos recentemente?
tr: Son zamanlarda kaç eş ile iletişim kurduk.

source: How many peers are considered 'fast'.
pt: Quantos pontos são considerados 'rápidos'.
tr: Kaç eş 'hızlı' olarak kabul ediliyor.

source: How many peers are considered 'high capacity'.
pt: Quantos pontos são considerados 'alta capacidade'.
tr: Kaç eş 'yüksek kapasiteli' olarak kabul ediliyor.

source: Is the router reseeding hosts to its NetDB?
pt: O roteador está repropagando hosts para seu NetDB?
tr: Yöneltici, sunucuları kendi "Ağ veri tabanına" (NetDB) yeniden tohumluyor mu?

source: How many peers are known to us (listed in our NetDB).
pt: Quantos pares são conhecidos por nós (listados em nosso NetDB).
tr: Kaç tane eş biliniyor ("Ağ veri tabanı" (NetDB) içinde listelenmiştir).

source: Manages I2P router restart/shutdown.
pt: Gerencia a reinicialização/desligamento do roteador I2P.
tr: I2P yönelticinin yeniden başlatılmasını/kapatılmasını yönetir.

source: <b>Blocking</b>. Initiates a search for signed updates.
pt: <b>Bloqueio</b>. Inicia uma busca por atualizações assinadas.
tr: <b>Engelleme</b>. İmzalı güncellemeler için bir arama başlatır.

source: Initiates a router reseed, fetching peers into our NetDB from a remote host.
pt: Inicia uma nova propagação do roteador, buscando pares em nosso NetDB a partir de um host remoto.
tr: Uzak bir sunucudan "Ağ veri tabanı" (NetDB) üzerine eşler getirerek bir yöneltici yeniden tohumlaması başlatır.

source: Restarts the router.
pt: Reinicia o roteador.
tr: Yönelticiyi yeniden başlatır.

source: Restarts the router gracefully (waits for participating tunnels to expire).
pt: Reinicia o roteador normalmente (aguarda a expiração dos túneis participantes).
tr: Yönelticiyi sorunsuz bir şekilde yeniden başlatır (katkıda bulunulan tünellerin süresinin dolmasını bekler).

source: Shuts down the router.
pt: Desliga o roteador.
tr: Yönelticiyi kapatır.

source: Shuts down the router gracefully (waits for participating tunnels to expire).
pt: Desliga o roteador normalmente (aguarda a expiração dos túneis participantes).
tr: Yönelticiyi sorunsuz bir şekilde kapatır (katkıda bulunulan tünellerin süresinin dolmasını bekler).

source: Initiates a router update from signed sources.
pt: Inicia uma atualização do roteador a partir de fontes assinadas.
tr: İmzalı kaynaklardan bir yöneltici güncellemesi başlatır.

source: <b>Blocking</b>. Returns true iff a signed update has been found.
pt: <b>Bloqueio</b>. Retorna verdadeiro se uma atualização assinada foi encontrada.
tr: <b>Engelleme</b>. İmzalı bir güncelleme bulunursa true değerini döndürür.

source: If requested, verifies that a reseed has been initiated.
pt: Se solicitado, verifica se uma nova sementeira foi iniciada.
tr: İstenmişse, yeniden tohumlama işleminin başlatıldığını doğrular.

source: If requested, verifies that a restart has been initiated.
pt: Se solicitado, verifica se uma reinicialização foi iniciada.
tr: İstenmişse, yeniden başlatma işleminin başlatıldığını doğrular.

source: If requested, verifies that a graceful restart has been initiated.
pt: Se solicitado, verifica se uma reinicialização normal foi iniciada.
tr: İstenmişse, sorunsuz bir yeniden başlatma işleminin başlatıldığını doğrular.

source: If requested, verifies that a shutdown has been initiated
pt: Se solicitado, verifica se um desligamento foi iniciado
tr: İstenmişse, bir kapatma işleminin başlatıldığını doğrular

source: If requested, verifies that a graceful shutdown has been initiated
pt: Se solicitado, verifica se um desligamento normal foi iniciado
tr: İstenmişse, sorunsuz bir kapatma işleminin başlatıldığını doğrular

source: <b>Blocking</b>. If requested, returns the status of the the update
pt: <b>Bloqueio</b>. Se solicitado, retorna o status da atualização
tr: <b>Engelleme</b>. İstenmişse, güncellemenin durumunu döndürür

source: Fetches or sets various network related settings. Ports, addresses etc.
pt: Busca ou define várias configurações relacionadas à rede. Portas, endereços etc.
tr: Ağla ilgili çeşitli ayarları getirir veya ayarlar. bağlantı noktaları, adresler vb.

source: What port is used for the TCP transport. If null is submitted, current setting will be returned.
pt: Qual porta é usada para o transporte TCP. Se null for enviado, a configuração atual será retornada.
tr: TCP taşıyıcısı için hangi bağlantı noktasının kullanıldığı. Null gönderilirse, geçerli ayarı döndürür.

source: What hostname is used for the TCP transport. If null is submitted, current setting will be returned.
pt: Qual nome de host é usado para o transporte TCP. Se null for enviado, a configuração atual será retornada.
tr: TCP taşıyıcısı için hangi sunucu adının kullanıldığı. Null gönderilirse, geçerli ayarı döndürür.

source: Use automatically detected ip for TCP transport. If null is submitted, current setting will be returned.
pt: Use ip detectado automaticamente para transporte TCP. Se null for enviado, a configuração atual será retornada.
tr: TCP taşıyıcısı için otomatik olarak algılanan IP adresinin kullanılması. Null gönderilirse, geçerli ayarı döndürür.

source: What port is used for the UDP transport. If null is submitted, current setting will be returned.
pt: Qual porta é usada para o transporte UDP. Se null for enviado, a configuração atual será retornada.
tr: UDP taşıyıcısı için hangi bağlantı noktasının kullanıldığı. Null gönderilirse, geçerli ayarı döndürür.

source: What hostname is used for the UDP transport. If null is submitted, current setting will be returned.
pt: Qual nome de host é usado para o transporte UDP. Se null for enviado, a configuração atual será retornada.
tr: UDP taşıyıcısı için hangi sunucu adının kullanıldığı. Null gönderilirse, geçerli ayarı döndürür.

source: Which methods should be used for detecting the ip address of the UDP transport. If null is submitted, current setting will be returned.
pt: Quais métodos devem ser usados para detectar o endereço IP do transporte UDP. Se null for enviado, a configuração atual será retornada.
tr: UDP taşıyıcısının IP adresini bulmak için hangi yöntemlerin kullanılması gerektiği. Null gönderilirse, geçerli ayarı döndürür.

source: What ip has been detected by the UDP transport.
pt: Qual IP foi detectado pelo transporte UDP.
tr: UDP taşıyıcısı tarafından hangi IP adresinin algılandığı.

source: Is UPnP enabled. If null is submitted, current setting will be returned.
pt: O UPnP está habilitado. Se null for enviado, a configuração atual será retornada.
tr: UPnP etkin mi? Null gönderilirse, geçerli ayarı döndürür.

source: How many percent of bandwidth is usable for participating tunnels. If null is submitted, current setting will be returned.
pt: Quantos por cento da largura de banda é utilizável para túneis participantes. Se null for enviado, a configuração atual será retornada.
tr: Katkıda bulunulan tüneller için bant genişliğinin yüzde kaçının kullanılabilir olduğu. Null gönderilirse, geçerli ayarı döndürür.

source: How many KB/s of inbound bandwidth is allowed. If null is submitted, current setting will be returned.
pt: Quantos KB/s de largura de banda de entrada são permitidos. Se null for enviado, a configuração atual será retornada.
tr: Kaç KB/sn geliş bant genişliğine izin verildiği. Null gönderilirse, geçerli ayarı döndürür.

source: How many KB/s of outbound bandwidth is allowed. If null is submitted, current setting will be returned.
pt: Quantos KB/s de largura de banda de saída são permitidos. Se null for enviado, a configuração atual será retornada.
tr: Kaç KB/sn gidiş bant genişliğine izin verildiği. Null gönderilirse, geçerli ayarı döndürür.

source: Is laptop mode enabled (change router identity and UDP port when IP changes ). If null is submitted, current setting will be returned.
pt: O modo laptop está habilitado (alterar identidade do roteador e porta UDP quando o IP muda). Se null for enviado, a configuração atual será retornada.
tr: Dizüstü bilgisayar kipi etkin mi (IP değiştiğinde yöenltici kimliğini ve UDP bağlantı noktasını değiştirir). Null gönderilirse, geçerli ayarı döndürür.

source: Token used for authenticating the client. Is provided by the server via the 'Authenticate' RPC method. If null is submitted, current setting will be returned.
pt: Token usado para autenticar o cliente. É fornecido pelo servidor por meio do método RPC 'Authenticate'. Se null for enviado, a configuração atual será retornada.
tr: İstemcinin kimliğini doğrulamak için kullanılan kod. Sunucu tarafından 'Authenticate' RPC yöntemi ile sağlanır. Null gönderilirse, geçerli ayarı döndürür.

source: If requested, returns the port used for the TCP transport.
pt: Se solicitado, retorna a porta usada para o transporte TCP.
tr: İstenmişse, TCP taşıyıcısı için kullanılan bağlantı noktasını döndürür.

source: If requested, returns the hostname used for the TCP transport.
pt: Se solicitado, retorna o nome do host usado para o transporte TCP.
tr: İstenmişse, TCP taşıyıcısı için kullanılan sunucu adını döndürür.

source: If requested, returns the method used for automatically detecting ip for the TCP transport.
pt: Se solicitado, retorna o método usado para detectar automaticamente o IP para o transporte TCP.
tr: İstenmişse, TCP taşıyıcısı için IP adresinin otomatik olarak algılanması için kullanılan yöntemi döndürür.

source: If requested, returns the port used for the UDP transport.
pt: Se solicitado, retorna a porta usada para o transporte UDP.
tr: İstenmişse, UDP taşıyıcısı için kullanılan bağlantı noktasını döndürür.

source: If requested, returns the hostname used for the UDP transport.
pt: Se solicitado, retorna o nome do host usado para o transporte UDP.
tr: İstenmişse, UDP taşıyıcısı için kullanılan sunucu adını döndürür.

source: If requested, returns methods used for detecting the ip address of the UDP transport.
pt: Se solicitado, retorna métodos usados para detectar o endereço IP do transporte UDP.
tr: İstenmişse, UDP taşıyıcısının IP adresini algılamak için kullanılan yöntemleri döndürür.

source: If requested, returns what ip has been detected by the UDP transport.
pt: Se solicitado, retorna qual IP foi detectado pelo transporte UDP.
tr: İstenmişse, UDP taşıyıcısı tarafından algılanan IP adresini döndürür.

source: If requested, returns the UPNP setting.
pt: Se solicitado, retorna a configuração UPNP.
tr: İstenmişse, UPNP ayarını döndürür.

source: If requested, returns how many percent of bandwidth is usable for participating tunnels.
pt: Se solicitado, retorna quantos por cento da largura de banda é utilizável para os túneis participantes.
tr: İstenmişse, katkıda bulunulan tüneller için bant genişliğinin yüzde kaçının kullanılabilir olduğunu döndürür.

source: If requested, returns how many KB/s of inbound bandwidth is allowed.
pt: Se solicitado, retorna quantos KB/s de largura de banda de entrada são permitidos.
tr: İstenmişse, kaç KB/sn geliş bant genişliğine izin verildiğini döndürür.

source: If requested, returns how many KB/s of outbound bandwidth is allowed.
pt: Se solicitado, retorna quantos KB/s de largura de banda de saída são permitidos.
tr: İstenmişse, kaç KB/sn gidiş bant genişliğine izin verildiğini döndürür.

source: If requested, returns the laptop mode.
pt: Se solicitado, retorna o modo laptop.
tr: İstenmişse, dizüstü bilgisayar kipini döndürür.

source: Have the provided settings been saved.
pt: As configurações fornecidas foram salvas?
tr: Belirtilen ayarlar kaydedildi mi.

source: Is a restart needed for the new settings to be used.
pt: É necessário reiniciar para que as novas configurações sejam usadas?
tr: Yeni ayarların etkin olması için yeniden başlatma gerekli mi?

source: Allows for manipulation of advanced i2p settings
pt: Permite a manipulação de configurações avançadas de i2p
tr: Gelişmiş i2p ayarlarının değiştirilmesine izin verir

source: Set the sent key-value pairs
pt: Defina os pares de chave-valor enviados
tr: Gönderilen anahtar/değer çiftlerini ayarlar

source: Set the sent key-value pairs, remove everything else
pt: Defina os pares de chave-valor enviados e remova todo o resto
tr: Gönderilen anahtar/değer çiftlerini ayarlayın, diğer her şeyi kaldırır

source: Get the key-value pairs for the sent keys
pt: Obtenha os pares de chave-valor para as chaves enviadas
tr: Gönderilen anahtarlar için anahtar/değer çiftlerini alır

source: Get all the key-value pairs
pt: Obtenha todos os pares chave-valor
tr: Tüm anahtar/değer çiftlerini alır

source: denotes an optional value.
pt: denota um valor opcional.
tr: isteğe bağlı bir değeri belirtir.

source: denotes a possibly occuring return value
pt: denota um valor de retorno possivelmente ocorrendo
tr: olası bir dönüş değerini belirtir

source: Error codes
pt: Códigos de erro
tr: Hata kodları

source: Standard JSON-RPC2 error codes.
pt: Códigos de erro JSON-RPC2 padrão.
tr: Standart JSON-RPC2 hata kodları.

source: JSON parse error.
pt: Erro de análise do JSON.
tr: JSON işleme hatası.

source: Invalid request.
pt: Requisição inválida.
tr: İstek geçersiz.

source: Method not found.
pt: Método não encontrado.
tr: Yöntem bulunamadı.

source: Invalid parameters.
pt: Parâmetros inválidos.
tr: Parametreler geçersiz.

source: Internal error.
pt: Erro interno.
tr: İç sorun.

source: I2PControl specific error codes.
pt: Códigos de erro específicos do I2PControl.
tr: Özel I2PControl hata kodları.

source: Invalid password provided.
pt: Senha inserida inválida.
tr: Belirtilen parola geçersiz.

source: No authentication token presented.
pt: Nenhum token de autenticação apresentado.
tr: Herhangi bir kimlik doğrulama kodu belirtilmedi.

source: Authentication token doesn't exist.
pt: Token de autenticação não existe.
tr: Kimlik doğrulama kodu bulunamadı.

source: The provided authentication token was expired and will be removed.
pt: O token de autenticação fornecido expirou e será removido.
tr: Belirtilen kimlik doğrulama kodunun süresi dolmuş ve kaldırılacak.

source: The version of the I2PControl API used wasn't specified, but is required to be specified.
pt: A versão da API de I2PControl usada não foi especificada, mas requer-se que seja especificada.
tr: Kullanılan I2PControl API sürümü belirtilmemiş, ancak belirtilmesi gerekiyor.

source: The version of the I2PControl API specified is not supported by I2PControl.
pt: A versão da API de I2PControl não é suportada pela extensão I2PControl.
tr: Belirtilen I2PControl API sürümü, I2PControl tarafından desteklenmiyor.
