Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: The <a href="http://%(forum)s/viewtopic.php?t=2068">I2P bittorrent FAQ</a>
pt: Perguntas frequentes sobre bittorrent I2P <a href="http://%(forum)s/viewtopic.php?t=2068"></a>
tr: <a href="http://%(forum)s/viewtopic.php?t=2068">I2P Bittorrent SSS</a>

source: <a href="http://%(zzz)s/topics/812">DHT on I2P discussion</a>
pt: <a href="http://%(zzz)s/topics/812">DHT na discussão I2P</a>
tr: <a href="http://%(zzz)s/topics/812">I2P üzerinde "Dağıtılmış karma tablosu" (DHT) tartışması</a>

source: Embedding I2P in your Application
pt: Incorporando I2P em seu aplicativo
tr: Uygulamanıza I2P Gömmek

source: This page is about bundling the entire I2P router binary with your application. It is not about writing an application to work with I2P (either bundled or external).
pt: Esta página é sobre agrupar todo o binário do roteador I2P com seu aplicativo. Não se trata de escrever um aplicativo para trabalhar com I2P (agrupado ou externo).
tr: Bu sayfa, tüm I2P yöneltici binary dosyasını uygulamanızla birlikte paketlemekle ilgilidir. Bu konu, I2P ile çalışmak için bir uygulama yazmakla ilgili değildir (paketlenmiş ya da dış).

source: Lots of projects are bundling, or talking about bundling, I2P. That's great if done right. If done wrong, it could cause real harm to our network. The I2P router is complex, and it can be a challenge to hide all the complexity from your users. This page discusses some general guidelines.
pt: Muitos projetos estão agrupando, ou falando sobre agrupar, I2P. Isso é ótimo se feito corretamente. Se feito errado, pode causar danos reais à nossa rede. O roteador I2P é complexo, e pode ser um desafio esconder toda a complexidade dos seus usuários. Esta página discute algumas diretrizes gerais.
tr: Pek çok proje paketleniyor ya da I2P paketlemesi hakkında konuşuluyor. Doğru yapılırsa harika. Yanlış yapılırsa, ağımıza gerçekten zarar verebilir. I2P yönelticisi karmaşıktır ve tüm bu karmaşıklığı kullanıcılarınızdan uzak tutmak zor olabiliyor. Bu sayfada bazı genel yönergeler anlatılmaktadır.

source: Talk to us
pt: Fale conosco
tr: Bizimle görüşün

source: Start a dialog. We're here to help. Applications that embed I2P are the most promising - and exciting - opportunities for us to grow the network and improve anonymity for everyone.
pt: Inicie um diálogo. Estamos aqui para ajudar. Os aplicativos que incorporam I2P são as oportunidades mais promissoras - e empolgantes - para que possamos expandir a rede e melhorar o anonimato para todos.
tr: Bir görüşme başlatın. Yardım etmek için buradayız. I2P kullanan uygulamalar, ağı büyütmek ve herkes için anonimliği sağlamak bizim için umut ve heyecan verici fırsatlardır.

source: Choose your router wisely
pt: Escolha seu roteador com sabedoria
tr: Yönelticinizi akıllıca seçin

source: If your application is in Java or Scala, it's an easy choice - use the Java router. If in C/C++, we recommend i2pd. The development of i2pcpp has stopped. For apps in other languages, best to use SAM or BOB or SOCKS and bundle the Java router as a separate process. Some of the following only applies to the Java router.
pt: Se seu aplicativo estiver em Java ou Scala, é uma escolha fácil - use o roteador Java. Se estiver em C/C++, recomendamos o i2pd. O desenvolvimento do i2pcpp foi interrompido. Para aplicativos em outras linguagens, é melhor usar SAM ou BOB ou SOCKS e agrupar o roteador Java como um processo separado. Alguns dos seguintes se aplicam apenas ao roteador Java.
tr: Uygulamanız Java veya Scala üzerindeyse, bu seçim kolaydır - Java yönelticisini kullanın. C/C++ kullanıyorsanız, i2pd kullanmanızı öneririz. i2pcpp geliştirme çalışmaları durdu. Diğer dillerdeki uygulamalar için en iyisi SAM ya da BOB ya da SOCKS kullanmak ve Java yönelticisini ayrı bir işlem olarak paketlemektir. Aşağıdakilerden bazıları yalnızca Java yönelticisi için geçerlidir.

source: Licensing
pt: Licenciamento
tr: Lisanslama

source: Ensure you meet the license requirements of the software you are bundling.
pt: Certifique-se de atender aos requisitos de licença do software que você está empacotando.
tr: Paketlediğiniz yazılımın lisans gereksinimlerini karşıladığınızdan emin olun.

source: Verify default configuration
pt: Verificar pré-configuração
tr: Varsayılan yapılandırmayı doğrulayın

source: A correct default configuration is crucial. Most users will not change the defaults. The defaults for your application may need to be different than the defaults for the router you are bundling. Override the router defaults if necessary.
pt: Uma configuração padrão correta é crucial. A maioria dos usuários não alterará os padrões. Os padrões para seu aplicativo podem precisar ser diferentes dos padrões para o roteador que você está empacotando. Substitua os padrões do roteador, se necessário.
tr: Doğru bir varsayılan yapılandırma çok önemlidir. Çoğu kullanıcı varsayılanları değiştirmez. Uygulamanızın varsayılanlarının, paketlediğiniz yönelticinin varsayılanlarından farklı olması gerekebilir. Gerekirse yöneltici varsayılanlarını değiştirin.

source: Some important defaults to review: Max bandwidth, tunnel quantity and length, max participating tunnels. A lot of this depends on the expected bandwidth and usage patterns of your app.
pt: Alguns padrões importantes a serem revisados: largura de banda máxima, quantidade e comprimento do túnel, número máximo de túneis participantes. Muito disso depende da largura de banda esperada e dos padrões de uso do seu aplicativo.
tr: İncelenecek bazı önemli varsayılanlar: En fazla bant genişliği, tünel miktarı ve uzunluğu, en fazla katkıda bulunulan tünel. Bunların çoğu, uygulamanızın beklenen bant genişliğine ve kullanım kalıplarına bağlıdır.

source: Configure enough bandwidth and tunnels to allow your users to contribute to the network. Consider disabling external I2CP, as you probably don't need it and it would conflict with any other running I2P instance. Also look at the configs for disabling killing of the JVM on exit, for example.
pt: Configure largura de banda e túneis suficientes para permitir que seus usuários contribuam com a rede. Considere desabilitar o I2CP externo, pois você provavelmente não precisa dele e ele entraria em conflito com qualquer outra instância I2P em execução. Veja também as configurações para desabilitar a eliminação da JVM na saída, por exemplo.
tr: Kullanıcılarınızın ağa katkıda bulunmasını sağlamak için yeterli bant genişliği ve tünel yapılandırın. Büyük olasılıkla gerek duymayacağınızdan ve çalışan diğer tüm I2P kopyaları ile çakışacağından, dış I2CP kullanımını devre dışı bırakmayı değerlendirin. Ayrıca örneğin çıkarken JVM sonlandırılmasını engellemek için de yapılandırmalara bakın.

source: Participating Traffic Considerations
pt: Considerações sobre o tráfego participante
tr: Trafiğe Katkıda Bulunma Değerlendirmeleri

source: It may be tempting for you to disable participating traffic. There's several ways to do this (hidden mode, setting max tunnels to 0, setting shared bandwidth below 12 KBytes/sec). Without participating traffic, you don't have to worry about graceful shutdown, your users don't see bandwidth usage not generated by them, etc. However, there's lots of reasons why you should allow participating tunnels.
pt: Pode ser tentador desabilitar o tráfego participante. Há várias maneiras de fazer isso (modo oculto, definir o máximo de túneis como 0, definir a largura de banda compartilhada abaixo de 12 KBytes/seg). Sem tráfego participante, você não precisa se preocupar com desligamento normal, seus usuários não veem o uso de largura de banda não gerado por eles, etc. No entanto, há muitos motivos pelos quais você deve permitir túneis participantes.
tr: Katkıda bulunulan trafiği devre dışı bırakmak sizin için cazip gelebilir. Bunu yapmanın birkaç yolu vardır (gizli kip, en fazla tünel sayısını 0 yapmak, paylaşılan bant genişliğini 12 KBytes/sn değerinin altına ayarlamak). Katkıda bulunulan trafik olmadan, normal kapatma konusunda endişelenmeniz gerekmez, kullanıcılarınız kendileri tarafından üretilmeyen bant genişliği kullanımını görmez, vb. Ancak, katkı tünellerine izin vermeniz için birçok neden var.

source: First of all, the router doesn't work that well if it doesn't have a chance to "integrate" with the network, which is helped tremendously by others building tunnels through you.
pt: Primeiro, o roteador não funciona tão bem se não tiver a chance de "integrar-se" com a rede, o que é muito ajudado por outros construindo túneis através de você.
tr: Her şeyden önce, ağ ile "bütünleşme" şansı yoksa yöneltici o kadar iyi çalışmaz, Buna, sizin aracılığınızla tüneller oluşturan başkaları tarafından muazzam bir şekilde yardımcı olur.

source: Secondly, over 90&#37; of the routers in the current network allow participating traffic. It's the default in the Java router. If your application doesn't route for others and it gets really popular, then it's a leech on the network, and it upsets the balance we have now. If it gets really big, then we become Tor, and spend our time begging for people to enable relaying.
pt: Em segundo lugar, mais de 90&#37; dos roteadores na rede atual permitem tráfego participante. É o padrão no roteador Java. Se seu aplicativo não rotear para outros e se tornar muito popular, então ele é um sanguessuga na rede, e perturba o equilíbrio que temos agora. Se ficar muito grande, então nos tornamos Tor e passamos nosso tempo implorando para que as pessoas habilitem o retransmissão.
tr: İkincisi, geçerli ağdaki yönelticiler yüzde 90&#37; oranında katkıda bulunulan trafiğe izin verir. Java yönelticisinde varsayılandır. Başvurunuz başkaları için yönlendirilme yapmıyorsa ve gerçekten sık kullanılmaya başlıyorsa, o zaman ağda bir sülüğe dönüşür ve şu anda sahip olduğumuz dengeyi bozar. Gerçekten büyürse, Tor haline geliriz ve zamanımızı insanlara aktarmayı etkinleştirmeleri için yalvararak geçiririz.

source: Thirdly, participating traffic is cover traffic that helps your users' anonymity.
pt: Em terceiro lugar, o tráfego participante é o tráfego de cobertura que ajuda no anonimato dos seus usuários.
tr: Üçüncüsü, katkıda bulunulan trafik, kullanıcılarınızın anonimliğine yardımcı olan örtü trafiğidir.

source: We strongly discourage you from disabling participating traffic by default. If you do this and your application gets hugely popular, it could break the network.
pt: Não recomendamos fortemente que você desabilite o tráfego participante por padrão. Se você fizer isso e seu aplicativo se tornar muito popular, isso poderá danificar a rede.
tr: Katkıda bulunulan trafiği varsayılan olarak devre dışı bırakmanızı kesinlikle önermiyoruz. Bunu yaparsanız ve uygulamanız çok kullanılmaya başlanırsa, ağı bozabilir.

source: Persistence
pt: Persistência
tr: Kalıcılık

source: You must save the router's data (netdb, configuration, etc.) between runs of the router. I2P does not work well if you must reseed each startup, and that's a huge load on our reseed servers, and not very good for anonymity either. Even if you bundle router infos, I2P needs saved profile data for best performance.
pt: Você deve salvar os dados do roteador (netdb, configuração, etc.) entre as execuções do roteador. O I2P não funciona bem se você precisar repropagar a cada inicialização, e isso é uma carga enorme em nossos servidores de repropagação, e também não é muito bom para o anonimato. Mesmo se você agrupar as informações do roteador, o I2P precisa de dados de perfil salvos para melhor desempenho.
tr: Yönelticinin çalıştırmaları arasında yöneltici verilerini ("Ağ veri tabanı" (NetDB), yapılandırma vb.) kaydetmelisiniz. Her başlatmada yeniden tohumlamanız gerekiyorsa I2P iyi çalışmaz. Bu durum, yeniden tohumlama sunucularımız için çok büyük bir yük oluşturur ve anonimlik için pek iyi değildir. Yöneltici bilgilerini bir araya getirseniz bile, en iyi I2P başarımı için kaydedilmiş profil verilerine gerek vardır.

source: Configurability
pt: Configurabilidade
tr: Yapılandırılabilirlik

source: Give your users a way to change the configuration of the important settings. We understand that you will probably want to hide most of I2P's complexity, but it's important to show some basic settings. In addition to the defaults above, some network settings such as UPnP, IP/port may be helpful.
pt: Dê aos seus usuários uma maneira de alterar a configuração das configurações importantes. Entendemos que você provavelmente desejará ocultar a maior parte da complexidade do I2P, mas é importante mostrar algumas configurações básicas. Além dos padrões acima, algumas configurações de rede, como UPnP, IP/porta, podem ser úteis.
tr: Kullanıcılarınıza önemli ayarların yapılandırmasını değiştirmeleri olanağı sağlayın. I2P karmaşıklığının çoğunu gizlemek isteyebileceğinizi anlıyoruz, ancak bazı temel ayarları görüntülemek önemlidir. Yukarıdaki varsayılanlara ek olarak, UPnP, IP/port gibi bazı ağ ayarları yardımcı olabilir.

source: Floodfill Considerations
pt: Considerações sobre aterro
tr: Otomatik Doldurma Değerlendirmeleri

source: Above a certain bandwidth setting, and meeting other health criteria, your router will become floodfill, which may cause a large increase in connections and memory usage (at least with the Java router). Think about whether that's OK. You can disable floodfill, but then your fastest users aren't contributing what they could. It also depends on the typical uptime for your application.
pt: Acima de uma certa configuração de largura de banda, e atendendo a outros critérios de saúde, seu roteador se tornará floodfill, o que pode causar um grande aumento nas conexões e no uso de memória (pelo menos com o roteador Java). Pense se isso é OK. Você pode desabilitar o floodfill, mas seus usuários mais rápidos não estão contribuindo com o que poderiam. Também depende do tempo de atividade típico do seu aplicativo.
tr: Belirli bir bant genişliği ayarının üzerinde ve diğer sağlık ölçütlerini karşılayan yönelticiniz, bağlantılarda ve bellek kullanımında (en azından Java yöneltici ile) büyük bir artışa neden olabilecek otomatik doldurma yapar. Bunun uygun olup olmadığını değerlendirin. Otomatik doldurmayı devre dışı bırakabilirsiniz, ancak bu durumda en hızlı kullanıcılarınız yapabilecekleri katkıda bulunmazlar. Ayrıca, uygulamanızın tipik çalışma süresi de etkilidir.

source: Reseeding
pt: Ressemeando
tr: Yeniden Tohumlama

source: Decide if you are bundling router infos or using our reseed hosts. The Java reseed host list is in the source code, so if you keep your source up to date, the host list will be also. Be aware of possible blocking by hostile governments.
pt: Decida se você está agrupando informações do roteador ou usando nossos hosts de reseed. A lista de hosts de reseed Java está no código-fonte, então se você mantiver seu código-fonte atualizado, a lista de hosts também estará. Esteja ciente de possíveis bloqueios por governos hostis.
tr: Yöneltici bilgilerini paketlemeyi ya da yeniden tohumlanmış sunucularımızı kullanmayı seçin. Java yeniden tohumlama sunucu listesi kaynak kodundadır. Yani kaynağınızı güncel tutarsanız sunucu listesi de güncel olur. Karşıt hükümetlerin yapabileceği engellemeleri de hesaba katın.

source: Reduce Network Resource Usage
pt: Reduzir o uso de recursos de rede
tr: Ağ Kaynağı Kullanımını Azaltmak

source: Consider setting your application tunnels to delay-open, reduce-on-idle and/or close-on-idle. This is straightforward if using i2ptunnel but you'll have to implement some of it yourself if using I2CP directly. See i2psnark for code that reduces tunnel count and then closes the tunnel, even in the presence of some background DHT activity.
pt: Considere configurar os túneis do seu aplicativo para atrasar a abertura, reduzir quando ocioso e/ou fechar quando ocioso. Isso é simples se estiver usando o i2ptunnel, mas você terá que implementar parte disso se estiver usando o I2CP diretamente. Veja o i2psnark para obter o código que reduz a contagem de túneis e, em seguida, fecha o túnel, mesmo na presença de alguma atividade DHT em segundo plano.
tr: Uygulama tünellerinizi gecikmeli açmayı, boştayken azaltmayı ve/veya kapatmayı değerlendirin. i2ptunnel kullanıyorsanız bunu kolayca yapabilirsiniz. Ancak doğrudan I2CP kullanıyorsanız, bir kısmını siz eklemelisiniz. Bazı arka plan "Dağıtılmış karma tablosu" (DHT) etkinliklerinin varlığında bile tünel sayısını azaltan ve ardından tüneli kapatan kod örneği için i2psnark uygulamasına bakabilirsiniz.

source: Updatability
tr: Güncellenebilirlik

source: Have an auto-update feature if at all possible, or at least auto-notification of a new version. Our biggest fear is a huge number of routers out there that can't be updated. We have about 6-8 releases a year of the Java router, and it's critical to the health of the network that the users keep up. We usually have over 80&#37; of the network on the latest release within 6 weeks after the release, and we'd like to keep it that way. You don't need to worry about disabling the router's built-in auto-update function, as that code is in the router console, which you presumably are not bundling.
pt: Tenha um recurso de atualização automática, se possível, ou pelo menos notificação automática de uma nova versão. Nosso maior medo é um grande número de roteadores que não podem ser atualizados. Temos cerca de 6 a 8 lançamentos por ano do roteador Java, e é essencial para a saúde da rede que os usuários se mantenham atualizados. Geralmente temos mais de 80&#37; da rede na versão mais recente dentro de 6 semanas após o lançamento, e gostaríamos de mantê-la assim. Você não precisa se preocupar em desabilitar a função de atualização automática integrada do roteador, pois esse código está no console do roteador, que você provavelmente não está agrupando.
tr: Yapabiliyorsanız otomatik güncelleme özelliği ekleyin ya da en azından yeni sürümleri otomatik olarak bildirin. En büyük korkumuz, çok sayıda yönelticinin güncellenmeden kalmasıdır. Java yöneltici yılda yaklaşık 6-8 sürüm yayınlar ve bu güncellemeler kullanıcıların izlediği ağın sağlığı için çok önemlidir. Genellikle bir sürümün yayınlandıktan 6 hafta sonra ağda 80&#37; oranında kullanıldığını görüyoruz ve bu şekilde kalmasını istiyoruz. Yöneltici içindeki otomatik güncelleme işlevini devre dışı bırakma konusunda endişelenmenize gerek yok. Bu kod yöneltici panosunda bulunuyor ve muhtemelen paketinize katmıyorsunuz.

source: Rollout
pt: Lançamento
tr: Dağıtım

source: Have a gradual rollout plan. Don't overwhelm the network all at once. We currently have approximately 25K unique users per day and 40K uniques per month. We are probably able to handle growth of 2-3X per year without too much issue. If you anticipate a faster rampup than that, OR the bandwidth distribution (or uptime distribution, or any other significant characteristic) of your userbase is significantly different from our current userbase, we really need to have a discussion. The bigger your growth plans, the more important everthing else in this checklist is.
pt: Tenha um plano de implementação gradual. Não sobrecarregue a rede de uma só vez. Atualmente, temos aproximadamente 25 mil usuários únicos por dia e 40 mil únicos por mês. Provavelmente somos capazes de lidar com um crescimento de 2 a 3 vezes por ano sem muitos problemas. Se você antecipar um aumento mais rápido do que isso, OU a distribuição de largura de banda (ou distribuição de tempo de atividade, ou qualquer outra característica significativa) da sua base de usuários for significativamente diferente da nossa base de usuários atual, realmente precisamos ter uma discussão. Quanto maiores forem seus planos de crescimento, mais importante será todo o resto nesta lista de verificação.
tr: Kademeli bir kullanıma sunma planınız olsun. Ağı bir anda boğmayın. Şu anda günde yaklaşık 25 bin tekil kullanıcımız ve ayda 40 bin tekil kullanıcımız oluyor. Büyük olasılıkla yılda 2-3 kat büyümeyi çok fazla sorun yaşamadan halledebiliriz. Bundan daha hızlı bir artış öngörüyorsanız YA DA kullanıcı tabanınızın bant genişliği dağılımı (ya da çalışma süresi dağılımı ya da herhangi bir önemli özelliği) var olan kullanıcı tabanımızdan önemli ölçüde farklıysa, gerçekten bunu görüşmemiz gerekir. Büyüme planlarınız ne kadar büyükse, bu kontrol listesindeki her şey o kadar önem kazanır.

source: Design for and Encourage Long Uptimes
pt: Projete e incentive longos períodos de atividade
tr: Uzun Süreki Çalışma İçin Tasarlayın ve Destekleyin

source: Tell your users that I2P works best if it keeps running. It may be several minutes after startup before it works well, and even more after first install. If your average uptime is less than an hour, I2P is probably the wrong solution.
pt: Diga aos seus usuários que o I2P funciona melhor se continuar em execução. Pode levar vários minutos após a inicialização para que ele funcione bem, e ainda mais depois da primeira instalação. Se o seu tempo de atividade médio for inferior a uma hora, o I2P provavelmente é a solução errada.
tr: Kullanıcılarınıza, I2P uygulamasının çalıştıkça iyileştiğini söyleyin. İyi çalışması için başlatmadan sonra birkaç dakika beklemek gerekir. Bu süre ilk kurulumdan sonra daha da fazla olabilir. Ortalama çalışma süreniz bir saatten azsa, I2P çözümü büyük olasılıkla size uygun değildir.

source: Show Status
pt: Mostrar status
tr: Durumu Görüntüleyin

source: Provide some indication to the user that the application tunnels are ready. Encourage patience.
pt: Forneça alguma indicação ao usuário de que os túneis do aplicativo estão prontos. Incentive a paciência.
tr: Kullanıcılara uygulama tünellerinin hazır olduğu hakkında bazı göstergeler sağlayın. Sabırlı olmalarını hatırlatın.

source: Graceful Shutdown
pt: Desligamento elegante
tr: Uygun Şekilde Kapatın

source: If possible, delay the shutdown until your participating tunnels expire. Don't let your users break tunnels easily, or at least ask them to confirm.
pt: Se possível, adie o desligamento até que seus túneis participantes expirem. Não deixe que seus usuários quebrem os túneis facilmente, ou pelo menos peça para eles confirmarem.
tr: Yapabiliyorsanız, katılımcı tünellerinizin süresi dolana kadar kapatmayı erteleyin. Kullanıcılarınızın tünelleri kolayca kapatmasına izin vermeyin ya da en azından onaylamalarını isteyin.

source: Education and Donation
pt: Educação e Doação
tr: Eğitim ve Bağış

source: It would be nice if you give your users links to learn more about I2P and to donate.
pt: Seria legal se você desse aos seus usuários links para aprender mais sobre o I2P e fazer doações.
tr: Kullanıcılarınıza I2P hakkında daha fazla bilgi edinmek ve bağış yapmak için bağlantılar sunarsanız iyi olur.

source: External Router Option
pt: Opção de roteador externo
tr: Dış Yöneltici Seçeneği

source: Depending on your user base and application, it may be helpful to provide an option or a separate package to use an external router.
pt: Dependendo da sua base de usuários e aplicação, pode ser útil fornecer uma opção ou um pacote separado para usar um roteador externo.
tr: Kullanıcı tabanınıza ve uygulamanıza bağlı olarak, bir dış yöneltici kullanma seçeneği ya da ayrı bir paket seçeneği sunmak yararlı olabilir.

source: Use of other Common Services
pt: Uso de outros serviços comuns
tr: Diğer Ortak Hizmetlerin Kullanımı
