Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: To reduce the susceptibility to <a href="%(url)s">some attacks</a>, 3 or more hops are recommended for the highest level of protection. <a href="%(url)s">Recent studies</a> also conclude that more than 3 hops does not provide additional protection.
pt: Para reduzir a suscetibilidade a <a href="%(url)s">alguns ataques</a>, 3 ou mais pulos são recomendados para o nível máximo de proteção. <a href="%(url)s">Estudos recentes</a> também concluem que mais de 3 pulos não entrega proteção adiciona.
tr: <a href="%(url)s">Bazı saldırılara</a>, duyarlılığı azaltmak için, en yüksek koruma düzeyi sağlamak amacıyla 3 ya da daha fazla sıçrama kullanılması önerilir. Ayrıca <a href="%(url)s">son çalışmalar</a> 3 sıçramadan fazlasının ek koruma sağlamadığı sonucuna varmıştır.

source: Tunnel default lengths
pt: Tamanhos padrões de túnel
tr: Varsayılan tünel uzunlukları

source: The router uses 2-hop tunnels by default for its exploratory tunnels. Client tunnel defaults are set by the application, using <a href="%(i2cp)s#options">I2CP options</a>. Most applications use 2 or 3 hops as their default.
pt: O roteador usa túneis de 2 saltos por padrão para seus túneis exploratórios. Os padrões do túnel do cliente são definidos pelo aplicativo, usando <a href="%(i2cp)s#options">Opções I2CP</a>. A maioria dos aplicativos usa 2 ou 3 saltos como padrão.
tr: Yöneltici, kendi keşif tünelleri için varsayılan olarak 2 sıçramalı tüneller kullanır. İstemci tüneli varsayılanları, <a href="%(i2cp)s#options">I2CP seçenekleri</a> kullanılarak uygulama tarafından belirlenir. Çoğu uygulama varsayılan olarak 2 veya 3 sıçrama kullanır.

source: Tunnel testing
pt: Teste de túnel
tr: Tünel sınaması

source: All tunnels are periodically tested by their creator by sending a DeliveryStatusMessage out an outbound tunnel and bound for another inbound tunnel (testing both tunnels at once). If either fails a number of consecutive tests, it is marked as no longer functional. If it was used for a client's inbound tunnel, a new leaseSet is created. Tunnel test failures are also reflected in the <a href="%(peerselection)s#capacity">capacity rating in the peer profile</a>.
pt: Todos os túneis são testados periodicamente por seu criador enviando uma DeliveryStatusMessage para fora de um túnel de saída e com destino a outro túnel de entrada (testando ambos os túneis de uma vez). Se um deles falhar em vários testes consecutivos, ele será marcado como não mais funcional. Se ele foi usado para um túnel de entrada do cliente, um novo leaseSet é criado. As falhas no teste de túnel também são refletidas na classificação de capacidade <a href="%(peerselection)s#capacity">no perfil do par</a>.
tr: Tüm tüneller, bir gidiş tünelinden bir "Aktarım durumu iletisi" (DeliveryStatusMessage) göndererek ve başka bir geliş tüneline bağlanarak (her iki tüneli aynı anda sınayarak) oluşturucuları tarafından düzenli olarak sınanır. Bir dizi ardışık sınama başarısız olursa, tünel işlevsel değil olarak işaretlenir. Bir istemcinin geliş tüneli için kullanılıyorsa, yeni bir "Kiralama kümesi" (LeaseSet) oluşturulur. Tünel sınamasındaki başarısızlıklar, <a href="%(peerselection)s#capacity">eş profilindeki kapasite değerlendirmesine</a> de yansıtılır.

source: Tunnel creation
pt: Criação de túnel
tr: Tünel oluşturma

source: Tunnel creation is handled by <a href="%(garlicrouting)s">garlic routing</a> a Tunnel Build Message to a router, requesting that they participate in the tunnel (providing them with all of the appropriate information, as above, along with a certificate, which right now is a 'null' cert, but will support hashcash or other non-free certificates when necessary). That router forwards the message to the next hop in the tunnel. Details are in the <a href="%(tunnelcreation)s">tunnel creation specification</a>.
pt: A criação do túnel é manipulada pelo roteamento <a href="%(garlicrouting)s">garlic</a> uma mensagem de construção de túnel para um roteador, solicitando que eles participem do túnel (fornecendo a eles todas as informações apropriadas, como acima, junto com um certificado, que agora é um certificado 'nulo', mas suportará hashcash ou outros certificados não livres quando necessário). Esse roteador encaminha a mensagem para o próximo salto no túnel. Os detalhes estão na especificação de criação de túnel <a href="%(tunnelcreation)s"></a>.
tr: Tünel oluşturma, <a href="%(garlicrouting)s">garlic yöneltme</a> tarafından bir yönelticiye bir tünel oluşturma iletisi gönderilerek ve tünele katılmalarını isteyerek gerçekleştirilir (yukarıdaki gibi tüm uygun bilgiler ve şu anda 'boş' olan bir sertifika sağlanır, ancak gerektiğinde hashcash veya diğer boşta olmayan sertifikalar da desteklenir). Bu yöneltici gelen iletiyi tüneldeki bir sonraki sıçramaya iletir. Ayrıntılı bilgi almak için <a href="%(tunnelcreation)s">tünel oluşturma teknik özellikleri</a> bölümüne bakabilirsiniz.

source: Multi-layer encryption is handled by <a href="%(garlicrouting)s">garlic encryption</a> of tunnel messages. Details are in the <a href="%(tunnelimpl)s">tunnel specification</a>. The IV of each hop is encrypted with a separate key as explained there.
pt: A criptografia multicamadas é manipulada pela criptografia garlic <a href="%(garlicrouting)s"></a> das mensagens do túnel. Os detalhes estão na especificação do túnel <a href="%(tunnelimpl)s"></a>. O IV de cada salto é criptografado com uma chave separada, conforme explicado lá.
tr: Çok katmanlı şifreleme, tünel iletilerinin <a href="%(garlicrouting)s">garlic şifrelemesi</a> ile gerçekleştirilir. Ayrıntılı bilgi almak için <a href="%(tunnelimpl)s">tünel teknik özellikleri</a> bölümüne bakabilirsiniz. Her sıçramadaki IV orada açıklandığı gibi ayrı bir anahtarla şifrelenir.

source: Other tunnel test techniques could be used, such as garlic wrapping a number of tests into cloves, testing individual tunnel participants separately, etc.
pt: Outras técnicas de teste de túnel podem ser usadas, como alho envolvendo uma série de testes em dentes, testando participantes individuais do túnel separadamente, etc.
tr: Sınamaların sayısını sarımsak dişleri ile sarmalamak, bireysel tünel katılımcılarını ayrı ayrı sınamak gibi diğer tünel sınama yöntemleri kullanılabilir.,

source: Move to 3-hop exploratory tunnels defaults.
pt: Mudar para os padrões de túneis exploratórios de 3 saltos.
tr: Varsayılan olarak 3 sıçramalı keşif tünellerine geçiş.

source: In a distant future release, options specifying the pooling, mixing, and chaff generation settings may be implemented.
pt: Em uma versão futura distante, as opções especificando as configurações de agrupamento, mistura e geração de palha podem ser implementadas.
tr: Uzak gelecekteki bir sürümde, havuz oluşturma, karıştırma ve artık oluşturma ayarlarını belirten seçenekler uygulanabilir.

source: In a distant future release, limits on the quantity and size of messages allowed during the tunnel's lifetime may be implemented (e.g. no more than 300 messages or 1MB per minute).
pt: Em uma versão futura distante, limites de na quantidade e tamanho de mensagens permitidas durante a vida útil do túnel podem ser implementados (por exemplo, não mais que 300 mensagens ou 1 MB por minuto).
tr: Uzak gelecekteki bir sürümde, tünelin ömrü boyunca izin verilen iletilerin miktarı ve boyutuna ilişkin sınırlamalar uygulanabilir (300 iletiden ya da dakikada 1MB boyutundan fazla olamaz gibi).

source: Tunnel specification
pt: Especificação do Túnel
tr: Tünel teknik özellikleri

source: Tunnel creation specification
pt: Especificação de criação de túnel
tr: Tünel oluşturma teknik özellikleri

source: Unidirectional tunnels
pt: Túneis unidirecionais
tr: Çift yönlü tüneller

source: Tunnel message specification
pt: Especificação de mensagem de túnel
tr: Tünel iletisi teknik özellikleri

source: Garlic routing
pt: Encaminhamento de alho
tr: Garlic yöneltme

source: ElGamal/AES+SessionTag
tr: ElGamal/AES+OturumEtiketi

source: I2CP options
pt: Opções I2CP
tr: I2CP ayarları

source: The I2P Client Protocol (I2CP) exposes a strong separation of concerns between the router and any client that wishes to communicate over the network. It enables secure and asynchronous messaging by sending and receiving messages over a single TCP socket. With I2CP, a client application tells the router who they are (their "destination"), what anonymity, reliability, and latency tradeoffs to make, and where to send messages. In turn the router uses I2CP to tell the client when any messages have arrived, and to request authorization for some tunnels to be used.
pt: O I2P Client Protocol (I2CP) expõe uma forte separação de preocupações entre o roteador e qualquer cliente que deseja se comunicar pela rede. Ele permite mensagens seguras e assíncronas enviando e recebendo mensagens por um único soquete TCP. Com o I2CP, um aplicativo cliente informa ao roteador quem eles são (seu "destino"), quais compensações de anonimato, confiabilidade e latência fazer e para onde enviar mensagens. Por sua vez, o roteador usa I2CP para informar ao cliente quando alguma mensagem chegou e para solicitar autorização para que alguns túneis sejam usados.
tr: I2P istemci iletişim kuralı (I2CP), yöneltici ile ağ üzerinden iletişim kurmak isteyen herhangi bir istemci arasındaki endişelerin güçlü bir şekilde ayrılmasını sağlar. Tek bir TCP soketi üzerinden ileti gönderip alarak güvenli ve asenkron iletişim sağlar. I2CP ile bir istemci uygulaması, yönelticiye kim olduklarını ("hedefleri"), hangi anonimlik, güvenilirlik ve gecikme sürelerinin değişeceğini ve iletilerin nereye gönderileceğini söyler. Yöneltici, istemciye herhangi bir iletinin ne zaman geldiğini bildirmek ve kullanılacak bazı tüneller için yetki istemek için I2CP iletişim kuralını kullanır.

source: The protocol itself is implemented in Java, to provide the <a href="%(url)s">Client SDK</a>. This SDK is exposed in the i2p.jar package, which implements the client-side of I2CP. Clients should never need to access the router.jar package, which contains the router itself and the router-side of I2CP. There is also a <a href="%(libi2cp)s">C library implementation</a>. A non-Java client would also have to implement the <a href="%(streaming)s">streaming library</a> for TCP-style connections.
pt: O protocolo em si é implementado em Java, para fornecer o <a href="%(url)s">SDK do cliente</a>. Este SDK é exposto no pacote i2p.jar, que implementa o lado do cliente do I2CP. Os clientes nunca devem precisar acessar o pacote router.jar, que contém o roteador em si e o lado do roteador do I2CP. Há também uma <a href="%(libi2cp)s">implementação da biblioteca C</a>. Um cliente não Java também teria que implementar a <a href="%(streaming)s">biblioteca de streaming</a> para conexões no estilo TCP.
tr: İletişim kuralının kendisi, <a href="%(url)s">İstemci SDK</a> yazılımını sağlamak için Java ile hazırlanmıştır. Bu SDK, I2CP iletişim kuralının istemci tarafını uygulayan i2p.jar paketinde gösterilir. İstemcilerin, yönelticinin kendisini ve I2CP iletişim kuralının yöneltici tarafını içeren router.jar paketine erişmesi asla gerekmez. Ayrıca bir <a href="%(libi2cp)s">C kitaplığı uygulaması</a> hazırlanmıştır. Java olmayan bir istemcinin de TCP tarzı bağlantılar için <a href="%(streaming)s">akış kitaplığını</a> kullanması gerekir.

source: Applications can take advantage of the base I2CP plus the <a href="%(streaming)s">streaming</a> and <a href="%(datagrams)s">datagram</a> libraries by using the <a href="%(sam)s">Simple Anonymous Messaging</a> or <a href="%(bob)s">BOB</a> protocols, which do not require clients to deal with any sort of cryptography. Also, clients may access the network by one of several proxies - HTTP, CONNECT, and SOCKS 4/4a/5. Alternatively, Java clients may access those libraries in ministreaming.jar and streaming.jar. So there are several options for both Java and non-Java applications.
pt: Os aplicativos podem aproveitar o I2CP básico mais as bibliotecas de streaming <a href="%(streaming)s"></a> e <a href="%(datagrams)s">datagrama</a> usando os protocolos <a href="%(sam)s">Simple Anonymous Messaging</a> ou <a href="%(bob)s">BOB</a> , que não exigem que os clientes lidem com nenhum tipo de criptografia. Além disso, os clientes podem acessar a rede por um dos vários proxies - HTTP, CONNECT e SOCKS 4/4a/5. Alternativamente, clientes Java podem acessar essas bibliotecas em ministreaming.jar e streaming.jar. Portanto, há várias opções para aplicativos Java e não Java.
tr: Uygulamalar, istemcilerin herhangi bir şifreleme türüyle uğraşmasını gerektirmeyen <a href="%(sam)s">Basit Anonim İletişim</a> ya da <a href="%(bob)s">BOB</a> iletişim kurallarını kullanarak temel I2CP yanında <a href="%(streaming)s">streaming</a> ve <a href="%(datagrams)s">veri şeması</a> kitaplıklarından yararlanabilir. Ayrıca istemciler, HTTP, CONNECT ve SOCKS 4/4a/5 gibi birkaç vekil sunucudan biriyle ağa erişebilir. Alternatif olarak, Java istemcileri bu kitaplıklara ministreaming.jar ve stream.jar dosyalarıyla erişebilir. Dolayısıyla hem Java hem de Java olmayan uygulamaların kullanabileceği çeşitli seçenekler vardır.

source: Client-side end-to-end encryption (encrypting the data over the I2CP connection) was disabled in I2P release 0.6, leaving in place the <a href="%(elgamalaes)s">ElGamal/AES end-to-end encryption</a> which is implemented in the router. The only cryptography that client libraries must still implement is <a href="%(cryptography)s#DSA">DSA public/private key signing</a> for <a href="%(i2cp)s#msg_CreateLeaseSet">LeaseSets</a> and <a href="%(i2cp)s#struct_SessionConfig">Session Configurations</a>, and management of those keys.
pt: A criptografia de ponta a ponta do lado do cliente (criptografando os dados pela conexão I2CP) foi desabilitada na versão 0.6 do I2P, deixando em vigor a <a href="%(elgamalaes)s">criptografia de ponta a ponta ElGamal/AES</a> que é implementada no roteador. A única criptografia que as bibliotecas cliente ainda devem implementar é <a href="%(cryptography)s#DSA">Assinatura de chave pública/privada DSA</a> para <a href="%(i2cp)s#msg_CreateLeaseSet">LeaseSets</a> e <a href="%(i2cp)s#struct_SessionConfig">Configurações de sessão</a>e gerenciamento dessas chaves.
tr: İstemci tarafında uçtan uca şifreleme (I2CP bağlantısı üzerinden verilerin şifrelenmesi), I2P 0.6 sürümüyle devre dışı bırakılmış ve yönelticide uygulanan <a href="%(elgamalaes)s">ElGamal/AES uçtan uca şifreleme</a> yerinde bırakılmıştır. İstemci kitaplıklarının hala uygulaması gereken tek şifreleme, <a href="%(i2cp)s#msg_CreateLeaseSet">"Kiralama kümeleri" (LeaseSets)</a> ve <a href="%(i2cp)s#struct_SessionConfig">Oturum yapılandırmaları</a> için <a href="%(cryptography)s#DSA">DSA herkese açık/kişisel anahtar imzalaması</a> ve bu anahtarların yönetimidir.

source: In a standard I2P installation, port 7654 is used by external java clients to communicate with the local router via I2CP. By default, the router binds to address 127.0.0.1. To bind to 0.0.0.0, set the router advanced configuration option <tt>i2cp.tcp.bindAllInterfaces=true</tt> and restart. Clients in the same JVM as the router pass messages directly to the router through an internal JVM interface.
pt: Em uma instalação I2P padrão, a porta 7654 é usada por clientes Java externos para se comunicar com o roteador local via I2CP. Por padrão, o roteador se vincula ao endereço 127.0.0.1. Para se vincular a 0.0.0.0, defina a opção de configuração avançada do roteador <tt>i2cp.tcp.bindAllInterfaces=true</tt> e reinicie. Os clientes na mesma JVM que o roteador passam mensagens diretamente para o roteador por meio de uma interface JVM interna.
tr: Standart bir I2P kurulumunda, 7654 numaralı bağlantı noktası, dış java istemcileri tarafından yerel yöneltici ile I2CP üzerinden iletişim kurmak için kullanılır. Varsayılan olarak, yöneltici 127.0.0.1 adresine bağlanır. 0.0.0.0 adresine bağlanmak için <tt>i2cp.tcp.bindAllInterfaces=true</tt> gelişmiş yöneltici yapılandırma seçeneğini ayarlayın ve yönelticiyi yeniden başlatın. Yöneltici ile aynı JVM üzerindeki istemciler, iletileri bir iç JVM arabirimi üzerinden doğrudan yönelticiye aktarır.

source: The router also supports external connections over SSL. While SSL is not the default, it is strongly recommended for any traffic that may be exposed to the open Internet. The authorization user/password (if any), the <a href="%(commonstructures)s#type_PrivateKey">Private Key</a> and <a href="%(commonstructures)s#type_SigningPrivateKey">Signing Private Key</a> for the <a href="%(commonstructures)s#struct_Destination">Destination</a> are all transmitted in-the-clear unless SSL is enabled.
pt: O roteador também suporta conexões externas por SSL. Embora SSL não seja o padrão, é altamente recomendado para qualquer tráfego que possa ser exposto à Internet aberta. O usuário/senha de autorização (se houver), a <a href="%(commonstructures)s#type_PrivateKey">Chave Privada</a> e <a href="%(commonstructures)s#type_SigningPrivateKey">Chave Privada de Assinatura</a> para o <a href="%(commonstructures)s#struct_Destination">Destino</a> são todos transmitidos em claro, a menos que SSL esteja habilitado.
tr: Yöneltici ayrıca SSL üzerinden dış bağlantılar kurulmasını da destekler. SSL kullanılması, varsayılan olarak olmasa da, açık İnternet üzerine çıkabilecek herhangi bir trafik için önemle önerilir. SSL etkinleştirilmedikçe, kimlik doğrulama kullanıcı adı/parolası (varsa), <a href="%(commonstructures)s#struct_Destination">Hedef</a> için <a href="%(commonstructures)s#type_PrivateKey">Kişisel anahtar</a> ve <a href="%(commonstructures)s#type_SigningPrivateKey">İmzalayan kişisel anahtar</a> verilerinin tümü, düz metin olarak iletilir.

source: I2CP Protocol Specification
pt: Especificação do Protocolo I2CP
tr: I2CP İletişim Kuralı Teknik Özellikleri

source: Now on the <a href="%(i2cp)s">I2CP Specification page</a>.
pt: Agora na <a href="%(i2cp)s">página da Especificação do I2CP</a>.
tr: <a href="%(i2cp)s">I2CP teknik özellikleri sayfası</a> içinde görülebilir.

source: I2CP Initialization
pt: Inicialização do I2CP
tr: I2CP Hazırlanması

source: When a client connects to the router, it first sends a single protocol version byte (0x2A). Then it sends a <a href="%(i2cp)s#msg_GetDate">GetDate Message</a> and waits for the <a href="%(i2cp)s#msg_SetDate">SetDate Message</a> response. Next, it sends a <a href="%(i2cp)s#msg_CreateSession">CreateSession Message</a> containing the session configuration. It next awaits a <a href="%(i2cp)s#msg_RequestLeaseSet">RequestLeaseSet Message</a> from the router, indicating that inbound tunnels have been built, and responds with a CreateLeaseSetMessage containing the signed LeaseSet. The client may now initiate or receive connections from other I2P destinations.
pt: Quando um cliente se conecta ao roteador, ele primeiro envia um único byte de versão de protocolo (0x2A). Em seguida, ele envia uma <a href="%(i2cp)s#msg_GetDate">Mensagem GetDate</a> e aguarda a resposta <a href="%(i2cp)s#msg_SetDate">Mensagem SetDate</a> . Em seguida, ele envia uma <a href="%(i2cp)s#msg_CreateSession">Mensagem CreateSession</a> contendo a configuração da sessão. Em seguida, ele aguarda uma <a href="%(i2cp)s#msg_RequestLeaseSet">Mensagem RequestLeaseSet</a> do roteador, indicando que os túneis de entrada foram construídos e responde com uma CreateLeaseSetMessage contendo o LeaseSet assinado. O cliente agora pode iniciar ou receber conexões de outros destinos I2P.
tr: Bir istemci yönelticiye bağlandığında, önce tek bir iletişim kuralı sürüm baytı (0x2A) gönderir. Ardından bir <a href="%(i2cp)s#msg_GetDate">GetDate iletisi</a> gönderir ve <a href="%(i2cp)s#msg_SetDate">SetDate iletisinin</a> yanıtını bekler. Daha sonra, oturum yapılandırmasını içeren bir <a href="%(i2cp)s#msg_CreateSession">CreateSession iletisi</a> gönderir. Son olarak yönelticiden gelen tünellerin oluşturulduğunu belirten bir <a href="%(i2cp)s#msg_RequestLeaseSet">RequestLeaseSet iletisi</a> bekler ve imzalı "Kiralama kümesini" (LeaseSet) içeren bir CreateLeaseSet iletisi ile yanıt verir. İstemci artık diğer I2P hedeflerine bağlantı gönderip alabilir.

source: I2CP Options
pt: Opções I2CP
tr: I2CP Ayarları

source: Router-side Options
pt: Opções do Roteador
tr: Yöneltici Tarafı Ayarları

source: The following options are traditionally passed to the router via a <a href="%(i2cp)s#struct_SessionConfig">SessionConfig</a> contained in a <a href="%(i2cp)s#msg_CreateSession">CreateSession Message</a> or a <a href="%(i2cp)s#msg_ReconfigureSession">ReconfigureSession Message</a>.
pt: As seguintes opções são tradicionalmente passadas ao roteador via um <a href="%(i2cp)s#struct_SessionConfig">SessionConfig</a> contido em uma <a href="%(i2cp)s#msg_CreateSession">CreateSession Message</a> ou uma <a href="%(i2cp)s#msg_ReconfigureSession">ReconfigureSession Message</a>.
tr: Aşağıdaki seçenekler geleneksel olarak yönelticiye içinde <a href="%(i2cp)s#msg_CreateSession">CreateSession Message</a> ya da <a href="%(i2cp)s#msg_ReconfigureSession">ReconfigureSession Message</a> bulunan bir <a href="%(i2cp)s#struct_SessionConfig">SessionConfig</a> aracılığıyla iletilir.

source: As Of Release
pt: Como Liberado
tr: Yayınlanma Tarihi

source: Recommended Arguments
pt: Argumentos recomendados
tr: Önerilen Argümanlar

source: Allowable Range
pt: Faixa permitida
tr: İzin Verilen Aralık

source: The timeout (ms) for all sent messages. Unused. See the protocol specification for per-message settings.
pt: O tempo limite (ms) para todas as mensagens enviadas. Não utilizado. Veja a especificação do protocolo para configurações por mensagem.
tr: Gönderilen tüm iletiler için zaman aşımı (ms). Kullanılmıyor. Tek tek ileti ayarları için iletişim kuralının teknik özelliklerine bakabilirsiniz.

source: Minimum number of ElGamal/AES Session Tags before we send more. Recommended: approximately tagsToSend * 2/3
pt: Número mínimo de tags de sessão ElGamal/AES antes de enviarmos mais. Recomendado: aproximadamente tagsToSend * 2/3
tr: Daha fazlası gönderilmeden önce iletilecek en az sayıda ElGamal/AES oturum etiketi. Önerilen: Yaklaşık olarak tagdsToSend * 2/3

source: Number of ElGamal/AES Session Tags to send at a time. For clients with relatively low bandwidth per-client-pair (IRC, some UDP apps), this may be set lower.
pt: Número de tags de sessão ElGamal/AES a serem enviadas por vez. Para clientes com largura de banda relativamente baixa por par de clientes (IRC, alguns aplicativos UDP), isso pode ser definido como um valor menor.
tr: Bir seferde gönderilecek ElGamal/AES oturum etiketlerinin sayısı. İstemci çiftinin bant genişliği nispeten düşük olan istemciler için (IRC, bazı UDP uygulamaları), bu değer daha düşük ayarlanabilir.

source: Comma-separated list of Base 64 Hashes of peers to build tunnels through; for debugging only
pt: Lista separada por vírgulas de Hashes Base 64 de pares para construir túneis; somente para depuração
tr: Tüneller oluşturulacak eşlerin Base 64 karmalarının virgül ile ayrılmış listesi. Yalnızca hata ayıklama için

source: Should generally be set to true for clients and false for servers
pt: Geralmente deve ser definido como verdadeiro para clientes e falso para servidores
tr: Genellikle istemciler için true, sunucular için false olarak ayarlanmalıdır

source: If true, the router just sends the MessagePayload instead of sending a MessageStatus and awaiting a ReceiveMessageBegin.
pt: Se verdadeiro, o roteador apenas envia o MessagePayload em vez de enviar um MessageStatus e aguardar um ReceiveMessageBegin.
tr: True olarak ayarlandığında, yöneltici bir MessageStatus göndermek ve bir ReceiveMessageBegin beklemek yerine MessagePayload gönderir.
