Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: <b>I2P Client Layer:</b> allow any client to use I2P functionality, without requiring the direct use of the router API.
pt: <b>Camada de cliente I2P:</b> permite que qualquer cliente use a funcionalidade I2P, sem exigir o uso direto da API do roteador.
tr: <b>I2P istemci katmanı:</b> Herhangi bir istemcinin yöneltici API uygulamasını doğrudan kullanmasına gerek kalmadan I2P işlevlerini kullanmasını sağlar.

source: <a href="%(i2cp)s">I2CP</a>: I2P Client Protocol, allows secure and asynchronous messaging over I2P by communicating messages over the I2CP TCP socket.
pt: <a href="%(i2cp)s">I2CP</a>: Protocolo de cliente I2P, permite mensagens seguras e assíncronas via I2P, comunicando mensagens pelo soquete TCP I2CP.
tr: <a href="%(i2cp)s">I2CP</a>: I2P istemci iletişim kuralı, iletileri I2CP TCP soketi üzerinden ileterek I2P üzerinden güvenli ve asenkron iletişim sağlar.

source: <b>I2P End-to-end Transport Layer:</b> allow TCP- or UDP-like functionality on top of I2P.
pt: <b>Camada de transporte ponta a ponta I2P:</b> permite funcionalidade semelhante a TCP ou UDP sobre I2P.
tr: <b>I2P uçtan uca taşıma katmanı:</b> I2P üzerinde TCP veya UDP benzeri işlevsellik sağlar.

source: <a href="%(streaming)s">Streaming Library</a>: an implementation of TCP-like streams over I2P. This allows easier porting of existing applications to I2P.
pt: <a href="%(streaming)s">Streaming Library</a>: uma implementação de fluxos do tipo TCP sobre I2P. Isso permite portabilidade mais fácil de aplicativos existentes para I2P.
tr: <a href="%(streaming)s">Streaming kitaplığı</a>: I2P üzerinde TCP benzeri akışların bir uygulamasıdır. Var olan uygulamaların I2P üzerine daha kolay taşınmasını sağlar.

source: <a href="%(datagrams)s">Datagram Library</a>: an implementation of UDP-like messages over I2P. This allows easier porting of existing applications to I2P.
pt: <a href="%(datagrams)s">Biblioteca de Datagramas</a>: uma implementação de mensagens do tipo UDP sobre I2P. Isso permite portabilidade mais fácil de aplicativos existentes para I2P.
tr: <a href="%(datagrams)s">Veri şeması kitaplığı</a>: I2P üzerinde UDP benzeri iletilerin bir uygulamasıdır. Var olan uygulamaların I2P üzerine daha kolay taşınmasını sağlar.

source: <b>I2P Application Interface Layer:</b> additional (optional) libraries allowing easier implementations on top of I2P.
pt: <b>Camada de interface de aplicação I2P:</b> bibliotecas adicionais (opcionais) que permitem implementações mais fáceis sobre I2P.
tr: <b>I2P uygulama arayüzü katmanı:</b> I2P üzerine uygulamaları kolaylaştıran ek (isteğe bağlı) kitaplıklar.

source: <b>I2P Application Proxy Layer:</b> proxy systems.
pt: <b>Camada de proxy de aplicativo I2P:</b> sistemas proxy.
tr: <b>I2P uygulama vekil sunucu katmanı:</b> Vekil sunucu sistemleri.

source: HTTP Client/Server, IRC Client, <a href="%(socks)s">SOCKS</a>, Streamr
pt: Cliente/Servidor HTTP, Cliente IRC, <a href="%(socks)s">SOCKS</a>, Streamr
tr: HTTP istemcisi/sunucusu, IRC istemcisi, <a href="%(socks)s">SOCKS</a>, Streamr

source: Finally, what could be considered the <b>'I2P application layer'</b>, is a large number of applications on top of I2P. We can order this based on the I2P stack layer they use.
pt: Por fim, o que poderia ser considerado a <b>'camada de aplicação I2P'</b>é um grande número de aplicações sobre I2P. Podemos ordenar isso com base na camada de pilha I2P que eles usam.
tr: Son olarak, <b>'I2P uygulama katmanı'</b> olarak kabul edilebilecek olan, I2P üzerinde çalışan çok sayıda uygulamadır. Bunları kullandıkları I2P yığın katmanına göre sıralayabiliriz.

source: <b>Streaming/datagram applications</b>: i2psnark, Syndie, i2phex...
pt: <b>Aplicações de streaming/datagrama</b>: i2psnark, Syndie, i2phex...
tr: <b>Streaming/veri şeması uygulamaları</b>: i2psnark, Syndie, i2phex...

source: <b>SAM applications</b>: IMule, i2p-bt...
pt: <b>Aplicações SAM</b>: IMule, i2p-bt...
tr: <b>SAM uygulamaları</b>: IMule, i2p-bt...

source: <b>Other I2P applications</b>: Syndie, EepGet, <a href="%(plugins)s">plugins</a>...
pt: <b>Outros aplicativos I2P</b>: Syndie, EepGet, <a href="%(plugins)s">plugins</a>...
tr: <b>Diğer I2P uygulamaları</b>: Syndie, EepGet, <a href="%(plugins)s">uygulama ekleri</a>...

source: <b>Regular applications</b>: Jetty, Apache, Git, browsers, e-mail...
pt: <b>Aplicações regulares</b>: Jetty, Apache, Git, navegadores, e-mail...
tr: <b>Normal uygulamalar</b>: Jetty, Apache, Git, tarayıcılar, e-posta...

source: I2P Network stack
pt: Pilha de rede I2P
tr: I2P ağ yığını

source: Figure 1: The layers in the I2P Network stack.
pt: Figura 1: As camadas na pilha de rede I2P.
tr: Şekil 1: I2P ağ yığınının katmanları.

source: Note: SAM can use both the streaming lib and datagrams.
pt: Observação: o SAM pode usar tanto a biblioteca de streaming quanto os datagramas.
tr: Not: SAM hem streaming kitaplığını hem de veri şemalarını kullanabilir.

source: Transport Overview
pt: Visão geral do transporte
tr: Taşıyıcı Özeti

source: June 2018
pt: Junho de 2018
tr: 2018 Haziran

source: Transports in I2P
pt: Transportes na I2P
tr: I2P Taşıyıcıları

source: A "transport" in I2P is a method for direct, point-to-point communication between two routers. Transports must provide confidentiality and integrity against external adversaries while authenticating that the router contacted is the one who should receive a given message.
pt: Um "transporte" no I2P é um método para comunicação direta ponto a ponto entre dois roteadores. Os transportes devem fornecer confidencialidade e integridade contra adversários externos enquanto autenticam que o roteador contatado é aquele que deve receber uma determinada mensagem.
tr: I2P üzerindeki bir "taşıyıcı", iki yöneltici arasında doğrudan, noktadan noktaya iletişim sağlamak için kullanılan bir yöntemdir. Taşıyıcılar, iletişim kurulan yönelticinin belirli bir iletiyi alması gereken kişi olduğunu doğrularken, dış saldırganlara karşı gizlilik ve bütünlük sağlamalıdır.

source: I2P supports multiple transports simultaneously. There are three transports currently implemented:
pt: O I2P suporta múltiplos transportes simultaneamente. Existem três transportes implementados atualmente:
tr: I2P aynı anda birçok taşıyıcıyı destekler. Şu anda kullanılan üç taşıyıcı var:

source: <a href="%(ntcp)s">NTCP</a>, a Java New I/O (NIO) TCP transport
pt: <a href="%(ntcp)s">NTCP</a>, um transporte TCP Java New I/O (NIO)
tr: <a href="%(ntcp)s">NTCP</a>, bir Java yeni giriş/çıkış (NIO) TCP taşıyıcısı

source: <a href="%(ssu)s">SSU</a>, or Secure Semireliable UDP
pt: <a href="%(ssu)s">SSU</a>, ou UDP Semiconfiável Seguro
tr: <a href="%(ssu)s">SSU</a>, ya da Secure Semireliable UDP

source: <a href="%(ntcp2)s">NTCP2</a>, a new version of NTCP
pt: <a href="%(ntcp2)s">NTCP2</a>, uma nova versão do NTCP
tr: <a href="%(ntcp2)s">NTCP2</a>, yeni bir NTCP sürümü

source: Each provides a "connection" paradigm, with authentication, flow control, acknowledgments and retransmission.
pt: Cada um fornece um paradigma de "conexão", com autenticação, controle de fluxo , confirmações e retransmissão.
tr: Her biri, kimlik doğrulama, akış denetimi, bildirimler ve yeniden iletim ile bir "bağlantı" paradigması sağlar.

source: Transport Services
pt: Serviços de Transporte
tr: Taşıyıcı Hizmetleri

source: The transport subsystem in I2P provides the following services:
pt: O subsistema de transporte no I2P fornece os seguintes serviços:
tr: I2P üzerindeki taşıyıcı alt sistemi şu hizmetleri sağlar:

source: Reliable delivery of <a href="%(i2np)s">I2NP</a> messages. Transports support I2NP message delivery ONLY. They are not general-purpose data pipes.
pt: Entrega confiável de mensagens <a href="%(i2np)s">I2NP</a> . Os transportes suportam SOMENTE a entrega de mensagens I2NP. Eles não são pipes de dados de uso geral.
tr: <a href="%(i2np)s">I2NP</a> iletilerinin güvenilir şekilde aktarılması. Taşıyıcılar YALNIZCA I2NP ileti aktarımını destekler. Genel amaçlı veri boruları değildirler.

source: In-order delivery of messages is NOT guaranteed by all transports.
pt: A entrega de mensagens em ordem NÃO é garantida por todos os transportes.
tr: İletilerin sırayla aktarılması tüm taşıyıcılar tarafından garanti EDİLMEZ.

source: Maintain a set of router addresses, one or more for each transport, that the router publishes as its global contact information (the RouterInfo). Each transport may connect using one of these addresses, which may be IPv4 or (as of version 0.9.8) IPv6.
pt: Mantenha um conjunto de endereços de roteador, um ou mais para cada transporte, que o roteador publica como suas informações de contato globais (o RouterInfo). Cada transporte pode se conectar usando um desses endereços, que pode ser IPv4 ou (a partir da versão 0.9.8) IPv6.
tr: Yönelticinin küresel iletişim bilgileri olarak yayınladığı "Yöneltici bilgileri" (RouterInfo), her taşıyıcı için bir ya da birkaç tane olabilen bir dizi yöneltici adresini tutar. Her taşıyıcı, IPv4 veya (0.9.8 sürümünden başlayarak) IPv6 üzerinden bu adreslerden birini kullanarak bağlanabilir.

source: Selection of the best transport for each outgoing message
pt: Seleção do melhor transporte para cada mensagem de saída
tr: Her giden ileti için en iyi taşıyıcıyı seçer

source: Queueing of outbound messages by priority
pt: Enfileiramento de mensagens de saída por prioridade
tr: Giden iletileri önceliklerine göre kuyruğa ekler

source: Bandwidth limiting, both outbound and inbound, according to router configuration
pt: Limitação de largura de banda, tanto de saída quanto de entrada, de acordo com a configuração do roteador
tr: Yöneltici yapılandırmasına göre hem gidiş hem de geliş bant genişliği sınırlar

source: Setup and teardown of transport connections
pt: Configuração e desmontagem de conexões de transporte
tr: Taşıyıcı bağlantılarını kurar ve kaldırır

source: Encryption of point-to-point communications
pt: Criptografia de comunicações ponto a ponto
tr: Noktadan noktaya iletişimi şifreler

source: Maintenance of connection limits for each transport, implementation of various thresholds for these limits, and communication of threshold status to the router so it may make operational changes based on the status
pt: Manutenção dos limites de conexão para cada transporte, implementação de vários limites para esses limites, e comunicação do status do limite ao roteador para que ele possa fazer alterações operacionais com base no status
tr: Her taşıyıcı için bağlantı sınırlarını gözetir. Bu sınırlar için çeşitli eşikleri uygular ve eşik durumunu yönelticiye bildirir. Böylece duruma göre operasyonel değişiklikler yapabilir

source: Firewall port opening using UPnP (Universal Plug and Play)
pt: Abertura de porta de firewall usando UPnP (Universal Plug and Play)
tr: UPnP (Evrensel tak ve çalıştır) kullanarak güvenlik duvarında bağlantı noktası açar

source: Cooperative NAT/Firewall traversal
pt: Travessia cooperativa de NAT/Firewall
tr: İş birlikli NAT/Güvenlik duvarı geçişi sağlar

source: Local IP detection by various methods, including UPnP, inspection of incoming connections, and enumeration of network devices
pt: Detecção de IP local por vários métodos, incluindo UPnP, inspeção de conexões de entrada e enumeração de dispositivos de rede
tr: UPnP, geliş bağlantılarını inceler ve ağ aygıtlarının belirlenmesi ile birlikte çeşitli yöntemlerle yerel IP adreslerini algılar

source: Coordination of firewall status and local IP, and changes to either, among the transports
pt: Coordenação do status do firewall e IP local, e alterações em ambos, entre os transportes
tr: Güvenlik duvarı durumu ve yerel IP adreslerinin koordinasyonu ile taşıyıcılar arasında değişiklikler yapar

source: Communication of firewall status and local IP, and changes to either, to the router and the user interface
pt: Comunicação do status do firewall e do IP local, e alterações em ambos, no roteador e na interface do usuário
tr: Güvenlik duvarı durumu ve yerel IP adresi iletişimi ile yöneltici ve kullanıcı arabiriminde değişiklikler yapar

source: Determination of a consensus clock, which is used to periodically update the router's clock, as a backup for NTP
pt: Determinação de um relógio de consenso, que é usado para atualizar periodicamente o relógio do roteador, como um backup para NTP
tr: NTP için yedek olarak yönelticinin saatini düzenli olarak güncellemek için kullanılan bir uzlaşma saati belirler

source: Maintenance of status for each peer, including whether it is connected, whether it was recently connected, and whether it was reachable in the last attempt
pt: Manutenção do status de cada par, incluindo se ele está conectado, se foi conectado recentemente, e se ele foi alcançável na última tentativa
tr: Her eşin, bağlı olup olmadığı, yakın zamanda bağlanıp bağlanmadığı ve son denemede erişilebilir olup olmadığı gibi durum bilgilerini tutar

source: Qualification of valid IP addresses according to a local rule set
pt: Qualificação de endereços IP válidos de acordo com um conjunto de regras locais
tr: Yerel bir kural kümesine göre geçerli IP adreslerini sınıflandırır

source: Honoring the automated and manual lists of banned peers maintained by the router, and refusing outbound and inbound connections to those peers
pt: Honrando as listas automatizadas e manuais de pares banidos mantidas pelo roteador, e recusando conexões de saída e entrada para esses pares
tr: Yöneltici tarafından otomatik ve el ile tutulan yasaklanmış eş listelerini değerlendirir ve bu eşlerin giden ve gelen bağlantılarını reddeder

source: Transport Addresses
pt: Endereços de Transporte
tr: Taşıyıcı Adresleri

source: The transport subsystem maintains a set of router addresses, each of which lists a transport method, IP, and port. These addresses constitute the advertised contact points, and are published by the router to the network database. Addresses may also contain an arbitrary set of additional options.
pt: O subsistema de transporte mantém um conjunto de endereços de roteador, cada um dos quais lista um método de transporte, IP e porta. Esses endereços constituem os pontos de contato anunciados e são publicados pelo roteador no banco de dados da rede. Os endereços também podem conter um conjunto arbitrário de opções adicionais.
tr: Taşıyıcı alt sistemi, her biri bir taşıyıcı yöntemi, IP adresi ve bağlantı noktası içeren bir dizi yöneltici adresi tutar. Bu adresler, duyurulan iletişim noktalarını oluşturur ve yöneltici tarafından ağ veri tabanında yayınlanır. Adreslerde ayrıca isteğe bağlı bir dizi ek seçenek bulunabilir.

source: Each transport method may publish multiple router addresses.
pt: Cada método de transporte pode publicar vários endereços de roteador.
tr: Her bir taşıyıcı yöntemi birkaç yöneltici adresi yayınlayabilir.

source: Typical scenarios are:
pt: Os cenários típicos são:
tr: Tipik senaryolar şunlardır:

source: A router has no published addresses, so it is considered "hidden" and cannot receive incoming connections
pt: Um roteador não tem endereços publicados, então ele é considerado "oculto" e não pode receber conexões de entrada
tr: Bir yönelticinin yayınlanmış bir adresi yoktur. Bu nedenle "gizli" olarak kabul edilir ve gelen bağlantıları alamaz

source: A router is firewalled, and therefore publishes an SSU address which contains a list of cooperating peers or "introducers" who will assist in NAT traversal (see <a href="%(ssu)s">the SSU spec</a> for details)
pt: Um roteador é protegido por firewall e, portanto, publica um endereço SSU que contém uma lista de pares cooperantes ou "introdutores" que ajudarão na travessia do NAT (veja <a href="%(ssu)s">a especificação SSU</a> para detalhes)
tr: Bir yöneltici güvenlik duvarı arkasındadır ve bu nedenle, NAT geçişine yardımcı olacak işbirliği yapan eşlerin veya "tanıtıcıların" bir listesinin bulunduğu bir SSU adresi yayınlar (ayrıntılı bilgi almak için<a href="%(ssu)s">SSU teknik özellikleri</a> bölümüne bakabilirsiniz)

source: A router is not firewalled or its NAT ports are open; it publishes both NTCP and SSU addresses containing directly-accessible IP and ports.
pt: Um roteador não tem firewall ou suas portas NAT estão abertas; ele publica endereços NTCP e SSU contendo IPs e portas diretamente acessíveis.
tr: Yöneltici güvenlik duvarı arkasında değildir veya NAT bağlantı noktaları açıktır. Doğrudan erişilebilir IP adresi ve bağlantı noktaları içeren NTCP ve SSU adresleri yayınlar.

source: Transport Selection
pt: Seleção de Transporte
tr: Taşıyıcı Seçimi

source: The transport system delivers <a href="%(i2np)s">I2NP messages</a> only. The transport selected for any message is independent of the upper-layer protocols and contents (router or client messages, whether an external application was using TCP or UDP to connect to I2P, whether the upper layer was using <a href="%(streaming)s">the streaming library</a> streaming or <a href="%(datagrams)s">datagrams</a>, datagrams etc.).
pt: O sistema de transporte entrega <a href="%(i2np)s">mensagens I2NP</a> somente. O transporte selecionado para qualquer mensagem é independente dos protocolos e conteúdos da camada superior (mensagens do roteador ou do cliente, se um aplicativo externo estava usando TCP ou UDP para se conectar ao I2P, se a camada superior estava usando <a href="%(streaming)s">a biblioteca de streaming</a> streaming ou <a href="%(datagrams)s">datagramas</a>, datagramas etc.).
tr: Taşıyıcı sistemi yalnızca <a href="%(i2np)s">I2NP iletilerini</a> aktarır. Herhangi bir ileti için seçilen taşıyıcı, üst katman iletişim kurallarından ve içeriklerinden bağımsızdır (yöneltici veya istemci iletileri, bir dış uygulamanın I2P bağlantısı kurmak için TCP veya UDP kullanıp kullanmadığı, üst katmanın <a href="%(streaming)s">streaming kitaplığı</a> akış veya <a href="%(datagrams)s">veri şemaları</a>, veri şemaları kullanıp kullanmadığı, vb.).

source: For each outgoing message, the transport system solicits "bids" from each transport. The transport bidding the lowest (best) value wins the bid and receives the message for delivery. A transport may refuse to bid.
pt: Para cada mensagem de saída, o sistema de transporte solicita "lances" de cada transporte. O transporte que oferece o menor (melhor) valor vence o lance e recebe a mensagem para entrega. Um transporte pode se recusar a oferecer lances.
tr: Her giden ileti için, taşıyıcı sistemi her taşıyıcıdan "teklif" ister. En düşük (en iyi) değeri veren taşıyıcı kazanır ve aktarım için iletiyi alır. Bir taşıyıcı teklif vermeyi reddedebilir.

source: Whether a transport bids, and with what value, depend on numerous factors:
pt: Se um transporte faz uma oferta e com qual valor, depende de vários fatores:
tr: Bir taşıyıcının teklif verip vermeyeceği ve hangi değerde olacağı birçok faktöre bağlıdır:

source: Configuration of transport preferences
pt: Configuração de preferências de transporte
tr: Taşıyıcı ayarlarının yapılandırılması

source: Whether the transport is already connected to the peer
pt: Se o transporte já está conectado ao peer
tr: Taşıyıcının eşe zaten bağlı olup olmadığı

source: The number of current connections compared to various connection limit thresholds
pt: O número de conexões atuais em comparação com vários limites de conexão
tr: Çeşitli bağlantı sınırı eşiklerine göre var olan bağlantı sayısı

source: Whether recent connection attempts to the peer have failed
pt: Se as tentativas recentes de conexão com o peer falharam
tr: Eşe yapılan son bağlantı denemelerinin başarısız olup olmadığı

source: The size of the message, as different transports have different size limits
pt: O tamanho da mensagem, pois diferentes transportes têm limites de tamanho diferentes
tr: Farklı taşıyıcılar farklı boyut sınırlarına sahip olduğundan iletinin boyutu

source: Whether the peer can accept incoming connections for that transport, as advertised in its RouterInfo
pt: Se o par pode aceitar conexões de entrada para esse transporte, conforme anunciado em seu RouterInfo
tr: Eşin, "Yöneltici bilgileri" (RouterInfo) verilerinde duyurulduğu gibi, bu taşıyıcının gelen bağlantıları kabul edip edemeyeceği

source: Whether the connection would be indirect (requiring introducers) or direct
pt: Se a conexão seria indireta (exigindo apresentadores) ou direta
tr: Bağlantının dolaylı mı (tanıtıcılar gerektiren) yoksa doğrudan mı olacağı

source: The peer's transport preference, as advertised in its RouterInfo
pt: A preferência de transporte do peer, conforme anunciado em seu RouterInfo
tr: "Yöneltici bilgileri" (RouterInfo) verilerinde duyurulan eşin taşıyıcı tercihi

source: In general, the bid values are selected so that two routers are only connected by a single transport at any one time. However, this is not a requirement.
pt: Em geral, os valores de lance são selecionados para que dois roteadores sejam conectados apenas por um único transporte a qualquer momento. No entanto, isso não é um requisito.
tr: Genel olarak, teklif değerleri, iki yöneltici herhangi bir zamanda yalnızca tek bir taşıyıcı ile bağlanacak şekilde seçilir. Ancak bu bir gereklilik değildir.

source: New Transports and Future Work
pt: Novos Transportes e Trabalho Futuro
tr: Yeni Taşıyıcılar ve Gelecekteki Çalışmalar

source: Additional transports may be developed, including:
pt: Transportes adicionais podem ser desenvolvidos, incluindo:
tr: Şunlar gibi ek taşıyıcılar geliştirilebilir:

source: A TLS/SSH look-alike transport
pt: Um transporte semelhante ao TLS/SSH
tr: TLS/SSH gibi görünen bir taşıyıcı

source: An "indirect" transport for routers that are not reachable by all other routers (one form of "restricted routes")
pt: Um transporte "indireto" para roteadores que não podem ser alcançados por todos os outros roteadores (uma forma de "rotas restritas")
tr: Diğer tüm yönelticiler tarafından erişilemeyen yönelticiler için "dolaylı" bir taşıyıcı ("kısıtlanmış rotaların bir biçimi")

source: Tor-compatible pluggable transports
pt: Transportes plugáveis compatíveis com Tor
tr: Tor uyumlu değiştirilebilir taşıyıcılar

source: Work continues on adjusting default connection limits for each transport. I2P is designed as a "mesh network", where it is assumed that any router can connect to any other router. This assumption may be broken by routers that have exceeded their connection limits, and by routers that are behind restrictive state firewalls (restricted routes).
pt: O trabalho continua no ajuste dos limites de conexão padrão para cada transporte. O I2P é projetado como uma "rede mesh", onde se presume que qualquer roteador pode se conectar a qualquer outro roteador. Essa suposição pode ser quebrada por roteadores que excederam seus limites de conexão e por roteadores que estão atrás de firewalls de estado restritivo (rotas restritas).
tr: Her taşıyıcı için varsayılan bağlantı sınırlarını ayarlama çalışmaları sürüyor. I2P, herhangi bir yönelticinin başka bir yönelticiye bağlanabileceği varsayıldığı bir "ağ örgüsü" olarak tasarlanmıştır. Bu varsayım, bağlantı sınırlarını aşan yönelticiler ve kısıtlayıcı durum güvenlik duvarlarının (kısıtlanmış rotalar) arkasındaki yönelticiler tarafından bozulabilir.
