Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: See also the sources for plugins developed by various people. Some plugins, such as <a href="http://%(pluginsite)s/plugins/snowman">snowman</a>, were developed specifically as examples.
pt: Veja também as fontes para plugins desenvolvidos por várias pessoas. Alguns plugins, como como <a href="http://%(pluginsite)s/plugins/snowman">snowman</a>, foram desenvolvidos especificamente como exemplos.
tr: Ayrıca çeşitli kişiler tarafından geliştirilen uygulama eki kaynaklarına da bakın. Özellikle örnek olarak <a href="http://%(pluginsite)s/plugins/snowman">snowman</a> gibi bazı uygulama ekleri geliştirilmiştir.

source: <b>Developers wanted!</b> Plugins are a great way to learn more about I2P or easily add some feature.
pt: <b>Procura-se desenvolvedores!</b> Extensões são uma ótima maneira de aprender mais sobre a I2P ou facilmente adicionar alguma funcionalidade.
tr: <b>Geliştiriciler arıyoruz!</b> Uygulama ekleri, I2P hakkında daha fazla bilgi edinmenin veya kolayca bazı özellikler eklemenin harika bir yoludur.

source: Getting Started
pt: Primeiros passos
tr: Başlarken

source: To create a plugin from an existing binary package you will need to get makeplugin.sh from <a href="%(url)s">the i2p.scripts branch in monotone</a>.
pt: Para criar um plugin a partir de um pacote binário existente, você precisará obter makeplugin.sh de <a href="%(url)s">a ramificação i2p.scripts em monotone</a>.
tr: Var olan bir binary paketinden bir uygulama eki oluşturmak için <a href="%(url)s">monotone üzerindeki i2p.scripts dalından</a> makeplugin.sh dosyasını almalısınız.

source: Known Issues
pt: Problemas Conhecidos
tr: Bilinen Sorunlar

source: Note that the router's plugin architecture does <b>NOT</b> currently provide any additional security isolation or sandboxing of plugins.
pt: Observe que a arquitetura de plug-ins do roteador <b>NÃO</b> atualmente fornece qualquer isolamento de segurança adicional ou sandbox de plug-ins.
tr: Yönelticinin uygulama eki mimarisinin şu anda herhangi bir ek güvenlik yalıtımı veya uygulama eki sanal alanı <b>sağlamadığını</b> unutmayın.

source: Updates of a plugin with included jars (not wars) won't be recognized if the plugin was already run, as it requires class loader trickery to flush the class cache; a full router restart is required.
pt: Atualizações de um plugin com jars incluídos (não wars) não serão reconhecidas se o plugin já tiver sido executado, pois requer truques do carregador de classes para liberar o cache de classe ; uma reinicialização completa do roteador é necessária.
tr: Sınıf ön belleğini temizlemek için sınıf yükleyici kandırmak gerektirdiğinden, uygulama eki zaten çalıştırılmışsa, katılmış jar dosyalarını (war dosyaları değil) içeren bir uygulama ekinin güncellemeleri tanınmaz. Yönelticinin tam olarak yeniden başlatılması gereklidir.

source: The stop button may be displayed even if there is nothing to stop.
pt: O botão de parada pode ser exibido mesmo que não haja nada para parar.
tr: Durdurulacak bir şey olmasa bile durdurma düğmesi görüntülenebilir.

source: Plugins running in a separate JVM create a <code>logs/</code> directory in <code>$CWD</code>.
pt: Extensões rodando em Máquina Virtual Java separada criam um diretório de <code>registros/</code> em <code>$CWD</code>.
tr: Ayrı bir Java sanal makinesinde çalışan uygulama ekleri, <code>$CWD</code> içinde <code>logs/</code> klasörü oluşturur.

source: No initial keys are present, except for those of jrandom and zzz (using the same keys as for router update), so the first key seen for a signer is automatically accepted&mdash;there is no signing key authority.
pt: Nenhuma chave inicial está presente, exceto as de jrandom e zzz (usando as mesmas chaves da atualização do roteador), então a primeira chave vista para um signatário é aceita automaticamente&mdash;não há autoridade de chave de assinatura.
tr: jrandom ve zzz (yöneltici güncellemesiyle aynı anahtarları kullanan) dışında başka bir başlangıç anahtarı yoktur. Bu nedenle bir imzalayan için görülen ilk anahtar otomatik olarak kabul edilir ve başka bir imzalama anahtarının yetkisi yoktur.

source: When deleting a plugin, the directory is not always deleted, especially on Windows.
pt: Quando se apaga uma extensão, o diretório nem sempre é apagado, especialmente no Windows.
tr: Bir uygulama ekini silerken, özellikle Windows üzerinde klasör her zaman silinmez.

source: Installing a plugin requiring Java 1.6 on a Java 1.5 machine will result in a "plugin is corrupt" message if pack200 compression of the plugin file is used.
pt: Instalar um plugin que requer Java 1.6 em uma máquina Java 1.5 resultará em uma mensagem "plugin está corrompido" se a compactação pack200 do arquivo de plugin for usada.
tr: Java 1.5 makinesine Java 1.6 gerektiren bir uygulama eki kurmak, uygulama eki dosyasının pack200 sıkıştırması kullanılırsa "uygulama eki bozuk" iletisi görüntülenir.

source: Theme and translation plugins are untested.
pt: Os plugins de tema e tradução não foram testados.
tr: Tema ve çeviri uygulama ekleri denenmemiştir.

source: Disabling autostart doesn't always work.
pt: Desativar a autoinicialização nem sempre funciona.
tr: Otomatik başlatmayı devre dışı bırakmak her zaman işe yaramaz.

source: Ports Used by I2P
pt: Portas usadas pela I2P
tr: I2P Tarafından Kullanılan Bağlantı Noktaları

source: These are the ports used or reserved by I2P, including those for known plugins, common alternates, and some typical related applications.
pt: Estas são as portas usadas ou reservadas pelo I2P, incluindo aquelas para plugins conhecidos, alternativas comuns, e alguns aplicativos típicos relacionados.
tr: Bunlar, bilinen uygulama ekleri, ortak alternatifler ve bazı tipik ilgili uygulamalar için olanlarla birlikte I2P tarafından kullanılan veya ayrılmış bağlantı noktalarıdır.

source: Note that many of these are not enabled by default. There is more information in <a href="%(faq)s#ports">the FAQ</a>. See also the documentation for individual plugins. Plugin authors please add any ports you use here. For new plugins, we recommend using the next available port in the 767x range.
pt: Observe que muitos deles não são habilitados por padrão. Há mais informações em <a href="%(faq)s#ports">as Perguntas Frequentes</a>. Veja também a documentação para plugins individuais. Autores de plugins, por favor, adicionem aqui quaisquer portas que vocês usarem. Para novos plugins, recomendamos usar a próxima porta disponível no intervalo 767x.
tr: Bunların çoğunun varsayılan olarak etkin olmadığını unutmayın. <a href="%(faq)s#ports">SSS</a> bölümünde daha fazla bilgi bulabilirsiniz. Ayrıca bireysel uygulama ekleri için belgelere bakın. Uygulama eki geliştiricileri lütfen kullandığınız bağlantı noktalarını buraya ekleyin. Yeni eklentiler için 767x aralığındaki bir sonraki uygun bağlantı noktasını kullanmanızı öneririz.

source: recommended spot for new plugins/applications
pt: local recomendado para novos plugins/aplicativos
tr: yeni uygulama ekleri/uygulamalar için önerilen nokta

source: Reseed Hosts
tr: Yeniden Tohumlama Sunucuları

source: September 2021
pt: Setembro de 2021
tr: 2021 Eylül

source: About Reseed hosts
pt: Sobre os anfitriões do Reseed
tr: Yeniden tohumlama sunucuları hakkında

source: Reseed hosts are needed to for bootstrapping, that is, providing the initial set of I2P nodes for your I2P node to talk to. Depending on the status of your node it may need to bootstrap every now and then if many of the nodes it knows of aren't contactable.
pt: Os hosts de reseed são necessários para bootstrapping, ou seja, fornecer o conjunto inicial de nós I2P para seu nó I2P conversar. Dependendo do status do seu nó , ele pode precisar fazer bootstrap de vez em quando se muitos dos nós que ele conhece não forem contatáveis.
tr: Ön yükleme için, yani I2P düğümünüzün konuşması için ilk I2P düğümleri kümesini sağlamak amacıyla yeniden tohumlama sunucularına gerek vardır. Düğümünüzün durumuna bağlı olarak, bildiği düğümlerin çoğuna ulaşılamıyorsa, ara sıra ön yükleme yapması gerekebilir.

source: Reseeding is done over an encrypted connection and all of the bootstrap information is signed by the reseed host you connect to, making it impossible for an unauthenticated source to provide you with false information.
pt: A reseed é feita por meio de uma conexão criptografada e todas as informações de bootstrap são assinadas pelo host de reseed ao qual você se conecta, tornando impossível que uma fonte não autenticada forneça informações falsas.
tr: Yeniden tohumlama, şifrelenmiş bir bağlantı üzerinden yapılır ve tüm ön yükleme bilgileri, bağlandığınız yeniden tohumlama sunucusu tarafından imzalanır. Böylece, kimliği doğrulanmamış bir kaynağın size yanlış bilgi vermesi olanaksız olur.

source: Running a Reseed host
pt: Executando um host Reseed
tr: Bir yeniden tohumlama sunucusu işletmek

source: Operating a reseed server can be accessible to any sysadmin familiar with I2P, and we encourage new reseed operators to get in contact with us at <a href="http://zzz.i2p">the development forums</a>. The more reseed hosts that are run, the more resilient the I2P network becomes, and the harder it is to prevent users of I2P from connecting to the network.
pt: Operar um servidor de reseed pode ser acessível a qualquer administrador de sistema familiarizado com I2P, e encorajamos novos operadores de reseed a entrar em contato conosco em <a href="http://zzz.i2p">os fóruns de desenvolvimento</a>. Quanto mais hosts de reseed são executados, mais resiliente a rede I2P se torna, e mais difícil é impedir que usuários do I2P se conectem à rede.
tr: Bir yeniden tohumlama sunucusu işletmek, I2P ağına aşina olan herhangi bir sistem yöneticisi tarafından yapılabilir ve yeni yeniden tohumlama sunucusu işletmecilerinin <a href="http://zzz.i2p">geliştirme forumlarında</a> bizimle iletişime geçmesini istiyoruz. Ne kadar çok yeniden tohumlama sunucusu işletilirse, I2P ağı o kadar esnek hale gelir ve I2P kullanıcılarının ağa bağlanmasını engellemek de o kadar zorlaşır.

source: Other ways of Reseeding
pt: Outras formas de ressemeadura
tr: Diğer Yeniden Tohumlama Yolları

source: In order to make I2P more reslient, other kinds of reseeding are possible. One important way of carrying out a reseed is the file-based reseed, where a user with a running I2P router generates a reseed file for a friend and transfers it to them as a .zip file. Others use cloud-based infrastructure to resist censorship. These reseed methods provide functionality which aids people in situations where reseeds are restricted.
pt: Para tornar o I2P mais resiliente, outros tipos de reseeding são possíveis. Uma maneira importante de realizar um reseed é o reseed baseado em arquivo, onde um usuário com um roteador I2P em execução gera um arquivo de reseed para um amigo e o transfere para ele como um arquivo .zip. Outros usam infraestrutura baseada em nuvem para resistir à censura. Esses métodos de reseed fornecem funcionalidade que auxilia as pessoas em situações em que os reseeds são restritos.
tr: I2P ağını daha dayanıklı hale getirmek için başka türlü bir yeniden tohumlama yapılabilir. Yeniden tohumlamanın önemli bir yolu, çalışan bir I2P yönelticisi bulunan bir kullanıcının bir arkadaşı için bir yeniden tohumlama dosyası oluşturduğu ve bunu bir .zip dosyası olarak ona aktardığı dosya tabanlı yeniden tohumlamadır. Diğerleri sansüre direnmek için bulut tabanlı altyapıyı kullanır. Bu yeniden tohumlama yöntemleri, yeniden tohumlamanın kısıtlandığı durumlarda insanlara yardımcı olur.

source: Thank you Reseed Operators
pt: Obrigado, operadores de Reseed
tr: Yeniden Tohumlama İşletmecilerine Teşekkürler

source: If you are running a reseed server, We would like to thank you for helping to make the I2P network stronger and more resilient than ever.
pt: Se você estiver executando um servidor de reseed, gostaríamos de agradecer por ajudar a tornar a rede I2P mais forte e resiliente do que nunca.
tr: Bir yeniden tohumlama sunucusu çalıştırıyorsanız, I2P ağını her zamankinden daha güçlü ve dayanıklı hale getirmeye yardımcı olduğunuz için teşekkür ederiz.

source: Thank you.
pt: Obrigado.
tr: Teşekkürler.

source: BOB - Basic Open Bridge
tr: BOB - Temel Açık Köprü

source: <code>KEYS</code> = keypair public+private, these are BASE64
pt: <code>KEYS</code> = par de chaves pública+privada, que são BASE64
tr: <code>ANAHTARLAR</code> = Anahtar çifti herkese açık+özel, BASE64 biçiminde

source: <code>KEY</code> = public key, also BASE64
pt: <code>KEY</code> = chave pública, também BASE64
tr: <code>KEY</code> = Herkese açık anahtar, BASE64 biçiminde

source: <code>ERROR</code> as is implied returns the message <code>"ERROR "+DESCRIPTION+"\n"</code>, where the <code>DESCRIPTION</code> is what went wrong.
pt: <code>ERRO</code> como está implícito retorna a mensagem <code>"ERRO "+DESCRIÇÃO+"\n"</code>, onde <code>DESCRIÇÃO</code> é o que deu errado.
tr: <code>ERROR</code>çıktısı, <code>"HATA"+AÇIKLAMA+"\n"</code> iletisini döndürür, burada <code>AÇIKLAMA</code> sorunun çıktığı yerdir.

source: <code>OK</code> returns <code>"OK"</code>, and if data is to be returned, it is on the same line. <code>OK</code> means the command is finished.
pt: <code>OK</code> retorna <code>"OK"</code>e, se os dados devem ser retornados, eles estão na mesma linha. <code>OK</code> significa que o comando foi concluído.
tr: <code>OK</code>, <code>"OK"</code> iletisini döndürür ve veri varsa o da aynı satırdadır. <code>OK</code> komut yürütülmesinin tamamlandığı anlamına gelir.

source: <code>DATA</code> lines contain information that you requested. There may be multiple <code>DATA</code> lines per request.
pt: <code>DATA</code> linhas contêm informações que você solicitou. Pode haver várias <code>DATA</code> linhas por solicitação.
tr: <code>DATA</code> satırlarında, istediğiniz bilgiler bulunur. Bir istek için birkaç <code>DATA</code> satırı olabilir.

source: <b>NOTE:</b> The help command is the ONLY command that has an exception to the rules... it can actually return nothing! This is intentional, since help is a HUMAN and not an APPLICATION command.
pt: <b>NOTA:</b> O comando help é o ÚNICO comando que tem uma exceção às regras... ele pode realmente não retornar nada! Isso é intencional, já que help é um comando HUMANO e não de APLICATIVO.
tr: <b>NOT:</b> Help komutu, kural ayrıcalığı olan TEK komuttur... Aslında hiçbir şey döndürmez! Bu kasıtlıdır, çünkü yardım bir UYGULAMA komutu değil bir İNSAN komutudur.

source: Connection and Version
pt: Conexão e Versão
tr: Bağlantı ve Sürüm

source: All BOB status output is by lines. Lines may be \n or \r\n terminated, depending on the system. On connection, BOB outputs two lines:
pt: Todas as saídas de status do BOB são por linhas. As linhas podem ser terminadas em \n ou \r\n , dependendo do sistema. Na conexão, o BOB emite duas linhas:
tr: Tüm BOB durum çıktıları satır şeklindedir. Satırlar, kullanılan sisteme bağlı olarak \n veya \r\n sona erebilir. Bağlantı kurulduğunda, BOB iki satır döndürür:

source: The current version is:
pt: A versão atual é:
tr: Kullanılan sürüm:

source: Note that previous versions used upper-case hex digits and did not conform to I2P versioning standards. It is recommended that subsequent versions use digits 0-9 only.
pt: Observe que versões anteriores usavam dígitos hexadecimais maiúsculos e não estavam em conformidade com os padrões de controle de versão I2P. É recomendado que versões subsequentes usem apenas dígitos de 0 a 9.
tr: Önceki sürümlerin büyük onaltılık rakamlar kullandığını ve I2P sürüm oluşturma standartlarına uygun olmadığını unutmayın. Sonraki sürümlerin yalnızca 0-9 rakamlarını kullanması önerilir.

source: Version history
pt: Histórico de versões
tr: Sürüm geçmişi

source: Version
pt: Versão
tr: Sürüm

source: I2P Router Version
pt: Versão do roteador I2P
tr: I2P Yöneltici Sürümü

source: Changes
pt: Modificações
tr: Değişiklikler

source: current version
pt: versão atual
tr: geçerli sürüm

source: development versions
pt: versões de desenvolvimento
tr: geliştirme sürümleri

source: Commands
pt: Comandos
tr: Komutlar

source: <b>PLEASE NOTE:</b> For CURRENT details on the commands PLEASE use the built-in help command. Just telnet to localhost 2827 and type help and you can get full documentation on each command.
pt: <b>ATENÇÃO:</b> Para detalhes ATUAIS sobre os comandos, USE o comando help integrado. Basta fazer telnet para o localhost 2827 e digitar help, e você poderá obter a documentação completa sobre cada comando.
tr: <b>LÜTFEN DİKKAT:</b> Komutlarla ilgili GÜNCEL bilgiler için LÜTFEN yerleşik yardım komutunu kullanın. Bunun için localhost 2827 adresine telnet açın ve help yazın. Böylece her komutla ilgili tam bilgileri görebilirsiniz.

source: Commands never get obsoleted or changed, however new commands do get added from time to time.
pt: Os comandos nunca ficam obsoletos ou alterados, porém novos comandos são adicionados de tempos em tempos.
tr: Komutlar asla eskimez veya değiştirilmez. Ancak zamanla yeni komutlar eklenir.

source: COMMAND
pt: COMANDO
tr: KOMUT

source: OPERAND
pt: OPERANDO
tr: İŞLEM

source: RETURNS
pt: Retorno
tr: GERİ DÖNÜŞ

source: Once set up, all TCP sockets can and will block as needed, and there is no need for any additional messages to/from the command channel. This allows the router to pace the stream without exploding with OOM like SAM does as it chokes on attempting to shove many streams in or out one socket -- that can't scale when you have alot of connections!
pt: Uma vez configurados, todos os soquetes TCP podem e irão bloquear conforme necessário, e não há necessidade de nenhuma mensagem adicional de/para o canal de comando. Isso permite que o roteador controle o fluxo sem explodir com OOM como o SAM faz, pois ele engasga ao tentar empurrar muitos fluxos para dentro ou para fora de um soquete -- que não pode ser dimensionado quando você tem muitas conexões!
tr: Kurulduktan sonra, tüm TCP soketleri gerektiğiNDE engellenebilir ve engellenecektir. Komut kanalına/kanalından herhangi bir ek iletiye gerek yoktur. Bu durum, yönelticinin, birçok akışı tek bir sokete sokmaya veya dışarı atmaya çalışırken boğulmasında SAM ile olduğu gibi OOM ile patlamadan akışı hızlandırmasını sağlar. Çok fazla bağlantınız olduğunda ölçeklenemez!

source: What is also nice about this particular interface is that writing anything to interface to it, is much much easier than SAM. There is no other processing to do after the set up. It's configuration is so simple, that very simple tools, such as nc (netcat) can be used to point to some application. The value there is that one could schedule up and down times for an application, and not have to change the application to do that, or to even have to stop that application. Instead, you can literally "unplug" the destination, and "plug it in" again. As long as the same IP/port addresses and destination keys are used when bringing the bridge up, the normal TCP application won't care, and won't notice. It will simply be fooled -- the destinations are not reachable, and that nothing is coming in.
pt: O que também é legal sobre essa interface em particular é que escrever qualquer coisa para a interface para ela é muito mais fácil do que SAM. Não há nenhum outro processamento a ser feito após a configuração. Sua configuração é tão simples que ferramentas muito simples, como nc (netcat) podem ser usadas para apontar para algum aplicativo. O valor aí é que alguém poderia agendar tempos de atividade e inatividade para um aplicativo, e não ter que alterar o aplicativo para fazer isso, ou mesmo ter para parar esse aplicativo. Em vez disso, você pode literalmente "desconectar" o destino e "conectá-lo" novamente. Contanto que os mesmos endereços IP/porta e chaves de destino sejam usados ao ativar a ponte, o aplicativo TCP normal não se importará e não notará. Ele simplesmente será enganado -- os destinos não são alcançáveis e nada está chegando.
tr: Bu özel arayüzün güzel yanı, herhangi bir şey yazmanın SAM yöntemine göre çok daha kolay olmasıdır. Kurulumdan sonra yapılacak başka bir işlem yoktur. Yapılandırma o kadar basittir ki, nc (netcat) gibi çok basit araçlar bazı uygulamaları gösterecek şekilde kullanılabilir. Bunun önemi, kişinin bir uygulamanın çalışacağı ve duracağı zamanları planlayabilmesi ve bunun için uygulamayı değiştirmesinin, hatta durdurmasının gerekmemesidir. Bunun yerine, kelimenin tam anlamıyla hedefin "fişini çıkarabilir" ve yeniden "takabilirsiniz". Köprüyü kurarken aynı IP/bağlantı noktası adresleri ve hedef anahtarlar kullanıldığı sürece, normal TCP uygulaması için bir şey fark etmeyecektir. Basitçe kandırılmış olur. Hedeflere erişilemez ve herhangi bir bilgi gelmez.

source: Examples
pt: Exemplos
tr: Örnekler

source: For the following example, we'll setup a very simple local loopback connection, with two destinations. Destination "mouth" will be the CHARGEN service from the INET superserver daemon. Destination "ear" will be a local port that you can telnet into, and watch the pretty ASCII test puke forth.
pt: Para o exemplo a seguir, configuraremos uma conexão de loopback local muito simples, com dois destinos. O destino "mouth" será o serviço CHARGEN do daemon do superservidor INET. O destino "ear" será uma porta local na qual você pode fazer telnet e assistir ao belo teste ASCII vomitar.
tr: Aşağıdaki örnek için, iki hedefli çok basit bir yerel geri döngü bağlantısı kuracağız. Hedef "ağız", INET süper sunucu arka plan programının CHARGEN hizmeti olacaktır. Hedef "kulak", telnet yapabileceğiniz ve güzel ASCII testinin çıktısını izleyebileceğiniz yerel bir bağlantı noktası olacaktır.

source: EXAMPLE SESSION DIALOGUE -- simple telnet 127.0.0.1 2827 works
pt: EXEMPLO DE DIÁLOGO DE SESSÃO -- telnet simples 127.0.0.1 2827 funciona
tr: ÖRNEK OTURUM İLETİŞİMİ -- basit telnet 127.0.0.1 2827 çalışır

source: Application
pt: Aplicação
tr: Uygulama

source: BOB's Command response.
pt: Resposta do comando do BOB.
tr: BOB komut yanıtı.

source: FROM
pt: DE
tr: NEREDEN

source: TO
pt: PARA
tr: NEREYE

source: DIALOGUE
pt: DIÁLOGO
tr: İLETİŞİM

source: MAKE NOTE OF THE ABOVE DESTINATION KEY, YOURS WILL BE DIFFERENT!
pt: ANOTE A CHAVE DE DESTINO ACIMA, O SEU SERÁ DIFERENTE!
tr: YUKARIDAKİ HEDEF ANAHTARINA DİKKAT EDİN, SİZİNKİ FARKLI OLACAKTIR!

source: At this point, there was no error, a destination with a nickname of "mouth" is set up. When you contact the destination provided, you actually connect to the <code>CHARGEN</code> service on <code>19/TCP</code>.
pt: Neste ponto, não houve erro, um destino com um apelido de "boca" é configurado. Quando você contata o destino fornecido, você realmente conecta ao serviço <code>CHARGEN</code> em <code>19/TCP</code>.
tr: Bu noktada herhangi bir hata olmadı, "ağız" takma adıyla bir hedef kuruldu. Belirtilen hedefle iletişim kurduğunuzda, aslında <code>19/TCP</code> üzerindeki <code>CHARGEN</code> hizmetine bağlanırsınız.

source: Now for the other half, so that we can actually contact this destination.
pt: Agora, a outra metade, para que possamos realmente entrar em contato com esse destino.
tr: Şimdi kalan yarısı, böylece bu hedefle gerçekten iletişime geçebiliriz.
