Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: With any certificate implementation must come the method for verifying the certificates. Presumably this would happen in the address book merge code. Is there a method for multiple types of certificates, or multiple certificates?
pt: Com qualquer implementação de certificado deve vir o método para verificar os certificados . Presumivelmente isso aconteceria no código de mesclagem do catálogo de endereços. Existe um método para vários tipos de certificados ou vários certificados?
tr: Herhangi bir sertifika uygulamasında, sertifikaları doğrulama yöntemi gelmelidir. Büyük olasılıkla bu, adres defteri birleştirme kodunda bulunur. Birden çok sertifika türü veya birden çok sertifika için bir yöntem var mı?

source: Adding on a certificate authenticating the responses as signed by some centralized certificate authority would address many of the hostile nameserver issues but would leave open replay attacks as well as hostile certificate authority attacks.
pt: Adicionar um certificado autenticando as respostas como assinadas por alguma autoridade de certificação centralizada resolveria muitos dos problemas de servidores de nomes hostis, mas deixaria ataques de repetição abertos, bem como ataques de autoridades de certificação hostis.
tr: Bazı merkezi sertifika yetkilisi tarafından imzalanmış yanıtları doğrulayan bir sertifika eklemek, kötü niyetli ad sunucusu sorunlarının çoğunu giderecek. Ancak kötü niyetli sertifika yetkilisi saldırılarının yanında açık yeniden yürütme saldırılarını da bırakacaktır.

source: July 2019
pt: Julho de 2019
tr: 2019 Temmuz

source: ElGamal/AES + SessionTag Encryption
pt: Criptografia ElGamal/AES + SessionTag
tr: ElGamal/AES + Oturum etiketi şifrelemesi

source: ElGamal/AES+SessionTags is used for end-to-end encryption.
pt: Usa-se ElGamal/AES+SessionTags para criptografia de ponta a ponta.
tr: Uçtan uca şifreleme için ElGamal/AES+Oturum etiketi kullanılır.

source: As an unreliable, unordered, message based system, I2P uses a simple combination of asymmetric and symmetric encryption algorithms to provide data confidentiality and integrity to garlic messages. As a whole, the combination is referred to as ElGamal/AES+SessionTags, but that is an excessively verbose way to describe the use of 2048bit ElGamal, AES256, SHA256, and 32 byte nonces.
pt: Como um sistema não confiável, não ordenado e baseado em mensagens, o I2P usa uma combinação simples de algoritmos de criptografia assimétrica e simétrica para fornecer confidencialidade de dados e integridade para mensagens garlic. Como um todo, a combinação é referida como ElGamal/AES+SessionTags, mas essa é uma maneira excessivamente prolixa de descrever o uso de ElGamal de 2048 bits, AES256, SHA256 e nonces de 32 bytes.
tr: Güvenilmez, sıralı olmayan ileti tabanlı bir sistem olan I2P, garlic iletilerinin veri gizliliği ve bütünlüğü sağlamak için asimetrik ve simetrik şifreleme algoritmalarının basit bir kombinasyonunu kullanır. Bir bütün olarak, kombinasyon ElGamal/AES+Oturum etiketi olarak anılır. Ancak bu, 2048 bit ElGamal, AES-256, SHA-256 ve 32 bayt nonce kullanımını açıklamak için aşırı derecede ayrıntılı bir yoldur.

source: The first time a router wants to encrypt a garlic message to another router, they encrypt the keying material for an AES256 session key with ElGamal and append the AES256/CBC encrypted payload after that encrypted ElGamal block. In addition to the encrypted payload, the AES encrypted section contains the payload length, the SHA256 hash of the unencrypted payload, as well as a number of "session tags" - random 32 byte nonces. The next time the sender wants to encrypt a garlic message to another router, rather than ElGamal encrypt a new session key they simply pick one of the previously delivered session tags and AES encrypt the payload like before, using the session key used with that session tag, prepended with the session tag itself. When a router receives a garlic encrypted message, they check the first 32 bytes to see if it matches an available session tag - if it does, they simply AES decrypt the message, but if it does not, they ElGamal decrypt the first block.
pt: Na primeira vez que um roteador deseja criptografar uma mensagem de alho para outro roteador, ele criptografa o material de chaveamento para uma chave de sessão AES256 com ElGamal e anexa a carga criptografada AES256/CBC após o bloco ElGamal criptografado. Além da carga criptografada, a seção criptografada AES contém o comprimento da carga , o hash SHA256 da carga não criptografada, bem como um número de "etiquetas de sessão" - nonces aleatórios de 32 bytes. Na próxima vez que o remetente quiser criptografar uma mensagem garlic para outro roteador, em vez de ElGamal criptografar uma nova chave de sessão, eles simplesmente escolhem uma das tags de sessão entregues anteriormente e criptografam o payload com AES como antes, usando a chave de sessão usada com aquela tag de sessão, prefixada com a própria tag de sessão. Quando um roteador recebe uma mensagem criptografada garlic, eles verificam os primeiros 32 bytes para ver se ela corresponde a uma tag de sessão disponível - se corresponder, eles simplesmente descriptografam a mensagem com AES, mas se não corresponder, eles descriptografam o primeiro bloco com ElGamal.
tr: Bir yöneltici ilk kez başka bir yönelticiye göndereceği bir garlic iletisini şifrelemek istediğinde, bir AES-256 oturum anahtarı için anahtarlama materyalini ElGamal ile şifreler ve bu şifrelenmiş ElGamal bloğunun ardından AES-256/CBC ile şifrelenmiş yükü ekler. Şifrelenmiş yüke ek olarak, AES ile şifrelenmiş bölümü yük uzunluğu, şifrelenmemiş yükün SHA-256 karması ve ayrıca bir dizi "oturum etiketi" - rastgele 32 baytlık olmayanlar - bulunur. Gönderici bir dahaki sefere bir garlic iletisini başka bir yönlendiriciye şifrelemek istediğinde, ElGamal yeni bir oturum anahtarını şifrelemek yerine, daha önce teslim edilmiş oturum etiketlerinden birini seçer ve AES, daha önce olduğu gibi, o oturum etiketiyle kullanılan oturum anahtarını kullanarak yükü şifreler. Bu bilgi oturum etiketinin başına eklenir. Bir yöneltici bir garlic şifrelenmiş iletisi aldığında, uygun bir oturum etiketiyle eşleşip eşleşmediğini görmek için ilk 32 baytı kontrol eder. Eşleşme bulunursa yalnızca AES iletisinin şifresini çözer. Bulunmazsa ElGamal ilk bloğun şifresini çözer.

source: Each session tag can be used only once so as to prevent internal adversaries from unnecessarily correlating different messages as being between the same routers. The sender of an ElGamal/AES+SessionTag encrypted message chooses when and how many tags to deliver, prestocking the recipient with enough tags to cover a volley of messages. Garlic messages may detect the successful tag delivery by bundling a small additional message as a clove (a "delivery status message") - when the garlic message arrives at the intended recipient and is decrypted successfully, this small delivery status message is one of the cloves exposed and has instructions for the recipient to send the clove back to the original sender (through an inbound tunnel, of course). When the original sender receives this delivery status message, they know that the session tags bundled in the garlic message were successfully delivered.
pt: Cada tag de sessão pode ser usada apenas uma vez para evitar que adversários internos correlacionem desnecessariamente mensagens diferentes como sendo entre os mesmos roteadores . O remetente de uma mensagem criptografada ElGamal/AES+SessionTag escolhe quando e quantas tags entregar, pré-estocando o destinatário com tags suficientes para cobrir uma saraivada de mensagens. Mensagens de alho podem detectar a entrega bem-sucedida da tag ao agrupar uma pequena mensagem adicional como um cravo (uma "mensagem de status de entrega ") - quando a mensagem de alho chega ao destinatário pretendido e é descriptografada com sucesso, esta pequena mensagem de status de entrega é um dos cravos expostos e tem instruções para o destinatário enviar o cravo de volta ao remetente original (por meio de um túnel de entrada, é claro). Quando o remetente original recebe esta mensagem de status de entrega, ele sabe que as tags de sessão agrupadas na mensagem de alho foram entregues com sucesso.
tr: Her oturum etiketi, iç izleyicilerin aynı yönelticiler arasında olduğu gibi farklı iletileri gereksiz yere ilişkilendirmesini önlemek için yalnızca bir kez kullanılabilir. ElGamal/AES+Oturum etiketi şifrelemiş iletisinin göndericisi, ne zaman ve kaç etiketin teslim edileceğini seçer ve alıcıya bir sürü iletiyi kapsayacak kadar yeterli etiket hazırlar. Garlic iletileri küçük bir ek iletiyi bir diş ("teslim durumu iletisi") olarak paketleyerek etiket tesliminin başarılı olduğunu algılayabilir - garlic iletisi hedeflenen alıcıya ulaştığında ve şifresi başarıyla çözüldüğünde, bu küçük teslim durumu dişlerden biridir. Açığa çıkar ve alıcının dişi özgün göndericiye geri göndermesi için yönergeler içerir (elbette bir geliş tüneli üzeirnden). Özgün gönderici bu teslim durumu iletisini aldığında, garlic iletisinde gruplanan oturum etiketlerinin başarıyla iletildiğini bilir.

source: Session tags themselves have a short lifetime, after which they are discarded if not used. In addition, the quantity stored for each key is limited, as are the number of keys themselves - if too many arrive, either new or old messages may be dropped. The sender keeps track whether messages using session tags are getting through, and if there isn't sufficient communication it may drop the ones previously assumed to be properly delivered, reverting back to the full expensive ElGamal encryption. A session will continue to exist until all its tags are exhausted or expire.
pt: As próprias tags de sessão têm uma vida útil curta, após a qual são descartadas se não forem usadas. Além disso, a quantidade armazenada para cada chave é limitada, assim como o número de chaves em si - se muitas chegarem, mensagens novas ou antigas podem ser descartadas. O remetente monitora se as mensagens que usam as tags de sessão estão sendo transmitidas e, se não houver comunicação suficiente, ele pode descartar aquelas que antes eram consideradas entregues corretamente, revertendo para a criptografia ElGamal cara e completa. Uma sessão continuará existindo até que todas as suas tags sejam esgotadas ou expirem.
tr: Oturum etiketlerinin ömürleri kısadır. bu sürenin sonunda kullanılmazlarsa atılır. Ek olarak, her bir anahtar için depolanan miktar ve anahtarların sayısı sınırlıdır. Çok fazla gelirse, yeni veya eski iletiler kaybolabilir Gönderici, oturum etiketlerini kullanan iletilerin geçip geçmediğini izler ve yeterli iletişim yoksa, daha önce düzgün bir şekilde iletildiği varsayılanları bırakarak en pahalı ElGamal şifrelemesine geri dönebilir. Bir oturum, tüm etiketleri tükenene veya süresi dolana kadar var olmayı sürdürür

source: Sessions are unidirectional. Tags are delivered from Alice to Bob, and Alice then uses the tags, one by one, in subsequent messages to Bob.
pt: As sessões são unidirecionais. As tags são entregues de Alice para Bob, e Alice então usa as tags, uma por uma, em mensagens subsequentes para Bob.
tr: Oturumlar tek yönlüdür. Etiketler Alice tarafından Bob tarafına iletilir ve Alice daha sonra Bob tarafına gönderilen sonraki iletilerdeki etiketleri birer birer kullanır.

source: Sessions may be established between Destinations, between Routers, or between a Router and a Destination. Each Router and Destination maintains its own Session Key Manager to keep track of Session Keys and Session Tags. Separate Session Key Managers prevents correlation of multiple Destinations to each other or a Router by adversaries.
pt: As sessões podem ser estabelecidas entre destinos, entre roteadores ou entre um roteador e um destino. Cada roteador e destino mantém seu próprio gerenciador de chaves de sessão para controlar chaves de sessão e tags de sessão. Gerenciadores de chaves de sessão separados impedem a correlação de vários destinos entre si ou com um roteador por adversários.
tr: Oturumlar, hedefler arasında, yönelticiler arasında veya yöneltici ile hedef arasında kurulabilir. Her yöneltici ve hedef,in oturum anahtarlarını ve oturum etiketlerini izlemek için kendi oturum anahtarı yöneticisi vardır. Ayrı oturum anahtarı yöneticileri olması, düşmanlar tarafından birden çok hedefin birbiriyle veya bir yönelticiyle ilişkilendirilmesini önler.

source: Message Reception
pt: Recepção de mensagens
tr: İleti Almak

source: Each message received has one of two the two possible conditions:</p>
pt: Cada mensagem recebida tem uma das duas as duas condições possíveis:</p>
tr: Alınan her ileti iki olası koşuldan birine sahiptir:</p>

source: It is part of an existing session and contains a Session Tag and an AES encrypted block
pt: Faz parte de uma sessão existente e contém uma etiqueta de sessão e um bloco criptografado AES
tr: Var olan bir oturumun parçasıdır ve bir oturum etiketi ve bir AES ile şifrelenmiş blok içerir

source: It is for a new session and contains both ElGamal and AES encrypted blocks
pt: É para uma nova sessão e contém blocos criptografados ElGamal e AES
tr: Yeni bir oturum içindir ve hem ElGamal hem de AES ile şifrelenmiş blokları içerir.

source: When a router receives a message, it will first assume it is from an existing session and attempt to look up the Session Tag and decrypt the following data using AES. If that fails, it will assume it is for a new session and attempt to decrypt it using ElGamal.
pt: Quando um roteador recebe uma mensagem, ele primeiro assume que é de uma sessão existente e tenta consultar a etiqueta de sessão e descriptografar os seguintes dados usando AES. Se isso falhar, ele assume que é para uma nova sessão e tenta descriptografá-la usando ElGamal.
tr: Bir yöneltici bir ileti aldığında, önce bunun var olan bir oturumdan geldiğini varsayar. Oturum etiketini aramaya ve AES kullanarak aşağıdaki verilerin şifresini çözmeye çalışır. Bunda başarısız olursa, oturumun yeni olduğunu varsayar ve şifresini ElGamal kullanarak çözmeye çalışır.

source: New Session Message Specification
pt: Especificação de Nova Mensagem de Sessão
tr: Yeni Oturum İleti Teknik Özellikleri

source: A New Session ElGamal Message contains two parts, an encrypted ElGamal block and an encrypted AES block.
pt: Uma nova mensagem ElGamal de sessão contém duas partes, um bloco ElGamal criptografado e um bloco AES criptografado.
tr: Yeni oturum ElGamal iletisi şifrelenmiş bir ElGamal bloğu ve şifrelenmiş bir AES bloğu şeklinde iki bölümden oluşur.

source: The encrypted message contains:
pt: A mensagem criptografada contém:
tr: Şifrelenmiş iletide şunlar bulunur:

source: ElGamal Block
pt: Bloco ElGamal
tr: ElGamal Bloğu

source: The encrypted ElGamal Block is always 514 bytes long.
pt: O bloco ElGamal criptografado tem sempre 514 bytes de comprimento.
tr: Şifrelenmiş ElGamal bloğu her zaman 514 bayt uzunluğundadır.

source: The unencrypted ElGamal data is 222 bytes long, containing:
pt: Os dados não criptografados do ElGamal têm 222 bytes de comprimento e contêm:
tr: Şifrelenmemiş ElGamal verileri 222 bayt uzunluğundadır ve şunları içerir:

source: The 32-byte <a href="%(commonstructures)s#type_SessionKey">Session Key</a> is the identifier for the session. The 32-byte Pre-IV will be used to generate the IV for the AES block that follows; the IV is the first 16 bytes of the SHA-256 Hash of the Pre-IV.
pt: A chave de sessão de 32 bytes <a href="%(commonstructures)s#type_SessionKey"></a> é o identificador da sessão. O Pre-IV de 32 bytes será usado para gerar o IV para o bloco AES que se segue; o IV são os primeiros 16 bytes do hash SHA-256 do Pre-IV.
tr: 32 bayt <a href="%(commonstructures)s#type_SessionKey">“Oturum anahtarı” (sessionKey)</a> oturum belirtecidir 32 baytlık Pre-IV, aşağıdaki AES bloğu için IV oluşturmakta kullanılır IV, Pre-IV için SHA-256 karmasının ilk 16 baytıdır.

source: The 222 byte payload is encrypted <a href="%(cryptography)s#elgamal">using ElGamal</a> and the encrypted block is 514 bytes long. </p>
pt: A carga útil de 222 bytes é criptografada <a href="%(cryptography)s#elgamal">usando ElGamal</a> e o bloco criptografado tem 514 bytes de comprimento. </p>
tr: 222 bayt yük <a href="%(cryptography)s#elgamal">ElGamal ile şifrelenmiş</a> ve şifrelenmiş 514 bayt uzunluğunda şifrelenmiş blok </p>

source: AES Block
pt: Bloco AES
tr: AES Bloğu

source: The unencrypted data in the AES block contains the following:
pt: Os dados não criptografados no bloco AES contêm o seguinte:
tr: AES bloğundaki şifrelenmemiş verilerde şunlar buunur:

source: Minimum length: 48 bytes
pt: Comprimento mínimo: 48 bytes
tr: En az uzunluk: 48 bayt

source: The data is then <a href="%(cryptography)s">AES Encrypted</a>, using the session key and IV (calculated from the pre-IV) from the ElGamal section. The encrypted AES Block length is variable but is always a multiple of 16 bytes. </p>
pt: Os dados são então <a href="%(cryptography)s">criptografados com AES</a>, usando a chave de sessão e o IV (calculado a partir do pré-IV) da seção ElGamal. O comprimento do bloco AES criptografado é variável, mas é sempre um múltiplo de 16 bytes. </p>
tr: Veriler daha sonra oturum anahtarı ve ElGamal bölümünden IV (IV öncesi hesaplanan) kullanılarak <a href="%(cryptography)s">AES ile şifrelenir</a>. Şifrelenmiş AES bloğunun uzunluğu değişkendir. Ancak her zaman 16 baytın katıdır. </p>

source: Actual max payload length, and max block length, is less than 64 KB; see the <a href="%(i2np)s">I2NP Overview</a>.
pt: O comprimento máximo real da carga útil e o comprimento máximo do bloco são menores que 64 KB; consulte a <a href="%(i2np)s">Visão geral do I2NP</a>.
tr: Gerçek en fazla yük uzunluğu ve en fazla blok uzunluğu 64 KB değerinden azdır: <a href="%(i2np)s">I2NP Özeti</a> bölümüne bakın.

source: New Session Key is currently unused and is never present.
pt: A nova chave de sessão não está sendo usada no momento e nunca está presente.
tr: Yeni oturum anahtarı şu anda kullanılmamış ve asla var olmamış.

source: Existing Session Message Specification
pt: Especificação de mensagem de sessão existente
tr: Var Olan Oturum İletisinin Teknik Özellikleri

source: The session tags delivered successfully are remembered for a brief period (15 minutes currently) until they are used or discarded. A tag is used by packaging one in an Existing Session Message that contains only an AES encrypted block, and is not preceded by an ElGamal block.
pt: As tags de sessão entregues com sucesso são lembradas por um breve período de (atualmente 15 minutos) até serem usadas ou descartadas. Uma tag é usada empacotando uma em uma Mensagem de Sessão Existente que contém apenas um bloco criptografado AES e não é precedida por um bloco ElGamal.
tr: Sorunsuz iletilen oturum etiketleri, kullanılıncaya ya da atılıncaya kadar kısa bir süre (şu anda 15 dakika) boyunca hatırlanır. Bir etiket, yalnızca AES ile şifrelenmiş bir blok içeren ve önünde bir ElGamal bloğu bulunmayan var olan oturum şletisinde paketlenerek kullanılır.

source: The existing session message is as follows:
pt: A mensagem da sessão existente é como segue:
tr: Var olan oturum iletisi şu şekildedir:

source: The session tag also serves as the pre-IV. The IV is the first 16 bytes of the SHA-256 Hash of the sessionTag.
pt: A tag de sessão também serve como o pré-IV. O IV são os primeiros 16 bytes do Hash SHA-256 da sessionTag.
tr: Oturum etiketi ayrıca IV öncesi olarak da hizmet eder. IV, oturum etiketinin SHA-256 karmasının ilk 16 baytıdır.

source: To decode a message from an existing session, a router looks up the Session Tag to find an associated Session Key. If the Session Tag is found, the AES block is decrypted using the associated Session Key. If the tag is not found, the message is assumed to be a <a href="#new">New Session Message</a>.
pt: Para decodificar uma mensagem de uma sessão existente, um roteador procura a Tag de Sessão para encontrar uma Chave de Sessão associada . Se a Tag de Sessão for encontrada, o bloco AES é descriptografado usando a Chave de Sessão associada. Se a tag não for encontrada, a mensagem é assumida como uma <a href="#new">Nova Mensagem de Sessão</a>.
tr: Var olan bir oturumdan gelen bir iletinin kodunu çözmek için yöneltici, ilişkili bir oturum anahtarı bulmak amacıyla oturum etiketini arar. Oturum etiketi bulunursa, ilgili oturum anahtarı kullanılarak AES bloğunun şifresi çözülür. Etiket bulunamazsa, iletinin bir <a href="#new">yeni oturum iletisi</a> olduğu varsayılır.

source: Session Tag Configuration Options
pt: Opções de configuração de tag de sessão
tr: Oturum Etiketi Yapılandırma Seçenekleri

source: As of release 0.9.2, the client may configure the default number of Session Tags to send and the low tag threshold for the current session. For brief streaming connections or datagrams, these options may be used to significantly reduce bandwidth. See the <a href="%(i2cp)s#options">I2CP options specification</a> for details. The session settings may also be overridden on a per-message basis. See the <a href="%(i2cpspec)s#msg_SendMessageExpires">I2CP Send Message Expires specification</a> for details.
pt: A partir da versão 0.9.2, o cliente pode configurar o número padrão de Tags de Sessão para enviar e o limite de tags baixo para a sessão atual. Para breves conexões de streaming ou datagramas, essas opções podem ser usadas para reduzir significativamente a largura de banda. Consulte a especificação de opções I2CP <a href="%(i2cp)s#options"></a> para obter detalhes. As configurações de sessão também podem ser substituídas por mensagem. Consulte a especificação <a href="%(i2cpspec)s#msg_SendMessageExpires">Expiração de mensagem de envio I2CP</a> para obter detalhes.
tr: 0.9.2 sürümünden başlayarak, istemci gönderilecek varsayılan oturum etiketi sayısını ve geçerli oturum için düşük etiket eşiğini yapılandırabilir. Bu seçenekler, kısa akış bağlantıları veya veri şemaları için bant genişliğini önemli ölçüde azaltmak amacıyla kullanılabilir. Ayrıntılı bilgi almak için <a href="%(i2cp)s#options">I2CP seçenekleri teknik özellikleri</a> bölümüne bakabilirsiniz. Ayrıca her ileti için oturum ayarları değiştirilebilir. Ayrıntılı bilgi almak için <a href="%(i2cpspec)s#msg_SendMessageExpires">I2CP ileti gönderme geçerlilik süresi teknik özellikleri</a> bölümüne bakabilirsiniz.

source: There are many possible areas to tune the Session Key Manager's algorithms; some may interact with the streaming library behavior, or have significant impact on overall performance.
pt: Há muitas áreas possíveis para ajustar os algoritmos do Session Key Manager; alguns podem interagir com o comportamento da biblioteca de streaming ou ter impacto significativo no desempenho geral.
tr: Oturum anahtarı yönetimi algoritmalarının ayarlanabileceği birçok olası alan vardır. Bazıları akış kitaplığı davranışıyla etkileşime girebilir ya da genel başarım üzerinde önemli bir etkiye sahip olabilir.

source: The number of tags delivered could depend on message size, keeping in mind the eventual padding to 1KB at the tunnel message layer.
pt: O número de tags entregues pode depender do tamanho da mensagem, tendo em mente o eventual preenchimento para 1 KB na camada de mensagem do túnel.
tr: Teslim edilen etiketlerin sayısı, tünel ileti katmanında son dolgu eklemenin 1 KB olacağı akılda tutularak, ileti boyutuna bağlı olabilir.

source: Clients could send an estimate of session lifetime to the router, as an advisory on the number of tags required.
pt: Os clientes podem enviar uma estimativa da duração da sessão ao roteador, como um aviso sobre o número de tags necessárias.
tr: İstemciler, gerekli etiket sayısı konusunda bir öneri olarak yönelticiye bir oturum ömrü öngörüsü gönderebilir.
