Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Floodfill Anonymity attacks
pt: Ataques de anonimato de inundação
tr: Otomatik doldurma anonimlik saldırıları

source: In addition to the floodfill DOS attacks described <a href="#ffdos">above</a>, floodfill routers are uniquely positioned to learn about network participants, due to their role in the netDb, and the high frequency of communication with those participants. This is somewhat mitigated because floodfill routers only manage a portion of the total keyspace, and the keyspace rotates daily, as explained on the <a href="%(netdb)s#threat">network database page</a>. The specific mechanisms by which routers communicate with floodfills have been <a href="%(netdb)s#delivery">carefully designed</a>. However, these threats should be studied further. The specific potential threats and corresponding defenses are a topic for future research.
pt: Além dos ataques DOS de floodfill descritos <a href="#ffdos">acima</a>, os roteadores de floodfill são posicionados exclusivamente para aprender sobre os participantes da rede, devido ao seu papel no netDb e à alta frequência de comunicação com esses participantes. Isso é um pouco atenuado porque os roteadores de floodfill gerenciam apenas uma parte do espaço de chaves total, e o espaço de chaves gira diariamente, conforme explicado na <a href="%(netdb)s#threat">página do banco de dados de rede</a>. Os mecanismos específicos pelos quais os roteadores se comunicam com floodfills foram <a href="%(netdb)s#delivery">cuidadosamente projetados</a>. No entanto, essas ameaças devem ser estudadas mais profundamente. As ameaças potenciais específicas e as defesas correspondentes são um tópico para pesquisas futuras.
tr: <a href="#ffdos">Yukarıda</a> açıklanan otomatik doldurma DOS saldırılarına ek olarak, otomatik doldurma yönelticileri "Ağ veri tabanı" (NetDB) rolleri ve bu katılımcılarla yüksek iletişim sıklığı nedeniyle ağ katılımcıları hakkında bilgi edinmek için benzersiz bir şekilde konumlandırılmıştır. Otomatik doldurma yönelticileri toplam anahtar alanının yalnızca bir bölümünü yönettiği ve <a href="%(netdb)s#threat">"Ağ veri tabanı" (NetDB) sayfasında</a> açıklandığı gibi anahtar alanı günlük olarak değiştiği için bu biraz azaltılmıştır. Yönelticilerin otomatik doldurucularla iletişim kurmasını sağlayan özel mekanizmalar <a href="%(netdb)s#delivery">dikkatle tasarlanmıştır</a>. Ancak, bu tehditler üzerinde daha fazla çalışılmalıdır. Belirli potansiyel tehditler ve karşı gelen savunmalar, gelecekteki araştırmaların konusudur.

source: A hostile user may attempt to harm the network by creating one or more floodfill routers and crafting them to offer bad, slow, or no responses. Several scenarios are discussed on the <a href="%(netdb)s#threat">network database page</a>.
pt: Um usuário hostil pode tentar prejudicar a rede criando um ou mais roteadores de floodfill e elaborando-os para oferecer respostas ruins, lentas ou nenhuma resposta. Vários cenários são discutidos na página do banco de dados de rede <a href="%(netdb)s#threat"></a>.
tr: Kötü niyetli bir kullanıcı, bir ya da birkaç otomatik doldurma yönelticisi oluşturarak ve bunları kötü, yavaş veya hiç yanıt vermeyecek şekilde hazırlayarak ağa zarar vermeye çalışabilir. Bazı senaryolar <a href="%(netdb)s#threat">"Ağ veri tabanı" (NetDB) sayfasında</a> tartışılmıştır.

source: Central Resource Attacks
pt: Ataques de recursos centrais
tr: Merkezi Kaynak Saldırıları

source: There are a few centralized or limited resources (some inside I2P, some not) that could be attacked or used as a vector for attacks. The absence of jrandom starting November 2007, followed by the loss of the i2p.net hosting service in January 2008, highlighted numerous centralized resources in the development and operation of the I2P network, most of which are now distributed. Attacks on externally-reachable resources mainly affect the ability of new users to find us, not the operation of the network itself.
pt: Existem alguns recursos centralizados ou limitados (alguns dentro do I2P, outros não) que podem ser atacados ou usados como um vetor para ataques. A ausência do jrandom a partir de novembro de 2007, seguida pela perda do serviço de hospedagem i2p.net em janeiro de 2008, destacou vários recursos centralizados no desenvolvimento e operação da rede I2P, a maioria dos quais agora estão distribuídos. Ataques a recursos acessíveis externamente afetam principalmente a capacidade de novos usuários nos encontrarem, não a operação da rede em si.
tr: Saldırıya uğrayabilecek veya saldırılar için bir vektör olarak kullanılabilecek birkaç merkezi veya sınırlı kaynak (bazıları I2P içinde olan, bazıları olmayan) vardır. Kasım 2007 tarihinden itibaren jrandom ortadan kaybolduğundan ve ardından Ocak 2008 tarihinde i2p.net barındırma hizmeti kaybedildiğinden, I2P ağının geliştirilmesi ve işletilmesinde çoğu şimdi dağıtılmış olan çok sayıda merkezi kaynak vurgulanmış oldu. Dışarıdan erişilebilen kaynaklara yapılan saldırılar, ağın işleyişini değil, esas olarak yeni kullanıcıların bizi bulma yeteneğini etkiler.

source: The <a href="%(site)s">website</a> is mirrored and uses DNS round-robin for external public access.
pt: O site <a href="%(site)s"></a> é espelhado e usa DNS round-robin para acesso público externo.
tr: <a href="%(site)s">Sitenin</a> yansısı oluşturuldu ve herkese açık dış erişim için DNS round-robin kullanıyor.

source: Routers now support <a href="%(faq)s#reseed">multiple external reseed locations</a>, however more reseed hosts may be needed, and the handling of unreliable or malicious reseed hosts may need improvement.
pt: Os roteadores agora oferecem suporte a <a href="%(faq)s#reseed">vários locais de reseed externos</a>, , no entanto, mais hosts de reseed podem ser necessários, e o tratamento de hosts de reseed não confiáveis ou maliciosos pode precisar de melhorias.
tr: Yönelticiler artık <a href="%(faq)s#reseed">birden fazla dış yeniden tohumlama konumunu</a> destekliyor. Bununla birlikte daha fazla yeniden tohumlama sunucusuna gerek duyulabilir ve güvenilmez veya kötü amaçlı yeniden tohumlama sunucularının ele alınmasının iyileştirilmesi gerekebilir.

source: Routers now support multiple update file locations. A malicious update host could feed a huge file, need to limit the size.
pt: Os roteadores agora oferecem suporte a vários locais de arquivos de atualização. Um host de atualização malicioso pode alimentar um arquivo enorme, é necessário limitar o tamanho.
tr: Yönelticiler artık birden çok güncelleme dosyası konumunu destekliyor. Kötü niyetli bir güncelleme sunucusu büyük bir dosya gönderebilir, boyutun sınırlaması gerekir.

source: Routers now support multiple default trusted update signers.
pt: Os roteadores agora oferecem suporte a vários signatários de atualização confiáveis padrão.
tr: Yönelticiler artık birden çok varsayılan güvenilir güncelleme imzalayıcısını destekliyor.

source: Routers now better handle <a href="#ffdos">multiple unreliable floodfill peers</a>. Malicious floodfills <a href="#ffdos">needs</a> <a href="#floodfill">more</a> study.
pt: Os roteadores agora lidam melhor com <a href="#ffdos">vários pares de floodfill não confiáveis</a>. Floodfills maliciosos <a href="#ffdos">precisam de</a> <a href="#floodfill">mais</a> estudo.
tr: Yönelticiler artık <a href="#ffdos">birden çok güvenilir olmayan otomatik doldurma eşini</a> daha iyi idare ediyor. Kötü amaçlı otomatik doldurma üzerine <a href="#floodfill">daha fazla</a> çalışma yapılması <a href="#ffdos">gerekiyor</a>.

source: The code is now stored in a <a href="%(monotone)s">distributed source control system</a>.
pt: O código agora está armazenado em um sistema de controle de fonte distribuído <a href="%(monotone)s"></a>.
tr: Kod artık bir <a href="%(monotone)s">dağıtılmış kaynak denetimi sisteminde</a> tutuluyor.

source: Routers rely on a single news host, but there is a hardcoded backup URL pointing to a different host. A malicious news host could feed a huge file, need to limit the size.
pt: Os roteadores dependem de um único host de notícias, mas há uma URL de backup codificada apontando para um host diferente. Um host de notícias malicioso pode alimentar um arquivo enorme, é preciso limitar o tamanho.
tr: Yönelticiler tek bir haber sunucusuna güveniyor. Ancak farklı bir sunucuyu gösteren sabit kodlanmış bir yedek adres vardır. Kötü niyetli bir haber sunucusu büyük bir dosya gönderebilir. Boyutun sınırlanması gerekir.

source: <a href="%(naming)s">Naming system services</a>, including address book subscription providers, add-host services, and jump services, could be malicious. Substantial protections for subscriptions were implemented in release 0.6.1.31, with additional enhancements in subsequent releases. However, all naming services require some measure of trust, see <a href="%(naming)s">the naming page</a> for details.
pt: <a href="%(naming)s">Os serviços do sistema de nomenclatura</a>, incluindo provedores de assinatura de catálogo de endereços, serviços add-host, e serviços jump, podem ser maliciosos. Proteções substanciais para assinaturas foram implementadas na versão 0.6.1.31, com melhorias adicionais em versões subsequentes. No entanto, todos os serviços de nomenclatura exigem alguma medida de confiança, veja <a href="%(naming)s">a página de nomenclatura</a> para detalhes.
tr: Adres defteri abonelik hizmeti sağlayıcıları, eklenti barındırma hizmetleri ve atlama hizmetleri ile birlikte <a href="%(naming)s">adlandırma sistem hizmetleri</a> kötü amaçlı olabilir. Abonelikler için önemli korumalar, sonraki sürümlerde yapılan eklerle birlikte ilk olarak 0.6.1.31 sürümünde uygulandı. Ancak, tüm adlandırma hizmetleri bir miktar güvenmeyi gerektirir. Ayrıntılar için <a href="%(naming)s">adlandırma sayfasına</a> bakabilirsiniz.

source: We remain reliant on the DNS service for i2p2.de, losing this would cause substantial disruption in our ability to attract new users, and would shrink the network (in the short-to-medium term), just as the loss of i2p.net did.
pt: Continuamos dependentes do serviço DNS para i2p2.de. Perdê-lo causaria uma interrupção substancial em nossa capacidade de atrair novos usuários, e reduziria a rede (no curto a médio prazo), assim como ocorreu com a perda do i2p.net.
tr: i2p2.de için DNS hizmetine bağlı kalmayı sürdürüyoruz. Bunu kaybetmek yeni kullanıcıları çekme yeteneğimizde önemli kesintilere neden olur ve kaybı i2p.net örneğinde olduğu gibi ağı (kısa ya da orta vadede) küçültür.

source: These attacks aren't directly on the network, but instead go after its development team by either introducing legal hurdles on anyone contributing to the development of the software, or by using whatever means are available to get the developers to subvert the software. Traditional technical measures cannot defeat these attacks, and if someone threatened the life or livelihood of a developer (or even just issuing a court order along with a gag order, under threat of prison), we would have a big problem.
pt: Esses ataques não são diretamente na rede, mas vão atrás de sua equipe de desenvolvimento introduzindo obstáculos legais a qualquer um que contribua para o desenvolvimento do software, ou usando quaisquer meios disponíveis para fazer os desenvolvedores subverterem o software. Medidas técnicas tradicionais não podem derrotar esses ataques, e se alguém ameaçasse a vida ou o sustento de um desenvolvedor (ou mesmo apenas emitindo uma ordem judicial junto com uma ordem de silêncio, sob ameaça de prisão), teríamos um grande problema.
tr: Bu saldırılar doğrudan ağ üzerinde değil, bunun yerine ya yazılımın geliştirilmesine katkıda bulunan herkese yasal engeller getirerek ya da geliştiricilerin yazılımı değiştirmesini sağlamak için var olan her yolu kullanarak geliştirme ekibinin peşine düşer. Geleneksel teknik önlemler bu saldırıları yenemez ve birisi bir geliştiricinin hayatını veya geçimini tehdit ederse (hatta yalnızca bir mahkeme emriyle birlikte hapis tehdidi altında bir tutuklama emri çıkarsa), büyük bir sorunumuz olur.

source: However, two techniques help defend against these attacks:
pt: No entanto, duas técnicas ajudam a se defender contra esses ataques:
tr: Bununla birlikte, iki teknik bu saldırılara karşı savunmaya yardımcı olur:

source: All components of the network must be open source to enable inspection, verification, modification, and improvement. If a developer is compromised, once it is noticed the community should demand explanation and cease to accept that developer's work. All checkins to our <a href="%(monotone)s">distributed source control system</a> are cryptographically signed, and the release packagers use a trust-list system to restrict modifications to those previously approved.
pt: Todos os componentes da rede devem ser de código aberto para permitir inspeção, verificação, modificação e melhoria. Se um desenvolvedor for comprometido, uma vez que for notado a comunidade deve exigir explicação e parar de aceitar o trabalho desse desenvolvedor. Todos os checkins para nosso <a href="%(monotone)s">sistema de controle de fonte distribuído</a> são assinados criptograficamente, e os empacotadores de lançamento usam um sistema de lista de confiança para restringir modificações àquelas previamente aprovadas.
tr: Denetim, doğrulama, değişiklik ve iyileştirme için ağın tüm bileşenleri açık kaynak kodlu olmalıdır. Bir geliştiricinin güvenliği ihlal edilirse, fark edildiğinde topluluk açıklama isteğinde bulunmalı ve geliştiricinin çalışmasını kabul etmeyi bırakmalıdır. <a href="%(monotone)s">Dağıtılmış kaynak denetimi sistemimize</a> yapılan tüm gönderimler şifrelenmiş olarak imzalanmıştır ve sürüm paketleyicileri, değişiklikleri önceden onaylananlarla sınırlamak için bir güvenilenler listesi sistemi kullanır.

source: Development over the network itself, allowing developers to stay anonymous but still secure the development process. All I2P development can occur through I2P - using a <a href="%(monotone)s">distributed source control system</a>, a distributed source control system, IRC chat, public web servers, discussion forums (forum.i2p), and the software distribution sites, all available within I2P.
pt: Desenvolvimento sobre a própria rede, permitindo que os desenvolvedores permaneçam anônimos, mas ainda protejam o processo de desenvolvimento. Todo o desenvolvimento I2P pode ocorrer através do I2P - usando um <a href="%(monotone)s">sistema de controle de fonte distribuído</a>, um sistema de controle de fonte distribuído, chat IRC, servidores web públicos, fóruns de discussão (forum.i2p) e os sites de distribuição de software, todos disponíveis dentro do I2P.
tr: Ağın kendisi üzerinden geliştirme, geliştiricilerin anonim kalmasını sağlar ve geliştirme sürecini güvence altına alır. Tüm I2P geliştirmeleri I2P üzerinden yapılabilir. Bir <a href="%(monotone)s">dağıtılmış kaynak denetimi sistemi</a> kullanılarak, I2P üzerinde bulunan dağıtılmış kaynak denetimi sistemi, IRC sohbet uygulaması, herkese açık site sunucuları, tartışma forumları (forum.i2p) ve yazılım dağıtım siteleri geliştirilebilir.

source: We also maintain relationships with various organizations that offer legal advice, should any defense be necessary.
pt: Também mantemos relacionamentos com diversas organizações que oferecem aconselhamento jurídico, caso seja necessária alguma defesa.
tr: Ayrıca, herhangi bir savunmanın gerekmesi durumunda yasal önerilerde bulunan çeşitli kuruluşlarla ilişkilerimizi sürdürüyoruz.

source: Implementation attacks (bugs)
pt: Ataques via falhas de implementação (bugs)
tr: Uygulama saldırıları (hatalar)

source: Try as we might, most nontrivial applications include errors in the design or implementation, and I2P is no exception. There may be bugs that could be exploited to attack the anonymity or security of the communication running over I2P in unexpected ways. To help withstand attacks against the design or protocols in use, we publish all designs and documentation and solicit review and criticism with the hope that many eyes will improve the system. We do not believe in <a href="http://www.haystacknetwork.com/">security through obscurity</a>.
pt: Por mais que tentemos, a maioria dos aplicativos não triviais inclui erros no design ou na implementação , e o I2P não é exceção. Pode haver bugs que podem ser explorados para atacar o anonimato ou a segurança da comunicação que roda sobre o I2P de maneiras inesperadas . Para ajudar a resistir a ataques contra o design ou protocolos em uso, publicamos todos os designs e documentação e solicitamos revisão e crítica com a esperança de que muitos olhos melhorem o sistema. Não acreditamos em <a href="http://www.haystacknetwork.com/">segurança através da obscuridade</a>.
tr: Olabildiğince deniyoruz. Çoğu önemsiz uygulamada tasarım veya uygulama sırasında hatalar bulunur ve I2P bir istisna değildir. I2P üzerinden çalışan iletişimin anonimliğine veya güvenliğine beklenmedik şekillerde saldırmak için kullanılabilecek hatalar olabilir. Tasarıma veya kullanımdaki iletişim kurallarına yönelik saldırılara karşı koymaya yardımcı olmak için, birçok gözün sistemi iyileştireceği umuduyla tüm tasarımları ve belgeleri yayınlıyoruz ve incelenmesi ile eleştirilmesini istiyoruz. <a href="http://www.haystacknetwork.com/">belirsiz bir ortam oluşturarak güvenlik sağlanacağına</a> inanmıyoruz.

source: In addition, the code is being treated the same way, with little aversion towards reworking or throwing out something that isn't meeting the needs of the software system (including ease of modification). Documentation for the design and implementation of the network and the software components are an essential part of security, as without them it is unlikely that developers would be willing to spend the time to learn the software enough to identify shortcomings and bugs.
pt: Além disso, o código está sendo tratado da mesma forma, com pouca aversão a retrabalhar ou jogar fora algo que não atende às necessidades do sistema de software (incluindo facilidade de modificação). A documentação para o design e implementação da rede e os componentes de software são uma parte essencial da segurança, pois sem eles é improvável que os desenvolvedores estejam dispostos a gastar tempo para aprender o software o suficiente para identificar deficiências e bugs.
tr: Ek olarak, koda aynı şekilde davranılıyor ve yazılım sisteminin gereksinimlerini karşılamayan bir şeyi (değişiklik kolaylığı ile birlikte) yeniden işlemeye veya atmaya karşı isteksizlik çok az. Ağın ve yazılım bileşenlerinin tasarımı ve uygulanmasına ilişkin belgeler, güvenliğin önemli bir parçasıdır. Bunlar olmadan geliştiriciler, eksiklikleri ve hataları bulmak için yazılımı öğrenmeye yeterince zaman harcamak istemeyecektir.

source: Our software is likely, in particular, to contain bugs related to denial of service through out-of-memory errors (OOMs), cross-site-scripting (XSS) issues in the router console, and other vulnerabilities to non-standard inputs via the various protocols.
pt: Nosso software provavelmente contém, em particular, bugs relacionados à negação de serviço por meio de erros de falta de memória (OOMs), problemas de script entre sites (XSS) no console do roteador, e outras vulnerabilidades a entradas não padronizadas por meio de vários protocolos.
tr: Yazılımımızda, özellikle yetersiz bellek hataları (OOM), yöneltici konsolundaki siteler arası betik çalıştırma (XSS) sorunları ve çeşitli iletişim kuralları üzerinden yapılan standart olmayan girişlerden kaynaklanabilecek diğer güvenlik açıkları nedeniyle hizmet reddi ile ilgili hatalar bulunabilir.

source: I2P is still a small network with a small development community and almost no interest from academic or research groups. Therefore we lack the analysis that <a href="https://torproject.org/">other anonymity networks</a> may have received. We continue to recruit people to <a href="%(volunteer)s">get involved</a> and help.
pt: O I2P ainda é uma rede pequena com uma pequena comunidade de desenvolvimento e quase nenhum interesse de grupos acadêmicos ou de pesquisa. Portanto, não temos a análise que <a href="https://torproject.org/">outras redes de anonimato</a> podem ter recebido. Continuamos a recrutar pessoas para <a href="%(volunteer)s">se envolverem</a> e ajudarem.
tr: I2P hala küçük bir geliştirme topluluğunun desteklediği ve akademik veya araştırma gruplarının neredeyse hiç ilgi göstermediği küçük bir ağdır. Bu nedenle, <a href="https://torproject.org/">diğer anonimlik ağları</a> üzerine yapılmış olabilecek incelemelerden yoksunuz. <a href="%(volunteer)s">Katkıda bulunmak</a> ve yardım etmek için insanları aramıza katmayı sürdürüyoruz.

source: Blocklists
pt: Listas de bloqueios
tr: Engelleme Listeleri

source: To some extent, I2P could be enhanced to avoid peers operating at IP addresses listed in a blocklist. Several blocklists are commonly available in standard formats, listing anti-P2P organizations, potential state-level adversaries, and others.
pt: Até certo ponto, o I2P poderia ser aprimorado para evitar que pares operem em endereços IP listados em uma lista de bloqueio. Várias listas de bloqueio estão comumente disponíveis em formatos padrão, listando organizações anti-P2P, potenciais adversários de nível estadual e outros.
tr: I2P, bir dereceye kadar bir engelleme listesinde bulunan IP adreslerinde çalışan eşlerden kaçınacak şekilde geliştirilebilir. P2P karşıtı kuruluşların, devlet düzeyindeki potansiyel karşıtların ve benzerlerinin bulunduğu birkaç engelleme listesi, standart biçimlerde yaygın olarak bulunur.

source: To the extent that active peers actually do show up in the actual blocklist, blocking by only a subset of peers would tend to segment the network, exacerbate reachability problems, and decrease overall reliability. Therefore we would want to agree on a particular blocklist and enable it by default.
pt: Na medida em que os pares ativos realmente aparecem na lista de bloqueio real, o bloqueio por apenas um subconjunto de pares tenderia a segmentar a rede, agravaria os problemas de acessibilidade e diminuiria a confiabilidade geral. Portanto, gostaríamos de concordar com uma lista de bloqueio específica e habilitá-la por padrão.
tr: Etkin eşler güncel engelleme listesinde gerçekten göründükleri ölçüde, yalnızca bir eş alt kümesi tarafından engelleme, ağı bölümlere ayırma, erişilebilirlik sorunlarını artırma ve genel güvenilirliği düşürme eğiliminde olacaktır. Bu nedenle, belirli bir engelleme listesi üzerinde anlaşmak ve varsayılan olarak etkinleştirmek isteriz.

source: Blocklists are only a part (perhaps a small part) of an array of defenses against maliciousness. In large part the profiling system does a good job of measuring router behavior so that we don't need to trust anything in netDb. However there is more that can be done. For each of the areas in the list above there are improvements we can make in detecting badness.
pt: As listas de bloqueio são apenas uma parte (talvez uma pequena parte) de uma série de defesas contra malícia. Em grande parte, o sistema de criação de perfil faz um bom trabalho ao medir o comportamento do roteador para que não precisemos confiar em nada no netDb. No entanto, há mais que pode ser feito. Para cada uma das áreas na lista acima, há melhorias que podemos fazer na detecção de maldade.
tr: Engelleme listeleri, kötü niyetliliğe karşı bir dizi savunmanın yalnızca bir parçasıdır (belki de küçük bir parçasıdır). Profil oluşturma sistemi, "Ağ veri tabanı" (NetDB) herhangi bir şeye güvenmemize gerek kalmaması için yöneltici davranışını ölçmek amacıyla büyük ölçüde iyi bir iş çıkarır. Ancak yapılabilecek daha çok şey var. Yukarıdaki listedeki konuların her biri için, kötü niyetleri algılamakta yapabileceğimiz iyileştirmeler var.
