Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: "Harvesting" means compiling a list of users running I2P. It can be used for legal attacks and to help other attacks by simply running a peer, seeing who it connects to, and harvesting whatever references to other peers it can find.
pt: "Colheita" significa compilar uma lista de usuários executando o I2P. Ele pode ser usado para ataques legais e para ajudar outros ataques, simplesmente executando um peer, vendo com quem ele se conecta e coletando quaisquer referências a outros peers que puder encontrar.
tr: "Hasat etmek", I2P çalıştıran kullanıcıların listesini derlemek anlamına gelir. Yasal saldırılar için ve yalnızca bir eş çalıştırarak, kiminle bağlantı kurduğunu görerek ve bulabildiği diğer eşlere olan referansları toplayarak diğer saldırılara yardımcı olacak veriler elde edilebilir.

source: I2P itself is not designed with effective defenses against this attack, since there is the distributed network database containing just this information. The following factors make the attack somewhat harder in practice:
pt: O I2P em si não foi projetado com defesas eficazes contra esse ataque, já que há um banco de dados de rede distribuído contendo apenas essas informações. Os seguintes fatores tornam o ataque um pouco mais difícil na prática:
tr: I2P aslında, yalnızca bu bilgileri içeren dağıtılmış bir ağ veri tabanı olduğundan, bu saldırıya karşı etkili savunmalarla tasarlanmamıştır. Aşağıdaki faktörler, saldırıyı pratikte biraz daha zorlaştırır:

source: Network growth will make it more difficult to obtain a given proportion of the network
pt: O crescimento da rede tornará mais difícil obter uma determinada proporção da rede
tr: Ağın büyümesi, ağı belirli bir oranda elde etmeyi zorlaştıracaktır.

source: Floodfill routers implement query limits as DOS protection
pt: Os roteadores Floodfill implementam limites de consulta como proteção DOS
tr: Otomatik doldurma yönelticileri, DOS koruması olarak sorgu sınırlarını uygular

source: "Hidden mode", which prevents a router from publishing its information to the netDb, (but also prevents it from relaying data) is not widely used now but could be.
pt: O "modo oculto", que impede um roteador de publicar suas informações no netDb, (mas também o impede de retransmitir dados), não é amplamente utilizado atualmente, mas poderia ser.
tr: Bir yönelticinin bilgilerinin "Ağ veri tabanında" (NetDB) yayınlamasını engelleyen (aynı zamanda veri aktarımını da engelleyen) "Gizli kip" şu anda yaygın olarak kullanılmıyor ancak kullanılabilir.

source: In future implementations, <a href="%(todo)s#nat">basic</a> and <a href="%(todo)s#fullRestrictedRoutes">comprehensive</a> restricted routes, this attack loses much of its power, as the "hidden" peers do not publish their contact addresses in the network database - only the tunnels through which they can be reached (as well as their public keys, etc).
pt: Em implementações futuras, <a href="%(todo)s#nat">rotas básicas</a> e <a href="%(todo)s#fullRestrictedRoutes">abrangentes</a> restritas, esse ataque perde muito de seu poder, pois os pares "ocultos" não publicam seus endereços de contato no banco de dados da rede - apenas os túneis pelos quais eles podem ser alcançados (assim como suas chaves públicas, etc.).
tr: Gelecekteki uygulamalarda, <a href="%(todo)s#nat">temel</a> ve <a href="%(todo)s#fullRestrictedRoutes">kapsamlı</a> kısıtlanmış rotalarda, "gizli" eşler iletişim adreslerini ağ veri tabanında yayınlamadığından bu saldırı gücünün çoğunu kaybeder. Yalnızca erişilebilen tüneller kullanılır (herkese açık anahtarları gibi).

source: In the future, routers could use GeoIP to identify if they are in a particular country where identification as an I2P node would be risky. In that case, the router could automatically enable hidden mode, or enact other restricted route methods.
pt: No futuro, os roteadores poderão usar o GeoIP para identificar se estão em um país específico onde a identificação como um nó I2P seria arriscada. Nesse caso, o roteador poderá habilitar automaticamente o modo oculto ou promulgar outros métodos de rota restritos.
tr: Gelecekte, yönelticiler, bir I2P düğümü olarak tanımlamanın riskli olacağı belirli bir ülkede olup olmadıklarını belirlemek için GeoIP verisini kullanabilir. Bu durumda, yöneltici otomatik olarak gizli kipi etkinleştirebilir veya diğer kısıtlı rota yöntemlerini yürürlüğe koyabilir.

source: By inspecting the traffic into and out of a router, a malicious ISP or state-level firewall could identify that a computer is running I2P. As discussed <a href="#harvesting">above</a>, I2P is not specifically designed to hide that a computer is running I2P. However, several design decisions made in the design of the <a href="%(transport)s">transport layer and protocols</a> make it somewhat difficult to identify I2P traffic:
pt: Ao inspecionar o tráfego de entrada e saída de um roteador, um ISP malicioso ou firewall de nível de estado pode identificar que um computador está executando I2P. Conforme discutido <a href="#harvesting">acima</a>, o I2P não foi projetado especificamente para esconder que um computador está executando I2P. No entanto, várias decisões de design feitas no design da <a href="%(transport)s">camada de transporte e protocolos</a> tornam um pouco difícil identificar o tráfego I2P:
tr: Kötü niyetli bir internet hizmeti sağlayıcı veya devlet düzeyinde güvenlik duvarı, bir yönelticiye giren ve çıkan trafiği inceleyerek bir bilgisayarın I2P çalıştırdığını belirleyebilir. <a href="#harvesting">Yukarıda</a> tartışıldığı gibi, I2P, bir bilgisayarın I2P çalıştırdığını gizlemek için özel olarak tasarlanmamıştır. Ancak, <a href="%(transport)s">taşıyıcı katmanı ve iletişim kurallarının</a> tasarımında alınan çeşitli kararlar, I2P trafiğini tanımlamayı biraz zorlaştırmaktadır:

source: Random port selection
pt: Seleção aleatória de porta
tr: Rastgele bağlantı noktası seçimi

source: Point-to-Point Encryption of all traffic
pt: Criptografia ponto a ponto de todo o tráfego
tr: Tüm trafiği uçtan uca şifrelemek

source: DH key exchange with no protocol bytes or other unencrypted constant fields
pt: Troca de chaves DH sem bytes de protocolo ou outros campos constantes não criptografados
tr: İletişim kuralı baytı veya diğer şifrelenmemiş sabit alanlar olmadan Diffie-Hellman anahtar alış verişi

source: Simultaneous use of both <a href="%(ntcp)s">TCP</a> and <a href="%(ssu)s">UDP</a> transports. UDP may be much harder for some Deep Packet Inspection (DPI) equipment to track.
pt: Uso simultâneo dos transportes <a href="%(ntcp)s">TCP</a> e <a href="%(ssu)s">UDP</a> . O UDP pode ser muito mais difícil de rastrear para alguns equipamentos de Deep Packet Inspection (DPI).
tr: Hem <a href="%(ntcp)s">TCP</a> hem de <a href="%(ssu)s">UDP</a> taşıyıcılarının eşzamanlı kullanımı. UDP taşıyıcısının bazı "Derin paket denetimi" (DPI) ekipmanları tarafından izlenmesi çok daha zor olabilir.

source: In the near future, we plan to directly address traffic analysis issues by further obfuscation of I2P transport protocols, possibly including:
pt: Em um futuro próximo, planejamos abordar diretamente os problemas de análise de tráfego por meio de maior ofuscação dos protocolos de transporte I2P, possivelmente incluindo:
tr: Yakın gelecekte, muhtemelen aşağıdakilerle birlikte I2P taşıyıcı iletişim kurallarını daha da karmaşık hale getirerek trafik analizi sorunlarını doğrudan ele almayı planlıyoruz:

source: Padding at the transport layer to random lengths, especially during the connection handshake
pt: Preenchimento na camada de transporte para comprimentos aleatórios, especialmente durante o handshake de conexão
tr: Özellikle bağlantı kuruluşunda el sıkışma sırasında, taşıyıcı katmanında rastgele uzunluklarda dolgu ekleme

source: Study of packet size distribution signatures, and additional padding as necessary
pt: Estudo de assinaturas de distribuição de tamanho de pacote e preenchimento adicional conforme necessário
tr: Paket boyutu dağıtım imzalarının incelenmesi ve gerektiğinde ek dolgu ekleme

source: Development of additional transport methods that mimic SSL or other common protocols
pt: Desenvolvimento de métodos de transporte adicionais que imitam SSL ou outros protocolos comuns
tr: SSL veya diğer yaygın iletişim kurallarını taklit eden ek taşıyıcı yöntemlerinin geliştirilmesi

source: Review of padding strategies at higher layers to see how they affect packet sizes at the transport layer
pt: Revisão das estratégias de preenchimento em camadas superiores para ver como elas afetam os tamanhos dos pacotes na camada de transporte
tr: Taşıyıcı katmanındaki paket boyutlarını nasıl etkilediklerini görmek için daha yüksek katmanlardaki dolgu ekleme stratejilerinin gözden geçirilmesi

source: Review of methods implemented by various state-level firewalls to block Tor
pt: Revisão dos métodos implementados por vários firewalls de nível estadual para bloquear o Tor
tr: Tor ağına erişimi engellemek için çeşitli devlet düzeyinde güvenlik duvarları tarafından uygulanan yöntemlerin gözden geçirilmesi

source: Working directly with DPI and obfuscation experts
pt: Trabalhando diretamente com especialistas em DPI e ofuscação
tr: Doğrudan "Derin paket denetimi" (DPI) ve şaşırtma uzmanlarıyla çalışmalar

source: Reference: <a href="%(pdf)s">Breaking and Improving Protocol Obfuscation</a>
pt: Referência: <a href="%(pdf)s">Quebrando e Melhorando a Ofuscação de Protocolo</a>
tr: Referans: <a href="%(pdf)s">İletişim kuralı gizlemeyi kırmak ve iyileştirme</a>

source: Sybil describes a category of attacks where the adversary creates arbitrarily large numbers of colluding nodes and uses the increased numbers to help mounting other attacks. For instance, if an attacker is in a network where peers are selected randomly and they want an 80&#37; chance to be one of those peers, they simply create five times the number of nodes that are in the network and roll the dice. When identity is free, Sybil can be a very potent technique for a powerful adversary. The primary technique to address this is simply to make identity 'non free' - <a href="http://www.pdos.lcs.mit.edu/tarzan/">Tarzan</a> (among others) uses the fact that IP addresses are limited, while IIP used <a href="http://www.hashcash.org/">HashCash</a> to 'charge' for creating a new identity. We currently have not implemented any particular technique to address Sybil, but do include placeholder certificates in the router's and destination's data structures which can contain a HashCash certificate of appropriate value when necessary (or some other certificate proving scarcity).
pt: Sybil descreve uma categoria de ataques onde o adversário cria arbitrariamente um grande número de nós coniventes e usa os números aumentados para ajudar a montar outros ataques. Por exemplo, se um invasor estiver em uma rede onde os pares são selecionados aleatoriamente e eles querem uma chance de 80&#37; de ser um desses pares, eles simplesmente criam cinco vezes o número de nós que estão na rede e rolam os dados. Quando a identidade é livre, Sybil pode ser uma técnica muito potente para um adversário poderoso. A técnica primária para resolver isso é simplesmente tornar a identidade 'não livre' - <a href="http://www.pdos.lcs.mit.edu/tarzan/">Tarzan</a> (entre outros) usa o fato de que endereços IP são limitados, enquanto IIP usou <a href="http://www.hashcash.org/">HashCash</a> para 'cobrar' pela criação de uma nova identidade . Atualmente, não implementamos nenhuma técnica específica para resolver Sybil, mas incluímos certificados de espaço reservado nas estruturas de dados do roteador e destino que podem conter um certificado HashCash de valor apropriado quando necessário (ou algum outro certificado que comprove escassez).
tr: Sybil, saldırganın keyfi olarak çok sayıda gizli düğüm oluşturduğu ve artan sayıları diğer saldırıların yapılmasına yardımcı olmak için kullandığı bir saldırı kategorisini tanımlar. Örneğin, bir saldırgan, eşlerin rastgele seçildiği bir ağdaysa ve bu eşlerden biri olma 80&37; şansı istiyorsa, ağdaki düğüm sayısının beş katını oluşturur ve zarları atar. Kimlik özgür olduğunda, Sybil güçlü bir düşman için çok etkili bir teknik olabilir. Bunu ele almanın birincil tekniği basitçe kimliği 'özgür olmayan' hale getirmektir - <a href="http://www.pdos.lcs.mit.edu/tarzan/">Tarzan</a> (diğerlerinin yanı sıra) IP adreslerinin sınırlı olduğu gerçeğini kullanırken, IIP yeni bir kimlik oluşturmak için 'ücret' almak amacıyla <a href="http://www.hashcash.org/">HashCash</a> kullanır. Şu anda Sybil konusunu ele almak için herhangi bir özel teknik uygulamadık. Ancak yönelticinin ve hedefin veri yapılarına, gerektiğinde uygun değerde bir HashCash sertifikası (veya kıtlığı kanıtlayan başka bir sertifika) içerebilen yer belirtici sertifikaları katıyoruz.

source: Requiring HashCash Certificates in various places has two major problems:
pt: Exigir certificados HashCash em vários lugares tem dois grandes problemas:
tr: HashCash sertifikalarının çeşitli yerlerde istenmesinin iki büyük sorunu vardır:

source: Maintaining backward compatibility
pt: Manter compatibilidade com versões anteriores
tr: Geriye dönük uyumluluğu korumak

source: The classic HashCash problem - selecting HashCash values that are meaningful proofs of work on high-end machines, while still being feasible on low-end machines such as mobile devices.
pt: O problema clássico do HashCash - selecionar valores de HashCash que sejam provas de trabalho significativas em máquinas de ponta, embora ainda sejam viáveis em máquinas de baixo custo, como dispositivos móveis.
tr: Klasik HashCash sorunu. Mobil aygıtlar gibi düşük kaliteli makinelerde hala uygulanabilirken, yüksek kaliteli makinelerde çalışmanın anlamlı kanıtları olan HashCash değerlerinin seçilmesi.

source: Various limitations on the number of routers in a given IP range restrict the vulnerability to attackers that don't have the ability to put machines in several IP blocks. However, this is not a meaningful defense against a powerful adversary.
pt: Várias limitações no número de roteadores em um determinado intervalo de IP restringem a vulnerabilidade a invasores que não têm a capacidade de colocar máquinas em vários blocos de IP. No entanto, esta não é uma defesa significativa contra um adversário poderoso.
tr: Belirli bir IP aralığındaki yöneltici sayısındaki çeşitli sınırlamalar, güvenlik açığını, makineleri birkaç IP bloğuna yerleştirme yeteneğine sahip olmayan saldırganlara karşı kısıtlar. Ancak bu, güçlü bir rakibe karşı anlamlı bir savunma sağlamaz.

source: See the <a href="%(netdb)s#threat">network database page</a> for more Sybil discussion.
pt: Veja a página do banco de dados de rede <a href="%(netdb)s#threat"></a> para mais discussões sobre Sybil.
tr: Daha fazla Sybil tartışması için <a href="%(netdb)s#threat">"Ağ veri tabanı" (NetDB) sayfasına</a> bakabilirsiniz.

source: (Reference: <a href="%(pdf)s">In Search of an Anonymous and Secure Lookup</a> Section 5.2)
pt: (Referência: <a href="%(pdf)s">Em busca de uma pesquisa anônima e segura</a> Seção 5.2)
tr: (Referans: <a href="%(pdf)s">In Search of an Anonymous and Secure Lookup</a> 5.2. bölüm)

source: By refusing to accept or forward tunnel build requests, except to a colluding peer, a router could ensure that a tunnel is formed wholly from its set of colluding routers. The chances of success are enhanced if there is a large number of colluding routers, i.e. a <a href="#sybil">Sybil attack</a>. This is somewhat mitigated by our <a href="%(peerselection)s">peer profiling</a> methods used to monitor the performance of peers. However, this is a powerful attack as the number of routers approaches <i>f</i> = 0.2, or 20&#37; malicious nodes, as specifed in the paper. The malicous routers could also maintain connections to the target router and provide excellent forwarding bandwidth for traffic over those connections, in an attempt to manipulate the profiles managed by the target and appear attractive. Further research and defenses may be necessary.
pt: Ao se recusar a aceitar ou encaminhar solicitações de construção de túneis, exceto para um par em conluio, um roteador pode garantir que um túnel seja formado inteiramente a partir de seu conjunto de roteadores em conluio. As chances de sucesso aumentam se houver um grande número de roteadores em conluio, ou seja, um <a href="#sybil">ataque Sybil</a>. Isso é um pouco atenuado por nossos <a href="%(peerselection)s">métodos de criação de perfil de pares</a> usados para monitorar o desempenho dos pares. No entanto, este é um ataque poderoso, pois o número de roteadores se aproxima de <i>f</i> = 0,2, ou 20&#37; nós maliciosos, conforme especificado no artigo. Os roteadores maliciosos também podem manter conexões com o roteador de destino e fornecer excelente largura de banda de encaminhamento para o tráfego por essas conexões, em uma tentativa de manipular os perfis gerenciados pelo alvo e parecer atraente. Mais pesquisas e defesas podem ser necessárias.
tr: Bir yöneltici, ortak bir eş dışında tünel oluşturma isteklerini kabul etmeyi veya iletmeyi reddederek, bir tünelin tamamen kendi ortak yönelticileri kümesinden oluşturulmasını sağlayabilir. Bir <a href="#sybil">Sybil saldırısındaki</a> gibi çok sayıda gizli yöneltici varsa, başarı şansı artar. Bu, eşlerin başarımını izlemek için kullanılan <a href="%(peerselection)s">eş profili oluşturma</a> yöntemlerimiz tarafından biraz azaltılır. Ancak makalede belirtildiği gibi yöneltici sayısı <i>f</i> = 0,2 civarında veya 20&#37; kötü niyetli düğümler varsa bu güçlü bir saldırı olur. Kötü amaçlı yönlendiriciler, hedef tarafından yönetilen profilleri manipüle etmek ve çekici görünmek amacıyla, hedef yönelticiyle olan bağlantıları da koruyabilir ve bu bağlantılar üzerinden trafik için mükemmel iletme bant genişliği sağlayabilir. Daha fazla araştırma ve savunma gerekli olabilir.

source: We use strong cryptography with long keys, and we assume the security of the industry-standard cryptographic primitives used in I2P, as documented <a href="%(cryptography)s">on the low-level cryptography page</a>. Security features include the immediate detection of altered messages along the path, the inability to decrypt messages not addressed to you, and defense against man-in-the-middle attacks. The key sizes chosen in 2003 were quite conservative at the time, and are still longer than those used in <a href="https://torproject.org/">other anonymity networks</a>. We don't think the current key lengths are our biggest weakness, especially for traditional, non-state-level adversaries; bugs and the small size of the network are much more worrisome. Of course, all cryptographic algorithms eventually become obsolete due to the advent of faster processors, cryptographic research, and advancements in methods such as rainbow tables, clusters of video game hardware, etc. Unfortunately, I2P was not designed with easy mechanisms to lengthen keys or change shared secret values while maintaining backward compatibility.
pt: Usamos criptografia forte com chaves longas e assumimos a segurança dos primitivos criptográficos padrão da indústria usados em I2P, conforme documentado <a href="%(cryptography)s">na página de criptografia de baixo nível</a>. Os recursos de segurança incluem a detecção imediata de mensagens alteradas ao longo do caminho, a incapacidade de descriptografar mensagens não endereçadas a você, e defesa contra ataques do tipo man-in-the-middle. Os tamanhos de chave escolhidos em 2003 eram bastante conservadores na época e ainda são maiores do que aqueles usados em <a href="https://torproject.org/">outras redes de anonimato</a>. Não achamos que os comprimentos de chave atuais sejam nossa maior fraqueza, especialmente para adversários tradicionais, não estatais; bugs e o pequeno tamanho da rede são muito mais preocupantes. Claro, todos os algoritmos criptográficos eventualmente se tornam obsoletos devido ao advento de processadores mais rápidos, pesquisa criptográfica e avanços em métodos como tabelas arco-íris, clusters de hardware de videogame, etc. Infelizmente, o I2P não foi projetado com mecanismos fáceis para aumentar chaves ou alterar valores secretos compartilhados, mantendo a compatibilidade com versões anteriores.
tr: Uzun anahtarlarla güçlü şifreleme kullanıyoruz ve <a href="%(cryptography)s">düşük düzeyli şifreleme sayfasında</a> belirtildiği gibi I2P ağında kullanılan endüstri standardı şifreleme öncüllerinin güvenli olduğunu varsayıyoruz. Güvenlik özellikleri, yol boyunca değiştirilmiş iletilerin anında algılanmasını, size gönderilmeyen iletilerin şifresinin çözülmemesini ve ortadaki adam saldırılarına karşı savunmayı kapsar. 2003 yılında seçilen anahtar boyutları o zamanlar oldukça tutucuydu ve hala <a href="https://torproject.org/">diğer anonimlik ağlarında</a> kullanılanlardan daha uzun. Geçerli anahtar uzunluklarının, özellikle geleneksel, devlet düzeyinde olmayan saldırganlar için en büyük zayıflığımız olduğunu düşünmüyoruz. Hatalar ve ağın küçük boyutu çok daha endişe vericidir. Tabii ki, tüm şifreleme algoritmaları, daha hızlı işlemcilerin ortaya çıkması, şifreleme araştırmaları ve gökkuşağı tabloları, video oyun donanımı kümeleri gibi yöntemlerdeki gelişmeler nedeniyle sonunda eskiyor. Ne yazık ki, I2P, geriye dönük uyumluluğu korurken anahtarları uzatmak veya paylaşılan gizli değerleri değiştirmeyi sağlayacak kolay mekanizmalarla tasarlanmamıştır.

source: Upgrading the various data structures and protocols to support longer keys will have to be tackled eventually, and this will be a <a href="%(cryptography)s">major undertaking</a>, just as it will be for <a href="https://torproject.org/">others</a>. Hopefully, through careful planning, we can minimize the disruption, and implement mechanisms to make it easier for future transitions.
pt: A atualização das várias estruturas de dados e protocolos para suportar chaves mais longas terá que ser abordada eventualmente, e isso será uma <a href="%(cryptography)s">grande tarefa</a>, assim como será para <a href="https://torproject.org/">outros</a>. Esperançosamente, por meio de um planejamento cuidadoso, podemos minimizar a interrupção e implementar mecanismos para facilitar futuras transições.
tr: Eninde sonunda daha uzun anahtarları desteklemek için çeşitli veri yapılarını ve iletişim kurallarını yükseltmenin ele alınması gerekecek ve bu, tıpkı <a href="https://torproject.org/">diğerleri</a> için olduğu gibi <a href="%(cryptography)s">önemli bir girişim</a> olacaktır. Umuyoruz ki dikkatli bir planlamayla kesintiyi en aza indirebilir ve gelecekteki geçişleri kolaylaştıracak mekanizmalar uygulayabiliriz.

source: In the future, several I2P protocols and data structures support securely padding messages to arbitrary sizes, so messages could be made constant size or garlic messages could be modified randomly so that some cloves appear to contain more subcloves than they actually do. At the moment, however, garlic, tunnel, and end to end messages include simple random padding.
pt: No futuro, vários protocolos I2P e estruturas de dados suportam mensagens de preenchimento seguro para tamanhos arbitrários, então as mensagens poderiam ser tornadas constantes ou mensagens de alho poderiam ser modificadas aleatoriamente para que alguns dentes parecessem conter mais subdentes do que realmente contêm. No momento, no entanto, mensagens de alho, túnel e ponta a ponta incluem preenchimento aleatório simples.
tr: Gelecekte, birkaç I2P iletişim kuralı ve veri yapısı, iletilerin rastgele boyutlara güvenli bir şekilde dolgu eklenmesini destekler. Bu nedenle iletiler sabit boyutta yapılabilir veya Garlic iletileri rastgele değiştirilebilir. Böylece bazı dişler gerçekte olduğundan daha fazla alt diş içeriyor gibi görünebilir. Ancak şu anda Garlic, tünel ve uçtan uca iletiler basit rastgele dolgu eklemeyi içeriyor.
