Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: To understand I2P's operation, it is essential to understand a few key concepts. First, I2P makes a strict separation between the software participating in the network (a "router") and the anonymous endpoints ("destinations") associated with individual applications. The fact that someone is running I2P is not usually a secret. What is hidden is information on what the user is doing, if anything at all, as well as what router a particular destination is connected to. End users will typically have several local destinations on their router - for instance, one proxying in to IRC servers, another supporting the user's anonymous webserver ("I2P Site"), another for an I2Phex instance, another for torrents, etc.
pt: Para entender a operação do I2P, é essencial entender alguns conceitos-chave. Primeiro, o I2P faz uma separação estrita entre o software que participa da rede (um "roteador") e os endpoints anônimos ("destinos") associados a aplicativos individuais. O fato de alguém estar executando o I2P não é geralmente um segredo. O que está oculto são informações sobre o que o usuário está fazendo, se é que está fazendo alguma coisa, bem como a qual roteador um destino específico está conectado . Os usuários finais normalmente terão vários destinos locais em seus roteadores - por exemplo, um fazendo proxy em servidores IRC, outro dando suporte ao servidor web anônimo do usuário ("Site I2P"), outro para uma instância I2Phex, outro para torrents, etc.
tr: I2P işleyişini anlamak için birkaç temel kavramın anlaşılması önemlidir. İlk olarak, I2P, ağa katılan yazılım (bir "yöneltici") ile bireysel uygulamalarla ilişkili anonim uç noktalar ("hedefler") arasında kesin bir ayrım yapar. Birinin I2P çalıştırdığı gerçeği genellikle bir sır değildir. Gizli olan, kullanıcının ne yaptığı, herhangi bir şey yapıyorsa belirli bir hedefin hangi yönelticiye bağlı olduğu hakkında bilgidir. Son kullanıcıların yönelticilerinde tipik olarak birkaç yerel hedefi olacaktır. Örneğin, biri IRC sunucuları için vekil sunucuyu, bir başkası, kullanıcının anonim site sunucusunu ("I2P Sitesi"), diğeri bir I2Phex kopyasını, diğeri torrent kullanımı gibi işlemleri destekler.

source: Another critical concept to understand is the "tunnel". A tunnel is a directed path through an explicitly selected list of routers. Layered encryption is used, so each of the routers can only decrypt a single layer. The decrypted information contains the IP of the next router, along with the encrypted information to be forwarded. Each tunnel has a starting point (the first router, also known as "gateway") and an end point. Messages can be sent only in one way. To send messages back, another tunnel is required.
pt: Outro conceito crítico para entender é o "túnel". Um túnel é um caminho direcionado por uma lista explicitamente selecionada de roteadores. Criptografia em camadas é usada, então cada um dos roteadores pode descriptografar apenas uma única camada. As informações descriptografadas contêm o IP do próximo roteador, junto com as informações criptografadas a serem encaminhadas. Cada túnel tem um ponto inicial (o primeiro roteador, também conhecido como "gateway") e um ponto final. As mensagens podem ser enviadas apenas de uma maneira. Para enviar mensagens de volta, outro túnel é necessário.
tr: Anlaşılması gereken bir diğer kritik kavram da "tünel"dir. Tünel, açıkça seçilmiş bir yöneltrici listesi üzerinden yöneltilen bir yoldur. Katmanlı şifreleme kullanılır, bu nedenle yönelticilerin her biri yalnızca tek bir katmanın şifresini çözebilir. Şifresi çözülen bilgilerde, iletilecek şifreli bilgilerle birlikte bir sonraki yönelticinin IP adresi bulunur. Her tünelin bir başlangıç noktası ("ağ geçidi" olarak da bilinen ilk yöneltrici) ve bir bitiş noktası vardır. İletiler yalnızca bir şekilde gönderilebilir. İletileri geri göndermek için başka bir tünel gereklidir.

source: Inbound and outbound tunnel schematic
pt: Esquema de túnel de entrada e saída
tr: Geliş ve gidiş tünellerinin şemaları

source: Figure 1: Two types of tunnels exist: inbound and outbound.
pt: Figura 1: Existem dois tipos de túneis: entrada e saída.
tr: Şekil 1: İki tünel türü: Geliş ve gidiş.

source: Two types of tunnels exist: <b>"outbound" tunnels</b> send messages away from the tunnel creator, while <b>"inbound" tunnels</b> bring messages to the tunnel creator. Combining these two tunnels allows users to send messages to each other. The sender ("Alice" in the above image) sets up an outbound tunnel, while the receiver ("Bob" in the above image) creates an inbound tunnel. The gateway of an inbound tunnel can receive messages from any other user and will send them on until the endpoint ("Bob"). The endpoint of the outbound tunnel will need to send the message on to the gateway of the inbound tunnel. To do this, the sender ("Alice") adds instructions to her encrypted message. Once the endpoint of the outbound tunnel decrypts the message, it will have instructions to forward the message to the correct inbound gateway (the gateway to "Bob").
pt: Existem dois tipos de túneis: <b>túneis de "saída"</b> enviam mensagens para longe do criador do túnel, enquanto <b>túneis de "entrada"</b> trazem mensagens para o criador do túnel. A combinação desses dois túneis permite que os usuários enviem mensagens uns aos outros. O remetente ("Alice" na imagem acima) configura um túnel de saída, enquanto o receptor ("Bob" na imagem acima) cria um túnel de entrada. O gateway de um túnel de entrada pode receber mensagens de qualquer outro usuário e as enviará até o ponto final ("Bob"). O ponto final do túnel de saída precisará enviar a mensagem para o gateway do túnel de entrada. Para fazer isso, o remetente ("Alice") adiciona instruções à sua mensagem criptografada. Assim que o ponto final do túnel de saída descriptografar a mensagem, ele terá instruções para encaminhar a mensagem para o gateway de entrada correto (o gateway para "Bob").
tr: İki tür tünel vardır: <b>"gidiş" tüneli</b> tünel oluşturucudan dışarı iletiler gönderirken, <b>"geliş" tüneli</b> iletileri tünel oluşturucuya getirir. Bu iki tünel bir arada kullanılarak kullanıcıların birbirlerine ileti gönderilmesi sağlanır. Gönderici (yukarıdaki görselde "Alice") bir gidiş tüneli oluştururken alıcı (yukarıdaki görselde "Bob") bir geliş tüneli oluşturur. Geliş tünelinin ağ geçidi, herhangi bir başka kullanıcıdan ileti alabilir ve bunları uç noktaya ("Bob") kadar gönderir. Gidiş tünelinin uç noktasının, geliş tünelinin ağ geçidine ileti göndermesi gerekir. Bunu yapmak için gönderici ("Alice") şifreli iletisine yönergeler ekler. Gidiş tünelinin uç noktası iletinin şifresini çözdüğünde, iletiyi doğru geliş ağ geçidine ("Bob" ağ geçidi) iletmek için yönergeleri almış olur.

source: A third critical concept to understand is I2P's <b>"network database"</b> (or "netDb") - a pair of algorithms used to share network metadata. The two types of metadata carried are <b>"routerInfo"</b> and <b>"leaseSets"</b> - the routerInfo gives routers the data necessary for contacting a particular router (their public keys, transport addresses, etc), while the leaseSet gives routers the information necessary for contacting a particular destination. A leaseSet contains a number of "leases". Each of this leases specifies a tunnel gateway, which allows reaching a specific destination. The full information contained in a lease:
pt: Um terceiro conceito crítico para entender é o <b>"network database"</b> (ou "netDb") do I2P - um par de algoritmos usados para compartilhar metadados de rede. Os dois tipos de metadados transportados são <b>"routerInfo"</b> e <b>"leaseSets"</b> - o routerInfo fornece aos roteadores os dados necessários para contatar um roteador específico (suas chaves públicas, endereços de transporte , etc.), enquanto o leaseSet fornece aos roteadores as informações necessárias para contatar um destino específico. Um leaseSet contém uma série de "leases". Cada um desses arrendamentos especifica um gateway de túnel, que permite atingir um destino específico. As informações completas contidas em um arrendamento:
tr: Anlaşılması gereken üçüncü kritik kavram, ağ üst verilerini paylaşmak için kullanılan bir çift algoritma olan I2P <b>"Ağ veri tabanı" (NetDB)</b> olacak. Taşınan iki üst veri türü <b>"Yöneltici bilgileri" (RouterInfo)</b> ve <b>"Kiralama kümeleri" (LeaseSets) - "Yöneltici bilgileri" (RouterInfo), yönelticilere belirli bir yöneltici ile iletişim kurmak için gerekli verileri (herkese açık anahtarlar, taşıyıcı adresleri, vb.) verirken, "Kiralama kümesi" (LeaseSet) yönelticilere belirli bir hedefle iletişim kurmak için gereken bilgileri verir. Bir "Kiralama kümesi" (LeaseSet) içinde bir dizi "kiralama" bulunur. Bu kiralamaların her biri, belirli bir hedefe ulaşmayı sağlayan bir tünel ağ geçidi belirtir. Bir kiralamadaki tüm bilgiler şunlardır:

source: Inbound gateway for a tunnel that allows reaching a specific destination.
pt: Gateway de entrada para um túnel que permite chegar a um destino específico.
tr: Belirli bir hedefe ulaşmayı sağlayan bir tünelin geliş ağ geçidi.

source: Time when a tunnel expires.
pt: Tempo em que um túnel expira.
tr: Bir tünelin geçerlilik süresi.

source: Pair of public keys to be able to encrypt messages (to send through the tunnel and reach the destination).
pt: Par de chaves públicas para poder criptografar mensagens (para enviar através do túnel e chegar ao destino).
tr: İletileri şifreleyebilmek için (tünelden göndermek ve hedefe ulaşmak için) herkese açık anahtar çifti.

source: Routers themselves send their routerInfo to the netDb directly, while leaseSets are sent through outbound tunnels (leaseSets need to be sent anonymously, to avoid correlating a router with his leaseSets).
pt: Os próprios roteadores enviam suas routerInfo para o netDb diretamente, enquanto os leaseSets são enviados por meio de túneis de saída (os leaseSets precisam ser enviados anonimamente para evitar correlacionar um roteador com seus leaseSets).
tr: Yönelticiler, "Yöneltici bilgilerini" (RouterInfo) doğrudan "Ağ veri tabanına" (NetDB) gönderirken, "Kiralama kümeleri" (LeaseSets) gidiş tünelleri üzerinden gönderilir (bir yönelticinin kendi "Kiralama kümesi" ile ilişkilendirilmesini önlemek için "Kiralama kümelerinin" anonim olarak gönderilmesi gerekir).

source: We can combine the above concepts to build successful connections in the network.
pt: Podemos combinar os conceitos acima para construir conexões bem-sucedidas na rede.
tr: Ağda başarılı bağlantılar kurmak için yukarıdaki kavramları birleştirebiliriz.

source: To build up her own inbound and outbound tunnels, Alice does a lookup in the netDb to collect routerInfo. This way, she gathers lists of peers she can use as hops in her tunnels. She can then send a build message to the first hop, requesting the construction of a tunnel and asking that router to send the construction message onward, until the tunnel has been constructed.
pt: Para construir seus próprios túneis de entrada e saída, Alice faz uma pesquisa no netDb para coletar routerInfo. Dessa forma, ela reúne listas de pares que pode usar como saltos em seus túneis. Ela pode então enviar uma mensagem de construção para o primeiro salto, solicitando a construção de um túnel e pedindo que o roteador envie a mensagem de construção adiante, até que o túnel seja construído.
tr: Alice, kendi geliş ve gidiş tünellerini oluşturmak için "Yöneltici bilgilerini" (RouterInfo) toplamak amacıyla "Ağ veri tabanı" (NetDB) üzerinde bir arama yapar. Böylece, tünellerinde sıçrama olarak kullanabileceği eşlerin listelerini toplar. Daha sonra ilk sıçramaya bir oluşturma iletisi gönderebilir, bir tünel oluşturulmasını isteyebilir ve yönelticiden tünel oluşturulana kadar oluşturma iletisini göndermesini isteyebilir.

source: Request information on other routers
pt: Requerer informação em outros roteadores
tr: Diğer yönelticiler hakkında bilgi istenir

source: Build tunnel using router information
pt: Construir túnel usando a informação do roteador
tr: Yöneltici bilgileri kullanılarak tünel oluşturulur

source: Figure 2: Router information is used to build tunnels.
pt: Figura 2: Informação dos roteadores é usada para construir túneis.
tr: Şekil 2: Tünelleri oluşturmak için kullanılan yöneltici bilgileri.

source: When Alice wants to send a message to Bob, she first does a lookup in the netDb to find Bob's leaseSet, giving her his current inbound tunnel gateways. She then picks one of her outbound tunnels and sends the message down it with instructions for the outbound tunnel's endpoint to forward the message on to one of Bob's inbound tunnel gateways. When the outbound tunnel endpoint receives those instructions, it forwards the message as requested, and when Bob's inbound tunnel gateway receives it, it is forwarded down the tunnel to Bob's router. If Alice wants Bob to be able to reply to the message, she needs to transmit her own destination explicitly as part of the message itself. This can be done by introducing a higher-level layer, which is done in the <a href="#app.streaming">streaming</a> library. Alice may also cut down on the response time by bundling her most recent LeaseSet with the message so that Bob doesn't need to do a netDb lookup for it when he wants to reply, but this is optional.
pt: Quando Alice quer enviar uma mensagem para Bob, ela primeiro faz uma pesquisa no netDb para encontrar o leaseSet de Bob, dando a ela seus gateways de túnel de entrada atuais. Ela então escolhe um de seus túneis de saída e envia a mensagem por ele com instruções para o ponto final do túnel de saída encaminhar a mensagem em para um dos gateways de túnel de entrada de Bob. Quando o ponto final do túnel de saída recebe essas instruções, ele encaminha a mensagem conforme solicitado, e quando o gateway de túnel de entrada de Bob a recebe, ela é encaminhada pelo túnel para o roteador de Bob. Se Alice quiser que Bob seja capaz de responder à mensagem, ela precisa transmitir seu próprio destino explicitamente como parte da própria mensagem. Isso pode ser feito introduzindo uma camada de nível superior, o que é feito na biblioteca de streaming <a href="#app.streaming"></a> . Alice também pode reduzir o tempo de resposta agrupando seu LeaseSet mais recente com a mensagem para que Bob não precise fazer uma pesquisa no netDb quando quiser responder, mas isso é opcional.
tr: Alice, Bob'a bir ileti göndermek istediğinde, önce Bob'un "Kiralama kümesini" (LeaseSet) bulmak için "Ağ veri tabanında" (NetDB) bir arama yapar ve ona var olan geliş tüneli ağ geçitlerini öğrenir. Ardından, gidiş tünellerinden birini seçer ve iletiyi Bob'un geliş tüneli ağ geçitlerinden birine iletmek için gidiş tünelinin uç noktası için yönergelerle birlikte aşağıya gönderir. Gidiş tüneli uç noktası bu yönergeleri aldığında, iletiyi istendiği gibi iletir ve Bob'un geliş tüneli ağ geçidi bunu aldığında, tünelden Bob'un yönelticisine iletilir. Alice, Bob'un iletiyi yanıtlayabilmesini istiyorsa, kendi hedefini iletinin bir parçası olarak açıkça iletmelidir. Bu, <a href="#app.streaming">Streaming</a> kitaplığında yapılan daha yüksek düzeyle bir katman sunularak yapılabilir. Alice ayrıca, Bob'un yanıt vermek istemesi durumunda "Ağ veri tabanı" (NetDB) araması yapmasına gerek kalmaması için en son "Kiralama kümesini" (LeaseSet) iletiye katarak yanıt süresini kısaltabilir. Ancak bu seçenek isteğe bağlıdır.

source: Connect tunnels using LeaseSets
pt: Conecte túneis usando LeaseSets
tr: "Kiralama kümeleri" (LeaseSets) kullanarak tüneller ile bağlantı kurmak

source: Connect tunnels using leaseSets
pt: Conecte túneis usando leaseSets
tr: "Kiralama kümeleri" (LeaseSets) kullanarak tüneller ile bağlantı kurmak

source: Figure 3: LeaseSets are used to connect outbound and inbound tunnels.
pt: Figura 3: LeaseSets são usados para conectar túneis de saída e entrada.
tr: Şekil 3: "Kiralama kümelerini" (LeaseSets) kullanarak gidiş ve geliş tünellerini bağlamak.

source: While the tunnels themselves have layered encryption to prevent unauthorized disclosure to peers inside the network (as the transport layer itself does to prevent unauthorized disclosure to peers outside the network), it is necessary to add an additional end to end layer of encryption to hide the message from the outbound tunnel endpoint and the inbound tunnel gateway. This "<a href="#op.garlic">garlic encryption</a>" lets Alice's router wrap up multiple messages into a single "garlic message", encrypted to a particular public key so that intermediary peers cannot determine either how many messages are within the garlic, what those messages say, or where those individual cloves are destined. For typical end to end communication between Alice and Bob, the garlic will be encrypted to the public key published in Bob's leaseSet, allowing the message to be encrypted without giving out the public key to Bob's own router.
pt: Enquanto os próprios túneis têm criptografia em camadas para impedir a divulgação não autorizada para pares dentro da rede (como a própria camada de transporte faz para impedir a divulgação não autorizada para pares fora da rede), é necessário adicionar uma camada adicional de criptografia de ponta a ponta para ocultar a mensagem do ponto final do túnel de saída e do gateway do túnel de entrada. Esta "<a href="#op.garlic">garlic criptografia</a>" permite que o roteador de Alice envolva várias mensagens em uma única "mensagem de alho", criptografada para uma chave pública específica para que os pares intermediários não possam determinar quantas mensagens estão dentro do alho, o que essas mensagens dizem ou para onde esses dentes individuais são destinados. Para uma comunicação típica de ponta a ponta entre Alice e Bob, o alho será criptografado para a chave pública publicada no leaseSet de Bob, permitindo que a mensagem seja criptografada sem fornecer a chave pública ao próprio roteador de Bob.
tr: Tünellerin kendileri, ağ içindeki eşlere karşı izinsiz açığa çıkmalarını önlemek için katmanlı şifreleme kullansa da (ağ dışındaki eşlere izin açığa çıkmayı önlemek için taşıma katmanının yaptığı gibi), gidiş tüneli uç noktasından ve geliş tüneli ağ geçidinden gelen iletiyi gizlemek için ek bir uçtan uca şifreleme katmanı eklemek gerekir. Bu "<a href="#op.garlic">Garlic şifrelemesi</a>", Alice'in yönelticisinin birden çok iletiyi tek bir "Garlic iletisine" sarmalamasını ve belirli bir ortak anahtarla şifrelemesini sağlar. Böylece aracı eşler Garlic içinde kaç ileti olduğunu, bu iletilerin ne söylediğini veya bu iletilerin nerede olduğunu ya da bu dişin hangi hedefe gönderildiğini belirleyemez. Alice ve Bob arasında tipik uçtan uca iletişim için, garlic Bob'un "Kiralama kümesinde" (LeaseSet) yayınlanan ortak anahtarla şifrelenir. Böylece herkese açık anahtar Bob'un kendi yönelticisine verilmeden iletinin şifrelenmesi sağlanır.

source: Another important fact to keep in mind is that I2P is entirely message based and that some messages may be lost along the way. Applications using I2P can use the message oriented interfaces and take care of their own congestion control and reliability needs, but most would be best served by reusing the provided <a href="#app.streaming">streaming</a> library to view I2P as a streams based network.
pt: Outro fato importante a ter em mente é que o I2P é inteiramente baseado em mensagens e que algumas mensagens podem ser perdidas ao longo do caminho. Os aplicativos que usam I2P podem usar as interfaces orientadas a mensagens e cuidar de suas próprias necessidades de controle e confiabilidade de congestionamento , mas a maioria seria melhor atendida reutilizando a biblioteca streaming <a href="#app.streaming">fornecida</a> para visualizar o I2P como uma rede baseada em fluxos .
tr: Akılda tutulması gereken bir diğer önemli durum, I2P uygulamasının tamamen ileti temelli olduğu ve yol boyunca bazı iletilerin kaybolabileceğidir. I2P kullanan uygulamalar, ileti odaklı arayüzleri kullanabilir ve kendi tıkanıklık denetimi ile güvenilirlik gereksinimlerini karşılayabilir. Ancak çoğunun en iyi şekilde hizmet sağlaması için, I2P uygulamasını akış temelli bir ağ olarak görüntülemek için sağlanan <a href="#app.streaming">akış</a> kitaplığını yeniden kullanması gerekir.

source: Both inbound and outbound tunnels work along similar principles. The tunnel gateway accumulates a number of tunnel messages, eventually preprocessing them into something for tunnel delivery. Next, the gateway encrypts that preprocessed data and forwards it to the first hop. That peer and subsequent tunnel participants add on a layer of encryption after verifying that it isn't a duplicate before forward it on to the next peer. Eventually, the message arrives at the endpoint where the messages are split out again and forwarded on as requested. The difference arises in what the tunnel's creator does - for inbound tunnels, the creator is the endpoint and they simply decrypt all of the layers added, while for outbound tunnels, the creator is the gateway and they pre-decrypt all of the layers so that after all of the layers of per-hop encryption are added, the message arrives in the clear at the tunnel endpoint.
pt: Tanto os túneis de entrada quanto os de saída funcionam com princípios semelhantes. O gateway do túnel acumula uma série de mensagens de túnel, eventualmente pré-processando-as em algo para entrega no túnel. Em seguida, o gateway criptografa os dados pré-processados e os encaminha para o primeiro salto. Esse par e os participantes subsequentes do túnel adicionam uma camada de criptografia após verificar se não é uma duplicata antes de encaminhá-la para o próximo par. Eventualmente, a mensagem chega ao ponto final onde as mensagens são divididas novamente e encaminhadas conforme solicitado. A diferença de surge no que o criador do túnel faz - para túneis de entrada, o criador é o ponto final e ele simplesmente descriptografa todas as camadas adicionadas, enquanto para túneis de saída, o criador é o gateway e ele pré-descriptografa todas as camadas para que, depois que todas as camadas de criptografia por salto forem adicionadas, a mensagem chegue limpa ao ponto final do túnel.
tr: Geliş ve gidiş tünelleri benzer ilkelerle çalışır. Tünel ağ geçidi, bir dizi tünel iletisi biriktirir ve sonunda bunları tünel aktarımı için bir şey olarak ön işler. Ardından, ağ geçidi ön işlenmiş verileri şifreler ve ilk sıçramaya iletir. Bu eş ve sonraki tünel katılımcıları, bir sonraki eşe iletmeden önce kopya olmadığını doğruladıktan sonra bir şifreleme katmanı ekler. Sonunda ileti, iletilerin yeniden bölündüğü ve istendiği gibi iletildiği uç noktaya ulaşır. Fark, tüneli oluşturanın yaptığı işte ortaya çıkar. Geliş tünellerinde, oluşturucu uç noktadır ve eklenen tüm katmanların şifresini çözer. Gidiş tünellerinde oluşturucu ağ geçididir ve tüm katmanların şifresini önceden çözer. Her sıçrama için şifrelemenin tüm katmanları eklendikten sonra, ileti tünel uç noktasına net bir şekilde ulaşır.
