Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: As the address book application does not use privatehosts.txt at all, in practice this file is the only place where it is appropriate to place private aliases or "pet names" for sites already in hosts.txt.
pt: Como o aplicativo de catálogo de endereços não usa privatehosts.txt, na prática este arquivo é o único lugar onde é apropriado colocar aliases privados ou "nomes de estimação" para sites que já estejam em hosts.txt.
tr: Adres defteri uygulaması privatehosts.txt dosyasını hiç kullanmadığından, pratikte bu dosya, hosts.txt içinde zaten bulunan siteler için özel takma adlar veya "evcil adlar" eklemenin uygun olduğu tek yerdir.

source: Advanced Subscription Feed Format
pt: Formato de feed de assinatura avançado
tr: Gelişmiş Abonelik Akış Biçimi

source: Outgoing Subscriptions
pt: Assinaturas de saída
tr: Gidiş Abonelikleri

source: Address Book will publish the merged hosts.txt to a location (traditionally hosts.txt in the local I2P Site's home directory) to be accessed by others for their subscriptions. This step is optional and is disabled by default.
pt: O Catálogo de Endereços publicará o hosts.txt mesclado em um local (tradicionalmente hosts.txt no diretório inicial do site I2P local) para ser acessado por outros para suas assinaturas. Esta etapa é opcional e está desabilitada por padrão.
tr: Adres Defteri, birleştirilmiş hosts.txt dosyasını başkaları tarafından abone olunabilmesi için erişilebilecek bir konuma (geleneksel olarak yerel I2P sitesinin kök klasöründeki hosts.txt) yayınlar. Bu adım isteğe bağlıdır ve varsayılan olarak devre dışıdır.

source: The address book application, together with eepget, saves the Etag and/or Last-Modified information returned by the web server of the subscription. This greatly reduces the bandwidth required, as the web server will return a '304 Not Modified' on the next fetch if nothing has changed.
pt: O aplicativo de catálogo de endereços, juntamente com o eepget, salva as informações de Etag e/ou Última modificação retornadas pelo servidor web da assinatura. Isso reduz muito a largura de banda necessária, pois o servidor web retornará um '304 Não modificado' na próxima busca se nada tiver sido alterado.
tr: Adres defteri uygulaması, eepget ile birlikte, aboneliğin site sunucusu tarafından geri döndürülen Etag ve/veya son değişiklik bilgilerini kaydeder. Bu özellik, gereken bant genişliğini büyük ölçüde azaltır, çünkü hiçbir şey değişmediyse site sunucusu bir sonraki almada '304 değiştirilmedi' iletisi geri döndürür.

source: However the entire hosts.txt is downloaded if it has changed. See below for discussion on this issue.
pt: No entanto, todo o arquivo hosts.txt será baixado caso tenha sido alterado. Veja abaixo a discussão sobre esse problema.
tr: Ancak, değişiklik yapılmışsa tüm hosts.txt dosyası indirilir. Bu konuyla ilgili tartışma için aşağıya bakabilirsiniz.

source: Hosts serving a static hosts.txt or an equivalent CGI application are strongly encouraged to deliver a Content-Length header, and either an Etag or Last-Modified header. Also ensure that the server delivers a '304 Not Modified' when appropriate. This will dramatically reduce the network bandwidth, and reduce chances of corruption.
pt: Hosts que servem um hosts.txt estático ou um aplicativo CGI equivalente são fortemente encorajados a entregar um cabeçalho Content-Length e um cabeçalho Etag ou Last-Modified. Certifique-se também de que o servidor entregue um '304 Not Modified' quando apropriado. Isso reduzirá drasticamente a largura de banda da rede e reduzirá as chances de corrupção.
tr: Durağan bir hosts.txt veya eşdeğer bir CGI uygulaması sunan sunucuların, bir Content-Length üst bilgisi ve bir Etag veya Last-Modified üst bilgisi göndermesi önemle önerilir. Ayrıca sunucunun uygun durumda '304 değiştirilmedi' iletisi sunduğundan emin olun. Bu özellik, ağ bant genişliğini önemli ölçüde azaltır ve bozulma olasılığını düşürür.

source: Host Add Services
pt: Serviços de Adição de Anfitrião
tr: Sunucu Ekleme Hizmetleri

source: A host add service is a simple CGI application that takes a hostname and a Base64 key as parameters and adds that to its local hosts.txt. If other routers subscribe to that hosts.txt, the new hostname/key will be propagated through the network.
pt: Um serviço de adição de host é um aplicativo CGI simples que recebe um nome de host e uma chave Base64 como parâmetros e os adiciona ao seu hosts.txt local. Se outros roteadores assinarem esse hosts.txt, o novo nome de host/chave será propagado pela rede.
tr: Sunucu ekleme hizmeti, parametre olarak bir sunucu adı ve bir Base64 anahtarı alan ve bunu yerel hosts.txt dosyasına ekleyen basit bir CGI uygulamasıdır. Diğer yönelticiler bu hosts.txt dosyasına abone olursa, yeni sunucu adı ve anahtarları ağ üzerinde yayılır.

source: It is recommended that host add services impose, at a minimum, the restrictions imposed by the address book application listed above. Host add services may impose additional restrictions on hostnames and keys, for example:
pt: É recomendável que os serviços de adição de host imponham, no mínimo, as restrições impostas pelo aplicativo de catálogo de endereços listado acima. Os serviços de adição de host podem impor restrições adicionais em nomes de host e chaves, por exemplo:
tr: Sunucu ekleme hizmetlerinin en azından yukarıda listelenen adres defteri uygulamasının getirdiği kısıtlamaları getirmesi önerilir. Sunucu ekleme hizmetleri, sunucu adlarına ve anahtarlarına ek kısıtlamalar getirebilir, örneğin:

source: A limit on number of 'subdomains'.
pt: Um limite para o número de 'subdomínios'.
tr: 'Alt etki alanı' sayısı için bir sınır.

source: Authorization for 'subdomains' through various methods.
pt: Autorização para 'subdomínios' através de diversos metódos.
tr: Çeşitli yöntemlerle 'alt etki alanları' için yetkilendirme.

source: Hashcash or signed certificates.
pt: Hashcash ou certificados assinados.
tr: Hashcash veya imzalanmış sertifikalar.

source: Editorial review of host names and/or content.
pt: Revisão editorial de nomes de hosts e/ou conteúdo.
tr: Sunucu adlarının ve/veya içeriğin editörlerce incelenmesi.

source: Categorization of hosts by content.
pt: Categorização de anfitriões por conteúdo.
tr: Sunucuların içeriğe göre sınıflandırılması.

source: Reservation or rejection of certain host names.
pt: Reserva ou rejeição de determinados nomes de hosts.
tr: Belirli sunucu adının rezervasyonu veya reddi.

source: Restrictions on the number of names registered in a given time period.
pt: Restrições quanto ao número de nomes registrados em um dado período de tempo.
tr: Belirli bir zaman diliminde kaydedilen ad sayısıyla ilgili kısıtlamalar.

source: Delays between registration and publication.
pt: Intervalos entre o registro e a publicação.
tr: Kayıt ve yayın arasındaki gecikmeler.

source: Requirement that the host be up for verification.
pt: Exigência de que o host esteja disponível para verificação.
tr: Sunucunun doğrulama için hazır olması şartı.

source: Expiration and/or revocation.
pt: Expiração e/ou revogação.
tr: Sona erme ve/veya iptal etme.

source: IDN spoof rejection.
pt: Rejeição de falsificação de IDN.
tr: IDN sahtecilik reddi.

source: Jump Services
pt: Serviços de saltos
tr: Atlama Hizmetleri

source: A jump service is a simple CGI application that takes a hostname as a parameter and returns a 301 redirect to the proper URL with a <code>?i2paddresshelper=key</code> string appended. The HTTP proxy will interpret the appended string and use that key as the actual destination. In addition, the proxy will cache that key so the address helper is not necessary until restart.
pt: Um serviço de salto é um aplicativo CGI simples que recebe um nome de host como parâmetro e retorna um redirecionamento 301 para a URL adequada com uma string <code>?i2paddresshelper=key</code> anexada. O proxy HTTP interpretará a string anexada e usará essa chave como o destino real. Além disso, o proxy armazenará em cache essa chave para que o auxiliar de endereço não seja necessário até a reinicialização.
tr: Bir atlama hizmeti, parametre olarak bir sunucu adını alan ve <code>?i2paddresshelper=key</code> dizgesi eklenmiş olarak uygun adrese bir 301 yönlendirmesi döndüren basit bir CGI uygulamasıdır. HTTP vekil sunucusu, eklenen dizgeyi yorumlar ve bu anahtarı gerçek hedef olarak kullanır. Ek olarak, vekil sunucu bu anahtarı ön belleğe alır, böylece yeniden başlatılıncaya kadar adres yardımcısı gerekli olmaz.

source: Note that, like with subscriptions, using a jump service implies a certain amount of trust, as a jump service could maliciously redirect a user to an incorrect destination.
pt: Observe que, assim como acontece com as assinaturas, usar um serviço de salto implica um certo nível de confiança, pois um serviço de salto poderia maliciosamente redirecionar um usuário para um destino incorreto.
tr: Aboneliklerde olduğu gibi, atlama hizmeti kullanmanın belirli bir güven düzeyi anlamına geldiğini unutmayın. Çünkü atlama hizmeti bir kullanıcıyı kötü niyetli bir şekilde yanlış bir hedefe yönlendirebilir.

source: To provide the best service, a jump service should be subscribed to several hosts.txt providers so that its local host list is current.
pt: Para fornecer o melhor serviço, um serviço de salto deve ser assinado em vários provedores hosts.txt para que sua lista de hosts locais esteja atualizada.
tr: En iyi hizmeti sağlamak amacıyla, yerel sunucu listesinin güncel olması için bir atlama hizmetinin birkaç hosts.txt sağlayıcısına abone olması gerekir.

source: SusiDNS is simply a web interface front-end to configuring address book subscriptions and accessing the four address book files. All the real work is done by the 'address book' application.
pt: SusiDNS é simplesmente uma interface web front-end para configurar assinaturas do catálogo de endereços e acessar os quatro arquivos do catálogo de endereços. Todo o trabalho real é feito pelo aplicativo 'catálogo de endereços'.
tr: SusiDNS, adres defteri aboneliklerini yapılandırmak ve dört adres defteri dosyasına erişmeyi sağlayan basit bir internet arayüzüdür. Tüm gerçek işler 'adres defteri' uygulaması tarafından yapılır.

source: Currently, there is little enforcement of address book naming rules within SusiDNS, so a user may enter hostnames locally that would be rejected by the address book subscription rules.
pt: Atualmente, há pouca aplicação de regras de nomenclatura de catálogo de endereços no SusiDNS, então um usuário pode inserir nomes de host localmente que seriam rejeitados pelas regras de assinatura do catálogo de endereços.
tr: Şu anda, SusiDNS içinde adres defteri adlandırma kurallarını çok azı uygulanır. Bu nedenle bir kullanıcı, adres defteri abonelik kuralları tarafından reddedilen sunucu adlarını yerel olarak ekleyebilir.

source: Base32 Names
pt: Nomes de Base32
tr: Base32 Adları

source: I2P supports Base32 hostnames similar to Tor's .onion addresses. Base32 addresses are much shorter and easier to handle than the full 516-character Base64 Destinations or addresshelpers. Example: <code>ukeu3k5oycgaauneqgtnvselmt4yemvoilkln7jpvamvfx7dnkdq.b32.i2p</code>
pt: O I2P suporta nomes de host Base32 semelhantes aos endereços .onion do Tor. Os endereços Base32 são muito mais curtos e fáceis de manusear do que os Destinos Base64 completos de 516 caracteres ou addresshelpers. Exemplo: <code>ukeu3k5oycgaauneqgtnvselmt4yemvoilkln7jpvamvfx7dnkdq.b32.i2p</code>
tr: I2P, Tor ağındaki .onion adreslerine benzer Base32 sunucu adlarını destekler. Base32 adresleri, tam 516 karakterli Base64 hedefleri veya adres yardımcılarından çok daha kısadır ve kullanımı daha kolaydır. Örnek: 1ukeu3k5oycgaauneqgtnvselmt4yemvoilkln7jpvamvfx7dnkdq.b32.i2p1

source: In Tor, the address is 16 characters (80 bits), or half of the SHA-1 hash. I2P uses 52 characters (256 bits) to represent the full SHA-256 hash. The form is {52 chars}.b32.i2p. Tor has a <a href="https://blog.torproject.org/blog/tor-weekly-news-%E2%80%94-december-4th-2013">proposal</a> to convert to an identical format of {52 chars}.onion for their hidden services. Base32 is implemented in the naming service, which queries the router over I2CP to lookup the LeaseSet to get the full Destination. Base32 lookups will only be successful when the Destination is up and publishing a LeaseSet. Because resolution may require a network database lookup, it may take significantly longer than a local address book lookup.
pt: No Tor, o endereço tem 16 caracteres (80 bits), ou metade do hash SHA-1. O I2P usa 52 caracteres (256 bits) para representar o hash SHA-256 completo. O formato é {52 chars}.b32.i2p. O Tor tem uma <a href="https://blog.torproject.org/blog/tor-weekly-news-%E2%80%94-december-4th-2013">proposta</a> para converter para um formato idêntico de {52 chars}.onion para seus serviços ocultos. O Base32 é implementado no serviço de nomenclatura, que consulta o roteador pelo I2CP para procurar o LeaseSet e obter o Destino completo. As pesquisas em Base32 só serão bem-sucedidas quando o Destino estiver ativo e publicando um LeaseSet. Como a resolução pode exigir uma pesquisa no banco de dados de rede, ela pode levar significativamente mais tempo do que uma pesquisa no catálogo de endereços local.
tr: Tor ağında adres 16 karakterdir (80 bit) veya SHA-1 karma değerinin yarısıdır. I2P, tam SHA-256 karmasını temsil etmek için 52 karakter (256 bit) kullanır. Biçimi {52 chars}.b32.i2p şeklindedir. Tor gizli hizmetlerini aynı {52 chars}.onion biçimine dönüştürmek için bir <a href="https://blog.torproject.org/blog/tor-weekly-news-%E2%80%94-december-4th-2013">öneri</a> vardır. Base32, tam hedefi almak amacıyla "Kiralama kümesini" (LeaseSet) aramak için yönelticiyi I2CP üzerinden sorgulayan adlandırma hizmetinde uygulanır. Base32 aramaları, yalnızca hedef açık olduğunda ve bir "Kiralama kümesi" (LeaseSet) yayınlandığında başarılı olur. Çözüm, bir ağ veri tabanı araması gerektirebileceğinden, yerel adres defteri aramasından çok daha uzun sürebilir.

source: Base32 addresses can be used in most places where hostnames or full destinations are used, however there are some exceptions where they may fail if the name does not immediately resolve. I2PTunnel will fail, for example, if the name does not resolve to a destination.
pt: Endereços Base32 podem ser usados na maioria dos lugares onde nomes de host ou destinos completos são usados, no entanto, há algumas exceções onde eles podem falhar se o nome não for resolvido imediatamente. O I2PTunnel falhará, por exemplo, se o nome não for resolvido para um destino.
tr: Base32 adresleri, sunucu adlarının veya tam hedeflerin kullanıldığı çoğu yerde kullanılabilir. Ancak ad hemen çözümlenmezse bunların başarısız olabileceği bazı istisnalar vardır. Örneğin, ad bir hedefe çözümlenemezse I2PTunnel başarısız olur.

source: Plugins
tr: Uygulama Ekleri

source: June 2012
pt: Junho de 2012
tr: 2012 Haziran

source: General Information
tr: Genel Bilgiler

source: I2P includes a plugin architecture to support easy development and installation of additional software.
pt: O I2P inclui uma arquitetura de plugin para dar suporte ao desenvolvimento e instalação fáceis de software adicional.
tr: I2P, ek yazılımların kolay geliştirilmesini ve kurulmasını sağlamak için bir uygulama eki mimarisi içerir.

source: There are now plugins available that support distributed email, blogs, IRC clients, distributed file storage, wikis, and more.
pt: Agora há plugins disponíveis que oferecem suporte a e-mail distribuído, blogs, clientes IRC , armazenamento de arquivos distribuído, wikis e muito mais.
tr: Şu anda dağıtılmış e-postaları, blogları, IRC istemcilerini, dağıtılmış dosya depolamayı, wiki sayfalarını ve başka pek çok özelliği sağlayan uygulama ekleri var.

source: Easy Installation of Applications
pt: Fácil instalação de aplicativos
tr: Uygulamaların kolay kurulması

source: I2P Plugins can be installed by copying the plugin download URL onto the appropriate section on the <a href="http://127.0.0.1:7657/configplugins">Router Console Plugin Configuration Page</a>.
pt: Os plugins I2P podem ser instalados copiando o URL de download do plugin para a seção apropriada na <a href="http://127.0.0.1:7657/configplugins">Página de configuração do plugin do console do roteador</a>.
tr: I2P uygulama ekleri, uygulama eki indirme adresini <a href="http://127.0.0.1:7657/configplugins">Yöneltici panosu uygulama eki yapılandırma sayfası</a> üzerindeki uygun bölüme kopyalayarak kurulabilir.

source: Start by copying the plugin URL from the page where it is published.
pt: Comece copiando a URL do plugin da página onde ele está publicado.
tr: Yayınlandığı sayfadan uygulama eki adresini kopyalayarak başlayın.

source: Then visit the plugin configuration page, which you can find linked on the console homepage.
pt: Em seguida, visite a página de configuração do plugin, cujo link está na página inicial do console.
tr: Ardından, pano ana sayfasında bağlantısını bulabileceğiniz uygulama eki yapılandırma sayfasını açın.

source: Paste in the URL and click the "Install Plugin" button.
pt: Cole a URL e clique no botão "Instalar Plugin".
tr: Adresi adres alanına yapıştırıp "Uygulama ekini kur" üzerine tıklayın.

source: Benefits to i2p users and app developers:
pt: Benefícios para os usuários da I2P e desenvolvedores de aplicações:
tr: i2p kullanıcılarına ve uygulama geliştiricilerine faydaları:

source: Easy distribution of applications
pt: Fácil distribuição de aplicativos
tr: Uygulamaların kolay dağıtılması

source: Allows innovation and use of additional libraries without worrying about increasing the size of <code>i2pupdate.sud</code>
pt: Permite inovação e uso de bibliotecas adicionais sem se preocupar em aumentar o tamanho de <code>i2pupdate.sud</code>
tr: <code>i2pupdate.sud</code> boyutunu büyütme endişesi olmadan yeniliğe ve ek kitaplıkların kullanılmasına izin verir

source: Support large or special-purpose applications that would never be bundled with the I2P installation
pt: Suporta aplicações grandes ou de propósito especial que nunca seriam agrupadas com a instalação do I2P
tr: Asla I2P kurulum paketine eklenmeyecek büyük veya özel amaçlı uygulamaları destekler

source: Cryptographically signed and verified applications
pt: Aplicativos verificados e assinados com criptografia
tr: Uygulamaların şifrelenmiş olarak imzalanmasını ve doğrulanmasını sağlar

source: Automatic updates of applications, just like for the router
pt: Atualizações automática de aplicações, tal como para o roteador
tr: Yöneltici için olduğu gibi uygulamaların otomatik güncellenmesini sağlar

source: Separate initial install and update packages, if desired, for smaller update downloads
pt: Pacotes de instalação e atualização iniciais separados, se desejado, para downloads de atualização menores
tr: Daha küçük güncellemeler için istenirse ilk kurulum ve güncelleme paketleri ayrılabilir

source: One-click installation of applications. No more asking users to modify <code>wrapper.config</code> or <code>clients.config</code>
pt: Instalação de aplicativos com um clique. Não é mais necessário pedir aos usuários para modificar <code>wrapper.config</code> ou <code>clients.config</code>
tr: Uygulamalar tek tıkla kurulabilir. Artık kullanıcılardan <code>wrapper.config</code> veya <code>clients.config</code> dosyalarını değiştirmeleri istenmez

source: Isolate applications from the base <code>$I2P</code> installation
pt: Isolar aplicativos da instalação base <code>$I2P</code>
tr: Uygulamalar temel <code>$I2P</code> kurulumundan ayrılabilir

source: Automatic compatibility checking for I2P version, Java version, Jetty version, and previous installed application version
pt: Verificação automática de compatibilidade para versão I2P, versão Java, versão Jetty e versão anterior do aplicativo instalado
tr: I2P sürümü, Java sürümü, Jetty sürümü ve önceden kurulmuş uygulama sürümleri için otomatik uyumluluk denetimi

source: Automatic link addition in console
pt: Adição automática de link no console
tr: Panoya otomatik bağlantı ekleme

source: Automatic startup of application, including modifying classpath, without requiring a restart
pt: Inicialização automática do aplicativo, incluindo modificação do classpath, sem necessidade de reinicialização
tr: Yeniden başlatma gerektirmeden sınıf yolunun değiştirilmesi ile birlikte uygulamanın otomatik olarak başlatılması

source: Automatic integration and startup of webapps into console Jetty instance
pt: Integração automática e inicialização de webapps na instância do console Jetty
tr: İnternet uygulamalarının pano Jetty kopyasıyla otomatik bütünleştirilmesi ve başlatılması

source: Facilitate creation of 'app stores' like the one at <a href="http://%(pluginsite)s">%(pluginsite)s</a>
pt: Facilitar a criação de 'lojas de aplicativos' como a de <a href="http://%(pluginsite)s">%(pluginsite)s</a>
tr: <a href="http://%(pluginsite)s">%(pluginsite)s</a> adresindeki gibi 'uygulama mağazalarının' oluşturulabilmesi

source: One-click uninstall
pt: Desinstalação em um clique.
tr: Tek tıkla kaldırma

source: Language and theme packs for the console
pt: Pacotes de temas e idiomas para o painel
tr: Pano için dil ve tema paketleri

source: Bring detailed application information to the router console
pt: Traga informações detalhadas do aplicativo para o console do roteador
tr: Ayrıntılı uygulama bilgilerinin yöneltici panosunda görüntülenmesi

source: Non-java applications also supported
pt: Aplicativos não-java também suportados
tr: Java olmayan uygulamalar da desteklenir

source: Required I2P version
pt: Versão do roteador I2P necessária
tr: Gerekli I2P sürümü

source: 0.7.12 or newer.
pt: 0.7.12 ou mais recente.
tr: 0.7.12 ya da üzeri.

source: Updating a Plugin
pt: Atualizando um plugin
tr: Bir uygulama ekini güncellemek

source: To update a plugin to the latest version, just click the update button on <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp</a>. There is also a button to check if the plugin has a more recent version, as well as a button to check for updates for all plugins. Plugins will be checked for updates automatically when updating to a new I2P release (not including dev builds).
pt: Para atualizar um plugin para a versão mais recente, basta clicar no botão de atualização em <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp</a>. Há também um botão para verificar se o plugin tem uma versão mais recente, assim como um botão para verificar atualizações para todos os plugins. Os plugins serão verificados para atualizações automaticamente ao atualizar para uma nova versão I2P (não incluindo dev builds).
tr: Bir uygulama ekini son sürüme güncellemek için <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp</a> bölümündeki güncelle düğmesine tıklamanız yeterlidir. Uygulama ekinin daha yeni bir sürümü olup olmadığını denetlemek için bir düğme ve tüm uygulama eklerinin güncellemelerini denetlemek için başka bir düğme vardır. Uygulama ekleri, yeni bir I2P sürümüne güncellenirken (geliştirme yapımları katılmaz) güncellemeler otomatik olarak denetlenir.

source: Development
pt: Desenvolvimento
tr: Geliştirme

source: See the latest <a href="%(pluginspec)s">plugin specification</a> and the <a href="http://%(zzz)s/forums/16">plugin forum</a> on %(zzz)s.
pt: Veja a especificação mais recente do plugin <a href="%(pluginspec)s"></a> e o fórum do plugin <a href="http://%(zzz)s/forums/16"></a> em %(zzz)s.
tr: %(zzz)s adresindeki en son <a href="%(pluginspec)s">uygulama eki teknik özellikleri</a> ve <a href="http://%(zzz)s/forums/16">uygulama eki forumu</a> bölümlerine bakabilirsiniz.
