Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: From an anonymity perspective, there is much similarity when the core networks are compared. However, there are a few key differences. When dealing with an internal adversary or most external adversaries, I2P's simplex tunnels expose half as much traffic data than would be exposed with Tor's duplex circuits by simply looking at the flows themselves - an HTTP request and response would follow the same path in Tor, while in I2P the packets making up the request would go out through one or more outbound tunnels and the packets making up the response would come back through one or more different inbound tunnels. While I2P's peer selection and ordering strategies should sufficiently address predecessor attacks, should a switch to bidirectional tunnels be necessary, we could simply build an inbound and outbound tunnel along the same routers.
pt: De uma perspectiva de anonimato, há muita similaridade quando as redes principais são comparadas. No entanto, há algumas diferenças importantes. Ao lidar com um adversário interno ou a maioria dos adversários externos, os túneis simplex do I2P expõem metade dos dados de tráfego que seriam expostos com os circuitos duplex do Tor simplesmente observando os próprios fluxos - uma solicitação e resposta HTTP seguiriam o mesmo caminho no Tor, enquanto no I2P os pacotes que compõem a solicitação sairiam por um ou mais túneis de saída e os pacotes que compõem a resposta retornariam por um ou mais túneis de entrada diferentes. Embora as estratégias de seleção e ordenação de pares do I2P devam abordar suficientemente ataques predecessores, caso seja necessária uma mudança para túneis bidirecionais, poderíamos simplesmente construir um túnel de entrada e saída ao longo dos mesmos roteadores.
tr: Anonimlik açısından bakıldığında, çekirdek ağlar karşılaştırıldığında çok fazla benzerlik görülebilir. Ancak, birkaç önemli farklılık da vardır. Ağ içindeki bir saldırganla ya da çok sayıdaki dış saldırganla uğraşırken, Tek yönlü I2P tünelleri, yalnızca akışların kendilerine bakarak, çift yönlü Tor devrelerinin taşıyacağının yarısı kadar trafik verisi açığa çıkarır. Bir HTTP isteği ve yanıtı Tor ağında aynı yolu izlerken, I2P ağında isteği oluşturan paketler bir ya da daha fazla çıkış tünelinden dışarı çıkar ve yanıtı oluşturan paketler bir ya da daha fazla farklı geliş tünelinden geri gelir. I2P eş seçimi ve sıralama stratejileri önceki saldırıları yeterince ele alırken, çift yönlü tünellere geçiş gerekliyse, aynı yönelticiler boyunca basitçe bir geliş ve gidiş tüneli oluşturabiliriz.

source: Another anonymity issue comes up in Tor's use of telescopic tunnel creation, as simple packet counting and timing measurements as the cells in a circuit pass through an adversary's node exposes statistical information regarding where the adversary is within the circuit. I2P's unidirectional tunnel creation with a single message so that this data is not exposed. Protecting the position in a tunnel is important, as an adversary would otherwise be able to mount a series of powerful predecessor, intersection, and traffic confirmation attacks.
pt: Outro problema de anonimato surge no uso da criação de túneis telescópicos pelo Tor, como simples contagem de pacotes e medições de tempo, já que as células em um circuito passam pelo nó de um adversário expõem informações estatísticas sobre onde o adversário está dentro do circuito. A criação de túneis unidirecionais do I2P com uma única mensagem para que esses dados não sejam expostos. Proteger a posição em um túnel é importante, pois um adversário seria capaz de montar uma série de poderosos ataques de predecessor, interseção e confirmação de tráfego.
tr: Tor üzerinde teleskopik tünel oluşturma kullanımında başka bir anonimlik sorunu ortaya çıkıyor. Bir devredeki hücreler bir saldırganın düğümünden geçerken basit paket sayımı ve zamanlama ölçümleri, düşmanın devre içinde nerede olduğuna ilişkin istatistiksel bilgileri ortaya çıkarıyor. Bu verilerin açığa çıkmaması için I2P tek bir ileti ile tek yönlü tünel oluşturuyor. Bir saldırgan bir dizi güçlü öncül, kavşak ve trafik doğrulama saldırısı gerçekleştirebileceğinden, bir tünelin konumunun korunması önemlidir.

source: Tor's support for a second tier of "onion proxies" does offer a non-trivial degree of anonymity while requiring a low cost of entry, while I2P will not offer this topology until <a href="#future.restricted">2.0</a>.
pt: O suporte do Tor para uma segunda camada de "proxies onion" oferece um grau não trivial de anonimato de , ao mesmo tempo em que exige um baixo custo de entrada, enquanto o I2P não oferecerá essa topologia até <a href="#future.restricted">2.0</a>.
tr: Tor tasrafından sağlanan ikinci bir "onion vekil sunucuları" katmanı, düşük bir başlangıç maliyeti ile önemsiz olmayan bir düzeyde anonimlik sunarken, I2P bu topolojiyi 2.0 sürümüne kadar sunmayacak.

source: On the whole, Tor and I2P complement each other in their focus - Tor works towards offering high speed anonymous Internet outproxying, while I2P works towards offering a decentralized resilient network in itself. In theory, both can be used to achieve both purposes, but given limited development resources, they both have their strengths and weaknesses. The I2P developers have considered the steps necessary to modify Tor to take advantage of I2P's design, but concerns of Tor's viability under resource scarcity suggest that I2P's packet switching architecture will be able to exploit scarce resources more effectively.
pt: No geral, Tor e I2P se complementam em seu foco - Tor trabalha para oferecer outproxying anônimo de Internet de alta velocidade, enquanto I2P trabalha para oferecer uma rede resiliente descentralizada em si. Em teoria, ambos podem ser usados para atingir ambos os propósitos, mas dados os recursos limitados de desenvolvimento, ambos têm seus pontos fortes e fracos. Os desenvolvedores do I2P consideraram as etapas necessárias para modificar o Tor para aproveitar o design do I2P, mas preocupações da viabilidade do Tor sob escassez de recursos sugerem que a arquitetura de comutação de pacotes do I2P será capaz de explorar recursos escassos de forma mais eficaz.
tr: Genel olarak, Tor ve I2P odak noktalarında birbirlerini tamamlar. Tor, yüksek hızlı anonim İnternet çıkış vekil sunucusu sağlamaya çalışırken, I2P kendi içinde merkezi olmayan esnek bir ağ sağlamaya çalışır. Teoride, ikisi de her iki amaca da ulaşmak için kullanılabilir. Ancak sınırlı geliştirme kaynakları göz önüne alındığında, her ikisinin de güçlü ve zayıf yönleri vardır. I2P geliştiricileri, Tor uygulamasını I2P ağının tasarımından yaralanacak şekilde değiştirmek için gerekli adımları düşündüler. Ancak Tor uygulamasının kıt kaynaklar altında yaşayabilirliği konusundaki endişeler, I2P paket anahtarlama mimarisinin kıt kaynakları daha etkili bir şekilde kullanabileceğini gösteriyor.

source: Freenet played a large part in the initial stages of I2P's design - giving proof to the viability of a vibrant pseudonymous community completely contained within the network, demonstrating that the dangers inherent in outproxies could be avoided. The first seed of I2P began as a replacement communication layer for Freenet, attempting to factor out the complexities of a scalable, anonymous and secure point to point communication from the complexities of a censorship resistant distributed data store. Over time however, some of the anonymity and scalability issues inherent in Freenet's algorithms made it clear that I2P's focus should stay strictly on providing a generic anonymous communication layer, rather than as a component of Freenet. Over the years, the Freenet developers have come to see the weaknesses in the older design, prompting them to suggest that they will require a "premix" layer to offer substantial anonymity. In other words, Freenet needs to run on top of a mixnet such as I2P or Tor, with "client nodes" requesting and publishing data through the mixnet to the "server nodes" which then fetch and store the data according to Freenet's heuristic distributed data storage algorithms.
pt: A Freenet desempenhou um papel importante nos estágios iniciais do design do I2P - dando provas da viabilidade de uma vibrante comunidade pseudônima completamente contida dentro da rede, demonstrando que os perigos inerentes a outproxies poderiam ser evitados. A primeira semente do I2P começou como uma camada de comunicação de substituição para a Freenet, tentando fatorar as complexidades de uma comunicação ponto a ponto escalável, anônima e segura das complexidades de um armazenamento de dados distribuído resistente à censura. Com o tempo, no entanto, alguns dos problemas de anonimato e escalabilidade inerentes aos algoritmos da Freenet deixaram claro que o foco do I2P deveria permanecer estritamente em fornecer uma camada de comunicação genérica anônima, em vez de um componente da Freenet. Com o passar dos anos, os desenvolvedores da Freenet passaram a ver as fraquezas no design antigo, o que os levou a sugerir que eles exigiriam uma camada "pré-mistura" para oferecer anonimato substancial. Em outras palavras, a Freenet precisa ser executada sobre uma mixnet como I2P ou Tor, com "nós clientes" solicitando e publicando dados através da mixnet para os "nós servidores" que então buscam e armazenam os dados de acordo com os algoritmos heurísticos de armazenamento de dados distribuídos da Freenet.
tr: Freenet, I2P tasarımının ilk aşamalarında büyük bir rol oynadı. Tamamen ağ içinde yer alan canlı bir takma adlı topluluğun yaşayabilirliğini kanıtlayarak, çıkış vekil sunucularının doğasında bulunan tehlikelerden kaçınılabileceğini gösterdi. İlk I2P tohumu, ölçeklenebilir, anonim ve güvenli bir noktadan noktaya iletişimin karmaşıklıklarını sansüre dayanıklı dağıtılmış bir veri deposunun karmaşıklıklarından ayırmaya çalışan Freenet için bir yedek iletişim katmanı olarak başladı. Ancak zamanla, Freenet algoritmalarının doğasında bulunan bazı anonimlik ve ölçeklenebilirlik sorunları, I2P odak noktasının, bir Freenet bileşeni olmak yerine kesinlikle genel bir anonim iletişim katmanı sağlamak olması gerektiğini açıkça ortaya koydu. Yıllar geçtikçe, Freenet geliştiricileri eski tasarımdaki zayıflıkları görmeye başladı ve önemli bir anonimlik sunmak için bir "ön karışım" katmanına gerek duyacaklarını önermeye yöneldi. Başka bir deyişle, Freenet I2P veya Tor gibi bir karma ağ üzerinde çalışmalıdır. "İstemci düğümleri", karma ağ üzerinde "sunucu düğümleri" üzerine veri alma istekleri gönderir ve verileri yayınlar. Ardından verileri buluşsal dağıtılmış Freenet depolama algoritmalarına göre alır ve depolar.

source: Freenet's functionality is very complementary to I2P's, as Freenet natively provides many of the tools for operating medium and high latency systems, while I2P natively provides the low latency mix network suitable for offering adequate anonymity. The logic of separating the mixnet from the censorship- resistant distributed data store still seems self-evident from an engineering, anonymity, security, and resource allocation perspective, so hopefully the Freenet team will pursue efforts in that direction, if not simply reusing (or helping to improve, as necessary) existing mixnets like I2P or Tor.
pt: A funcionalidade que a Freenet oferece é bastante complementar a fornecida pela I2P. Enquanto a Freenet fornece nativamente muitas das ferramentas para operacionalizar sistemas de alta e média latências, a I2P fornece nativamente uma rede mix de baixa latência apropriada para oferecer um anonimato adequado. A lógica de separar a rede mix do sistema de armazenamento distribuído e resiliente a censura parece ainda ser auto-evidente do ponto de vista de engenharia, anonimato, segurança e alocação de recursos, de modo que se espera que a equipe da Freenet prosseguirá com esforços nessa direção, se não simplesmente reusando (ou ajudando a melhorar, na medida do necessário) as redes mix existentes como I2P ou Tor.
tr: Freenet işlevselliği I2P işlevlerini tamamlar. Çünkü Freenet yerel olarak orta ve yüksek gecikmeli sistemleri çalıştırmak için birçok araç sunarken, I2P yerel olarak yeterli anonimlik sunmaya uygun düşük gecikmeli karma ağı sağlar. Karma ağı sansüre dayanıklı dağıtılmış veri deposundan ayırma mantığı mühendislik, anonimlik, güvenlik ve kaynak ayırma açısından hala açık görünüyor. Bu yüzden umarım Freenet ekibi, I2P veya Tor gibi var olan karma ağları yalnızca yeniden kullanmak (veya gerektiğinde iyileştirilmesine yardımcı olmak) yerine bu yönde çaba harcar.

source: It is worth mentioning that there has recently been discussion and work by the Freenet developers on a "globally scalable darknet" using restricted routes between peers of various trust. While insufficient information has been made publicly available regarding how such a system would operate for a full review, from what has been said the anonymity and scalability claims seem highly dubious. In particular, the appropriateness for use in hostile regimes against state level adversaries has been tremendously overstated, and any analysis on the implications of resource scarcity upon the scalability of the network has seemingly been avoided. Further questions regarding susceptibility to traffic analysis, trust and other topics do exist, but a more in-depth review of this "globally scalable darknet" will have to wait until the Freenet team makes more information available.
pt: Vale mencionar que recentemente houve discussão e trabalho pelos desenvolvedores da Freenet em uma "darknet globalmente escalável" usando rotas restritas entre pares de várias confianças. Embora informações insuficientes tenham sido disponibilizadas publicamente sobre como tal sistema operaria para uma revisão completa, pelo que foi dito, as alegações de anonimato e escalabilidade parecem altamente duvidosas. Em particular, a adequação para uso em regimes hostis contra adversários de nível estadual foi tremendamente exagerada, e qualquer análise sobre as implicações da escassez de recursos na escalabilidade da rede foi aparentemente evitada. Existem mais questões sobre a suscetibilidade à análise de tráfego, confiança e outros tópicos, mas uma análise mais aprofundada desta "darknet globalmente escalável" terá que esperar até que a equipe da Freenet disponibilize mais informações.
tr: Son zamanlarda Freenet geliştiricileri tarafından farklı güven düzeyindeki eşler arasında kısıtlı yollar kullanan "küresel olarak ölçeklenebilir bir karanlık ağ" üzerine tartışıldığını ve çalıştığını belirtmekte fayda var. Böyle bir sistemin tam bir inceleme için nasıl çalışacağı konusunda kamuya yeterli bilgi verilmemiş olsa da, söylenenlere göre anonimlik ve ölçeklenebilirlik iddiaları oldukça şüpheli görünüyor. Özellikle, devlet düzeyindeki hasımlara karşı katı rejimlerde kullanım uygunluğu aşırı derecede abartılmıştır ve görünüşe göre kaynak kıtlığının ağın ölçeklenebilirliği üzerindeki etkilerine ilişkin herhangi bir analizden kaçınılmıştır. Trafik analizine duyarlılık, güven ve diğer konularla ilgili başka sorular da var. Ancak bu "küresel olarak ölçeklenebilir karanlık ağ" hakkında daha derin bir inceleme, Freenet ekibi daha fazla bilgi sağlayana kadar beklemek zorunda kalacak.

source: I2P itself doesn't really do much - it simply sends messages to remote destinations and receives messages targeting local destinations - most of the interesting work goes on at the layers above it. By itself, I2P could be seen as an anonymous and secure IP layer, and the bundled <a href="#app.streaming">streaming library</a> as an implementation of an anonymous and secure TCP layer on top of it. Beyond that, <a href="#app.i2ptunnel">I2PTunnel</a> exposes a generic TCP proxying system for either getting into or out of the I2P network, plus a variety of network applications provide further functionality for end users.
pt: O I2P em si não faz muita coisa - ele simplesmente envia mensagens para destinos remotos e recebe mensagens direcionadas a destinos locais - a maior parte do trabalho interessante acontece nas camadas acima dele. Por si só, o I2P pode ser visto como uma camada IP anônima e segura, e a biblioteca de streaming <a href="#app.streaming"></a> empacotada como uma implementação de uma camada TCP anônima e segura sobre ela. Além disso, <a href="#app.i2ptunnel">I2PTunnel</a> expõe um sistema genérico de proxy TCP para entrar ou sair da rede I2P, além de uma variedade de aplicativos de rede que fornecem mais funcionalidade para usuários finais.
tr: Aslında I2P pek bir şey yapmaz. Yalnızca uzak hedeflere iletiler gönderir ve yerel hedeflere yönelik iletileri alır. İlginç çalışmaların çoğu, I2P üzerrindeki katmanlarda olur. I2P kendi başına anonim ve güvenli bir IP katmanı olarak, <a href="#app.streaming">streaming kitaplığı</a> ile bunun üzerinde anonim ve güvenli bir TCP katmanının bir uygulaması olarak görülebilir. Bunun ötesinde, <a href="#app.i2ptunnel">I2PTunnel</a>, I2P ağına girmek veya çıkmak için genel bir TCP vekil sunucu sistemi sunar. Ayrıca çeşitli ağ uygulamaları son kullanıcılar için daha fazla işlevsellik sağlar.

source: Streaming library
pt: Biblioteca de transmissão
tr: Streaming kitaplığı

source: The I2P streaming library can be viewed as a generic streaming interface (mirroring TCP sockets), and the implementation supports a <a href="http://en.wikipedia.org/wiki/Sliding_Window_Protocol">sliding window protocol</a> with several optimizations, to take into account the high delay over I2P. Individual streams may adjust the maximum packet size and other options, though the default of 4KB compressed seems a reasonable tradeoff between the bandwidth costs of retransmitting lost messages and the latency of multiple messages.
pt: A biblioteca de streaming I2P pode ser vista como uma interface de streaming genérica (espelhando soquetes TCP), e a implementação suporta um <a href="http://en.wikipedia.org/wiki/Sliding_Window_Protocol">protocolo de janela deslizante</a> com várias otimizações, para levar em conta o alto atraso sobre I2P. Os fluxos individuais podem ajustar o tamanho máximo do pacote e outras opções, embora o padrão de 4 KB compactados pareça uma troca razoável entre os custos de largura de banda da retransmissão de mensagens perdidas e a latência de múltiplas mensagens.
tr: I2P Streaming kitaplığı, genel bir akış arabirimi (TCP soketlerini yansıtma) olarak görülebilir ve uygulama, I2P üzerindeki yüksek gecikmeyi hesaba katmak için çeşitli iyileştirmelerle <a href="http://en.wikipedia.org/wiki/Sliding_Window_Protocol">kayan aralık iletişim kuralını</a> destekler. Akışlar bireysel olarak en fazla paket boyutunu ve diğer seçenekleri ayarlayabilir. Ancak varsayılan olarak sıkıştırılmış 4KB, kayıp iletilerin yeniden iletilmesinin bant genişliği maliyetleri ile çoklu iletilerin gecikmesi arasında makul bir denge kuruyor gibi görünmektedir.

source: In addition, in consideration of the relatively high cost of subsequent messages, the streaming library's protocol for scheduling and delivering messages has been optimized to allow individual messages passed to contain as much information as is available. For instance, a small HTTP transaction proxied through the streaming library can be completed in a single round trip - the first message bundles a SYN, FIN and the small payload (an HTTP request typically fits) and the reply bundles the SYN, FIN, ACK and the small payload (many HTTP responses fit). While an additional ACK must be transmitted to tell the HTTP server that the SYN/FIN/ACK has been received, the local HTTP proxy can deliver the full response to the browser immediately.
pt: Além disso, em consideração ao custo relativamente alto das mensagens subsequentes, o protocolo da biblioteca de streaming para agendamento e entrega de mensagens foi otimizado para permitir que mensagens individuais passadas contenham o máximo de informações disponíveis. Por exemplo, uma pequena transação HTTP com proxy por meio da biblioteca de streaming pode ser concluída em uma única viagem de ida e volta - a primeira mensagem agrupa um SYN, FIN e a pequena carga útil (uma solicitação HTTP normalmente se encaixa) e a resposta agrupa o SYN, FIN, ACK e a pequena carga útil (muitas respostas HTTP se encaixam). Embora um ACK adicional deva ser transmitido para informar ao servidor HTTP que o SYN/FIN/ACK foi recebido, o proxy HTTP local pode entregar a resposta completa ao navegador imediatamente.
tr: Ek olarak, sonraki iletilerin nispeten yüksek maliyeti göz önüne alındığında, Streaming kitaplığının iletileri programlama ve teslim etme iletişim kuralı, iletilen bireysel iletilerin var olduğu kadar çok bilgi içermesine izin verecek şekilde iyileştirilmiştir. Örneğin, Streaming kitaplığı aracılığıyla vekil sunucu üzerinden geçilrilen küçük bir HTTP işlemi tek bir gidiş-dönüşte tamamlanabilir. İlk ileti bir SYN, FIN iletileri ile küçük yükü (genellikle bir HTTP isteğine uyar) paketler ve yanıt SYN, FIN, ACK iletileri ile küçük yükü paketler (birçok HTTP yanıtı uygundur). HTTP sunucusuna SYN/FIN/ACK iletilerinin alındığını söylemek için ek bir ACK iletilmesi gerekirken, yerel HTTP vekil sunucusu tarayıcıya tam yanıtı hemen teslim edebilir.

source: On the whole, however, the streaming library bears much resemblance to an abstraction of TCP, with its sliding windows, congestion control algorithms (both slow start and congestion avoidance), and general packet behavior (ACK, SYN, FIN, RST, etc).
pt: No geral, no entanto, a biblioteca de streaming tem muita semelhança com uma abstração do TCP, com suas janelas deslizantes, algoritmos de controle de congestionamento (início lento e prevenção de congestionamento) e comportamento geral dos pacotes (ACK, SYN, FIN, RST, etc.).
tr: Bununla birlikte, genel olarak, Streaming kitaplığı, kayan aralıklar, tıkanıklık kontrol algoritmaları (hem yavaş başlatma hem de tıkanıklıktan kaçınma) ve genel paket davranışı (ACK, SYN, FIN, RST, vb.) ile bir TCP soyutlamasına benzer.

source: Naming library and address book
pt: Nomeando biblioteca e livro de endereços
tr: Adlandırma kitaplığı ve adres defteri

source: For more information see the <a href="%(naming)s">Naming and Address Book</a> page.
pt: Para mais informações, consulte a página <a href="%(naming)s">Catálogo de nomes e endereços</a> .
tr: Ayrıntılı bilgi almak için <a href="%(naming)s">Adlandırma ve adres defteri</a> bölümüne bakabilirsiniz.

source: Developed by: %(dev)s
pt: Desenvolvido por: %(dev)s
tr: Geliştiren: %(dev)s
