Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: A ping packet must have the ECHO, SIGNATURE_INCLUDED, and FROM_INCLUDED flags set. The sendStreamId must be greater than zero, and the receiveStreamId is ignored. The sendStreamId may or may not correspond to an existing connection.
pt: Um pacote ping deve ter os sinalizadores ECHO, SIGNATURE_INCLUDED e FROM_INCLUDED definidos. O sendStreamId deve ser maior que zero, e o receiveStreamId é ignorado. O sendStreamId pode ou não corresponder a uma conexão existente.
tr: Bir ping paketinin ECHO, SIGNATURE_INCLUDED ve FROM_INCLUDED işaretleri ayarlanmış olmalıdır. sendStreamId sıfırdan büyük olmalıdır ve alıcıStreamId yok sayılır. sendStreamId, var olan bir bağlantıya karşılık gelebilir veya gelmeyebilir.

source: A pong packet must have the ECHO flag set. The sendStreamId must be zero, and the receiveStreamId is the sendStreamId from the ping. Prior to release 0.9.18, the pong packet does not include any payload that was contained in the ping.
pt: Um pacote pong deve ter o sinalizador ECHO definido. O sendStreamId deve ser zero, e o receiveStreamId é o sendStreamId do ping. Antes da versão 0.9.18, o pacote pong não incluía nenhuma carga útil contida no ping.
tr: Bir pong paketinin ECHO işlaretinin ayarlanmış olması gerekir. sendStreamId sıfır olmalıdır ve alıcıStreamId, ping ile gelen sendStreamId olur. 0.9.18 sürümünden önce, pong paketinde, ping içinde bulunan herhangi bir yük bulunmaz.

source: As of release 0.9.18, pings and pongs may contain a payload. The payload in the ping, up to a maximum of 32 bytes, is returned in the pong.
pt: A partir da versão 0.9.18, pings e pongs podem conter uma carga útil. A carga útil no ping, até um máximo de 32 bytes, é retornada no pong.
tr: 0.9.18 sürümünden başlayarak, ping ve pong içinde bir yük içerebilir. Ping içindeki en fazla 32 bayta kadar olan yük, pong içinde döndürülür.

source: Streaming may be configured to disable sending pongs with the configuration i2p.streaming.answerPings=false.
pt: O streaming pode ser configurado para desabilitar o envio de pongs com a configuração i2p.streaming.answerPings=false.
tr: Streaming üzerinde, i2p.streaming.answerPings=false yapılandırmasıyla pong gönderme devre dışı bırakılabilir.

source: Control Block Sharing
pt: Compartilhamento de bloco de controle
tr: Denetim Bloğunu Paylaşma

source: The streaming lib supports "TCP" Control Block sharing. This shares three important streaming lib parameters (window size, round trip time, round trip time variance) across connections to the same remote peer. This is used for "temporal" sharing at connection open/close time, not "ensemble" sharing during a connection (See <a href="http://www.ietf.org/rfc/rfc2140.txt">RFC 2140</a>). There is a separate share per ConnectionManager (i.e. per local Destination) so that there is no information leakage to other Destinations on the same router. The share data for a given peer expires after a few minutes. The following Control Block Sharing parameters can be set per router:
pt: A biblioteca de streaming suporta compartilhamento de bloco de controle "TCP". Isso compartilha três parâmetros importantes da biblioteca de streaming (tamanho da janela, tempo de ida e volta, variação do tempo de ida e volta) entre conexões com o mesmo peer remoto. Isso é usado para compartilhamento "temporal" no momento de abertura/fechamento da conexão, não para compartilhamento de "conjunto" durante uma conexão (consulte <a href="http://www.ietf.org/rfc/rfc2140.txt">RFC 2140</a>). Há um compartilhamento separado por ConnectionManager (ou seja, por destino local) para que não haja vazamento de informações para outros destinos no mesmo roteador. Os dados compartilhados para um determinado peer expiram após alguns minutos. Os seguintes parâmetros de Compartilhamento de Bloco de Controle podem ser definidos por roteador:
tr: Streaming kitaplığı, "TCP" Kontrol Bloğu paylaşımını destekler. Bu paylaşımda, aynı uzak eşe bağlantılar arasında üç önemli Streaming kitaplığı parametresi (pencere boyutu, gidiş dönüş süresi, gidiş dönüş süresi farkı) bulunur. Bu paylaşım, bağlantı sırasında "toplu" paylaşım için değil, bağlantı açma/kapama zamanında "geçici" paylaşım için kullanılır (Bkz. 1RFC 21401). Aynı yöneltici üzerindeki diğer hedeflere bilgi sızıntısı olmaması için ConnectionManager başına (yani yerel hedef başına) ayrı bir paylaşım bulunur. Belirli bir eş için paylaşım verilerinin süresi birkaç dakika sonra sona erer. Her yöneltici için aşağıdaki kontrol bloğu paylaşımı parametreleri ayarlanabilir:

source: Other Parameters
pt: Outros parâmetros
tr: Diğer Parametreler

source: The following parameters are hardcoded, but may be of interest for analysis:
pt: Os seguintes parâmetros são codificados, mas podem ser de interesse para análise:
tr: Aşağıdaki parametreler sabit kodlanmıştır, ancak inceleme için ilgi çekici olabilir:

source: History
pt: História
tr: Geçmiş

source: The streaming library has grown organically for I2P - first mihi implemented the "mini streaming library" as part of I2PTunnel, which was limited to a window size of 1 message (requiring an ACK before sending the next one), and then it was refactored out into a generic streaming interface (mirroring TCP sockets) and the full streaming implementation was deployed with a sliding window protocol and optimizations to take into account the high bandwidth x delay product. Individual streams may adjust the maximum packet size and other options. The default message size is selected to fit precisely in two 1K I2NP tunnel messages, and is a reasonable tradeoff between the bandwidth costs of retransmitting lost messages, and the latency and overhead of multiple messages.
pt: A biblioteca de streaming cresceu organicamente para I2P - primeiro mihi implementou a "mini biblioteca de streaming" como parte do I2PTunnel, que foi limitada a uma janela tamanho de 1 mensagem (exigindo um ACK antes de enviar a próxima), e então foi refatorada em uma interface de streaming genérica (espelhamento de soquetes TCP) e a implementação de streaming completa foi implantada com um protocolo de janela deslizante e otimizações para levar em conta o produto de alta largura de banda x atraso. Os fluxos individuais podem ajustar o tamanho máximo do pacote e outras opções. O tamanho de mensagem padrão é selecionado para caber precisamente em duas mensagens de túnel I2NP de 1K, e é uma compensação razoável entre os custos de largura de banda de retransmissão de mensagens perdidas e a latência e sobrecarga de múltiplas mensagens.
tr: Streaming kitaplığı I2P için organik olarak büyüdü - ilk önce mihi, I2PTunnel üzerinde bir parça olarak "mini streaming kitaplığını" uyguladı. Bu pencere boyutu 1 ileti ile sınırlıydı (bir sonraki iletiyi göndermeden önce bir ACK gerekiyordu). Ardından yeniden düzenlendi genel bir akış arayüzüne (TCP soketlerini yansıtma) ve tam akış uygulaması, yüksek bant genişliği x gecikme ürününü hesaba katacak şekilde kayan bir pencere iletişim kuralı ve iyileştirmeler yapıldı. Bireysel akışlar, en fazla paket boyutunu ve diğer seçenekleri ayarlayabilir. Varsayılan ileti boyutu, tam olarak iki 1K I2NP tünel iletisine uyacak şekilde seçilir ve kayıp iletilerin yeniden iletilmesinin bant genişliği maliyetleri ile birden fazla iletinin gecikmesi ve ek yükü arasında makul bir denge sağlar.

source: Future Work
pt: Trabalho futuro
tr: Gelecekte Yapılacak Çalışmalar

source: The behavior of the streaming library has a profound impact on application-level performance, and as such, is an important area for further analysis.
pt: O comportamento da biblioteca de streaming tem um impacto profundo no desempenho do nível do aplicativo e, como tal, é uma área importante para análise posterior.
tr: Streaming kitaplığının davranışının, uygulama düzeyinde başarım üzerinde etkisi büyüktür ve bu nedenle, daha fazla inceleme için önemli bir alandır.

source: Additional tuning of the streaming lib parameters may be necessary.
pt: Pode ser necessário um ajuste adicional dos parâmetros da biblioteca de streaming.
tr: Streaming kitaplığı parametrelerinin ayrıca ayarlanması gerekebilir.

source: Another area for research is the interaction of the streaming lib with the NTCP and SSU transport layers. See <a href="%(ntcpdisc)s">the NTCP discussion page</a> for details.
pt: Outra área de pesquisa é a interação da biblioteca de streaming com as camadas de transporte NTCP e SSU. Veja <a href="%(ntcpdisc)s">a página de discussão do NTCP</a> para detalhes.
tr: Araştırma için başka bir alan, Streaming kitaplığının NTCP ve SSU taşıyıcı katmanlarıyla etkileşimidir. Ayrıntılar için <a href="%(ntcpdisc)s">NTCP tartışma sayfasına</a> bakabilirsiniz.

source: The interaction of the routing algorithms with the streaming lib strongly affects performance. In particular, random distribution of messages to multiple tunnels in a pool leads to a high degree of out-of-order delivery which results in smaller window sizes than would otherwise be the case. The router currently routes messages for a single from/to destination pair through a consistent set of tunnels, until tunnel expiration or delivery failure. The router's failure and tunnel selection algorithms should be reviewed for possible improvements.
pt: A interação dos algoritmos de roteamento com a biblioteca de streaming afeta fortemente o desempenho. Em particular, a distribuição aleatória de mensagens para vários túneis em um pool leva a um alto grau de entrega fora de ordem, o que resulta em tamanhos de janela menores do que seria o caso de outra forma. O roteador atualmente roteia mensagens para um único par de destino de/para por meio de um conjunto consistente de túneis, até a expiração do túnel ou falha na entrega. Os algoritmos de seleção de túnel e falha do roteador devem ser revisados para possíveis melhorias.
tr: Yöneltme algoritmalarının Streaming kitaplığı ile etkileşiminin, başarım üzerinde önemli bir etkisi vardır. Özellikle, iletilerin bir havuzdaki birden çok tünele rastgele dağıtılması, aksi durumda olacağından daha küçük pencere boyutlarıyla sonuçlanan yüksek derecede sıra dışı teslimata yol açar. Yöneltici şu anda tek bir nereden/nereye hedef çifti için iletileri, tünelin süresi dolana veya teslimat hatası oluşana kadar tutarlı bir tünel kümesi üzerinden yöneltir. Olası iyileştirmeler için yönelticisi sorunları ve tünel seçim algoritmaları gözden geçirilmelidir.

source: The data in the first SYN packet may exceed the receiver's MTU.
pt: Os dados no primeiro pacote SYN podem exceder a MTU do receptor.
tr: İlk SYN paketindeki veriler, alıcının MTU değerini aşabilir.

source: The DELAY_REQUESTED field could be used more.
pt: O campo DELAY_REQUESTED poderia ser mais utilizado.
tr: DELAY_REQUESTED alanı daha fazla kullanılabilir.

source: Duplicate initial SYNCHRONIZE packets on short-lived streams may not be recognized and removed.
pt: Pacotes SYNCHRONIZE iniciais duplicados em fluxos de curta duração podem não ser reconhecidos e removidos.
tr: Kısa ömürlü akışlarda yinelenen ilk SYNCHRONIZE paketleri tanınmadığından kaldırılabilir.

source: Don't send the MTU in a retransmission.
pt: Não mandar o MTU na retransmissão.
tr: Yeniden aktarımda MTU verisini göndermeyin.

source: Data is sent along unless the outbound window is full. (i.e. no-Nagle or TCP_NODELAY) Probably should have a configuration option for this.
pt: Os dados são enviados a menos que a janela de saída esteja cheia. (ou seja, sem Nagle ou TCP_NODELAY) Provavelmente deve haver uma opção de configuração para isso.
tr: Gidiş penceresi dolu olmadığı sürece veriler birlikte gönderilir. (yani, no-Nagle ya da TCP_NODELAY) Büyük olasılıkla bunun için bir yapılandırma seçeneği bulunmalıdır.

source: zzz has added debug code to the streaming library to log packets in a wireshark-compatible (pcap) format; Use this to further analyze performance. The format may require enhancement to map more streaming lib parameters to TCP fields.
pt: O zzz adicionou código de depuração à biblioteca de streaming para registrar pacotes em um formato (pcap) compatível com o Wireshark; Use isso para analisar melhor o desempenho. O formato pode exigir aprimoramento para mapear mais parâmetros da biblioteca de streaming para campos TCP.
tr: zzz, paketleri wireshark uyumlu (pcap) biçimde günlüğe kaydetmek için Streaming kitaplığına hata ayıklama kodu ekledi. Başarımı daha fazla incelemek için bunu kullanın. Daha fazla Streaming kitaplığı parametresini TCP alanlarıyla eşleştirmek için biçimi geliştirmek gerekebilir.

source: There are proposals to replace the streaming lib with standard TCP (or perhaps a null layer together with raw sockets). This would unfortunately be incompatible with the streaming lib but it would be good to compare the performance of the two.
pt: Há propostas para substituir a biblioteca de streaming pelo TCP padrão (ou talvez uma camada nula junto com soquetes brutos). Infelizmente, isso seria incompatível com a biblioteca de streaming , mas seria bom comparar o desempenho dos dois.
tr: Streaming kitaplığını standart TCP (veya belki de ham yuvalarla birlikte boş bir katman) ile değiştirmek için öneriler var. Bunu yapmak, ne yazık ki Streaming kitaplığı ile uyumsuz olur. Ancak ikisinin başarımını karşılaştırmak iyi olur.

source: There are several bittorrent clients and trackers on I2P. As I2P addressing uses a Destination instead of an IP and port, minor changes are required to tracker and client software for operation on I2P. These changes are specified below. Note carefully the guidelines for compatibility with older I2P clients and trackers.
pt: Existem vários clientes e rastreadores de bittorrent no I2P. Como o endereçamento I2P usa um destino em vez de um IP e porta, pequenas alterações são necessárias no software do rastreador e do cliente para operação no I2P. Essas alterações são especificadas abaixo. Observe cuidadosamente as diretrizes de compatibilidade com clientes e rastreadores I2P mais antigos.
tr: I2P üzerinde birkaç bittorrent istemcisi ve izleyicisi var. I2P adresleme, IP ve bağlantı noktası yerine bir hedef kullandığından, I2P üzerinde çalışmak için izleyici ve istemci yazılımında küçük değişiklikler gerekir. Bu değişiklikler aşağıda belirtilmiştir. Eski I2P istemcileri ve izleyicileri ile uyumluluk sağlamak için yönergeleri dikkatlice inceleyin.

source: This page specifies protocol details common to all clients and trackers. Specific clients and trackers may implement other unique features or protocols.
pt: Esta página especifica detalhes do protocolo comuns a todos os clientes e rastreadores. Clientes e rastreadores específicos podem implementar outros recursos ou protocolos exclusivos.
tr: Bu sayfada, tüm istemciler ve izleyiciler için ortak olan iletişim kuralı ayrıntıları bulunur. Belirli istemci ve izleyiciler, diğer benzersiz özellikleri veya iletişim kurallarını uygulayabilir.

source: We welcome additional ports of client and tracker software to I2P.
pt: Aceitamos portas adicionais de software cliente e rastreador para o I2P.
tr: I2P için ek istemci ve izleme yazılımı aktarımlarını memnuniyetle karşılıyoruz.

source: Announces
pt: Anúncios
tr: Duyurular

source: Clients generally include a fake port=6881 parameter in the announce, for compatibility with older trackers. Trackers may ignore the port parameter, and should not require it.
pt: Os clientes geralmente incluem um parâmetro falso port=6881 no anúncio, para compatibilidade com rastreadores mais antigos. Os rastreadores podem ignorar o parâmetro port e não devem exigi-lo.
tr: İstemciler, eski izleyicilerle uyumluluk için duyuruya genellikle sahte bir port=6881 parametresi ekler. İzleyiciler port parametresini yok sayabilir ve buna gerek duymamalıdır.

source: The ip parameter is the base 64 of the client's <a href="%(commonstructures)s#struct_Destination">Destination</a>, using the I2P Base 64 alphabet [A-Z][a-z][0-9]-~. <a href="%(commonstructures)s#struct_Destination">Destinations</a> are 387+ bytes, so the Base 64 is 516+ bytes. Clients generally append ".i2p" to the Base 64 Destination for compatibility with older trackers. Trackers should not require an appended ".i2p".
pt: O parâmetro ip é a base 64 do <a href="%(commonstructures)s#struct_Destination">Destino</a>, do cliente usando o alfabeto I2P Base 64 [AZ][az][0-9]-~. <a href="%(commonstructures)s#struct_Destination">Destinos</a> têm 387+ bytes, então a Base 64 tem 516+ bytes. Os clientes geralmente acrescentam ".i2p" ao Destino Base 64 para compatibilidade com rastreadores mais antigos. Os rastreadores não devem exigir um ".i2p" acrescentado.
tr: ip parametresi, istemcinin base 64. <a href="%(commonstructures)s#struct_Destination">hedefidir</a>, I2P Base 64 alfabesini kullanarak [A-Z][a-z][0-9]-~. <a href="%(commonstructures)s#struct_Destination">Hedefler</a> 387+ bayttır, dolayısıyla Base 64, 516+ bayttır. İstemciler, daha eski izleyicilerle uyumluluk sağlamak için genellikle Base 64 hedefine ".i2p" ekler. İzleyicilere, ".i2p" eklenmesi gerekmemelidir.

source: Other parameters are the same as in standard bittorrent.
pt: Outros parâmetros são os mesmos do bittorrent padrão.
tr: Diğer parametreler standart bittorrent ile aynıdır.

source: Current Destinations for clients are 387 or more bytes (516 or more in Base 64 encoding). A reasonable maximum to assume, for now, is 475 bytes. As the tracker must decode the Base64 to deliver compact responses (see below), the tracker should probably decode and reject bad Base64 when announced.
pt: Os destinos atuais para clientes são 387 ou mais bytes (516 ou mais na codificação Base 64). Um máximo razoável para assumir, por enquanto, é 475 bytes. Como o rastreador deve decodificar o Base64 para entregar respostas compactas (veja abaixo), o rastreador provavelmente deve decodificar e rejeitar o Base64 ruim quando anunciado.
tr: İstemciler için geçerli hedefler 387 ve üzeri bayttan oluşur (Base 64 kodlamasında 516 ve üzeri). Şu an normal kabul edilebilecek en fazla değer 475 bayttır. İzleyicinin, kısa yanıtlar vermesi için Base64 kodunu çözmesi gerektiğinden (aşağıya bakın), bir izleyicinin duyurulan hatalı Base64 kodunu çözmesi ve reddetmesi gerekebilir.

source: The default response type is non-compact. Clients may request a compact response with the parameter compact=1. A tracker may, but is not required to, return a compact response when requested.
pt: O tipo de resposta padrão é não compacto. Os clientes podem solicitar uma resposta compacta com o parâmetro compact=1. Um rastreador pode, mas não é obrigado a, retornar uma resposta compacta quando solicitado.
tr: Varsayılan yanıt türü, kısa değildir. İstemciler, compact=1 parametresi ile kısa bir yanıt isteyebilir. İzleyici, istendiğinde kısa bir yanıt verebilir, ancak zorunlu değildir.

source: Developers of new I2P clients are strongly encouraged to implemenent announces over their own tunnel rather than the HTTP client proxy at port 4444. Doing so is both more efficient and it allows destination enforcement by the tracker (see below).
pt: Desenvolvedores de novos clientes I2P são fortemente encorajados a implementar anúncios em seu próprio túnel em vez de o proxy do cliente HTTP na porta 4444. Fazer isso é mais eficiente e permite a aplicação do destino pelo rastreador (veja abaixo).
tr: Yeni I2P istemcilerinin geliştiricilerinin, duyurular için 4444 bağlantı noktasını HTTP istemci vekil sunucusu yerine kendi tünellerini kullanması şiddetle önerilir. Bunu yapmak hem daha verimlidir hem de izleyici tarafından hedefin dayatılmasını sağlar (aşağıya bakın).

source: There are no known I2P clients or trackers that currently support UDP announce/responses.
pt: Não há clientes ou rastreadores I2P conhecidos que atualmente suportem anúncios/respostas UDP.
tr: Şu anda UDP duyurusunu/yanıtlarını destekleyen herhangi bir I2P istemcisi ya da izleyicisi bilinmiyor.

source: Non-Compact Tracker Responses
pt: Respostas do rastreador não compacto
tr: Kısa Olmayan İzleyici Yanıtları

source: The non-compact response is just as in standard bittorrent, with an I2P "ip".
pt: A resposta não compacta é igual à do bittorrent padrão, com um "ip" I2P.
tr: Kısa olmayan yanıt, bir I2P "ip" parametresi ile standart bittorrent üzerindeki gibidir.

source: Trackers generally include a fake port key, or use the port from the announce, for compatibility with older clients. Clients must ignore the port parameter, and should not require it.
pt: Os rastreadores geralmente incluem uma chave de porta falsa ou usam a porta do anúncio para compatibilidade com clientes mais antigos. Os clientes devem ignorar o parâmetro de porta e não devem exigi-lo.
tr: İzleyiciler, eski istemcilerle uyumluluk için duyuruya genellikle sahte bir port anahtarı ekler ya da duyurudaki port parametresini kullanır. İstemciler port parametresini yok sayabilir ve buna gerek duymamalıdır.

source: The value of the ip key is the base 64 of the client's <a href="%(commonstructures)s#struct_Destination">Destination</a>, as described above. Trackers generally append ".i2p" to the Base 64 Destination if it wasn't in the announce ip, for compatibility with older clients. Clients should not require an appended ".i2p" in the responses.
pt: O valor da chave IP é a base 64 do <a href="%(commonstructures)s#struct_Destination">Destino</a>do cliente, conforme descrito acima. Os rastreadores geralmente acrescentam ".i2p" ao Destino Base 64 se ele não estiver no IP anunciado, para compatibilidade com clientes mais antigos. Os clientes não devem exigir um ".i2p" acrescentado nas respostas.
tr: ip anahtarının değeri, yukarıda açıklandığı gibi, istemcinin base 64 <a href="%(commonstructures)s#struct_Destination">hedefidir</a>. İzleyiciler genellikle, daha eski istemcilerle uyumluluk için, duyuru ip parametresinde değilse, Base 64 hedefine ".i2p" ekler. İstemciler için yanıtlara ".i2p" eklenmesi gerekmemelidir.

source: Other response keys and values are the same as in standard bittorrent.
pt: Outras chaves de resposta e valores são os mesmos do bittorrent padrão.
tr: Diğer yanıt anahtarları ve değerleri standart bittorrent ile aynıdır.

source: Compact Tracker Responses
pt: Respostas do Compact Tracker
tr: Kısa İzleyici Yanıtları
