Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/docs.po
Languages: pt, tr

source: Naming within I2P has been an oft-debated topic since the very beginning with advocates across the spectrum of possibilities. However, given I2P's inherent demand for secure communication and decentralized operation, the traditional DNS-style naming system is clearly out, as are "majority rules" voting systems. Instead, I2P ships with a generic naming library and a base implementation designed to work off a local name to destination mapping, as well as an optional add-on application called the "Address Book". The address book is a web-of-trust-driven secure, distributed, and human readable naming system, sacrificing only the call for all human readable names to be globally unique by mandating only local uniqueness. While all messages in I2P are cryptographically addressed by their destination, different people can have local address book entries for "Alice" which refer to different destinations. People can still discover new names by importing published address books of peers specified in their web of trust, by adding in the entries provided through a third party, or (if some people organize a series of published address books using a first come first serve registration system) people can choose to treat these address books as name servers, emulating traditional DNS.
pt: A nomenclatura dentro do I2P tem sido um tópico frequentemente debatido desde o início com defensores em todo o espectro de possibilidades. No entanto, dada a demanda inerente do I2P por comunicação segura e operação descentralizada, o sistema de nomenclatura tradicional no estilo DNS está claramente fora, assim como as "regras da maioria" sistemas de votação. Em vez disso, o I2P vem com uma biblioteca de nomenclatura genérica e uma implementação base projetada para trabalhar com um nome local para mapeamento de destino, bem como um aplicativo complementar opcional chamado "Address Book". O catálogo de endereços é um sistema de nomenclatura seguro, distribuído e legível por humanos, orientado por uma rede de confiança, sacrificando apenas a chamada para que todos os nomes legíveis por humanos sejam globalmente únicos ao exigir apenas a exclusividade local. Enquanto todas as mensagens no I2P são criptograficamente endereçadas por seu destino, pessoas diferentes podem ter entradas no catálogo de endereços local para "Alice" que se referem a destinos diferentes. As pessoas ainda podem descobrir novos nomes importando catálogos de endereços publicados de pares especificados em sua rede de confiança, adicionando as entradas fornecidas por terceiros, ou (se algumas pessoas organizarem uma série de catálogos de endereços publicados usando um sistema de registro por ordem de chegada, primeiro a ser atendido) as pessoas podem escolher tratar esses catálogos de endereços como servidores de nomes, emulando o DNS tradicional.
tr: I2P üzerinde adlandırma, en başından beri, çeşitli olasılıkların savunucuları ile sıkça tartışılan bir konu olmuştur. Bununla birlikte, I2P yapısının güvenli iletişim ve merkezi olmayan çalışma şekli için doğal istekleri göz önüne alındığında, geleneksel DNS benzeri adlandırma sistemi ve "çoğunluk kuralları" oylama sistemleri açıkça geçersizdir. Bunun yerine, I2P, genel bir adlandırma kitaplığı ve yerel bir adla hedef eşleme üzerinde çalışacak şekilde tasarlanmış bir temel uygulamanın yanı sıra "Adres defteri" adı verilen isteğe bağlı bir ek uygulamayla birlikte gelir. Adres defteri, yalnızca yerel benzersizliği zorunlu kılarak, yalnızca insan tarafından okunabilen tüm adların küresel olarak benzersiz olması çağrısını feda eden, ağa güvenmeye odaklı, güvenli, dağıtılmış ve insan tarafından okunabilir bir adlandırma sistemidir. I2P ağındaki tüm iletiler, hedefleri tarafından şifrelenmiş olarak adreslenirken, farklı kişilerin, farklı hedefleri gösteren aynı "Alice" yerel adres defteri kayıtları bulunabilir. İnsanlar, güvendikleri ağlarda belirtilen eşlerin yayınlanmış adres defterlerini içe aktararak, üçüncü bir taraf aracılığıyla sağlanan kayıtları ekleyerek ya da (bazı kişiler bir ilk gelen ilk alır kayıt sistemi kullanarak bazı yayınlanmış adres defterleri düzenlerse) yine de yeni adlar keşfedebilir. İnsanlar bu adres defterlerini geleneksel DNS sistemini taklit eden ad sunucuları olarak değerlendirmeyi seçebilirler.

source: I2P does not promote the use of DNS-like services though, as the damage done by hijacking a site can be tremendous - and insecure destinations have no value. DNSsec itself still falls back on registrars and certificate authorities, while with I2P, requests sent to a destination cannot be intercepted or the reply spoofed, as they are encrypted to the destination's public keys, and a destination itself is just a pair of public keys and a certificate. DNS-style systems on the other hand allow any of the name servers on the lookup path to mount simple denial of service and spoofing attacks. Adding on a certificate authenticating the responses as signed by some centralized certificate authority would address many of the hostile nameserver issues but would leave open replay attacks as well as hostile certificate authority attacks.
pt: O I2P não promove o uso de serviços semelhantes ao DNS, pois o dano causado pelo sequestro de um site pode ser tremendo - e destinos inseguros não têm valor algum. O DNSsec em si ainda recorre a registradores e autoridades de certificação, enquanto com o I2P, as solicitações enviadas a um destino não podem ser interceptadas ou a resposta falsificada, pois são criptografadas para as chaves públicas do destino, e um destino em si é apenas um par de chaves públicas e um certificado. Os sistemas no estilo DNS , por outro lado, permitem que qualquer um dos servidores de nomes no caminho de pesquisa monte ataques simples de negação de serviço e falsificação. Adicionar um certificado autenticando as respostas como assinadas por alguma autoridade de certificação centralizada resolveria muitos dos problemas de servidores de nomes hostis, mas deixaria ataques de repetição abertos, bem como ataques de autoridades de certificação hostis.
tr: I2P, DNS benzeri hizmetlerin kullanımını desteklemez, çünkü bir sitenin ele geçirilmesinin vereceği zarar çok büyük olabilir ve güvenli olmayan hedeflerin hiçbir değeri yoktur. DNSsec verileri kayıt şirketlerine ve sertifika yetkililerine geri giderken, I2P ile, bir hedefe gönderilen veriler, hedefin herkese açık anahtarları ile şifrelendiğinden ve bir hedefin kendisi yalnızca bir herkese açık anahtar ve sertifika çifti olduğundan, istekler engellenemez veya yanıta müdahale edilemez. Öte yandan DNS tarzı sistemler, arama yolundaki ad sunucularından herhangi birinin basit hizmet reddi ve sahtekarlık saldırıları başlatmasına izin verir. Yanıtları doğrulamak için merkezi sertifika yetkilileri tarafından imzalanmış bir sertifika eklemek, kötü niyetli ad sunucusu sorunlarının çoğunu giderse de, kötü niyetli sertifika yetkilisi saldırılarının yanında yeniden yürütme saldırılarına da açık kalır.

source: Voting style naming is dangerous as well, especially given the effectiveness of Sybil attacks in anonymous systems - the attacker can simply create an arbitrarily high number of peers and "vote" with each to take over a given name. Proof-of-work methods can be used to make identity non-free, but as the network grows the load required to contact everyone to conduct online voting is implausible, or if the full network is not queried, different sets of answers may be reachable.
pt: A nomeação de estilo de votação também é perigosa, especialmente dada a eficácia dos ataques Sybil em sistemas anônimos - o invasor pode simplesmente criar um número arbitrariamente alto de pares e "votar" com cada um para assumir um determinado nome. Métodos de prova de trabalho podem ser usados para tornar a identidade não livre, mas conforme a rede cresce, a carga necessária para contatar todos para conduzir a votação online é implausível, ou se a rede completa não for consultada, diferentes conjuntos de respostas podem ser alcançáveis.
tr: Oylama biçimindeki adlandırma da tehlikelidir. Özellikle de anonim sistemlerdeki Sybil saldırılarının etkinliği göz önüne alındığında - saldırgan yalnızca keyfi olarak yüksek sayıda eş oluşturabilir ve belirli bir adı devralmak için her biriyle "oy kullanabilir". Proof-of-work yöntemleri, kimliği özgür olmayan hale getirmek için kullanılabilir. Ancak ağ büyüdükçe, çevrimiçi oylama yapmak için herkesle iletişim kurmayı sağlayacak yük çok fazladır ya da ağın tamamı sorgulanmazsa, farklı yanıt kümelerine ulaşılabilir. .

source: As with the Internet however, I2P is keeping the design and operation of a naming system out of the (IP-like) communication layer. The bundled naming library includes a simple service provider interface which alternate naming systems can plug into, allowing end users to drive what sort of naming tradeoffs they prefer.
pt: Assim como na Internet, no entanto, o I2P está mantendo o design e a operação de um sistema de nomenclatura fora da camada de comunicação (semelhante ao IP). A biblioteca de nomenclatura empacotada inclui uma interface simples de provedor de serviços na qual sistemas de nomenclatura alternativos podem ser conectados, permitindo que os usuários finais conduzam que tipo de trocas de nomenclatura eles preferem.
tr: Ancak İnternet üzerinde olduğu gibi, I2P bir adlandırma sisteminin tasarımını ve çalışmasını (IP benzeri) iletişim katmanının dışında tutar. Paketlenmiş adlandırma kitaplığında, alternatif adlandırma sistemlerinin takılabileceği basit bir hizmet sağlayıcı arabirimi bulunur ve son kullanıcıların yeğlediği adlandırma değiş tokuşunu yapmalarını sağlar.

source: The old Syndie bundled with I2P has been replaced by the new Syndie which is distributed separately. For more information see the <a href="http://syndie.i2p2.de/">Syndie</a> pages.
pt: O antigo Syndie empacotado com I2P foi substituído pelo novo Syndie que é distribuído separadamente. Para mais informações, veja as páginas <a href="http://syndie.i2p2.de/">Syndie</a> .
tr: I2P ile birlikte gelen eski Syndie, ayrı olarak dağıtılan yeni Syndie ile değiştirildi. Ayrıntılı bilgi almak için <a href="http://syndie.i2p2.de/">Syndie</a> sayfasına bakabilirsiniz.

source: Syndie is a safe, anonymous blogging / content publication / content aggregation system. It lets you create information, share it with others, and read posts from those you're interested in, all while taking into consideration your needs for security and anonymity. Rather than building its own content distribution network, Syndie is designed to run on top of existing networks, syndicating content through I2P Sites, Tor hidden services, Freenet freesites, normal websites, usenet newsgroups, email lists, RSS feeds, etc. Data published with Syndie is done so as to offer pseudonymous authentication to anyone reading or archiving it.
pt: Syndie é um sistema seguro e anônimo de blogs / publicação de conteúdo / agregação de conteúdo . Ele permite que você crie informações, compartilhe-as com outras pessoas e leia postagens daqueles em que você está interessado, tudo isso levando em consideração suas necessidades de segurança e anonimato. Em vez de construir sua própria rede de distribuição de conteúdo , o Syndie foi projetado para rodar em cima de redes existentes, sindicando conteúdo por meio de sites I2P, serviços ocultos Tor, sites gratuitos Freenet, sites normais, grupos de notícias usenet, listas de e-mail, feeds RSS, etc. Os dados publicados com o Syndie são feitos para oferecer autenticação pseudônima a qualquer um que os leia ou arquive .
tr: Syndie, güvenli, anonim bir blog oluşturma / içerik yayınlama / içerik toplama sistemidir. Güvenlik ve anonimlik gereksinimlerinizi göz önünde bulundurarak içerik oluşturmanızı, başkalarıyla paylaşmanızı ve ilgilendiğiniz kişilerin gönderilerini okumanızı sağlar. Syndie, kendi içerik dağıtım ağını oluşturmak yerine, var olan ağları kullanarak içerikleri I2P siteleri, Tor gizli hizmetleri, Freenet siteleri, normal internet siteleri, usenet haber grupları, e-posta listeleri, RSS akışları gibi kanallar üzerinden paylaşacak şekilde tasarlanmıştır. Syndie üzerinde veri paylaşımı, içeriği okuyan veya arşivleyen herkesin takma adla kimliğini doğrulayabileceği şekilde yapılır.

source: I2PTunnel is probably I2P's most popular and versatile client application, allowing generic proxying both into and out of the I2P network. I2PTunnel can be viewed as four separate proxying applications - a "client" which receives inbound TCP connections and forwards them to a given I2P destination, an "httpclient" (aka "eepproxy") which acts like an HTTP proxy and forwards the requests to the appropriate I2P destination (after querying the naming service if necessary), a "server" which receives inbound I2P streaming connections on a destination and forwards them to a given TCP host+port, and an "httpserver" which extends the "server" by parsing the HTTP request and responses to allow safer operation. There is an additional "socksclient" application, but its use is not encouraged for reasons previously mentioned.
pt: O I2PTunnel é provavelmente o aplicativo cliente mais popular e versátil do I2P, permitindo proxy genérico dentro e fora da rede I2P. O I2PTunnel pode ser visto como quatro aplicativos de proxy separados - um "cliente" que recebe conexões TCP de entrada e as encaminha para um determinado destino I2P, um "httpclient" (também conhecido como "eepproxy") que atua como um proxy HTTP e encaminha as solicitações para o destino I2P apropriado (após consultar o serviço de nomenclatura, se necessário), um "servidor" que recebe conexões de streaming I2P de entrada em um destino e as encaminha para um determinado host+porta TCP, e um "httpserver" que estende o "servidor" analisando a solicitação e as respostas HTTP para permitir uma operação mais segura. Há um aplicativo adicional "socksclient", mas seu uso não é incentivado pelos motivos mencionados anteriormente.
tr: I2PTunnel, büyük olasılıkla en beğenilen ve çok yönlü I2P istemci uygulamasıdır. I2P ağında hem geliş hem de çıkış vekil sunucularının kullanılmasını sağlar. I2PTunnel, dört ayrı vekil sunucu uygulaması olarak görülebilir. Gelen TCP bağlantılarını alan ve bunları belirli bir I2P hedefine ileten bir "istemci", bir HTTP vekil sunucusu gibi davranan ve istekleri sunucuya ileten bir "httpclient" (aka "eepproxy"), istekleri uygun I2P hedefine ileten (gerekirse adlandırma hizmetini sorguladıktan sonra), bir hedefte gelen I2P akış bağlantılarını alan ve bunları belirli bir TCP sunucu + bağlantı noktasına ileten bir "sunucu" ve daha güvenli çalışmayı sağlamak için HTTP isteğini ve yanıtlarını ayrıştıran genişletilmiş bir "https sunucusu". Ek bir "socksclient" uygulaması var. Ancak daha önce bahsedilen nedenlerle kullanılması önerilmiyor.

source: I2P itself is not an outproxy network - the anonymity and security concerns inherent in a mix net which forwards data into and out of the mix have kept I2P's design focused on providing an anonymous network which capable of meeting the user's needs without requiring external resources. However, the I2PTunnel "httpclient" application offers a hook for outproxying - if the hostname requested doesn't end in ".i2p", it picks a random destination from a user-provided set of outproxies and forwards the request to them. These destinations are simply I2PTunnel "server" instances run by volunteers who have explicitly chosen to run outproxies - no one is an outproxy by default, and running an outproxy doesn't automatically tell other people to proxy through you. While outproxies do have inherent weaknesses, they offer a simple proof of concept for using I2P and provide some functionality under a threat model which may be sufficient for some users.
pt: O I2P em si não é uma rede outproxy - as preocupações com anonimato e segurança inerentes a uma rede mix que encaminha dados para dentro e para fora da mix mantiveram o design do I2P focado em fornecer uma rede anônima que seja capaz de atender às necessidades do usuário sem exigir recursos externos. No entanto, o aplicativo I2PTunnel "httpclient" oferece um gancho para outproxy - se o nome do host solicitado não terminar em ".i2p", ele escolhe um destino aleatório de um conjunto de outproxies fornecido pelo usuário e encaminha a solicitação para eles. Esses destinos são simplesmente instâncias de "servidor" I2PTunnel executadas por voluntários que explicitamente escolheram executar outproxies - ninguém é um outproxy por padrão, e executar um outproxy não diz automaticamente a outras pessoas para fazer proxy através de você. Embora outproxies tenham fraquezas inerentes, eles oferecem uma prova de conceito simples para usar I2P e fornecem alguma funcionalidade sob um modelo de ameaça que pode ser suficiente para alguns usuários.
tr: I2P ağı bir çıkış vekil sunucusu ağı değildir. Veriler karma bir ağdan içeri ve dışarı aktarılırken anonimlik ve güvenlik endişeleri de aktarılır. I2P tasarımı, kullanıcının gereksinimlerini karşılamak için dış kaynaklara gerek duyulmayan bir anonim bir ağ sağlamaya odaklanmıştır. Bununla birlikte I2PTunnel "httpclient" uygulaması, bağlantı kurulması istenilen sunucu adı ".i2p" ile bitmiyorsa, kullanıcı tarafından sağlanan bir çıkış vekil sunucusu kümesinden rastgele bir hedef seçerek ve isteği onlara ileterek çıkış vekil sunucusu için bir bağlantı sağlar. Bu hedefler, açıkça çıkış vekil sunucusu işletmeyi seçmiş gönüllüler tarafından yürütülen I2PTunnel "sunucu" kopyalarıdır. Varsayılan olarak hiç bir kopya çıkış vekil sunucusu değildir ve bir çıkış vekil sunucusu işletmek, başkalarına otomatik olarak sizin vekil sunucunuzu kullanmasını söylemez. Çıkış vekil sunucularının doğal zayıflıkları olsa da, I2P kullanımı için basit bir kavramsal kanıt sunarlar ve bazı kullanıcılar için yeterli olabilecek bir tehdit modeline göre bazı işlevler sağlarlar.

source: I2PTunnel enables most of the applications in use. An "httpserver" pointing at a webserver lets anyone run their own anonymous website (or "I2P Site") - a webserver is bundled with I2P for this purpose, but any webserver can be used. Anyone may run a "client" pointing at one of the anonymously hosted IRC servers, each of which are running a "server" pointing at their local IRCd and communicating between IRCds over their own "client" tunnels. End users also have "client" tunnels pointing at <a href="#app.i2pmail">I2Pmail's</a> POP3 and SMTP destinations (which in turn are simply "server" instances pointing at POP3 and SMTP servers), as well as "client" tunnels pointing at I2P's CVS server, allowing anonymous development. At times people have even run "client" proxies to access the "server" instances pointing at an NNTP server.
pt: O I2PTunnel habilita a maioria dos aplicativos em uso. Um "httpserver" apontando para um servidor web permite que qualquer um execute seu próprio site anônimo (ou "Site I2P") - um servidor web é empacotado com o I2P para esse propósito, mas qualquer servidor web pode ser usado. Qualquer um pode executar um "cliente" apontando para um dos servidores IRC hospedados anonimamente, cada um dos quais está executando um "servidor" apontando para seu IRCd local e se comunicando entre IRCds por seus próprios túneis "cliente". Usuários do final do também têm túneis "cliente" apontando para os destinos POP3 e SMTP do <a href="#app.i2pmail">I2Pmail</a> (que por sua vez são simplesmente instâncias de "servidor" apontando para servidores POP3 e SMTP), bem como túneis "cliente" apontando para o servidor CVS do I2P , permitindo desenvolvimento anônimo. Às vezes, as pessoas até executaram proxies "cliente" para acessar as instâncias de "servidor" apontando para um servidor NNTP.
tr: I2PTunnel ile genel olarak gerek duyulan çoğu şey kullanılabilir. Bir site sunucusunu gösteren bir "https sunucusu", herkesin kendi anonim sitesini (veya "I2P sitesini") işletebilmesini sağlar. I2P ile birlikte bu amaçla kullanılabilecek bir site sunucusu gelir. Ancak bunun dışındaki herhangi bir site sunucusu da kullanılabilir. İsteyen herkes, her biri kendi yerel IRCd uygulamasını gösteren bir "sunucu" işleten ve kendi "istemci" tünelleri üzerinden IRCd uygulamaları arasında iletişim kuran ve anonim olarak barındırılan IRC sunucularından birini gösteren bir "istemci" işletebilir. Son kullanıcılar ayrıca anonim geliştirme yapılabilen <a href="#app.i2pmail">I2Pmail</a> POP3 ve SMTP hedeflerini gösteren "istemci" tünellerini (sırasıyla POP3 ve SMTP sunucularını gösteren "sunucu" kopyaları) ve ayrıca I2P CVS sunucusunu gösteren "istemci" tünellerini kullanabilir. Bazı durumlarda insanlar bir NNTP sunucusunu gösteren "sunucu" kopyalarına erişmek için bile "istemci" vekil sunucuları işletti.

source: i2p-bt is a port of the mainline python BitTorrent client to run both the tracker and peer communication over I2P. Tracker requests are forwarded through the eepproxy to I2P Sites specified in the torrent file while tracker responses refer to peers by their destination explicitly, allowing i2p-bt to open up a <a href="#app.streaming">streaming lib</a> connection to query them for blocks.
pt: i2p-bt é uma porta do cliente Python BitTorrent da linha principal para executar o rastreador e a comunicação peer por I2P. As solicitações do rastreador são encaminhadas por meio do eepproxy para sites I2P especificados no arquivo torrent, enquanto as respostas do rastreador se referem aos peers por seu destino explicitamente, permitindo que o i2p-bt abra uma conexão <a href="#app.streaming">streaming lib</a> para consultá-los por blocos .
tr: i2p-bt, I2P üzerinden hem izleyiciyi hem de eş iletişimini çalıştıran Python ile yazılmış asıl BitTorrent istemcisinin bir dalıdır. İzleyici istekleri, eepproxy üzerinden torrent dosyasında belirtilen I2P sitelerine iletilirken, izleyici yanıtları hedeflerine göre eşleri açıkça belirtir ve i2p-bt tarafından blokların sorgulanması için bir <a href="#app.streaming">streaming kitaplığı</a> bağlantısı açılmasını sağlar.

source: In addition to i2p-bt, a port of bytemonsoon has been made to I2P, making a few modifications as necessary to strip any anonymity-compromising information from the application and to take into consideration the fact that IPs cannot be used for identifying peers.
pt: Além do i2p-bt, uma porta do bytemonsoon foi feita para o I2P, fazendo algumas modificações conforme necessário para remover qualquer informação que comprometa o anonimato do aplicativo e para levar em consideração o fato de que os IPs não podem ser usados para identificar pares.
tr: i2p-bt yanında, I2P için bir bytemonsoon dalı oluşturuldu ve uygulamadan anonimlikten ödün verilmesine yol açabilecek herhangi bir bilgiyi ayıklayan ve IP adreslerinin eşleri tanımlamak için kullanılamayacağı gerçeğini hesaba katan birkaç gerekli değişiklik yapıldı.

source: I2PSnark developed: jrandom, et al, ported from <a href="http://www.klomp.org/mark/">mjw</a>'s <a href="http://www.klomp.org/snark/">Snark</a> client
pt: I2PSnark desenvolvido: jrandom, et al, portado de <a href="http://www.klomp.org/mark/">mjw</a>'s <a href="http://www.klomp.org/snark/">Snark</a> cliente
tr: I2PSnark geliştirildi: jrandom ve et al<a href="http://www.klomp.org/mark/">mjw</a> kullanıcısının <a href="http://www.klomp.org/snark/">Snark</a> istemcisinden bir dal oluşturdu
