Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: There are existing ways to refer to these large and ugly destinations by short and pretty names (e.g. "irc.duck.i2p"), but those techniques do not guarantee globally uniqueness (since they're stored locally in a database on each person's machine) and the current mechanism is not especially scalable nor secure (updates to the host list are managed using "subscriptions" to naming services). There may be some secure, human readable, scalable, and globally unique, naming system some day, but applications shouldn't depend upon it being in place, since there are those who don't think such a beast is possible. <a href="%(naming)s">Further information on the naming system</a> is available.
pt_br: Existem maneiras de se referir a esses destinos grandes e feios por nomes curtos e bonitos (por exemplo, "irc.duck.i2p"), mas essas técnicas não garantem exclusividade global (já que são armazenados localmente em um banco de dados na máquina de cada pessoa) e o mecanismo atual não é especialmente escalável nem seguro (as atualizações da lista de hosts são gerenciadas usando "assinaturas" para serviços de nomenclatura). Pode haver algum sistema de nomenclatura seguro, legível por humanos, escalável e globalmente único algum dia, mas os aplicativos não devem depender de sua existência, já que há aqueles que não acham que tal fera seja possível. <a href="%(naming)s">Mais informações sobre o sistema de nomenclatura</a> estão disponíveis.
tr: Bu büyük ve çirkin hedefleri kısa ve güzel adlarla ("irc.duck.i2p" gibi) anmanın çeşitli yöntemleri bulunuyor. Ancak bu yöntemler küresel olarak benzersizliği garanti etmez (çünkü her kişinin bilgisayarındaki bir veri tabanında yerel olarak depolanırlar) ve var olan yöntem özellikle ölçeklenebilir veya güvenli değildir (sunucu bilgisayar listesindeki güncellemeler, adlandırma hizmetlerine "abonelikler" kullanılarak yönetilir). Gelecekte bir gün güvenli, insan tarafından okunabilen, ölçeklenebilir ve küresel olarak benzersiz bir adlandırma sistemi var olabilir. Ancak böyle dev bir yapının mümkün olmayacağını düşünenler bulunduğundan, uygulamalar bunun yapının varlığına bağlı olmamalıdır. <a href="%(naming)s">Adlandırma sistemi hakkında ayrıntılı bilgi</a> alabilirsiniz.

source: While most applications do not need to distinguish protocols and ports, I2P <em>does</em> support them. Complex applications may specify a protocol, from port, and to port, on a per-message basis, to multiplex traffic on a single destination. See the <a href="%(datagrams)s">datagram page</a> for details. Simple applications operate by listening for "all protocols" on "all ports" of a destination.
pt_br: Embora a maioria dos aplicativos não precise distinguir protocolos e portas, I2P <em>os</em> oferece suporte. Aplicativos complexos podem especificar um protocolo, de porta e para porta, em uma base por mensagem, para multiplexar o tráfego em um único destino. Veja a <a href="%(datagrams)s">página de datagrama</a> para detalhes. Aplicativos simples operam ouvindo "todos os protocolos" em "todas as portas" de um destino.
tr: Çoğu uygulamanın iletişim kurallarını ve bağlantı noktalarını ayırt etmesi gerekmese de, I2P bunları <em>destekler</em>. Karmaşık uygulamalar, bağlantı noktasından bağlantı noktasına ve ileti bazında bağlantı noktasına, tek bir hedef üzerinde çoklayıcı trafiğe gibi farklı uygulamalar için belirli bir iletişim kuralını seçebilir. Ayrıntılı bilgi almak için <a href="%(datagrams)s">veri şeması sayfasına</a> bakabilirsiniz. Basit uygulamalar, bir hedefin "tüm bağlantı noktaları" üzerindeki "tüm iletişim kurallarını" dinleyerek çalışır.

source: Anonymity and confidentiality
pt_br: Anonimato e confidencialidade
tr: Anonimlik ve gizlilik

source: I2P has transparent end to end encryption and authentication for all data passed over the network - if Bob sends to Alice's destination, only Alice's destination can receive it, and if Bob is using the datagrams or streaming library, Alice knows for certain that Bob's destination is the one who sent the data.
pt_br: O I2P tem criptografia de ponta a ponta transparente e autenticação para todos os dados transmitidos pela rede - se Bob envia para o destino de Alice, somente o destino de Alice pode recebê-lo, e se Bob estiver usando a biblioteca de datagramas ou streaming , Alice sabe com certeza que o destino de Bob é aquele que enviou os dados.
tr: I2P, ağ üzerinden geçirilen tüm veriler için uçtan uca şeffaf şifreleme ve kimlik doğrulama özelliğine sahiptir Bob, Alice hedefine bir veri gönderdiğinde, yalnızca Alice'in hedefi bunu alabilir ve Bob veri akış şemalarını veya akış kitaplığını kullanıyorsa, Alice Bob'un hedefi olduğunu ve veriyi gönderen kişinin o olduğunu kesin olarak bilir.

source: Of course, I2P transparently anonymizes the data sent between Alice and Bob, but it does nothing to anonymize the content of what they send. For instance, if Alice sends Bob a form with her full name, government IDs, and credit card numbers, there is nothing I2P can do. As such, protocols and applications should keep in mind what information they are trying to protect and what information they are willing to expose.
pt_br: Claro, o I2P torna anônimos de forma transparente os dados enviados entre Alice e Bob, mas não faz nada para tornar anônimo o conteúdo do que eles enviam. Por exemplo, se Alice envia a Bob um formulário com seu nome completo, documentos de identidade do governo e números de cartão de crédito, não há nada que o I2P possa fazer. Como tal, protocolos e aplicativos devem ter em mente quais informações eles estão tentando proteger e quais informações eles estão dispostos a expor.
tr: Tabii ki, I2P, Alice ve Bob arasında gönderilen verileri şeffaf bir şekilde anonimleştirir. Ancak gönderdiklerinin içeriğini anonimleştirmek için hiçbir şey yapmaz. Örneğin, Alice Bob'a tam adını, resmi kimliklerini ve kredi kartı numaralarını içeren bir form gönderirse, I2P bu durumda bir şey yapamaz. Bu nedenle, iletişim kuralları ve uygulamalar, hangi bilgileri korumaya çalıştıklarını ve hangi bilgileri açık etmeye istekli olduklarını göz önüne almalıdır.

source: I2P datagrams can be up to several KB
pt_br: Datagramas da I2P podem ter vários KB
tr: I2P veri şemalarının boyutu birkaç KB kadar olabilir

source: Applications that use I2P datagrams (either raw or repliable ones) can essentially be thought of in terms of UDP - the datagrams are unordered, best effort, and connectionless - but unlike UDP, applications don't need to worry about MTU detection and can simply fire off large datagrams. While the upper limit is nominally 32 KB, the message is fragmented for transport, thus dropping the reliability of the whole. Datagrams over about 10 KB are not currently recommended. See the <a href="%(datagrams)s">datagram page</a> for details. For many applications, 10 KB of data is sufficient for an entire request or response, allowing them to transparently operate in I2P as a UDP-like application without having to write fragmentation, resends, etc.
pt_br: Aplicações que usam datagramas I2P (brutos ou replicáveis) podem ser essencialmente pensadas em termos de UDP - os datagramas são desordenados, de melhor esforço e sem conexão - mas diferentemente de UDP, aplicações não precisam se preocupar com detecção de MTU e podem simplesmente disparar datagramas grandes. Enquanto o limite superior é nominalmente 32 KB, a mensagem é fragmentada para transporte, diminuindo assim a confiabilidade do todo. Datagramas acima de 10 KB não são recomendados atualmente. Veja a <a href="%(datagrams)s">página de datagramas</a> para detalhes. Para muitas aplicações, 10 KB de dados são suficientes para uma solicitação ou resposta inteira, permitindo que elas operem de forma transparente em I2P como uma aplicação do tipo UDP sem precisar gravar fragmentação, reenvios, etc.
tr: I2P veri şemalarını (ham veya güvenilir olanlar) kullanan uygulamalar aslında UDP gibi düşünülebilir. Veri şemaları sırasız, en iyi çaba gerektiren ve bağlantısızdır. Ancak UDP aksine, uygulamaların MTU algılaması konusunda endişelenmesi gerekmez ve büyük veri şemaları basitçe ateşlenebilir. Üst sınır nominal olarak 32 KB iken, ileti aktarılmak için parçalanır, bu nedenle bütünün güvenilirliği düşer. Şu anda yaklaşık 10 KB boyutunun üzerindeki veri şemaları önerilmiyor. Ayrıntılı bilgi almak için <a href="%(datagrams)s">datagram sayfasına</a> bakabilirsiniz. Birçok uygulamada, tam bir istek veya yanıt için 10 KB boyutunda veri yeterlidir. Bu değer, uygulamanın parçalama, yeniden gönderme gibi işlemler yapmasına gerek kalmadan, I2P üzerinde UDP benzeri şeffaf bir şekilde çalışmasını sağlar.

source: There are several means of sending data over I2P, each with their own pros and cons. The streaming lib is the recommended interface, used by the majority of I2P applications.
pt_br: Existem vários meios de enviar dados via I2P, cada um com suas próprias vantagens e desvantagens. A biblioteca de streaming é a interface recomendada, usada pela maioria dos aplicativos I2P.
tr: I2P üzerinden veri göndermek için, her birinin artı ve eksi yönleri olan birkaç yöntem vardır. Akış kitaplığı, önerilen ve I2P uygulamalarının çoğu tarafından kullanılan arabirimdir.

source: Streaming Lib
pt_br: Biblioteca de streaming
tr: Akış kitaplığı

source: The <a href="%(streaming)s">full streaming library</a> is now the standard interface. It allows programming using TCP-like sockets, as explained in the <a href="#start.streaming">Streaming development guide</a>.
pt_br: A biblioteca de streaming completa <a href="%(streaming)s"></a> é agora a interface padrão . Ela permite a programação usando sockets do tipo TCP, conforme explicado no <a href="#start.streaming">Guia de desenvolvimento de streaming</a>.
tr: <a href="%(streaming)s">Tam akış kitaplığı</a> artık standart arabirimdir. <a href="#start.streaming">Streaming geliştirme rehberinde</a> açıklandığı gibi, programlamada TCP benzeri soketlerin kullanılabilmesini sağlar.

source: BOB is the <a href="%(bob)s">Basic Open Bridge</a>, allowing an application in any language to make streaming connections to and from I2P. At this point in time it lacks UDP support, but UDP support is planned in the near future. BOB also contains several tools, such as destination key generation, and verification that an address conforms to I2P specifications. Up to date info and applications that use BOB can be found at this <a href="http://%(boburl)s/">I2P Site</a>.
pt_br: BOB é o <a href="%(bob)s">Basic Open Bridge</a>, permitindo que um aplicativo em qualquer idioma faça conexões de streaming de e para I2P. Neste momento, ele não tem suporte a UDP, mas o suporte a UDP está planejado para um futuro próximo. BOB também contém várias ferramentas, como geração de chave de destino e verificação de que um endereço está em conformidade com especificações I2P. Informações atualizadas e aplicativos que usam BOB podem ser encontrados neste <a href="http://%(boburl)s/">Site I2P</a>.
tr: BOB, herhangi bir dilde bir uygulamanın I2P üzerinden geliş ve gidiş akış bağlantıları kurmasını sağlayan <a href="%(bob)s">Basic Open Bridge</a> uygulamasıdır. Şu anda UDP desteği yok, ancak yakın gelecekte UDP desteği olması planlanıyor. BOB üzerinde ayrıca, hedef anahtar oluşturma ve bir adresin I2P özelliklerine uygunluğunu doğrulama gibi çeşitli araçlar bulunur. BOB kullanımı ile ilgili güncel bilgiler ve uygulamalar <a href="http://%(boburl)s/">I2P sitesinde</a> bulunabilir.

source: SAM is not recommended. SAM V2 is okay, SAM V3 is recommended.
pt_br: O SAM não é recomendado. O SAM v2 é firmeza, mas recomenda-se o SAM v3.
tr: SAM önerilmez. SAM V2 iyidir, SAM V3 önerilir.

source: SAM is the <a href="%(sam)s">Simple Anonymous Messaging</a> protocol, allowing an application written in any language to talk to a SAM bridge through a plain TCP socket and have that bridge multiplex all of its I2P traffic, transparently coordinating the encryption/decryption and event based handling. SAM supports three styles of operation:
pt_br: SAM é o protocolo <a href="%(sam)s">Simple Anonymous Messaging</a> , permitindo que um aplicativo escrito em qualquer linguagem converse com uma ponte SAM por meio de um soquete TCP simples e tenha essa ponte multiplexando todo o seu tráfego I2P, coordenando de forma transparente a criptografia/descriptografia e o tratamento baseado em eventos. O SAM suporta três estilos de operação:
tr: SAM, herhangi bir dilde yazılmış bir uygulamanın düz bir TCP soketi üzerinden bir SAM köprüsüyle konuşmasını ve bu köprünün tüm I2P trafiğini çoklamasını, şifrelemesini/şifre çözmesini ve olay tabanlı işlemesini şeffaf bir şekilde koordine etmeyi sağlayan <a href="%(sam)s">basit anonim iletişim kuralıdır</a> (Simple Anonymous Messaging). SAM, üç çalışma şeklini destekler:

source: streams, for when Alice and Bob want to send data to each other reliably and in order
pt_br: fluxos, para quando Alice e Bob querem enviar dados um ao outro de forma confiável e em ordem
tr: Akışlar, Alice ve Bob birbirlerine güvenilir ve sırayla veri göndermek istediğinde

source: repliable datagrams, for when Alice wants to send Bob a message that Bob can reply to
pt_br: datagramas replicáveis, para quando Alice quiser enviar uma mensagem a Bob para que Bob possa responder
tr: Güvenilir veri şemaları, Alice Bob'a, Bob'un yanıtlayabileceği bir ileti göndermek istediğinde

source: raw datagrams, for when Alice wants to squeeze the most bandwidth and performance as possible, and Bob doesn't care whether the data's sender is authenticated or not (e.g. the data transferred is self authenticating)
pt_br: datagramas brutos, para quando Alice quer extrair o máximo de largura de banda e desempenho possível, e Bob não se importa se o remetente dos dados é autenticado ou não (por exemplo, os dados transferidos são autoautenticados)
tr: Ham veri şemaları, Alice olabildiği kadar bant genişliğini ve başarımı sıkıştırmak istediğinde ve Bob veri göndericisinin kimliğinin doğrulanıp doğrulanmadığını umursamadığında (örneğin, aktarılan veri kendi kendini doğruluyorsa)

source: SAM V3 aims at the same goal as SAM and SAM V2, but does not require multiplexing/demultiplexing. Each I2P stream is handled by its own socket between the application and the SAM bridge. Besides, datagrams can be sent and received by the application through datagram communications with the SAM bridge.
pt_br: O SAM V3 visa o mesmo objetivo que o SAM e o SAM V2, mas não requer multiplexação/desmultiplexação . Cada fluxo I2P é manipulado por seu próprio soquete entre o aplicativo e a ponte SAM. Além disso, os datagramas podem ser enviados e recebidos pelo aplicativo por meio de comunicações de datagrama com a ponte SAM.
tr: SAM V3, SAM ve SAM V2 ile aynı hedefe ulaşmayı amaçlar. Ancak çoklamayı ya da çoklamayı çözmeyi gerektirmez. Her I2P akışı, uygulama ile SAM köprüsü arasındaki kendi soketi tarafından işlenir. Ayrıca, SAM köprüsü ile veri şeması iletişimleri yoluyla uygulama tarafından veri şemaları gönderilebilir ve alınabilir.

source: <a href="%(samv2)s">SAM V2</a> is a new version used by imule that fixes some of the problems in <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> is used by imule since version 1.4.0.
pt_br: <a href="%(samv2)s">SAM V2</a> é uma nova versão usada pelo imule que corrige alguns dos problemas no <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> é usado pelo imule desde a versão 1.4.0.
tr: <a href="%(samv2)s">SAM V2</a>, imule tarafından kullanılan ve bazı <a href="%(sam)s">SAM</a> sorunlarını gideren yeni bir sürümdür. <br /> <a href="%(samv3)s">SAM V3</a>, imule tarafından 1.4.0 sürümünden beri kullanılmaktadır.

source: The I2PTunnel application allows applications to build specific TCP-like tunnels to peers by creating either I2PTunnel 'client' applications (which listen on a specific port and connect to a specific I2P destination whenever a socket to that port is opened) or I2PTunnel 'server' applications (which listen to a specific I2P destination and whenever it gets a new I2P connection it outproxies to a specific TCP host/port). These streams are 8-bit clean, and are authenticated and secured through the same streaming library that SAM uses, but there is a nontrivial overhead involved with creating multiple unique I2PTunnel instances, since each have their own unique I2P destination and their own set of tunnels, keys, etc.
pt_br: O aplicativo I2PTunnel permite que aplicativos criem túneis específicos do tipo TCP para pares criando aplicativos 'cliente' I2PTunnel (que escutam em uma porta específica e se conectam a um destino I2P específico sempre que um soquete para essa porta é aberto) ou aplicativos 'servidor' I2PTunnel (que escutam um destino I2P específico e sempre que obtém uma nova conexão I2P ele faz outproxies para um host/porta TCP específico). Esses fluxos são limpos em 8 bits e são autenticados e protegidos pela mesma biblioteca de streaming que o SAM usa, mas há uma sobrecarga não trivial envolvida na criação de várias instâncias I2PTunnel exclusivas, pois cada uma tem seu próprio destino I2P exclusivo e seu próprio conjunto de túneis, chaves, etc.
tr: I2PTunnel uygulaması, I2PTunnel 'istemci' uygulamaları (belirli bir bağlantı noktasını dinleyen ve o bağlantı noktasına bir soket açıldığında belirli bir I2P hedefine bağlanan) veya I2PTunnel 'sunucu' uygulamaları oluşturarak, uygulamaların eşler için belirli TCP benzeri tüneller kurmasını sağlar (bunlar belirli bir I2P hedefini dinler ve ne zaman yeni bir I2P bağlantısı alırsa, belirli bir TCP sunucusuna/bağlantı noktasına çıkış vekil sunucusu olarak gönderir). Bu akışlar 8 bit temiz veri içerir ve SAM tarafından kullanılan akış kitaplığı aracılığıyla kimliği doğrulanır ve güvence altına alınır. Ancak her birinin kendi benzersiz I2P hedefi ve kendi tünel kümesi, anahtarları vb. olduğundan, birden çok benzersiz I2PTunnel kopyası oluşturmayla ilgili önemsiz bir ek yük oluşur.

source: I2P supports a SOCKS V4 and V5 proxy. Outbound connections work well. Inbound (server) and UDP functionality may be incomplete and untested.
pt_br: O I2P suporta um proxy SOCKS V4 e V5. Conexões de saída funcionam bem. A funcionalidade de entrada (servidor) e UDP pode estar incompleta e não testada.
tr: I2P, bir SOCKS V4 ve V5 vekil sunucusunu destekler. Gidiş bağlantıları iyi çalışıyor. Geliş (sunucu) ve UDP özellikleri eksik ve denenmemiş olabilir.

source: Removed
pt_br: Removido
tr: Kaldırıldı

source: There used to be a simple "ministreaming" library, but now ministreaming.jar contains only the interfaces for the full streaming library.
pt_br: Costumava haver uma biblioteca simples de "ministreaming", , mas agora ministreaming.jar contém apenas as interfaces para a biblioteca de streaming completa.
tr: Eskiden basit bir "mini akış" kitaplığı vardı. Ancak şimdi tam akış kitaplığının arayüzleri için yalnızca ministreaming.jar kullanılıyor.

source: Datagrams
pt_br: Datagramas
tr: Veri şemaları

source: Recommended for UDP-like applications
pt_br: Recomendado para aplicativos do tipo UDP
tr: UDP benzeri uygulamalar için önerilir

source: The <a href="%(datagrams)s">Datagram library</a> allows sending UDP-like packets. It's possible to use:
pt_br: A biblioteca de datagramas <a href="%(datagrams)s"></a> permite o envio de pacotes do tipo UDP. É possível usar:
tr: Veri şeması kitaplığı<a href="%(datagrams)s">, UDP benzeri paketlerin gönderilmesini sağlar. Şunlar kullanılabilir:

source: Repliable datagrams
pt_br: Datagramas confiáveis
tr: Güvenilir veri şemaları

source: Raw datagrams
pt_br: Datagramas brutos
tr: Ham veri şemaları

source: Not recommended
pt_br: Não recomendado
tr: Önerilmez

source: <a href="%(i2cp)s">I2CP</a> itself is a language independent protocol, but to implement an I2CP library in something other than Java there is a significant amount of code to be written (encryption routines, object marshalling, asynchronous message handling, etc). While someone could write an I2CP library in C or something else, it would most likely be more useful to use the C SAM library instead.
pt_br: <a href="%(i2cp)s">I2CP</a> em si é um protocolo independente de linguagem, mas para implementar uma biblioteca I2CP em algo diferente de Java, há uma quantidade significativa de código a ser escrito (rotinas de criptografia, marshalling de objetos, tratamento de mensagens assíncronas, etc.). Embora alguém possa escrever uma biblioteca I2CP em C ou outra coisa, provavelmente seria mais útil usar a biblioteca C SAM.
tr: <a href="%(i2cp)s">I2CP</a> dilden bağımsız bir iletişim kuralıdır. Ancak bir I2CP kitaplığını Java yerine başka bir şeye uygulamak için yazılması gereken önemli miktarda kod vardır (şifreleme alt programları, nesne sıralama, asenkron ileti işleme, vb.). Birisi C ya da başka bir dil üzerinde bir I2CP kitaplığı yazabilirken, C SAM kitaplığını kullanmak büyük olasılıkla daha yararlı olacaktır.

source: Web Applications
pt_br: Aplicações para a Web
tr: İnternet uygulamaları

source: I2P comes with the Jetty webserver, and configuring to use the Apache server instead is straightforward. Any standard web app technology should work.
pt_br: O I2P vem com o servidor web Jetty, e configurar para usar o servidor Apache é simples. Qualquer tecnologia de aplicativo web padrão deve funcionar.
tr: I2P, Jetty site sunucusuyla birlikte gelir ve kolayca bunun yerine Apache sunucusunu kullanacak şekilde yapılandırılabilir. Herhangi bir standart internet uygulaması teknolojisinin çalışması beklenir.

source: Developing using I2P requires a working I2P installation and a development environment of your own choice. If you are using Java, you can start development with the <a href="#start.streaming">streaming library</a> or datagram library. Using another programming language, SAM or BOB can be used.
pt_br: O desenvolvimento usando I2P requer uma instalação funcional do I2P e um ambiente de desenvolvimento de sua escolha. Se estiver usando Java, você pode iniciar o desenvolvimento com a biblioteca de streaming <a href="#start.streaming"></a> ou biblioteca de datagramas. Usando outra linguagem de programação, SAM ou BOB podem ser usados.
tr: I2P kullanarak yazılım geliştirmek için, çalışan bir I2P kurulumu ve kendi seçtiğiniz bir geliştirme ortamı gerekir. Java kullanıyorsanız, <a href="#start.streaming">akış kitaplığı</a> veya veri şeması kitaplığı kullanarak geliştirmeye başlayabilirsiniz. Başka bir programlama dili kullanılarak SAM veya BOB kullanılabilir.

source: Developing with the streaming library
pt_br: Desenvolvendo com a biblioteca de streamings
tr: Akış kitaplığı ile yazılım geliştirmek

source: The following example shows how to create TCP-like client and server applications using the streaming library.
pt_br: O exemplo seguinte mostra como criar aplicações cliente e servidor do tipo TCP usando a biblioteca de streaming.
tr: Aşağıdaki örnek, akış kitaplığını kullanarak TCP benzeri istemci ve sunucu uygulamalarının nasıl oluşturulacağını gösterir.

source: This will require the following libraries in your classpath:
pt_br: Isso há de exigir as seguintes bibliotecas no seu classpath:
tr: Bunun için, sınıf yolunuzda şu kitaplıklar bulunmalıdır:

source: The streaming library itself
pt_br: A biblioteca de streamings em si
tr: Akış kitaplığının kendisi

source: Factory and interfaces for the streaming library
pt_br: Fábrica e interfaces para a biblioteca de streaming
tr: Akış kitaplığı için atölye ve arayüzler

source: Standard I2P classes, data structures, API, and utilities
pt_br: Classes padrões da I2P, estruturas de dados, API e utilitários
tr: Standart I2P sınıfları, veri yapıları, API ve yardımcı programlar
