Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: The easiest way by far to translate the router console is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
pt_br: A maneira mais fácil de traduzir o console do roteador é criar uma conta em <a href="%(transifex)s">Transifex</a> e solicitar a entrada em uma equipe de tradução. Alternativamente, isso pode ser feito "do jeito antigo", conforme descrito abaixo.
tr: Yöneltici panosunu çevirmenin açık ara en kolay yolu <a href="%(transifex)s">Transifex</a> üzerinde bir hesap açmak ve bir çeviri takımına katılma isteğinde bulunmaktır. Alternatif olarak, aşağıda belirtildiği gibi "eski yöntem" de kullanılabilir.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, including the installation of monotone and the gettext tools, checking out i2p.i2p branch, and generate your own monotone keys.
pt_br: Siga o <a href="%(newdevs)s">novo guia do desenvolvedor</a>, incluindo a instalação do monotone e as ferramentas gettext, verificando a ramificação i2p.i2p e gere suas próprias chaves monotone.
tr: Monotone ve gettext araçlarının kurulumu, i2p.i2p dalına geçiş ve kendi monotone anahtarlarınızı oluşturma gibi başlıkları içeren <a href="%(newdevs)s">yeni geliştirici rehberini</a> izleyin.

source: Generate your own gpg key and sign the dev agreement.
pt_br: Gere sua própria chave gpg e assine o contrato de desenvolvimento.
tr: Kendi gpg anahtarınızı oluşturun ve geliştirici sözleşmesini imzalayın.

source: Before starting a console translation, better help translate some i2p webpages first. At least an i2p homepage in your language would be great.
pt_br: Antes de começar a tradução de um console, é melhor ajudar a traduzir algumas páginas da web do i2p primeiro. Pelo menos uma página inicial do i2p no seu idioma seria ótimo.
tr: Yöneltici panosunu çevirmeye başlamadan, bazı i2p sitesi sayfalarının çevirisine yardımcı olun. En azından kendi dilinizde bir i2p ana sayfası harika olurdu.

source: <b>What to translate:</b> There are about 15 files in the i2p.i2p branch that needs translation:
pt_br: <b>O que traduzir:</b> Há cerca de 15 arquivos na ramificação i2p.i2p que precisam de tradução:
tr: <b>Nelerin çevirilmesi gerekiyor:1 i2p.i2p dalında çevrilmesi gereken yaklaşık 15 dosya bulunuyor:

source: Where xx is your language code like fr/de/ch/zh/... There may be or may not be files with your lang code. If not, you can create your own. by copying and renaming other language files you know with your own lang code.
pt_br: Onde xx é o código do seu idioma, como fr/de/ch/zh/... Pode haver ou não arquivos com seu código lang. Se não houver, você pode criar o seu próprio. copiando e renomeando outros arquivos de idioma que você conhece com seu próprio código lang.
tr: xx yerine fr/de/ch/tr/... gibi kendi dil kodunuzu bulun Dil kodunuzda dosyalar olabilir veya olmayabilir. Yoksa, kendiniz oluşturabilirsiniz. Bildiğiniz diğer bir dilin dosyalarını kopyalayıp kendi dil kodunuzla yeniden adlandırın.

source: <b>Create files:</b> If the file for your language does not exist yet, copy another language file to a new file <code>foo_xx.bar</code> for your language. Then "<code>mtn add</code>" the file. After creating a .po file, edit the headers. Then run "<code>ant distclean poupdate</code>".
pt_br: <b>Crie arquivos:</b> Se o arquivo para seu idioma ainda não existir, copie outro arquivo de idioma para um novo arquivo <code>foo_xx.bar</code> para seu idioma. Então "<code>mtn add</code>" o arquivo. Depois de criar um arquivo .po, edite os cabeçalhos. Então execute "<code>ant distclean poupdate</code>".
tr: <b>Dosyaları oluşturun:</b> Henüz kendi dilinizde bir dosya yoksa, başka bir dil dosyasını kendi diliniz için yeni bir <code>foo_xx.bar</code> dosyası olarak kopyalayın. Ardından dosya için "<code>mtn add</code>" komutunu verin. Bir .po dosyası oluşturduktan sonra üst bilgilerini düzenleyin. Ardından "<code>ant distclean poupdate</code>" komutunu verin.

source: <b>Start to work:</b> Edit the HTML files with any text editor. Be sure not to use an editor in HTML mode that reformats everything. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
pt_br: <b>Comece a trabalhar:</b> Edite os arquivos HTML com qualquer editor de texto. Certifique-se de não usar um editor no modo HTML que reformate tudo. Para trabalhar com arquivos .po de forma eficiente, você pode usar <a href="http://www.poedit.net/download.php">POEdit</a>
tr: <b>Çalışmaya başlayın:</b> HTML dosyalarını herhangi bir metin düzenleyici ile düzenleyin. HTML kipinde her şeyi yeniden biçimlendiren bir düzenleyici kullanmadığınızdan emin olun. .po dosyalarıyla verimli bir şekilde çalışmak için <a href="http://www.poedit.net/download.php">POEdit</a> uygulamasını kullanmak isteyebilirsiniz.

source: As you can see, it's not that difficult. If you have questions about the meaning of the terms in the console, ask in <code>#i2p-dev</code> on IRC.
pt_br: Como você pode ver, não é tão difícil. Se você tiver dúvidas sobre o significado dos termos no console, pergunte em <code>#i2p-dev</code> no IRC.
tr: Gördüğünüz gibi, o kadar da zor değil. Panodaki terimlerin anlamları hakkında sorularınız varsa, <code>#i2p-dev</code> IRC kanalından sorabilirsiniz.

source: FAQ
pt_br: Perguntas mais frequentes
tr: SSS

source: Q: Why do I have to install monotone, Java, jsp, learn about .po files and html, etc.? Why can't I just do a translation and email it to you?
pt_br: P: Por que tenho que instalar monotone, Java, jsp, aprender sobre arquivos .po e html, etc.? Por que não posso simplesmente fazer uma tradução e enviar por e-mail para você?
tr: Soru: Neden monotone, Java, jsp kurmam, .po dosyaları ve HTML gibi konular hakkında bilgi edinmem gerekiyor? Neden yalnızca bir çeviri yapıp size e-postayla gönderemiyorum?

source: A: Several reasons:
pt_br: A: diversas razões:
tr: Yanıt: Bunun çeşitli nedenleri var:

source: You might be interested in translating via Transifex. Request to join a translation team <a href="%(transifex)s">here</a>.
pt_br: Você pode estar interessado em traduzir via Transifex. Solicite para se juntar a uma equipe de tradução <a href="%(transifex)s">aqui</a>.
tr: Transifex üzerinden çeviri yapmak ilginizi çekebilir. <a href="%(transifex)s">Buradan</a> bir çeviri takımına katılma isteğinde bulunabilirsiniz.

source: We don't have anybody who has time to accept manual contributions and submit them to our source control system on your behalf. Even if we did, it doesn't scale.
pt_br: Não temos ninguém que tenha tempo para aceitar contribuições manuais e enviá-las ao nosso sistema de controle de origem em seu nome. Mesmo se tivéssemos, não escala.
tr: Yapılan katkıları el ile karşılayıp, kaynak kodu denetim sistemimize sizin adınıza gönderecek bir vakti olan kimse yok. Bunu denesek bile herkes için yapamıyoruz.

source: Maybe you are thinking translation is a one-step process. It isn't. You can't do it all at once. You will make mistakes. You need to test it and tweak it to make it look right <i>before</i> you submit it. Developers will update or add to the English text, thus requiring a translation update.
pt_br: Talvez você esteja pensando que a tradução é um processo de uma etapa. Não é. Você não pode fazer tudo de uma vez. Você cometerá erros. Você precisa testar e ajustar para que pareça certo <i>antes de</i> enviá-lo. Os desenvolvedores atualizarão ou adicionarão ao texto em inglês, exigindo assim uma atualização da tradução.
tr: Çeviri işleminin tek adımlı bir süreç olduğunu düşünüyor olabilirsiniz ama değil. Hepsini bir anda yapamazsınız. Yanlış çeviriler olacaktır. Göndermeden <i>önce</i> doğru görünmesi için denemeniz ve ince ayarlar yapmanız gerekir. Geliştiriciler İngilizce metinde güncelleme veya ekleme yapabilir ve çevirinin de güncellemesi gerekir.

source: Having translators use a source control system directly provides authentication and accountablility - we know who is doing what, and we can track changes, and revert them if necessary.
pt_br: Ter tradutores usando um sistema de controle de origem fornece autenticação e responsabilização direta: sabemos quem está fazendo o quê e podemos rastrear alterações e revertê-las, se necessário.
tr: Çevirmenlerin doğrudan bir kaynak kodu denetim sistemi kullanması, kimlik doğrulaması ve ölçülebilirlik sağlar. Böylece kimin ne yaptığını bilebilir, değişiklikleri izleyebilir ve gerekirse geri alabiliriz.

source: .po files are not difficult. If you don't want to work directly with them, we recommend 'poedit'.
pt_br: Arquivos .po não são difíceis. Se você não quiser trabalhar diretamente com eles, recomendamos 'poedit'.
tr: Ham .po dosyaları ile çalışmak zor değildir. Ama bunu istemiyorsanız, 'poedit' uygulamasını öneririz.

source: HTML files are not difficult. Just ignore the html stuff and translate the text.
pt_br: Arquivos HTML não são difíceis. Apenas ignore as coisas de HTML e traduza o texto.
tr: HTML dosyaları ile çalışmak da zor değildir. HTML ögelerini görmezden gelin ve metni çevirin.

source: Installing and using monotone is not that difficult. Several of the translators and other contributors to I2P are non-programmers, and they use monotone regularly. Monotone is simply a source control system, it is not about "coding".
pt_br: Instalar e usar o monotone não é tão difícil. Vários tradutores e outros contribuidores do I2P não são programadores e usam o monotone regularmente. O Monotone é simplesmente um sistema de controle de fonte, não é sobre "codificação".
tr: Monotone kurmak ve kullanmak o kadar da zor değildir. Çevirmenlerin ve I2P projesine katkıda bulunan diğer kişilerin birçoğu programcı olmamalarına rağmen düzenli olarak monotone kullanırlar. Monotone bir kaynak kodu denetim sistemidir ve "kodlama" ile ilgili değildir.

source: Our items to translate are not "documents". They are html files and po files, with a specific format and character encoding (UTF-8) that must be maintained, and not corrupted by email programs or other methods of transfer.
pt_br: Nossos itens para traduzir não são "documentos". Eles são arquivos html e po, com um formato específico e codificação de caracteres (UTF-8) que devem ser mantidos, e não corrompidos por programas de e-mail ou outros métodos de transferência.
tr: Çevrilecek ögelerimiz "belgeler" değildir. Bunlar, içeriklerinin korunması ve e-posta uygulamaları ya da diğer aktarım yöntemleri tarafından bozulmaması gereken, belirli bir biçime ve karakter kodlamasına (UTF-8) sahip HTML ve po dosyalarıdır.

source: We looked at 'pootle' as a front-end for translators. It didn't work well, needed an administrator, and a pootle-based process would suffer from a number of the above flaws.
pt_br: Nós olhamos para o 'pootle' como um front-end para tradutores. Ele não funcionava bem, precisava de um administrador, e um processo baseado em pootle sofreria de uma série das falhas acima.
tr: Çevirmenler için bir ön yüz olarak 'pootle' uygulamasına baktık. Ancak iyi çalışmadı, bir yöneticiye gerek duyuyordu ve pootle tabanlı bir süreç, yukarıdaki bazı konularda eksik kalıyordu.

source: <b>In summary:</b> Yes, we know it is somewhat of a hurdle to get started. It's really the only possible way we can do it. Give it a try, it really isn't that hard.
pt_br: <b>Em resumo:</b> Sim, sabemos que é um pouco difícil começar. É realmente a única maneira possível de fazer isso. Experimente, não é tão difícil assim.
tr: <b>Özetle:</b> Evet, başlamanın biraz zor olduğunu biliyoruz. Ancak gerçekten bunu yapabilmemizin tek yolu bu. Bir deneyin, aslında o kadar zor olmadığını göreceksiniz.

source: More Information
pt_br: Informações adicionais
tr: Diğer bilgiler

source: The #i2p-dev channel on IRC, or the <a href="http://%(zzz)s/forums/14">translation forum on %(zzz)s</a>.
pt_br: No canal #i2p-dev no IRC; ou na <a href="http://%(zzz)s/forums/14">sessão de traduções do fórum em %(zzz)s</a>.
tr: IRC üzerindeki #i2p-dev kanalı ya da <a href="http://%(zzz)s/forums/14">%(zzz)s üzerindeki çeviri forumu</a>.

source: How to Set up a Reseed Server
pt_br: Como configurar um servidor Reseed
tr: Yeniden tohumlama sunucusu nasıl kurulur

source: Overview
pt_br: Visão geral
tr: Özet

source: Thank you for volunteering to run an I2P reseed server. "Reseeding" is our term for bootstrapping new routers into the network. New routers fetch a bundle of peer references, or "router infos", from one or more of a hardcoded list of HTTPS URLs.
pt_br: Obrigado por se voluntariar para executar um servidor de reseed I2P. "Reseeding" é o nosso termo para inicializar novos roteadores na rede. Novos roteadores buscam um pacote de referências de pares, ou "informações do roteador", de uma ou mais listas codificadas de URLs HTTPS.
tr: Bir I2P yeniden tohumlama sunucusu işletmeye gönüllü olduğunuz için teşekkür ederiz. "Yeniden tohumlama", ağda yeni yönelticileri başlatmak için kullandığımız terimdir. Yeni yönelticiler, bir ya da daha fazla sabit kodlanmış HTTPS URL listesinden bir dizi eş referansı ya da "yöneltici bilgileri" alır.

source: Requirements
pt_br: Requerimentos
tr: Gereksinimler

source: At its simplest, a reseed server consists of a Java I2P router, an HTTPS web server, and some scripts that periodically gather router infos from the router, bundle and sign them into a custom file format, and deliver these files over HTTPS. In practice, it's a bit more complex, and a reseed operator must be fairly competent and attentive. A reseed server is not appropriate for a residential internet connection. The complexities include:
pt_br: Em sua forma mais simples, um servidor de reseed consiste em um roteador Java I2P, um servidor web HTTPS, e alguns scripts que coletam periodicamente informações do roteador, os agrupam e assinam em um formato de arquivo personalizado e entregam esses arquivos por HTTPS. Na prática, é um pouco mais complexo, e um operador de reseed deve ser bastante competente e atencioso. Um servidor de reseed não é apropriado para uma conexão residencial de internet. As complexidades incluem:
tr: En basit haliyle, bir yeniden tohumlama sunucusu, bir Java I2P yönelticisi, bir HTTPS site sunucusu ve yönelticiden tüm yöneltici bilgilerini düzenli olarak toplayan, bunları özel bir dosya biçiminde paketleyip imzalayan ve bu dosyaları HTTPS üzerinden sunan bazı komut dosyalarından oluşur. Uygulamada, biraz daha karmaşıktır ve bir yeniden tohumlama sunucusu işletmecisi oldukça yetkin ve dikkatli olmalıdır. Bir yeniden tohumlama sunucusu, evlerdeki İnternet bağlantısı üzerinden işletilmeye uygun değildir. Karmaşıklıklar şunlardır:

source: You must have a secure SSL setup with either a self-signed certificate or a cert that chains up to a standard CA
pt_br: Você deve ter uma configuração SSL segura com um certificado autoassinado ou um certificado que se encadeie a uma CA padrão
tr: Kendinden imzalı bir sertifika veya standart bir sertifika hizmeti sağlayıcısına bağlanan bir sertifika ile güvenli bir SSL kurulumunuz olmalıdır.

source: The SSL configuration must conform to current best practices on allowed ciphers and protocols, and the CN/SAN host name must match the URL
pt_br: A configuração SSL deve estar em conformidade com as melhores práticas atuais sobre cifras e protocolos permitidos, e o nome do host CN/SAN deve corresponder ao URL
tr: SSL yapılandırması, izin verilen şifreleyiciler ve iletişim kuralları konusunda var olan en iyi örneklere uygun olmalı ve CN/SAN sunucu adı adres ile eşleşmelidir.

source: The scripts are designed to deliver different router info bundles to different requestors for network diversity
pt_br: Os scripts são projetados para fornecer diferentes pacotes de informações do roteador para diferentes solicitantes para diversidade de rede
tr: Komut dosyaları, ağ çeşitliliğini sağlamak için farklı istek sahiplerine farklı yöneltici bilgi paketleri sunacak şekilde tasarlanmıştır.

source: The scripts are designed to deliver the same bundle to the same repeated requestor to prevent scraping
pt_br: Os scripts são projetados para entregar o mesmo pacote ao mesmo solicitante repetido para evitar raspagem
tr: Komut dosyaları, kazımayı önlemek için aynı isteği yineleyenlere aynı paketi gönderecek şekilde tasarlanmıştır.

source: The reseed servers are under periodic attacks and DDoS attempts, and from other buggy I2P implementations and botnets. This necessitates that you run fail2ban or an equivalent solution.
pt_br: Os servidores de reseed estão sob ataques periódicos e tentativas de DDoS, além de outras implementações I2P com bugs e botnets. Isso exige que você execute o fail2ban ou uma solução equivalente.
tr: Yeniden tohumlama sunucuları, diğer hatalı I2P kurulumları ve botnet gibi kaynaklardan gelen düzenli saldırı ve DDoS girişimleri ile karşılaşır. Bu durum, fail2ban veya eşdeğer bir çözüm kullanmanızı gerektirir.

source: Information Required
pt_br: Informações necessárias
tr: Gerekli bilgiler

source: When your setup is complete and ready for testing, we will need the HTTPS URL, the SSL public key certificate (only if selfsigned), and the su3 public key certificate. After testing is complete, these will be added to the hardcoded entries in the Java and C++ routers in the next release, and you will start seeing traffic. We also will need your email address so we may continue to contact you about reseed administration issues. The email will not be made public but will be known to the other reseed operators. You should expect that your nick or name and its association with that URL or IP will become public.
pt_br: Quando sua configuração estiver concluída e pronta para teste, precisaremos da URL HTTPS, do certificado de chave pública SSL (somente se autoassinado) e do certificado de chave pública su3. Após a conclusão do teste, eles serão adicionados às entradas codificadas nos roteadores Java e C++ na próxima versão, e você começará a ver tráfego. Também precisaremos do seu endereço de e-mail para que possamos continuar a contatá-lo sobre problemas de administração de reseed. O e-mail não será tornado público, mas será conhecido pelos outros operadores de reseed. Você deve esperar que seu apelido ou nome e sua associação com essa URL ou IP se tornem públicos.
tr: Kurulumunuz tamamlanıp denenmeye hazır olduğunda, HTTPS adresine, SSL herkese açık anahtar sertifikasına (yalnızca kendinden imzalı) ve "su3" paketinin herkese açık anahtar sertifikasına gerek duyacağız. Deneme tamamlandıktan sonra, bunlar bir sonraki yayınlamada Java ve C++ yönelticilerindeki sabit kodlanmış kayıtlara eklenecek ve trafiği görmeye başlayacaksınız. Yeniden tohumlama yönetim sorunları hakkında sizinle iletişim kurabilmemiz için e-posta adresinize de ihtiyacımız olacak. E-posta adresiniz herkese açık olarak yayınlanmayacak, ancak diğer yeniden tohumlama işletmecileri tarafından bilinecek. Takma adınızın veya adınızın, bu adres ya da IP adresi ile olan ilişkisinin herkese açık hale geleceğinin farkında olun.

source: Privacy Policy
pt_br: Política de Privacidade
tr: Gizlilik ilkesi

source: A reseed operator is a trusted role in the network. While we do not yet have a formal privacy policy, you must ensure the privacy of our users by not publicizing logs or IPs found in those logs, except as necessary to discuss administration issues with the I2P reseed team.
pt_br: Um operador de reseed é uma função confiável na rede. Embora ainda não tenhamos uma política de privacidade formal, você deve garantir a privacidade de nossos usuários não divulgando logs ou IPs encontrados nesses logs, exceto quando necessário para discutir questões administrativas com a equipe de reseed do I2P.
tr: Yeniden tohumlama işletmecisi, ağ üzerinde güvenilir bir roldür. Henüz resmi bir gizlilik ilkemiz olmasa da, kullanıcılarımızın gizliliğini korumak için, yönetim sorunlarının I2P yeniden tohumlama ekibiyle tartışılması gereken durumlar dışında, bu günlüklerin ya da bu günlüklerde bulunan IP adreslerinin yayınlanmayacağından emin olmalısınız

source: Financial Support
pt_br: Apoio financeiro
tr: Mali destek

source: Modest financial support may be available to those running reseed servers. This support would be in partial reimbursement for your server costs. Support will not be paid in advance and will probably not cover all your expenses. Support is only available to those who have been running reseed servers in good standing for several months, and is based on actual need.
pt_br: Um modesto suporte financeiro pode estar disponível para aqueles que estão executando servidores de reseed. Este suporte seria um reembolso parcial dos custos do seu servidor. O suporte não será pago antecipadamente e provavelmente não cobrirá todas as suas despesas. O suporte está disponível apenas para aqueles que estão executando servidores de reseed em boas condições há vários meses e é baseado na necessidade real.
tr: Yeniden tohumlama sunucuları işletmecilerine mütevazi bir mali destek sağlanabilir. Bu destek, sunucu maliyetleriniz için kısmi bir geri ödeme şeklinde olacaktır. Destek önceden ödenmez ve büyük olasılıkla tüm giderlerinizi karşılamaz. Yalnızca yeniden tohumlama sunucuları birkaç aydır iyi çalışan ve gerçekten ihtiyacı olan işletmeciler desteklenir.

source: If you would like to discuss support, please contact echelon and CC: zzz
pt_br: Se você gostaria de discutir o suporte, entre em contato com echelon e CC: zzz
tr: Destek almak için, echelon ve CC ile görüşebilirsiniz: zzz

source: Getting Started
pt_br: Primeiros passos
tr: Başlarken

source: Our reseed coordinator is "zzz" and he may be contacted at zzz at mail.i2p or zzz at i2pmail.org. Unfortunately, he is not generally on IRC. The reseed setup is somewhat specialized, and you should direct most questions to him.
pt_br: Nosso coordenador de reseed é "zzz" e ele pode ser contatado em zzz at mail.i2p ou zzz at i2pmail.org. Infelizmente, ele geralmente não está no IRC. A configuração de reseed é um tanto especializada, e você deve direcionar a maioria das perguntas a ele.
tr: Yeniden tohumlama koordinatörümüz "zzz" olduğundan, kendisiyle zzz at mail.i2p adresinden veya zzz at i2pmail.org adresinden görüşebilirsiniz. Ne yazık ki, genellikle IRC üzerinde bulunmuyor. Yeniden tohumlama kurulumu biraz uzmanlaşmak gereken bir konudur ve çoğu soruyu doğrudan ona sormalısınız.

source: For actual implementation, details below. We have one recommended reseed solution:
pt_br: Para implementação real, detalhes abaixo. Temos uma solução de reseed recomendada:
tr: Gerçek uygulama ayrıntılarını aşağıda bulabilirsiniz. Önerdiğimiz bir yeniden tohumlama çözümümüz var:

source: A Go implementation that includes the web server and all the scripts. This is the recommended solution.
pt_br: Uma implementação Go que inclui o servidor web e todos os scripts. Esta é a solução recomendada.
tr: Site sunucusunu ve tüm komut dosyalarını içeren bir Go uygulaması. Önerilen çözüm budur.

source: For further information, read the information at the following links, and then contact zzz. Thank you!
pt_br: Para mais informações, leia as informações nos links a seguir e entre em contato com zzz. Obrigado!
tr: Ayrıntılı bilgi almak için aşağıdaki bağlantılarda bulunan bilgileri okuduktan sonra zzz ile görüşün. Teşekkürler!

source: Detailed Instructions
pt_br: Instruções detalhadas
tr: Ayrıntılı yönergeler
