Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: While it may be redundant, just for clarity the <a href="%(gpl)s">GPL</a>'ed code included within I2PTunnel and other apps must be released under the GPL with an additional "exception" explicitly authorizing the use of Java's standard libraries:
pt_br: Embora possa ser redundante, apenas para maior clareza, o código <a href="%(gpl)s">GPL</a>incluído no I2PTunnel e outros aplicativos devem ser lançados sob a GPL com uma "exceção" adicional autorizando explicitamente o uso das bibliotecas padrão do Java:
tr: Gereksiz olsa da, açıklığa kavuşturmak için, I2PTunnel ve diğer uygulamalarda bulunan <a href="%(gpl)s">GPL</a>leştirilmiş kodun, standart Java kitaplıklarının kullanımına açıkça yetki veren ek bir "istisna" ile GPL altında yayınlanması gerekir:

source: All source code under each component will by default be licensed under the primary license, unless marked otherwise in the code. All of the above is summary of the license terms - please see the specific license for the component or source code in question for authoritative terms. Component source locations and resource packaging may be changed if the repository is reorganized.
pt_br: Todo o código-fonte em cada componente será licenciado por padrão sob a licença primária , a menos que marcado de outra forma no código. Tudo acima é resumo dos termos da licença - consulte a licença específica para o componente ou código-fonte em questão para termos autoritativos. Os locais de origem do componente e o empacotamento de recursos podem ser alterados se o repositório for reorganizado.
tr: Kodda aksi belirtilmedikçe, her bileşen altındaki tüm kaynak kodları varsayılan olarak birincil lisans koşulları altında lisanslanır. Yukarıdakilerin tümü, lisans koşullarının özetidir - yetkili koşullar için lütfen söz konusu bileşen veya kaynak kodunun özel lisansına bakın. Depo yeniden düzenlenirse bileşen kaynak konumları ve kaynak paketlemesi değiştirilebilir.

source: Website content
pt_br: Conteúdo do website
tr: Site içeriği

source: Commit privileges
pt_br: Privilégios de confirmação
tr: Ayrıcalıkları sunmak

source: Developers may push changes to a distributed git repository if you receive permission from the person running that repository. See the <a href="%(git)s">Monotone Page</a> for details.
pt_br: Os desenvolvedores podem enviar alterações para um repositório git distribuído se você receber permissão da pessoa que executa o repositório. Veja a <a href="%(git)s">Página Monotone</a> para mais detalhes.
tr: Bu depoyu işleten kişiden izin alırsanız, geliştiriciler değişiklikleri dağıtılmış bir Git deposuna itebilir. Ayrıntılı bilgi almak için <a href="%(git)s">Monotone sayfasına</a> bakabilirsiniz.

source: However, to have changes included in a release, developers must be trusted by the release manager (currently zzz). In addition, they must explicitly agree with the above terms to be trusted. That means that they must send one of the release managers a signed message affirming that:
pt_br: No entanto, para que as alterações sejam incluídas em uma versão, os desenvolvedores devem ser confiáveis pelo gerente de versão (atualmente zzz). Além disso, eles devem concordar explicitamente com os termos acima para serem confiáveis. Isso significa que eles devem enviar a um dos gerentes de versão uma mensagem assinada afirmando que:
tr: Ancak, değişikliklerin bir yayına katılması için, yayın yöneticisinin (şu anda zzz) geliştiricilere güvenmelidir. Ayrıca, kendilerine güvenilmesi için yukarıdaki şartları açıkça kabul etmeleri gerekir. Bunun için, sürüm yöneticilerinden birine aşağıdakileri onaylayan imzalı bir ileti göndermeleri gerekir:

source: Unless marked otherwise, all code I commit is implicitly licensed under the component's primary license
pt_br: A menos que indicado de outra forma, todo o código que eu enviar é implicitamente licenciado sob a licença primária do componente
tr: Aksi belirtilmedikçe, sunduğum tüm kodlar, bileşenin birincil lisansı kapsamı koşulları altında lisanslanmıştır.

source: If specified in the source, the code may be explicitly licensed under one of the component's alternate licenses
pt_br: Se especificado na fonte, o código pode ser explicitamente licenciado sob uma das licenças alternativas do componente
tr: Kaynak kodunda belirtilerek, kod açıkça bileşenin alternatif lisanslarından birinin koşulları altında lisanslanabilir.

source: I have the right to release the code I commit under the terms I am committing it
pt_br: Tenho o direito de liberar o código que comprometo sob os termos em que o estou comprometendo
tr: Kabul ettiğim koşullar altında sunduğum kodu serbest bırakma hakkım var.

source: If anyone is aware of any instances where the above conditions are not met, please contact the component lead and/or an I2P release manager with further information. <a href="%(licenseagreements)s">See developers' license agreements</a>.
pt_br: Se alguém estiver ciente de quaisquer casos em que as condições acima não foram atendidas, entre em contato com o líder do componente e/ou um gerente de versão do I2P com mais informações. <a href="%(licenseagreements)s">Veja os contratos de licença dos desenvolvedores</a>.
tr: Yukarıdaki koşulların karşılanmadığı durumlardan haberdar olan biri varsa, lütfen ayrıntılı bilgi almak için bileşen lideri ve/veya bir I2P sürüm yöneticisi ile görüşün. <a href="%(licenseagreements)s">Geliştiricilerin lisans sözleşmelerine bakın</a>.

source: Release Signing Key
pt_br: Chave de assinatura de lançamento
tr: Sürüm imzalama anahtarı

source: Windows installers for releases 0.9.38 and later are signed by zlatinb.
pt_br: Os instaladores do Windows para versões 0.9.38 e posteriores são assinados por zlatinb.
tr: 0.9.38 ve sonraki sürümler için Windows kurucuları zlatinb tarafından imzalanmıştır.

source: Download code signing certificate
pt_br: Baixar certificado de assinatura de código
tr: Kod imzalama sertifikasını indirin

source: Mac OSX installers for releases 0.9.38 and later are signed by zlatinb.
pt_br: Os instaladores do Mac OSX para versões 0.9.38 e posteriores são assinados por zlatinb.
tr: 0.9.38 ve sonraki sürümler için Mac OSX kurucuları zlatinb tarafından imzalanmıştır.

source: Releases 0.7.6 and later are signed by zzz. His current public key is:
pt_br: As versões 0.7.6 e posteriores são assinadas por zzz. Sua chave pública atual é:
tr: 0.7.6 ve sonraki sürümler zzz tarafından imzalanmıştır. Var olan herkese açık anahtar:

source: Download PGP public key
pt_br: Baixar chave pública PGP
tr: Herkese açık PGP anahtarını indirin

source: Releases from 0.9.9 could be signed by str4d. His current public key is:
pt_br: Lançamentos de 0.9.9 podem ser assinados por str4d. Sua chave pública atual é:
tr: 0.9.9 sonrasındaki sürümler str4d tarafından imzalanmış olabilir. Var olan herkese açık anahtar:

source: str4d has signed the following releases:
pt_br: str4d assinou os seguintes lançamentos:
tr: str4d şu sürümleri imzalamıştır:

source: Releases 0.7.6 through 0.9.12 were signed by zzz with the following key:
pt_br: As versões 0.7.6 a 0.9.12 foram assinadas pela zzz com a seguinte chave:
tr: 0.7.6 ile 0.9.12 arasındaki sürümler, zzz tarafından aşağıdaki anahtarla imzalanmıştır:

source: Releases 0.6.1.31 through 0.7.5 were signed by Complication. His public key is:
pt_br: Os lançamentos 0.6.1.31 a 0.7.5 foram assinados por Complication. Sua chave pública é:
tr: 0.6.1.31 ile 0.7.5 arasındaki sürümler, Complication tarafından imzalanmıştır. Onun herkese açık anahtarı:

source: Security GPG Key
pt_br: Chave GPG de segurança
tr: Güvenlik GPG anahtarı

source: Following is the GPG key for the security _at_ geti2p.net email address:
pt_br: A seguir está a chave GPG para o endereço de e-mail security _at_ geti2p.net:
tr: Scurity_at_ geti2p.net e-posta adresinin GPG anahtarı şöyledir:

source: Signed Developer Keys
pt_br: Chaves de desenvolvedor assinadas
tr: İmzalanmış geliştirici anahtarları

source: Keys for zzz, Complication and welterde are provided clearsigned. The key for jrandom must be verified differently, since he's away, and only left a binary detached signature for his key.
pt_br: As chaves para zzz, Complication e welterde são fornecidas com assinatura clara. A chave para jrandom deve ser verificada de forma diferente, já que ele está ausente e deixou apenas uma assinatura binária separada para sua chave.
tr: zzz, Complication ve welterde anahtarları açık imzalı olarak sağladı. Jrandom anahtarı, uzakta olduğundan farklı bir şekilde doğrulanmalıdır ve anahtarı için yalnızca ayrılmış bir binary imza bırakmıştır.

source: Monotone keys for zzz
pt_br: Teclas monótonas para zzz
tr: zzz için Monotone anahtarları

source: Monotone keys for welterde
pt_br: Chaves monótonas para welterde
tr: welterde için Monotone anahtarları

source: Monotone keys for Complication
pt_br: Chaves monótonas para complicação
tr: Comlication için Monotone anahtarları

source: Monotone keys for jrandom
pt_br: Teclas monótonas para jrandom
tr: jrandom için Monotone anahtarları

source: Others
pt_br: Outros
tr: Diğerleri

source: <u>Tip:</u> To find zzz's GPG key, on his I2P Site locate the key `0xA76E0BED`, with the name `zzz@mail.i2p` and the fingerprint `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.
pt_br: <u>Dica:</u> Para encontrar a chave GPG do zzz, no site I2P dele localize a chave `0xA76E0BED`, com o nome `zzz@mail.i2p` e a impressão digital `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.
tr: <u>İpucu:</u> zzz GPG anahtarını için, kendi I2P sitesinde 'zzz@mail.i2p' adıyla ve '4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED' parmak iziyle '0xA76E0BED' anahtarını bulun.

source: <b>Tip:</b> To find welterde's GPG key, on public keyservers locate the key `0x62E011A1`, with the name `welterde@arcor.de` and the fingerprint `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.
pt_br: <b>Dica:</b> Para encontrar a chave GPG de welterde, em servidores de chaves públicas localize a chave `0x62E011A1`, com o nome `welterde@arcor.de` e a impressão digital `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.
tr: <b>İpucu:</b> welterde GPG anahtarı için, herkese açık anahtar sunucularında `welterde@arcor.de` adıyla ve `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1` parmak iziyle `0x62E011A1` anahtarını bulun.

source: <b>Tip:</b> To find Complication's GPG key, on his I2P Site locate the key `0x79FCCE33`, with the name `complication@mail.i2p` and the fingerprint `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.
pt_br: <b>Dica:</b> Para encontrar a chave GPG do Complication, no site I2P dele localize a chave `0x79FCCE33`, com o nome `complication@mail.i2p` e a impressão digital `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.
tr: <b>İpucu:</b> Complication GPG anahtarı için, kendi I2P sitesinde `complication@mail.i2p` adıyla ve `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33` parmak iziyle `0x79FCCE33` anahtarını bulun.

source: <b>Tip:</b> To find jrandom's GPG key for Syndie releases, on public keyservers locate the key `0x393F2DF9`, with the name `syndie-dist-key@i2p.net` and the fingerprint `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.
pt_br: <b>Dica:</b> Para encontrar a chave GPG do jrandom para lançamentos Syndie, em servidores de chaves públicas localize a chave `0x393F2DF9`, com o nome `syndie-dist-key@i2p.net` e a impressão digital `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.
tr: <b>İpucu:</b> Syndie yayınlarının jrandom GPG anahtarı için, herkese açık anahtar sunucusunda `syndie-dist-key@i2p.net` adı ve `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9` parmak iziyle `0x393F2DF9` anahtarını bulun.

source: Jrandom had to leave unexpectedly in the end of 2007. His commit key was deployed in the Syndie Monotone repository, in a file named `mtn-committers`. That file also had a GPG signature, `mtn-committers.sig`, but it was a binary detached signature. I am going to supply both files in GPG ASCII-armoured form below.
pt_br: Jrandom teve que sair inesperadamente no final de 2007. Sua chave de commit foi implantada no repositório Syndie Monotone, em um arquivo chamado `mtn-committers`. Esse arquivo também tinha uma assinatura GPG, `mtn-committers.sig`, mas era uma assinatura binária separada. Vou fornecer ambos os arquivos em formato GPG ASCII-armoured abaixo.
tr: Jrandom, 2007 sonunda beklenmedik bir şekilde ayrılmak zorunda kaldı. Onun gönderim anahtarı, Syndie Monotone deposunda, "mtn committers" adlı bir dosyada bulunuyor. Bu dosyada ayrıca bir GPG imzası vardı, "mtn-committers.sig". Ancak bu imza, binary dosyadan ayrılmış bir imzaydı. Her iki dosyayı da aşağıda GPG ASCII zırhlı biçimde sunacağım.

source: First, the file `mtn-committers` containing jrandom's Monotone key. Save as `mtn-committers.asc` and unpack it using `gpg --output mtn-committers --dearmor mtn-committers.asc`:
pt_br: Primeiro, o arquivo `mtn-committers` contendo a chave Monotone do jrandom. Salve como `mtn-committers.asc` e descompacte-o usando `gpg --output mtn-committers --dearmor mtn-committers.asc`:
tr: İlk olarak, jrandom Monotone anahtarını içeren "mtn-committers" dosyası. "mtn-committers.asc" olarak kaydedin ve "gpg --output mtn committers --dearmor mtn-committers.asc" komutuyla paketi açın:

source: Now the file `mtn-committers.sig`, containing the GPG signature. Save as `mtn-committers.sig.asc` and unpack it using `gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc`. Use it to verify the above supplied `mtn-committers` file:
pt_br: Agora o arquivo `mtn-committers.sig`, contendo a assinatura GPG. Salve como `mtn-committers.sig.asc` e descompacte-o usando `gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc`. Use-o para verificar o arquivo `mtn-committers` fornecido acima:
tr: Şimdi GPG imzasını içeren `mtn-committers.sig` dosyası. "mtn-committers.sig.asc" olarak kaydedin ve "gpg --output mtn committers.sig --dearmor mtn-committers.sig.asc" komutuyla paketi açın. Yukarıdaki `mtn-committers` dosyasını doğrulamak için kullanın:

source: Some of the developers have included their Monotone keys in their <a href="%(licenseagreements)s">signed license agreement</a>.
pt_br: Alguns desenvolvedores incluíram suas chaves Monotone em seu contrato de licença assinado <a href="%(licenseagreements)s"></a>.
tr: Bazı geliştiriciler, Monotone anahtarlarını <a href="%(licenseagreements)s">imzalı lisans sözleşmelerine</a> eklemiştir.

source: Developer Guidelines and Coding Style
pt_br: Diretrizes para os desenvolvedores e Estilo de código
tr: Geliştirici rehberleri ve kodlama biçemi

source: Read the <a href="%(newdevs)s">new developers guide</a> first.
pt_br: Leia o <a href="%(newdevs)s">guia para novos desenvolvedores</a> primeiro.
tr: Önce <a href="%(newdevs)s">yeni geliştirici rehberi</a> bölümünü okuyun.

source: Basic Guidelines and Coding Style
pt_br: Diretrizes elementares e Estilo de código
tr: Temel rehberler ve kodlama biçemi

source: Most of the following should be common sense for anybody who has worked on open source or in a commercial programming envrionment. The following applies mostly to the main development branch i2p.i2p. Guidelines for other branches, plugins, and external apps may be substantially different; check with the appropriate developer for guidance.
pt_br: A maior parte do que se segue deve ser senso comum para qualquer pessoa que tenha trabalhado em código aberto ou em um ambiente de programação comercial . O seguinte se aplica principalmente ao ramo de desenvolvimento principal i2p.i2p. As diretrizes para outros ramos, plugins e aplicativos externos podem ser substancialmente diferentes; consulte o desenvolvedor apropriado para obter orientação.
tr: Aşağıdakilerin çoğu, açık kaynak veya ticari bir programlama ortamında çalışan herkes için sağduyulu bir yaklaşım olmalıdır. Aşağıdaki konular çoğunlukla ana geliştirme dalı i2p.i2p için geçerlidir. Diğer dallar, eklentiler ve dış uygulamalar için yönergeler önemli ölçüde farklı olabilir. Rehberlik etmesi için uygun geliştiriciye danışın.

source: Community
pt_br: Comunidade
tr: Topluluk

source: Please don't just "write code". If you can, participate in other development activities, including: development discussions and support on IRC, zzz.i2p, and i2pforum.i2p; testing; bug reporting and responses; documentation; code reviews; etc.
pt_br: Por favor, não apenas "escreva código". Se puder, participe de outras atividades de desenvolvimento, incluindo: discussões de desenvolvimento e suporte no IRC, zzz.i2p e i2pforum.i2p; testes; relatórios de bugs e respostas; documentação; revisões de código; etc.
tr: Lütfen yalnızca "kod yazmakla yetinmeyin". Yapabiliyorsanız, diğer geliştirme işlemlerine de katılın: IRC, zzz.i2p ve i2pforum.i2p üzerinde geliştirme tartışmaları yapmak ve destek vermek; deneme yapmak; hataları raporlamak ve yanıtlamak; belgelendirme; kod incelemeleri; vb.

source: Active devs should be available periodically on IRC #i2p-dev. Be aware of the current release cycle. Adhere to release milestones such as feature freeze, tag freeze, and the checkin deadline for a release.
pt_br: Os desenvolvedores ativos devem estar disponíveis periodicamente no IRC #i2p-dev. Esteja ciente do ciclo de lançamento atual. Respeite os marcos de lançamento, como congelamento de recursos, congelamento de tags e o prazo de check-in para um lançamento.
tr: Aktif geliştiriciler, #i2p-dev IRC kanalında periyodik olarak bulunmalıdır. Var olan yayın döngüsünü anlayın. Özellik dondurma, etiket dondurma ve bir sürümün gönderilme teslim tarihi gibi aşamalara bağlı kalın.

source: Release Cycle
pt_br: Ciclo de liberação
tr: Yayın döngüsü

source: 1-2 days after previous release: Checkins to trunk are allowed.
pt_br: 1-2 dias após a liberação anterior: Check-ins no porta-malas são permitidos.
tr: Önceki sürümden 1-2 gün sonra: Dal içine göndermeye izin verilir.

source: 2-3 weeks after previous release: Deadline to propagate major changes from other branches to trunk.
pt_br: 2 a 3 semanas após o lançamento anterior: Prazo para propagar grandes mudanças de outros ramos para o tronco.
tr: Önceki sürümden 2-3 hafta sonra: Büyük değişiklikleri diğer dallardan ana gövdeye almak için son tarih.

source: 4-5 weeks before release: Deadline to request new home page links.
pt_br: 4-5 semanas antes do lançamento: Prazo final para solicitar novos links para a página inicial.
tr: Yayınlanmadan 4-5 hafta önce: Yeni ana sayfa bağlantıları istemek için son tarih.

source: 3-4 weeks before release: Feature freeze. Deadline for major new features.
pt_br: 3-4 semanas antes do lançamento: congelamento de recursos. Prazo para novos recursos importantes.
tr: Yayınlanmadan 3-4 hafta önce: Özellik dondurma. Önemli yeni özellikler için son tarih.

source: 2-3 weeks before release: Hold project meeting to review new home page link requests, if any.
pt_br: 2 a 3 semanas antes do lançamento: Realize uma reunião do projeto para revisar as solicitações de novos links para a página inicial, se houver.
tr: Yayınlanmadan 2-3 hafta önce: Varsa, yeni ana sayfa bağlantı isteklerini gözden geçirmek için proje toplantısı.

source: Hours before release: Code review deadline.
pt_br: Horas antes do lançamento: Prazo final para revisão do código.
tr: Yayınlanmadan saatler önce: Kodu incelemek için son tarih.

source: Have a basic understanding of distributed source control systems, even if you haven't used git before. Ask for help if you need it. Once pushed, checkins are forever, there is no undo. Please be careful. If you have not used git before, start with baby steps. Check in some small changes and see how it goes.
pt_br: Tenha um entendimento básico de sistemas de controle de fonte distribuídos, mesmo que você não tenha usado o git antes. Peça ajuda se precisar. Uma vez enviado, os checkins são para sempre, não há como desfazer. Por favor, tenha cuidado. Se você nunca usou o git antes, comece com pequenos passos. Verifique algumas pequenas mudanças e veja como vai.
tr: Daha önce Git kullanmamış olsanız bile, dağıtılmış kaynak kodu kontrol sistemleri hakkında temel bilgilere sahip olun. Gerek duyarsanız yardım isteyin. Bir kez itildiğinde, gönbderimler sonsuza kadar kalır ve geri alınamaz. Lütfen dikkatli olun. Daha önce Git kullanmadıysanız, bebek adımlarıyla başlayın. Bazı küçük değişiklikler gönderin ve nasıl gittiğini görün.

source: Test your changes before checking them in. If you prefer the checkin-before-test development model, use your own development branch and propagate back to i2p.i2p once it is working well. Do not break the build. Do not cause regressions. In case you do (it happens), please do not vanish for a long period after you push your change.
pt_br: Teste suas alterações antes de fazer o check-in. Se você preferir o modelo de desenvolvimento check-in-before-test, use seu próprio branch de desenvolvimento e propague de volta para i2p.i2p quando estiver funcionando bem. Não interrompa a compilação. Não cause regressões. Caso você faça isso (acontece), não desapareça por um longo período após você enviar sua alteração.
tr: Değişikliklerinizi göndermeden önce deneyin. Deneme öncesi gönderme geliştirme modelini yeğliyorsanız, kendi geliştirme dalınızı kullanın ve iyi çalıştığında i2p.i2p üzerine gönderin. Yapımı bozmayın. Gerilemelere neden olmayın. Bunu yaparsanız (olabilir), lütfen değişikliğinizi ittikten sonra uzun bir süre ortadan kaybolmayın.

source: If your change is non-trivial, or you want people to test it and need good test reports to know whether your change was tested or not, add a checkin comment to history.txt and increment the build revision in RouterVersion.java.
pt_br: Se sua alteração não for trivial, ou se você quiser que as pessoas a testem e precisar de bons relatórios de teste para saber se sua alteração foi testada ou não, adicione um comentário de checkin em history.txt e incremente a revisão de compilação em RouterVersion.java.
tr: Yaptığınız değişiklik önemsizse ya da başkalarının denemesini istiyorsanız ve değişikliğinizin denendiğini bilmek için iyi raporlara gerek duyuyorsanız, history.txt dosyasına bir gönderme yorumu ekleyin ve RouterVersion.java içindeki yapım sürümünü artırın.

source: Ensure that you 'git pull' to the latest revision before you check in and push. If you inadvertently diverge, merge and push as soon as possible. Don't routinely make others merge for you.
pt_br: Certifique-se de fazer um 'git pull' para a revisão mais recente antes de fazer o check-in e enviar. Se você divergir inadvertidamente, mescle e envie o mais rápido possível. Não faça com que outros mesclem para você rotineiramente.
tr: Göndermeden ve itmeden önce son değişiklikleri çekmek için 'git pull' yaptığınızdan emin olun. Yanlışlıkla değişikliklerden ayrılırsanız, en kısa sürede birleştirin ve gönderin. Birleştirme işlemini başkalarına yaptırmayı alışkanlık haline getirmeyin.

source: Do not check in major changes into the main i2p.i2p branch late in the release cycle. If a project will take you more than a couple days, create your own branch in git and do the development there so you do not block releases.
pt_br: Não faça check-in de grandes mudanças na ramificação principal i2p.i2p no final do ciclo de lançamento. Se um projeto levar mais do que alguns dias, crie sua própria ramificação no git e faça o desenvolvimento lá para não bloquear lançamentos.
tr: Yayın döngüsünün sonlarında ana i2p.i2p dalına büyük değişiklikler göndermeyin. Bir proje birkaç gününüzden fazlasını alacaksa, Git üzerinde kendi dalınızı oluşturun ve geliştirmeleri orada yapın. Böylece yayınları engellemezsiniz.

source: Coding Style
pt_br: Estilo de código
tr: Kodlama biçemi
