Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: A transport key grants you the ability to push your changes to a Monotone repository server. In order to commit code into Monotone (in essence signing your code), a commit key is also needed. None of the public Monotone servers on I2P currently require a key in order to read (or pull) the source code.
pt_br: Uma chave de transporte concede a você a capacidade de enviar suas alterações para um servidor de repositório Monotone. Para enviar o código para o Monotone (basicamente assinando seu código), uma chave de envio também é necessária. Nenhum dos servidores Monotone públicos no I2P atualmente requer uma chave para ler (ou extrair) o código-fonte.
tr: Taşıyıcı anahtarı, değişikliklerinizi bir Monotone veri havuzu sunucusuna itme olanağı sağlar. Monotone üzerine kod göndermek için (temel olarak kodunuzu imzalamak), ayrıca bir gönderim anahtarı da gereklidir. Herkese açık I2P Monotone sunucularının hiçbirinde, kaynak kodunu okumak (veya çekmek) için şu anda bir anahtar gerekmez.

source: Without a transport key, one cannot: <ul> <li>pull code from a server which doesn't allow global read access</li> <li>push code to any server</li> <li>run a Monotone server</li> </ul>
pt_br: Sem uma chave de transporte, não é possível: <ul> <li>extrair código de um servidor que não permite acesso de leitura global</li> <li>enviar código para qualquer servidor</li> <li>executar um servidor Monotone</li> </ul>
tr: Taşıyıcı anahtarı olmadan bir kişi şu işlemleri yapamaz: <ul> <li>Genel okuma izni olmayan bir sunucudan kod çekemez <li>Herhangi bir sunucuya kod itemez</li> <li>Bir Monotone sunucusu işletemez</li> </ul>

source: Without a commit key, one cannot: <ul> <li>commit any code</li> </ul>
pt_br: Sem uma chave de confirmação, não é possível: <ul> <li>confirmar nenhum código</li> </ul>
tr: Gönderim anahtarı olmadan bir kişi şu işlemleri yapamaz: <ul> <li>Herhangi bir kod gönderemez</li> </ul>

source: If you only intend to retrieve code from MTN, feel free to skip to the <a href="#trust-and-initializing-your-repository">next section</a>. If you want to generate keys, read the following.
pt_br: Se você pretende apenas recuperar código do MTN, sinta-se à vontade para pular para a próxima seção <a href="#trust-and-initializing-your-repository"></a>. Se você quiser gerar chaves, leia o seguinte.
tr: Yalnızca MTN üzerinden kod almayı düşünüyorsanız, <a href="#trust-and-initializing-your-repository">sonraki bölüme</a> geçebilirsiniz. Eğer isterseniz anahtarları oluşturmak için aşağıdakileri okuyabilirsiniz.

source: By convention keys are named like an e-mail addresses, but a corresponding e-mail address does not need to exist. For example, your keys might be named:
pt_br: Por convenção, as chaves são nomeadas como endereços de e-mail, mas um endereço de e-mail correspondente não precisa existir. Por exemplo, suas chaves podem ser nomeadas:
tr: Alışkanlığa göre anahtarlar bir e-posta adresi gibi adlandırılır. Ancak anahtara karşılık gelen bir e-posta adresinin bulunması şart değildir. Örneğin, anahtarlarınız şu şekilde adlandırılmış olabilir:

source: Monotone stores keys under <code><b>$HOME/.monotone/keys</b></code> in text files which are named identically to the keys. For example:
pt_br: Monotone armazena chaves em <code><b>$HOME/.monotone/keys</b></code> em arquivos de texto que são nomeados de forma idêntica às chaves. Por exemplo:
tr: Monotone, anahtarları <code><b>$HOME/.monotone/keys</b></code> klasörü altında anahtarlar ile aynı adı taşıyan metin dosyalarında tutar. Örneğin:

source: To generate transport and commit keys, enter the following commands at a prompt:
pt_br: Para gerar chaves de transporte e confirmação, insira os seguintes comandos em um prompt:
tr: Taşıyıcı ve gönderim anahtarları oluşturmak için komut satırına aşağıdaki komutları yazın:

source: Monotone will prompt you for a password to protect your keys. You are very strongly encouraged to set a password for the commit key. Many users will leave an empty password for the transport key, especially those running a Monotone server.
pt_br: O Monotone solicitará uma senha para proteger suas chaves. É altamente recomendável que você defina uma senha para a chave de commit. Muitos usuários deixarão uma senha vazia para a chave de transporte, especialmente aqueles que executam um servidor Monotone .
tr: Monotone, anahtarlarınızı korumak için sizden bir parola ister. Gönderim anahtarı için bir parola belirlemeniz önemle önerilir. Birçok kullanıcı, özellikle Monotone sunucusu işleyenler, taşıyıcı anahtarı parolasını boş bırakacaktır.

source: Trust, and initializing your repository
pt_br: Confiança e inicialização do seu repositório
tr: Güvenme ve deponuzu hazırlama

source: Monotone's security model helps to ensure that nobody can easily impersonate a developer without it being noticed. Since developers can make mistakes and become compromised,only manual review can ensure quality of code. Monotone's trust model will ensure that you read the right diffs. It does not replace reading diffs.
pt_br: O modelo de segurança do Monotone ajuda a garantir que ninguém possa facilmente se passar por um desenvolvedor sem ser notado. Como os desenvolvedores podem cometer erros e ficar comprometidos, apenas a revisão manual pode garantir a qualidade do código. O modelo de confiança do Monotone garantirá que você leia os diffs corretos. Ele não substitui a leitura de diffs.
tr: Monotone güvenlik modeli, hiç kimsenin fark edilmeden bir geliştiriciyi kolayca taklit etmesini engeller. Geliştiriciler hata yapabildiğinden ve saldırıya uğrayabildiğinden, yalnızca el ile gözden geçirmek kodun kalitesinden emin olunmasını sağlar. Monotone güvenilirlik modeli, doğru farkları okumanızı sağlar. Okuma farklarını değiştirmez.

source: A Monotone repository is a single file (a compressed SQLite database) which contains all of the project's source code and history.
pt_br: Um repositório Monotone é um único arquivo (um banco de dados SQLite compactado) que contém todo o código-fonte e o histórico do projeto.
tr: Monotone deposu, projenin tüm kaynak kodunu ve geçmişini içeren tek bir dosyadır (sıkıştırılmış bir SQLite veri tabanı).

source: After <a href="#obtaining-and-deploying-developers-keys">importing the developers' keys into Monotone</a> and <a href="#setting-up-trust-evaluation-hooks">setting up trust evaluation hooks</a>, Monotone will prevent untrusted code from being checked out into your workspace. There are commands available to clean untrusted code from your workspace but in practice they've not been needed due to the push access policies in place.
pt_br: Após <a href="#obtaining-and-deploying-developers-keys">importar as chaves dos desenvolvedores para o Monotone</a> e <a href="#setting-up-trust-evaluation-hooks">configurar ganchos de avaliação de confiança</a>, o Monotone impedirá que código não confiável seja retirado do seu espaço de trabalho. Existem comandos disponíveis para limpar código não confiável do seu espaço de trabalho, mas na prática eles não são necessários devido às políticas de acesso push em vigor.
tr: Monotone, geliştiriciler anahtarlarını Monotone içine aktardıktan ve <a href="#obtaining-and-deploying-developers-keys">güven değerlendirme bağlantılarını<a href="#setting-up-trust-evaluation-hooks"> ayarladıktan sonra, güvenilmeyen kodun çalışma alanınıza gönderilmesini engeller. Güvenilmeyen kodu çalışma alanınızdan temizlemek için kullanılabilecek komutlar vardır. Ancak pratikte kullanılan itme erişim ilkeleri nedeniyle bunlara gerek duyulmaz.

source: A repository can hold many branches. For example, our repository holds the following main branches:
pt_br: Um repositório pode conter muitos branches. Por exemplo, nosso repositório contém os branches principais a seguir:
tr: Bir depoda birçok dal bulunabilir. Örneğin, depomuzda aşağıdaki ana dallar bulunur:

source: The I2P router and associated programs
pt_br: O roteador I2P e programas correlatos
tr: I2P yöneltici ve ilgili programlar

source: The I2P project website
pt_br: O website do projeto I2P
tr: I2P projesi sitesi

source: Syndie, a distributed forums tool
pt_br: Syndie, uma ferramenta para fóruns distribuídos
tr: Syndie, dağıtılmış forumlar aracı

source: By convention, the I2P Monotone repository is named <code>i2p.mtn</code>. Before pulling source code from servers, a database for your repository will need to be initialized. To initialize your local repository, change into the directory that you want the <code>i2p.mtn</code> file and branch directories to be stored and issue the following command:
pt_br: Por convenção, o repositório I2P Monotone é chamado de <code>i2p.mtn</code>. Antes de extrair o código-fonte dos servidores, um banco de dados para seu repositório precisará ser inicializado. Para inicializar seu repositório local, mude para o diretório em que você deseja que o arquivo <code>i2p.mtn</code> e os diretórios de ramificação sejam armazenados e emita o seguinte comando :
tr: Alışkanlık olarak, I2P Monotone deposu <code>i2p.mtn</code> olarak adlandırılır. Sunuculardan kaynak kodunu çekmeden önce, deponuz için bir veri tabanının başlatılması gerekir. Yerel deponuzu başlatmak için <code>i2p.mtn</code> dosyasının ve dal klasörlerinin kaydedilmesini istediğiniz klasöre geçin ve aşağıdaki komutu verin:

source: Keys which developers use to commit code are essential for trust evaluation in Monotone. The other developers' transport keys are only required for Monotone server operators.
pt_br: As chaves que os desenvolvedores usam para fazer commit do código são essenciais para a avaliação de confiança em Monotone. As chaves de transporte dos outros desenvolvedores são necessárias apenas para operadores de servidor Monotone.
tr: Geliştiricilerin kod işlemek için kullandığı anahtarlar, Monotone üzerinde güvenilirlik değerlendirmesi için gereklidir. Diğer geliştiricilerin taşıyıcı anahtarları yalnızca Monotone sunucu işletmecileri için gereklidir.

source: Developers' commit keys are provided GPG-signed <a href="%(signedkeys)s">on another page</a>.
pt_br: As chaves de confirmação dos desenvolvedores são fornecidas assinadas por GPG <a href="%(signedkeys)s">em outra página</a>.
tr: Geliştiricilerin gönderim anahtarları, GPG imzalı <a href="%(signedkeys)s">başka bir sayfada</a> yayınlanır.

source: To import developers' keys after verifying their authenticity, copy <a href="%(devkeys)s">all of the keys</a> into a new file. Create this file (e.g. <code><b>keys.txt</b></code>) in the same directory where <code>i2p.mtn</code> is located. Import the keys with the command:
pt_br: Para importar as chaves dos desenvolvedores após verificar sua autenticidade, copie <a href="%(devkeys)s">todas as chaves</a> em um novo arquivo . Crie este arquivo (por exemplo, <code><b>keys.txt</b></code>) no mesmo diretório onde <code>i2p.mtn</code> está localizado. Importe as chaves com o comando:
tr: Özgünlüklerini doğruladıktan sonra geliştiricilerin anahtarlarını içe aktarmak için <a href="%(devkeys)s">tüm anahtarları</a> yeni bir dosyaya kopyalayın. Bu dosyayı ( <code><b>keys.txt</b></code> gibi) <code>i2p.mtn</code> dosyasının bulunduğu klasörde oluşturun. Şu komutu vererek anahtarları içe aktarın:

source: <b>Note</b>: <i>Never</i> add keys to <code><b>$HOME/.monotone/keys</b></code> manually.
pt_br: <b>Observação</b>: <i>Nunca</i> adicione chaves a <code><b>$HOME/.monotone/keys</b></code> manualmente.
tr: <b>Not</b>: Anahtarları <i>asla</i> <code><b>$HOME/.monotone/keys</b></code> klasörüne el ile eklemeyin.

source: The default Monotone trust policy is way too lax for our requirements: every committer is trusted by default. That is not acceptable for I2P development.
pt_br: A política de confiança padrão do Monotone é muito frouxa para nossos requisitos: cada responsável é confiável por padrão. Isso não é aceitável para desenvolvimento I2P.
tr: Varsayılan Monoton güvenilirlik ilkesi, gereksinimlerimiz için çok gevşektir: Varsayılan olarak her göndericiye güvenilir. Bu durum, I2P geliştirmesi için kabul edilemez.

source: Change into the directory <code><b>$HOME/.monotone</b></code> and open the file <code>monotonerc</code> with a text editor. Copy and paste the following two functions into this file:
pt_br: Mude para o diretório <code><b>$HOME/.monotone</b></code> e abra o arquivo <code>monotonerc</code> com um editor de texto. Copie e cole as duas funções a seguir neste arquivo:
tr: <code><b>$HOME/.monotone</b></code> klasörüne geçin ve <code>monotonerc</code> dosyasını bir metin düzenleyiciyle açın. Aşağıdaki iki işlevi kopyalayıp bu dosyaya yapıştırın:

source: The first function determines an intersection between two sets, in our case a revision's signers and trusted signers.
pt_br: A primeira função determina uma interseção entre dois conjuntos, no nosso caso, os signatários e os signatários confiáveis de uma revisão .
tr: İlk işlev, bizim durumumuzda bir revizyonun imzalayanları ile güvenilir imzalayanlarından oluşan iki küme arasındaki kesişimi belirler.

source: The second function determines trust in a given revision, by calling the first function with "signers" and "trusted" as arguments. If the intersection is null, the revision is not trusted. If the intersection is not empty, the revision is trusted. Otherwise, the revision is not trusted.
pt_br: A segunda função determina a confiança em uma revisão dada, chamando a primeira função com "signers" e "trusted" como argumentos. Se a interseção for nula, a revisão não é confiável. Se a interseção não estiver vazia, a revisão é confiável. Caso contrário, a revisão não é confiável.
tr: İkinci işlev, argüman olarak "imzalayanlar" ve "güvenilir" ile ilk işlevi çağırarak belirli bir revizyondaki güvenilirliği belirler. Kesişim kümesi boşsa, revizyona güvenilmez. Kesişim kümesi boş değilse, revizyon güvenilirdir. Olabilecek diğer durumlar revizyona güvenilmez.

source: More information about Trust Evaluation Hooks can be found in the <a href="http://www.monotone.ca/docs/Hooks.html">official Monotone documentation</a>.
pt_br: Mais informações sobre os Trust Evaluation Hooks podem ser encontradas na <a href="http://www.monotone.ca/docs/Hooks.html">documentação oficial do Monotone</a>.
tr: Güvenilirlik değerlendirme bağlantıları hakkında ayrıntılı bilgi almak için <a href="http://www.monotone.ca/docs/Hooks.html">resmi Monotone belgelerine</a> bakabilirsiniz.

source: I2P is shipped with a pre-configured tunnel pointing to the project Monotone server. Ensure that the tunnel has been started within <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a> before attempting to pull the source code from 127.0.0.1:8998.
pt_br: O I2P é enviado com um túnel pré-configurado apontando para o servidor Monotone do projeto. Certifique-se de que o túnel tenha sido iniciado dentro de <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a> antes de tentar extrair o código-fonte de 127.0.0.1:8998.
tr: I2P, projenin Monotone sunucusuna yönelen önceden yapılandırılmış bir tünel ile gönderilir. 127.0.0.1:8998 adresinden kaynak kodunu çekmeyi denemeden önce tünelin <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a> içinden başlatıldığından emin olun.

source: Enter the directory where you initialized <code>i2p.mtn</code>. Depending on whether you want only I2P sources, or also sources for the I2P website and Syndie, you can perform the <code>pull</code> operation in different ways.
pt_br: Entre no diretório onde você inicializou <code>i2p.mtn</code>. Dependendo se você quer apenas fontes I2P, ou também fontes para o site I2P e Syndie, você pode executar a operação <code>pull</code> de diferentes maneiras.
tr: <code>i2p.mtn</code> dosyasını hazırladığınız klasörü yazın. Yalnızca I2P kaynaklarını mı yoksa I2P sitesi ve Syndie kaynaklarını da mı istediğinize bağlı olarak, <code>çekme</code> işlemini farklı şekillerde gerçekleştirebilirsiniz.

source: If you only want I2P sources:
pt_br: Se você quer apenas o código-fonte da I2P:
tr: Yalnızca I2P kaynakları istiyorsanız:

source: If you want all branches:
pt_br: Se você quiser todos os ramos:
tr: Tüm dalları istiyorsanız:

source: If the transfer aborts before completing sucessfully, simply repeating the pull command will resume the transfer.
pt_br: Se a transferência for abortada antes de ser concluída com sucesso, basta repetir o comando pull para retomar a transferência.
tr: Aktarım tamamlanmadan iptal edilirse, çekme komutunu yinelemek aktarımı sürdürür.

source: Pulling in the above examples is done anonymously by specifying an empty transport key. If everyone pulls anonymously it will be harder for an attacker who gains control of the server to selectively provide some people with tampered data.
pt_br: A extração dos exemplos acima é feita anonimamente, especificando uma chave de transporte vazia. Se todos fizerem a extração anonimamente, será mais difícil para um invasor que obtiver o controle do servidor fornecer seletivamente dados adulterados a algumas pessoas.
tr: Yukarıdaki örneklerin çekilmesi, boş bir taşıyıcı anahtarı belirtilerek anonim olarak yapılır. Herkes anonim olarak çekerse, sunucunun denetimini ele geçiren bir saldırganın bazı kişilere kurcalanmış verileri seçici olarak sağlaması daha zor olacaktır.

source: To verify that trust evaluation works:
pt_br: Para verificar se a avaliação de confiança funciona:
tr: Güven değerlendirmesinin işe yaradığını doğrulamak için:

source: Make a backup of your <code>monotonerc</code> file.
pt_br: Faça um backup do seu arquivo <code>monotonerc</code>.
tr: <code>monotonerc</code> dosyanızın yedeğini alın.

source: Modify <code><b>monotonerc</b></code> by setting the trusted_signers variable in the following way:
pt_br: Modifique <code><b>monotonerc</b></code> definindo a variável trusted_signers da seguinte maneira:
tr: <code><b>monotonerc</b></code> dosyanızı değiştirerek Trusted_signers değişkenini aşağıdaki şekilde ayarlayın:

source: With <code><b>monotonerc</b></code> configured as above, Monotone will no longer trust any committers. Confirm this by changing into the directory where <code>i2p.mtn</code> was created and attempt a checkout of the I2P branch:
pt_br: Com <code><b>monotonerc</b></code> configurado como acima, o Monotone não confiará mais em nenhum committer. Confirme isso mudando para o diretório onde <code>i2p.mtn</code> foi criado e tente um checkout do branch I2P:
tr: <code><b>monotonerc</b></code> yukarıdaki gibi yapılandırıldığında, Monotone artık hiçbir göndericiye güvenmez. <code>i2p.mtn</code> dosyasının oluşturulduğu klasöre geçiş yapıp I2P dalına göndermeyi deneyerek bunu doğrulayın:

source: A directory named <code>i2p.i2p</code> should <b>not</b> appear. You should encounter many error messages like:
pt_br: Um diretório chamado <code>i2p.i2p</code> não deveria <b></b> aparecer. Você deve encontrar muitas mensagens de erro como:
tr: <code>i2p.i2p</code> adlı bir dizin görünme<b>me</b>lidir. Aşağıdakiler gibi birçok hata iletisi görmelisiniz:

source: If you are satisfied with results, restore the backup of <code>monotonerc</code> that was created above. If you didn't create a backup as advised, re-read <a href="#setting-up-trust-evaluation-hooks">Setting up trust evaluation hooks</a>.
pt_br: Se estiver satisfeito com os resultados, restaure o backup de <code>monotonerc</code> que foi criado acima. Se não criou um backup conforme recomendado, releia <a href="#setting-up-trust-evaluation-hooks">Configurando ganchos de avaliação de confiança</a>.
tr: Sonuçlardan memnunsanız, yukarıda oluşturulan <code>monotonerc</code> yedeğini geri yükleyin. Önerildiği gibi bir yedekleme oluşturmadıysanız, <a href="#setting-up-trust-evaluation-hooks">Güvenilirlik değerlendirme bağlantılarını ayarlama</a> konusunu yeniden okuyun.

source: If you already have a branch checked out, skip to the <a href="#updating-your-working-copy-to-the-latest-version">next section</a>.
pt_br: Se você já tiver uma ramificação verificada, pule para a próxima seção <a href="#updating-your-working-copy-to-the-latest-version"> </a>.
tr: Zaten kullanıma alınmış bir dalınız varsa, <a href="#updating-your-working-copy-to-the-latest-version">sonraki bölüme</a> atlayın.

source: Change into the directory where <code>i2p.mtn</code> is located. Over there issue:
pt_br: Mude para o diretório onde <code>i2p.mtn</code> está localizado. Lá, problema:
tr: <code>i2p.mtn</code> dosyasının bulunduğu klasöre geçin. Oradaki şunu yazın:

source: The checkout should complete without error messages and a directory named <code>i2p.i2p</code> should appear in the current directory. Congratulations! You have successfully checked out the latest I2P sources, ready to be compiled.
pt_br: O checkout deve ser concluído sem mensagens de erro e um diretório chamado <code>i2p.i2p</code> deve aparecer no diretório atual. Parabéns! Você verificou com sucesso as últimas fontes do I2P, prontas para serem compiladas.
tr: Geçiş, hata iletileri olmadan tamamlanmalı ve geçerli klasörde <code>i2p.i2p</code> adlı bir klasör görünmelidir. Tebrikler! Derlenmeye hazır en son I2P kaynaklarına geçtiniz.

source: If you haven't done this already, pull fresh code from the server to your local Monotone repository. To accomplish this, change into the directory where <code>i2p.mtn</code> is located and issue:
pt_br: Se você ainda não fez isso, puxe o código novo do servidor para o seu repositório local Monotone. Para fazer isso, mude para o diretório onde <code>i2p.mtn</code> está localizado e emita:
tr: Bunu henüz yapmadıysanız, sunucudan yerel Monotone deponuza taze kodları çekin. Bunu yapmak için <code>i2p.mtn</code> dosyasının bulunduğu klasöre geçin ve şunu yazın:

source: Now change into your <code>i2p.i2p</code> directory, and over there issue:
pt_br: Agora vá para o diretório <code>i2p.i2p</code> e digite:
tr: Şimdi <code>i2p.i2p</code> klasörünüee geçin ve orada şunu yazın:

source: As long as there were no errors&hellip;Congratulations! You have successfully updated to the latest I2P sources. They should be ready to compile.
pt_br: Desde que não haja erros&hellip;Parabéns! Você atualizou com sucesso para as últimas fontes I2P. Elas devem estar prontas para compilar.
tr: Bir sorun çıkmadıysa&hellip;Tebrikler! En son I2P kaynaklarına geçtiniz. Bu kaynaklar derlenmeye hazır olmalı.

source: Obtaining and deploying developers' transport keys
pt_br: Obtendo e empregando chaves de transporte dos desenvolvedores
tr: Geliştiricinin taşıyıcı anahtarlarını edinmek ve dağıtmak

source: As a server operator you may want to grant push access to certain developers.
pt_br: Como operador de servidor, você pode querer conceder acesso push a determinados desenvolvedores.
tr: Bir sunucu işletmecisi olarak, belirli geliştiricilere itme erişimi izni vermek isteyebilirsiniz.

source: By default the Monotone server denies all access.
pt_br: O padrão, por omissão, é o servidor do Monotone negar qualquer acesso.
tr: Monotone sunucusu varsayılan olarak tüm erişimi reddeder.

source: To grant pull access to all clients, set the following in
pt_br: Para conceder acesso pull a todos os clientes, defina o seguinte em
tr: Tüm istemcilere çekme erişimi vermek için aşağıdakileri ayarlayın

source: No one will not be able to push code to your server without permission being explicitly granted. To grant push access:
pt_br: Ninguém poderá enviar código para seu servidor sem que a permissão seja explicitamente concedida. Para conceder acesso de envio:
tr: Açıkça izin verilmeden hiç kimse sunucunuza kod itemexz. İtme erişimi vermek için:
