Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: Add the name of the user's transport key to <code>$HOME/.monotone/write-permissions</code>, such as <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> with one key per line.
pt_br: Adicione o nome da chave de transporte do usuário a <code>$HOME/.monotone/write-permissions</code>, como <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> com uma chave por linha.
tr: Kullanıcının taşıma anahtarının adını şuraya ekleyin: <code>$HOME/.monotone/yazma izinleri</code>, örneğin <code><pre> zzz-transport@mail.i2p complivation-transport@mail.i2p </pre></code> her satıra bir anahtar yazın.

source: Import the transport key(s) into your database. The procedure for importing transport keys is the same as for importing commit keys, which is described in the section <a href="#obtaining-and-deploying-developers-keys">Obtaining and deploying developers' keys</a>.
pt_br: Importe a(s) chave(s) de transporte para seu banco de dados. O procedimento para importar chaves de transporte é o mesmo que para importar chaves de commit, que é descrito na seção <a href="#obtaining-and-deploying-developers-keys">Obtendo e implantando chaves de desenvolvedores</a>.
tr: Taşıma anahtarını veri tabanınızın içine aktarın. Taşıyıcı anahtarlarını içe aktarma işlemi, <a href="#obtaining-and-deploying-developers-keys">Geliştirici anahtarlarını edinmek ve dağıtmak</a> bölümünde açıklanan gönderim anahtarlarını içe aktarma işlemiyle aynıdır.

source: A separate database should be used for your Monotone server because monotone will lock the database while it is served to others. Make a copy of your development database, then start the server with:
pt_br: Um banco de dados separado deve ser usado para seu servidor Monotone porque o Monotone bloqueará o banco de dados enquanto ele for servido a outros. Faça uma cópia do seu banco de dados de desenvolvimento e inicie o servidor com:
tr: Monotone sunucunuz için ayrı bir veri tabanı kullanılmalıdır çünkü monotone, başkalarına sunulurken veri tabanını kilitler. Geliştirme veri tabanınızın bir kopyasını alın, ardından sunucuyu şu komutla başlatın:

source: If your key is protected with a passphrase, Monotone may request the passphrase when the first client connects. You can work around this by connecting making the first client connection to your server (or by clearing the password for your transport key).
pt_br: Se sua chave estiver protegida com uma frase-senha, o Monotone pode solicitar a frase-senha quando o primeiro cliente se conectar. Você pode contornar isso conectando-se fazendo a primeira conexão do cliente ao seu servidor (ou limpando a senha da sua chave de transporte).
tr: Anahtarınız bir parola ile korunuyorsa, ilk istemci bağlandığında Monotone parolayı isteyebilir. Sunucunuza ilk istemci bağlantısını kurarak (ya da taşıyıcı anahtarınız için parolayı temizleyerek) bu sorunu aşabilirsiniz.

source: For your server to be accessible for others over I2P, you will need to create a server tunnel for it. Use the "Standard" tunnel type and "Bulk" profile.
pt_br: Para que seu servidor seja acessível para outros via I2P, você precisará criar um túnel de servidor para ele. Use o tipo de túnel "Standard" e o perfil "Bulk".
tr: Sunucunuzun I2P üzerinden başkaları tarafından erişilebilir olması için bir sunucu tüneli oluşturmanız gerekir. "Standart" tünel türünü ve "Toplu" profili kullanın.

source: Debian (amongst other distributions) has integrated Monotone into their framework of daemons/services. Although Monotone servers can still be run "the ordinary way" on Debian systems, doing it the "Debian way" may be more straightforward.
pt_br: O Debian (entre outras distribuições) integrou o Monotone em seu framework de daemons/serviços. Embora servidores Monotone ainda possam ser executados "do jeito comum" em sistemas Debian, fazê-lo do "jeito Debian" pode ser mais direto.
tr: Debian (diğer bazı dağıtımların yanı sıra), Monotone uygulamasını arka plan işlemleri/hizmetleri çatısıyla bütünleştirdi. Monotone sunucuları Debian sistemlerinde hala "sıradan şekilde" çalıştırılabilse de, bunu "Debian yoluyla" yapmak daha kolay olabilir.

source: Permissions are granted by editing the files <code>/etc/monotone/read-permissions</code> and <code>/etc/monotone/write-permissions</code>. You'll also need to edit <code>/etc/default/monotone</code> to enable monotone to start at boot or to customize the host, port, or database location.
pt_br: As permissões são concedidas editando os arquivos <code>/etc/monotone/read-permissions</code> e <code>/etc/monotone/write-permissions</code>. Você também precisará editar <code>/etc/default/monotone</code> para permitir que o monotone inicie na inicialização ou para personalizar o host, a porta ou o local do banco de dados.
tr: İzinleri vermek için, <code>/etc/monotone/read-permissions</code> ve <code>/etc/monotone/write-permissions</code> dosyaları düzenlenmelidir. Monotone uygulamasının başlangıçta yüklenmesi sağlamak veya sunucu, bağlantı noktası veya veri tabanı konumunu değiştirmek için <code>/etc/default/monotone</code> dosyasını da düzenlemeniz gerekir.

source: New Developer's Guide
pt_br: Guia para novos desenvolvedores
tr: Yeni geliştirici rehberi

source: Basic study
pt_br: Estudo básico
tr: Temel çalışma

source: Getting the I2P code
pt_br: Baixando o código-fonte da I2P
tr: I2P kodunu almak

source: The new way: Git
pt_br: A nova maneira: Git
tr: Yeni yöntem: Git

source: Building I2P
pt_br: Compilando a I2P
tr: I2P derlemek

source: Development ideas
pt_br: Idéias para desenvolver
tr: Geliştirme fikirleri

source: Making the results available
pt_br: Tornando os resultados disponíveis
tr: Sonuçları yayınlamak

source: Get to know us!
pt_br: Venha nos conhecer!
tr: Bizi tanıyın!

source: Translations
pt_br: Traduções
tr: Çeviriler

source: Tools
pt_br: Ferramentas
tr: Araçlar

source: So you want to start work on I2P? Great! Here's a quick guide to getting started on contributing to the website or the software, doing development or creating translations.
pt_br: Então você quer começar a trabalhar na I2P? Ótimo! Eis aqui um guia rápido para ajudá-lo a começar a contribuir com o site web ou com o software, desenvolvendo ou traduzindo.
tr: Yani I2P üzerinde çalışmaya başlamak istiyor musunuz? Harika! İşte siteye veya yazılıma katkıda bulunmaya, yazılımı geliştirmeye veya çeviri yapmaya hızlıca başlamak için bir rehber.

source: Not quite ready for coding? Try <a href="%(volunteer)s">getting involved</a> first.
pt_br: Ainda não está pronto para codificar? Tente <a href="%(volunteer)s">se envolver</a> primeiro.
tr: Kodlamaya tam olarak hazır değil misiniz? Önce <a href="%(volunteer)s">katılmayı</a> deneyin.

source: Basic development on the I2P router or the embedded applications uses Java as the main development language. If you don't have experience with Java, you can always have a look at <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a>.
pt_br: O desenvolvimento básico no roteador I2P ou nos aplicativos embarcados usa Java como a principal linguagem de desenvolvimento. Se você não tem experiência com Java, você pode sempre dar uma olhada em <a href="http://www.mindview.net/Books/TIJ/">Pensando em Java</a>.
tr: I2P yöneltici veya gömülü uygulamalardaki temel yazılım geliştirme için, ana geliştirme dili olarak Java kullanılır. Java üzerine deneyiminiz yoksa, <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a> siteisne göz atabilirsiniz.

source: Study the <a href="%(intro)s">how intro</a>, the <a href="%(docs)s">other "how" documents</a>, the <a href="%(techintro)s">tech intro</a>, and associated documents. These will give you a good overview of how I2P is structured and what different things it does.
pt_br: Estude o <a href="%(intro)s">how intro</a>, os <a href="%(docs)s">outros documentos de "how"</a>, a <a href="%(techintro)s">tech intro</a>, e documentos associados. Eles lhe darão uma boa visão geral de como o I2P é estruturado e quais coisas diferentes ele faz.
tr: <a href="%(intro)s">Nasıl girişi</a>, <a href="%(docs)s">diğer "nasıl" belgeleri</a>, <a href="%(techintro)s">teknik giriş</a> ve ilgili belgeleri inceleyin. Bunlar size I2P yapılandırmasının nasıl olduğu ve ne gibi farklı şeyler yaptığı hakkında genel bilgileri sağlar.

source: For development on the I2P router or the embedded applications, there are two ways to get the source code:
pt_br: Para desenvolvimento no roteador I2P ou em aplicativos embarcados, há duas maneiras de obter o código-fonte:
tr: I2P yöneltici veya gömülü uygulamalar üzerinde yazılım geliştirme için kaynak kodu iki yöntemle alınabilir:

source: I2P now has official Git services and accepts contributions via Git at our own gitlab. Trac issues have also been migrated to <a href="%(trac)s">gitlab</a>, however Trac still available for now. Two-way syncing of issues between Gitlab and Github is a work-in-progress.
pt_br: O I2P agora tem serviços oficiais do Git e aceita contribuições via Git em nosso próprio gitlab. Os problemas do Trac também foram migrados para <a href="%(trac)s">gitlab</a>, no entanto, o Trac ainda está disponível por enquanto. A sincronização bidirecional de problemas entre o Gitlab e o Github é um trabalho em andamento.
tr: I2P artık resmi Git hizmetlerine sahip ve kendi gitlab platformumuzda Git aracılığıyla katkıları kabul ediyoruz. Trac konuları da <a href="%(trac)s">GitLab</a> üzerine taşındı. Şimdilik Trac platformu da kullanılabilir durumda. Konuların GitLab ve GitHub arasında iki yönlü eşitlenmesi çalışmaları da sürüyor.

source: Install <a href="%(git_url)s">Git</a>.
pt_br: Instalar <a href="%(git_url)s">Git</a>.
tr: <a href="%(git_url)s">Git</a> kurun.

source: <a href="%(i2p_git)s">GitHub mirror</a></strong>:
pt_br: <a href="%(i2p_git)s">Espelho GitHub</a></strong>:
tr: <a href="%(i2p_git)s">GitHub yansısı</a></strong>:

source: To compile the code, you need the Sun Java Development Kit 6 or higher, or equivalent JDK (<a href="%(sunjdk6)s">Sun JDK 6</a> strongly recommended) and <a href="http://ant.apache.org/">Apache ant</a> version 1.7.0 or higher. If you go are working on the main I2P code, you can go into the i2p.i2p directory and run 'ant' to see the build options.
pt_br: Para compilar o código, você precisa do Sun Java Development Kit 6 ou superior, ou JDK equivalente (<a href="%(sunjdk6)s">Sun JDK 6</a> fortemente recomendado) e <a href="http://ant.apache.org/">Apache ant</a> versão 1.7.0 ou superior. Se você estiver trabalhando no código principal do I2P, pode acessar o diretório i2p.i2p e executar 'ant' para ver as opções de compilação.
tr: Kodu derlemek için Sun Java Development Kit 6 veya üzeri ya da eşdeğeri JDK (<a href="%(sunjdk6)s">Sun JDK 6</a> şiddetle önerilir) ve <a href="http://ant.apache.org/">Apache ant</a> sürüm 1.7.0 veya üzeri gerekir. Ana I2P kodu üzerinde çalışıyorsanız, i2p.i2p klasörüne gidebilir ve derleme seçeneklerini görmek için 'ant' komutunu verebilirsiniz.

source: To build or work on console translations, you need the xgettext, msgfmt, and msgmerge tools from the <a href="http://www.gnu.org/software/gettext/">GNU gettext package</a>.
pt_br: Para criar ou trabalhar em traduções de console, você precisa das ferramentas xgettext, msgfmt e msgmerge do <a href="http://www.gnu.org/software/gettext/">pacote GNU gettext</a>.
tr: Pano çevirileri oluşturmak veya bunlar üzerinde çalışmak için <a href="http://www.gnu.org/software/gettext/">GNU gettext paketindeki</a> gettext, msgfmt ve msgmerge araçlarına gerek duyacaksınız.

source: For development on new applications, see the <a href="%(apps)s">application development guide</a>.
pt_br: Para desenvolvimento de novos aplicativos, consulte o <a href="%(apps)s">guia de desenvolvimento de aplicativos</a>.
tr: Yeni uygulamalar geliştirmek hakkında bilgiler için <a href="%(apps)s">uygulama geliştirme rehberine</a> bakabilirsiniz.

source: See <a href="http://%(zzz)s/forums/3">zzz's TODO lists</a>, <a href="%(todo)s">this website's TODO list</a> or <a href="%(trac)s">Trac</a> for ideas.
pt_br: Veja as listas de tarefas do <a href="http://%(zzz)s/forums/3">zzz</a>, <a href="%(todo)s">a lista de tarefas deste site</a> ou <a href="%(trac)s">Trac</a> para ideias.
tr: Fikir almak için <a href="http://%(zzz)s/forums/3">zzz YAPILACAKLAR listelerine</a>, <a href="%(todo)s">bu sitenin YAPILACAKLAR listesine</a> ya da <a href="%(trac)s">3Trac</a> sitesine bakabilirsiniz.

source: See the bottom of <a href="%(licenses)s#commit">the licenses page</a> for commit privilege requirements. You need these to put code into i2p.i2p (not required for the website!).
pt_br: Veja a parte inferior da <a href="%(licenses)s#commit">página de licenças</a> para requisitos de privilégio de commit. Você precisa deles para colocar código em i2p.i2p (não é necessário para o site!).
tr: Gönderim yetkisi gereksinimleri için <a href="%(licenses)s#commit">lisanslar sayfasının</a> alt tarafına bakın. i2p.i2p üzerine kod eklemek için bunlara gerek duyacaksınız (site için gerekmez!).

source: The developers hang around on IRC. They can be reached on the Freenode network, OFTC, and on the I2P internal networks. The usual place to look is #i2p-dev. Join the channel and say hi! We also have <a href="%(guidelines)s">additional guidelines for regular developers</a>.
pt_br: Os desenvolvedores ficam no IRC. Eles podem ser encontrados na rede Freenode, OFTC e nas redes internas do I2P. O lugar habitual para procurar é #i2p-dev. Entre no canal e diga oi! Também temos <a href="%(guidelines)s">diretrizes adicionais para desenvolvedores regulares</a>.
tr: Geliştiriciler IRC üzerinde bulunur. Onlara Freenode ağı, OFTC ve I2P iç ağları üzerinden ulaşılabilir. #i2p-dev kanalına bakın. Kanala katılın ve merhaba deyin! Ayrıca normal geliştiriciler için <a href="%(guidelines)s">ek yönergelerimiz de var</a>.

source: Website and router console translators: See the <a href="%(newtrans)s">New Translator's Guide</a> for next steps.
pt_br: Tradutores do painel do roteador e do site na web: Deem uma olhada em <a href="%(newtrans)s">Guia para novos tradutores</a> para os próximos passos.
tr: Site ve yöneltici panosu çevirmenleri: Sonraki adımlar için <a href="%(newtrans)s">yeni çevirmen rehberine</a> bakın.

source: I2P is open source software that is mostly developed using open sourced toolkits. The I2P project recently acquired a license for the YourKit Java Profiler. Open source projects are eligible to receive a free license provided that YourKit is referenced on the project web site. Please get in touch if you are interested in profiling the I2P codebase.
pt_br: O I2P é um software de código aberto que é desenvolvido principalmente usando kits de ferramentas de código aberto . O projeto I2P adquiriu recentemente uma licença para o YourKit Java Profiler. Projetos de código aberto são elegíveis para receber uma licença gratuita desde que o YourKit seja referenciado no site do projeto. Entre em contato se você estiver interessado em criar um perfil da base de código do I2P.
tr: I2P, çoğunlukla açık kaynaklı araç setleri kullanılarak geliştirilen açık kaynak kodlu bir yazılımdır. I2P projesi kısa süre önce YourKit Java Profiler için bir lisans aldı. Açık kaynak kodlu projeler, proje sitesinde YourKit atıfında bulunulması koşuluyla ücretsiz lisans almaya hak kazanır. I2P kod tabanının profilini çıkarmakla ilgileniyorsanız lütfen bizimle görüşün.

source: YourKit is kindly supporting open source projects with its full-featured Java Profiler. YourKit, LLC is the creator of innovative and intelligent tools for profiling Java and .NET applications. Take a look at YourKit's leading software products: <a href="%(java)s">YourKit Java Profiler</a> and <a href="%(dotnet)s">YourKit .NET Profiler</a>.
pt_br: YourKit está gentilmente apoiando projetos de código aberto com seu Java Profiler completo. YourKit, LLC é o criador de ferramentas inovadoras e inteligentes para criação de perfil de aplicativos Java e .NET. Dê uma olhada nos principais produtos de software da YourKit: <a href="%(java)s">YourKit Java Profiler</a> e <a href="%(dotnet)s">YourKit .NET Profiler</a>.
tr: YourKit, açık kaynak kodlu projeleri tam özellikli Java Profiler ile destekleme nezaketini gösteriyor. YourKit, LLC, Java ve .NET uygulamalarının profilini çıkarmak için yenilikçi ve akıllı araçların yaratıcısıdır. Önde gelen YourKit yazılım ürünlerine bir göz atın: <a href="%(java)s">YourKit Java Profiler</a> ve <a href="%(dotnet)s">YourKit .NET Profiler</a>.

source: New Translator's Guide
pt_br: Guia para novos tradutores
tr: Yeni çevirmenin rehberi

source: Here's a very quick guide to getting started.
pt_br: Eis aqui um guia rápido pra começar.
tr: İşte hızlıca başlamak için bir rehber.

source: How to Translate the Website
pt_br: Como traduzir o website
tr: Sitesi çevirisi nasıl yapılır

source: Translation of the website is done with .po files. The easiest way by far to translate the website is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
pt_br: A tradução do site é feita com arquivos .po. A maneira mais fácil de traduzir o site é criar uma conta em <a href="%(transifex)s">Transifex</a> e solicitar a entrada em uma equipe de tradução. Alternativamente, pode ser feito "do jeito antigo", conforme descrito abaixo.
tr: Sitenin çevirisi .po dosyaları ile yapılır. Siteyi çevirmenin açık ara en kolay yolu <a href="%(transifex)s">Transifex</a> üzerinde bir hesap açmak ve bir çeviri takımına katılma isteğinde bulunmaktır. Alternatif olarak, aşağıda belirtildiği gibi "eski yöntem" de kullanılabilir.

source: Preparation
pt_br: Elaboração
tr: Hazırlık

source: Come to #i2p-dev on irc and talk to people. Claim the language - To make sure other coworkers don't bump onto the files you are working on, please update the translation status on <a href="%(url)s">this wiki page</a>.
pt_br: Acesse #i2p-dev no irc e converse com as pessoas. Reivindique o idioma - Para garantir que outros colegas de trabalho não esbarrem nos arquivos em que você está trabalhando, atualize o status da tradução <a href="%(url)s">nesta página wiki</a>.
tr: #i2p-dev IRC kanalına gelin ve insanlarla konuşun. Dili sahiplenin - Diğer katılımcıların üzerinde çalıştığınız dosyalar üzerinde çalışmadığından emin olmak için lütfen <a href="%(url)s">bu wiki sayfasındaki</a> çeviri durumunu güncelleyin.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, Including the installation of monotone, checking out i2p.www branch, and generate your own monotone keys. It is not required that you sign a dev agreement.
pt_br: Siga o <a href="%(newdevs)s">novo guia do desenvolvedor</a>, incluindo a instalação do monotone, verificando a ramificação i2p.www e gerando suas próprias chaves monotone. Não é necessário que você assine um contrato de desenvolvimento.
tr: Monotone kurulumu, i2p.www dalına geçme ve kendi monotone anahtarlarınızı oluşturma gibi başlıkları içeren <a href="%(newdevs)s">yeni geliştirici rehberini</a> izleyin. Bir geliştirici sözleşmesi imzalamanız gerekmez.

source: <b>Create files:</b> If the file for your language does not exist yet:
pt_br: <b>Crie arquivos:</b> Se o arquivo para seu idioma ainda não existir:
tr: <b>Dosyaları oluşturun:</b> Diliniz için bir dosya yoksa:

source: Run "<code>./extract-messages.sh</code>" to generate a <code>messages.pot</code> in the base directory. Edit the header of this file, then run "<code>./init-new-po.sh locale</code>" to generate the file <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" this file.
pt_br: Execute "<code>./extract-messages.sh</code>" para gerar um <code>messages.pot</code> no diretório base. Edite o cabeçalho deste arquivo e execute "<code>./init-new-po.sh locale</code>" para gerar o arquivo <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" deste arquivo.
tr: Temel klasörde bir <code>messages.pot</code> dosyası oluşturmak için "<code>./extract-messages.sh</code>" komutunu verin. Bu dosyanın üst bilgilerini düzenleyin, ardından <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code> dosyasını oluşturmak için "<code>./init-new-po.sh locale</code>" komutunu verin. Bu dosya için "<code>mtn add</code>" komutunu verin.

source: Edit <code>i2p2www/pages/global/lang.html</code> and add a line for your language (copy an existing line).
pt_br: Edite <code>i2p2www/pages/global/lang.html</code> e adicione uma linha para seu idioma (copie uma linha existente).
tr: <code>i2p2www/pages/global/lang.html</code> dosyasını düzenleyin ve diliniz için bir satır ekleyin (var olan bir satırı kopyalayın).

source: Add a flag image file to <code>i2p2www/static/images/flags/</code> for the menu (copy from the router).
pt_br: Adicione um arquivo de imagem de bandeira em <code>i2p2www/static/images/flags/</code> para o menu (copie do roteador).
tr: Menü için <code>i2p2www/static/images/flags/</code> klasörüne bir bayrak görseli dosyası ekleyin (yönelticiden kopyalayın).

source: <b>Edit files:</b> Edit <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
pt_br: <b>Editar arquivos:</b> Editar <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. Para trabalhar com arquivos .po de forma eficiente, você pode usar <a href="http://www.poedit.net/download.php">POEdit</a>
tr: <b>Dosyaları düzenleyin:</b> <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code> dosyasını düzenleyin. .po dosyalarıyla verimli bir şekilde çalışmak için <a href="http://www.poedit.net/download.php">POEdit</a> uygulamasını kullanmak isteyebilirsiniz.

source: <b>Check in:</b> "<code>mtn pull</code>", "<code>mtn update</code>". Then check in by "<code>mtn ci -k yourname@mail.i2p file1 file2 ...</code>" This collects the diff info of your changed file into your local repo. Then "<code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code>". This synchronizes your local repo with the repo on the target machine.
pt_br: <b>Check in:</b> "<code>mtn pull</code>", "<code>mtn update</code>". Então check in por "<code>mtn ci -k yourname@mail.i2p file1 file2 ...</code>" Isso coleta as informações de diff do seu arquivo alterado em seu repositório local. Então "<code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code>". Isso sincroniza seu repositório local com o repositório na máquina de destino.
tr: <b>Gönderim:</b> "<code>mtn pull</code>", "<code>mtn update</code>". Ardından "<code>mtn ci -k adınız@mail.i2p dosya1 dosya2 ...</code>" ile gönderim yapın. Böylece, değiştirdiğiniz dosyanın fark bilgileri yerel deponuzda toplanır. Ardından "<code>mtn sync mtn.i2p2.de -k adınız-transport@mail.i2p i2p.i2p</code>" komutunu verin. Bu işlem, yerel deponuzu hedef bilgisayardaki depo ile eşitler.

source: Repeat. Check in often. Don't wait until it is perfect.
pt_br: Repita. Verifique com frequência. Não espere até que esteja perfeito.
tr: Yeniden yapın. Sık sık gönderin. Mükemmel olana kadar beklemeyin.

source: How to Translate the Router Console
pt_br: Como traduzir o painel do roteador
tr: Yöneltici panosu çevirisi nasıl yapılır
