Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: Coding style throughout most of the code is 4-spaces for indentation. Do not use tabs. Do not reformat code. If your IDE or editor wants to reformat everything, get control of it. Yes, we know 4 spaces is a pain, but perhaps you can configure your editor appropriately. In some places, the coding style is different. Use common sense. Emulate the style in the file you are modifying.
pt_br: O estilo de codificação na maior parte do código é de 4 espaços para recuo. Não use tabulações. Não reformate o código. Se seu IDE ou editor quiser reformatar tudo, assuma o controle. Sim, sabemos que 4 espaços são um problema, mas talvez você possa configurar seu editor adequadamente. Em alguns lugares, o estilo de codificação é diferente. Use o bom senso. Emule o estilo no arquivo que você está modificando.
tr: Kodun çoğunda kodlama biçemi olarak, girinti için 4 boşluk kullanılır. Sekmeleri kullanmayın. Kodu yeniden biçimlendirmeyin. IDE veya düzenleyiciniz her şeyi yeniden biçimlendirmek istiyorsa, kontrolü ele alın. 4 boşluğun zahmetli olduğunu biliyoruz, ancak belki düzenleyicinizi uygun şekilde yapılandırabilirsiniz. Bazı yerlerde kodlama biçemi farklıdır. Sağduyulu olun. Üzerinde çalıştığınız dosyamın biçemine uygun davranın.

source: All new public and package-private classes and methods require Javadocs. Add @since release-number. Javadocs for new private methods are desirable.
pt_br: Todas as novas classes e métodos públicos e privados de pacote exigem Javadocs. Adicione @since release-number. Javadocs para novos métodos privados são desejáveis.
tr: Tüm yeni herkese açık ve pakete özel sınıflar ve yöntemler için Javadocs gerekir. @since release-number ekleyin. Yeni özel yöntemler için Javadocs istenir.

source: For any Javadocs added, there must not be any doclint errors or warnings. Run 'ant javadoc' with Oracle Java 14 or higher to check. All params must have @param lines, all non-void methods must have @return lines, all exceptions declared thrown must have @throws lines, and no HTML errors.
pt_br: Para qualquer Javadoc adicionado, não deve haver erros ou avisos de doclint. Execute 'ant javadoc' com Oracle Java 14 ou superior para verificar. Todos os parâmetros devem ter linhas @param, todos os métodos não nulos devem ter linhas @return, todas as exceções declaradas lançadas devem ter linhas @throws e nenhum erro de HTML.
tr: Eklenen herhangi bir Javadocs için, herhangi bir doklint hatası veya uyarısı olmamalıdır. Kontrol etmek için Oracle Java 14 veya üzerinde 'ant javadoc' çalıştırın. Tüm paragraflar @param satırlarına sahip olmalıdır, geçerli olmayan tüm yöntemlerde @return satırları bulunmalıdır. Atılan tüm istisnalarda @throws satırları bulunmalı ve HTML hatası olmamalıdır.

source: Classes in core/ (i2p.jar) and portions of i2ptunnel are part of our official API. There are several out-of-tree plugins and other applications that rely on this API. Be careful not to make any changes that break compatibility. Don't add methods to the API unless they are of general utility. Javadocs for API methods should be clear and complete. If you add or change the API, also update the documentation on the website (i2p.www branch).
pt_br: Classes em core/ (i2p.jar) e partes do i2ptunnel fazem parte da nossa API oficial. Existem vários plugins fora da árvore e outros aplicativos que dependem desta API. Tenha cuidado para não fazer nenhuma alteração que quebre a compatibilidade. Não adicione métodos à API, a menos que sejam de utilidade geral. Javadocs para métodos de API devem ser claros e completos. Se você adicionar ou alterar a API, atualize também a documentação no site (branch i2p.www).
tr: Core/ (i2p.jar) içindeki sınıflar ve i2ptunnel bölümleri resmi API parçasıdır. Bu API yazılımına dayanan birkaç ağaç dışı eklenti ve diğer uygulama vardır. Uyumluluğu bozan herhangi bir değişiklik yapmamaya dikkat edin. Genel kullanıma yönelik olmadıkça API üzerine yöntemler eklemeyin. API yöntemleri için Javadocs açık ve eksiksiz olmalıdır. API üzerinde ekleme veya değişiklik yaparsanız, sitedeki belgeleri de güncelleyin (i2p.www dalı).

source: Tag strings for translation where appropriate, which is true for all UI strings. Don't change existing tagged strings unless really necessary, as it will break existing translations. Do not add or change tagged strings after the "tag freeze" in the release cycle so that translators have a chance to update before the release.
pt_br: Marque strings para tradução quando apropriado, o que é verdade para todas as strings da IU. Não altere strings marcadas existentes, a menos que seja realmente necessário, pois isso quebrará as traduções existentes. Não adicione ou altere strings marcadas após o "congelamento de tags" no ciclo de lançamento para que os tradutores tenham a chance de atualizar antes do lançamento.
tr: Uygun olduğunda çeviri için dizgeleri etiketleyin, tüm kullanıcı arayüzü dizgeleri için geçerlidir. Yapılmış çevirileri bozacağından, gerçekten gerekmedikçe var olan etiketli dizgeleri değiştirmeyin. Yayın döngüsünde "etiket dondurma" işleminden sonra etiketli dizgeleri eklemeyin veya değiştirmeyin, böylece çevirmenler yayından önce çevirileri güncelleyebilir.

source: Use generics and concurrent classes where possible. I2P is a highly multi-threaded application.
pt_br: Use classes genéricas e concorrentes sempre que possível. O I2P é um aplicativo altamente multithread.
tr: Olabiliyorsa genel ve yinelenen sınıflar kullanın. I2P oldukça fazla sayıda arka plan işlemi kullanan bir uygulamadır.

source: Be familiar with common Java pitfalls that are caught by findbugs. Run 'ant findbugs' to learn more.
pt_br: Familiarize-se com as armadilhas comuns do Java detectadas pelos findbugs. Execute 'ant findbugs' para saber mais.
tr: Hata ayıklayıcıların bulduğu yaygın Java tuzaklarına aşina olun. Ayrıntılı bilgi edinmek için 'ant findbugs' çalıştırın.

source: Explicitly convert between primitive types and classes; don't rely on autoboxing/unboxing.
pt_br: Converta explicitamente entre tipos primitivos e classes; não confie em autoboxing/unboxing.
tr: İlkel türler ve sınıflar arasında açıktan dönüştürme; otomatik kutulamaya/kutudan çıkarmaya güvenmeyin.

source: Don't use URL. Use URI.
pt_br: Não use URL. Use URI.
tr: URL kullanmayın URI kullanın.

source: Don't catch Exception. Catch RuntimeException and checked exceptions individually.
pt_br: Não capture Exception. Capture RuntimeException e verifique exceções individualmente.
tr: Exception yakalamayın. RuntimeException ve kontrol edilen istisnaları ayrı ayrı yakalayın.

source: Don't use String.getBytes() without a UTF-8 charset argument. You may also use DataHelper.getUTF8() or DataHelper.getASCII().
pt_br: Não use String.getBytes() sem um argumento UTF-8 charset. Você também pode usar DataHelper.getUTF8() ou DataHelper.getASCII().
tr: UTF-8 karakter kümesi bağımsız değişkeni olmadan String.getBytes() kullanmayın. DataHelper.getUTF8() veya DataHelper.getASCII() kullanabilirsiniz.

source: Always specify a UTF-8 charset when reading or writing files. The DataHelper utilities may be helpful.
pt_br: Sempre especifique um charset UTF-8 ao ler ou escrever arquivos. Os utilitários DataHelper podem ser úteis.
tr: Dosyaları okurken veya yazarken her zaman bir UTF-8 karakter kümesi belirtin. DataHelper araçları yardımcı olabilir.

source: Always specify a locale (for example Locale.US) when using String.toLowerCase() or String.toUpperCase(). Do not use String.equalsIgnoreCase(), as a locale cannot be specified.
pt_br: Sempre especifique um local (por exemplo, Locale.US) ao usar String.toLowerCase() ou String.toUpperCase(). Não use String.equalsIgnoreCase(), pois um local não pode ser especificado.
tr: String.toLowerCase() veya String.toUpperCase() kullanırken her zaman bir yerel ayar (Locale.US gibi) belirtin. Bir yerel ayar belirlenemediğinde String.equalsIgnoreCase() kullanmayın.

source: Don't use String.split(). Use DataHelper.split().
pt_br: Não use String.split(). Use DataHelper.split().
tr: String.split() kullanmayın. DataHelper.split() kullanın.

source: Ensure that InputStreams and OutputStreams are closed in finally blocks.
pt_br: Certifique-se de que InputStreams e OutputStreams sejam fechados em blocos finally.
tr: InputStreams ve OutputStreams için son bloklarda kapalı olduğundan emin olun.

source: Use {} for all for and while blocks, even if only one line. If you use {} for either the if, else, or if-else block, use it for all blocks. Put "} else {" on a single line.
pt_br: Use {} para todos os blocos for e while, mesmo que seja apenas uma linha. Se você usar {} para o bloco if, else ou if-else, use-o para todos os blocos. Coloque "} else {" em uma única linha.
tr: Yalnızca bir satır bile olsa tüm for ve while blokları için {} kullanın. if, else veya if-else bloğu için {} kullanırsanız, tüm bloklar için kullanın. Tek bir satıra "} else {" koyun.

source: Specify fields as final wherever possible.
pt_br: Defina os campos como finais sempre que possível.
tr: Alanları olabildiğince sonda belirtin.

source: Don't store I2PAppContext, RouterContext, Log, or any other references to router or context items in static fields.
pt_br: Não armazene I2PAppContext, RouterContext, Log ou quaisquer outras referências a itens de roteador ou contexto em campos estáticos.
tr: Durağan alanlarda, I2PPAppContext, RouterContext, Log veya yöneltici veya bağlam ögelerine yapılan diğer referansları saklamayın.

source: Don't start threads in constructors. Use I2PAppThread instead of Thread.
pt_br: Não inicie threads em construtores. Use I2PAppThread em vez de Thread.
tr: Yapımcılarda arka plan işlemleri başlatmayın. Thread yerine I2PAppThread kullanın.

source: Logging
pt_br: Registo de Eventos
tr: Günlük kaydı

source: Licenses
pt_br: Licenças
tr: Lisanslar

source: Only check in code that you wrote yourself. Before checking in any code or library jars from other sources, justify why it is necessary, verify the license is compatible, and obtain approval from the lead developer.
pt_br: Verifique apenas o código que você escreveu. Antes de verificar qualquer código ou jars de biblioteca de outras fontes, justifique por que é necessário, verifique se a licença é compatível, e obtenha a aprovação do desenvolvedor líder.
tr: Yalnızca kendi yazdığınız kodu gönderin. Diğer kaynaklardan herhangi bir kod veya kitaplık jar dosyası göndermeden önce, neden gerekli olduğunu gerekçelendirin, lisansın uyumlu olduğunu doğrulayın, ve baş geliştiriciden onay alın.

source: If you do obtain approval to add external code or jars, and binaries are available in any Debian or Ubuntu package, you must implement build and packaging options to use the external package instead. Checklist of files to modify:
pt_br: Se você obtiver aprovação para adicionar código externo ou jars, e binários estão disponíveis em qualquer pacote Debian ou Ubuntu, você deve implementar opções de compilação e empacotamento para usar o pacote externo. Lista de verificação de arquivos para modificar:
tr: Dış kod veya jar dosyası eklemek için onay alırsanız, ve binary dosyalar herhangi bir Debian veya Ubuntu paketinde varsa, dış paketi kullanmak için derleme ve paketleme seçeneklerini uygulamanız gerekir. Değiştirilecek dosyaların kontrol listesi:

source: For any images checked in from external sources, it is your responsibility to first verify the license is compatible. Include the license and source information in the checkin comment.
pt_br: Para quaisquer imagens retiradas de fontes externas, é sua responsabilidade primeiro verificar se a licença é compatível. Inclua as informações da licença e da fonte no comentário de check-in.
tr: Dış kaynaklardan gönderilen tüm görseller için, öncelikle lisansın uyumlu olduğunu doğrulamak sizin sorumluluğunuzdadır. Gönderme açıklamasına lisans ve kaynak bilgilerini ekleyin.

source: Bugs
pt_br: Falhas
tr: Hatalar

source: Managing Trac tickets is everybody's job, please help. Monitor %(trac)s for tickets you have been assigned or can help with. Assign, categorize, comment on, fix, or close tickets if you can.
pt_br: Gerenciar tickets do Trac é tarefa de todos, por favor ajude. Monitore %(trac)s os tickets que lhe foram atribuídos ou com os quais você pode ajudar. Atribua, categorize, comente, corrija ou feche tickets, se possível.
tr: Trac kayıtlarını yönetmek herkesin işidir, lütfen yardım edin. Atandığınız veya yardımcı olabileceğiniz kayıtlar için %(trac)s izleyin. Yapabiliyorsanız kayıtları atayın, kategorilere ayırın, yorum yapın, düzeltin veya kapatın.

source: New developers should start by fixing a bug. Search for bugs with the 'easy' keyword on trac. When you have a fix, attach your patch to the ticket and add the keyword 'review-needed'. Do not close the ticket until it's been successfully reviewed and you've checked your changes in. Once you've done this smoothly for a couple of tickets, you may follow the normal procedure below.
pt_br: Novos desenvolvedores devem começar corrigindo um bug. Procure por bugs com a palavra-chave "easy" no trac. Quando tiver uma correção, anexe seu patch ao ticket e adicione a palavra-chave "review-needed". Não feche o ticket até que ele tenha sido revisado com sucesso e você tenha verificado suas alterações. Depois de fazer isso sem problemas para alguns tickets, você pode seguir o procedimento normal abaixo.
tr: Yeni geliştiriciler bir hatayı düzelterek başlamalıdır. trac üzerinde 'easy' anahtar sözcüğüyle hataları arayın. Bir düzeltme yaptığınızda, yamanızı kayıda ekleyin ve 'review-needed' anahtar sözcüğünü ekleyin. Tam olarak incelenene ve değişiklikleriniz gönderilene kadar kaydı kapatmayın. Birkaç kayıt için bu işlemi sorunsuz olarak tamamladıktan sonra, aşağıdaki normal süreci izleyebilirsiniz.

source: Close a ticket when you think you've fixed it. We don't have a test department to verify and close tickets. If you arent sure you fixed it, close it and add a note saying "I think I fixed it, please test and reopen if it's still broken". Add a comment with the dev build number or revision and set the milestone to the next release.
pt_br: Feche um tíquete quando achar que o corrigiu. Não temos um departamento de testes para verificar e fechar tíquetes. Se não tiver certeza de que corrigiu, feche-o e adicione uma nota dizendo "Acho que corrigi, teste e reabra se ainda estiver quebrado". Adicione um comentário com o número da compilação de desenvolvimento ou revisão e defina o marco para o próximo lançamento.
tr: Düzelttiğinizi düşündüğünüzde bir kaydı kapatın. Kayıtları doğrulamak ve kapatmak için bir deneme ekibimiz yok. Düzelttiğinizden emin değilseniz, kapatın ve şunu notu ekleyin. "I think I fixed it, please test and reopen if it's still broken". Geliştirme yapı numarası veya revizyon numarasını yorum olarak ekleyin ve sonraki sürüm için kilometre taşını ayarlayın.

source: Using an IDE with I2P
pt_br: Programar para a I2P usando um IDE
tr: I2P ile bir IDE kullanmak

source: The main I2P development branch (<code>i2p.i2p</code>) has been set up to enable developers to easily set up two of the commonly-used IDEs for Java development: Eclipse and NetBeans.
pt_br: O principal ramo do desenvolvimento da I2P (<code>i2p.i2p</code>) foi configurado para permitir que os desenvolvedores facilmente configurem os dois IDEs mais usados no desenvolvimento em Java: o Eclipse e o NetBeans.
tr: Ana I2P geliştirme dalı (<code>i2p.i2p</code>), geliştiricilerin Java geliştirme için yaygın olarak kullandığı iki IDE uygulamasını kolayca kurmasını sağlamak için kurulmuştur: Eclipse ve NetBeans.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain build.gradle to enable the branch to be easily set up in Eclipse.
pt_br: Os principais ramos de desenvolvimento do I2P (<code>i2p.i2p</code> e ramos dele) contêm build.gradle para permitir que o ramo seja facilmente configurado no Eclipse.
tr: Ana I2P geliştirme dallarında (<code>i2p.i2p</code> ve ondan ayrılan dallar), dalın Eclipse üzerinde kolayca kurulmasını sağlamak için build.gradle bulunur.

source: Make sure you have a recent version of Eclipse. Anything newer than 2017 should do.
pt_br: Certifique-se de ter uma versão recente do Eclipse. Qualquer versão mais nova que 2017 deve servir.
tr: Güncel Eclipse sürümüne sahip olduğunuzdan emin olun. 2017 sonrası sürümler işinizi görmeli.

source: Check out the I2P branch into some directory (e.g. <code>$HOME/dev/i2p.i2p</code>).
pt_br: Verifique a ramificação I2P em algum diretório (por exemplo, <code>$HOME/dev/i2p.i2p</code>).
tr: I2P dalını bir klasöre yönlendirin (<code>$HOME/dev/i2p.i2p</code> gibi).

source: Select "File - Import..." and then under "Gradle" select "Existing Gradle Project".
pt_br: Selecione "Arquivo - Importar..." e então em "Gradle" selecione "Projeto Gradle Existente".
tr: "Dosya - İçe aktar..." komutunu seçin ve ardından "Gradle" altından "Existing Gradle Project" seçin.

source: For "Project root directory:" choose the directory that the I2P branch was checked out to.
pt_br: Para "Diretório raiz do projeto:", escolha o diretório onde a ramificação I2P foi verificada.
tr: "Project root directory:" olarak I2P dalının teslim alındığı klasörü seçin.

source: In the "Import Options" dialog, select "Gradle Wrapper" and press continue.
pt_br: Na caixa de diálogo "Opções de importação", selecione "Gradle Wrapper" e pressione continuar.
tr: "Import Options" bölümünde, "Gradle Wrapper" ögesini seçin ve ilerle üzerine tıklayın.

source: In the "Import Preview" dialog you can review the project structure. Multiple projects should appear under "i2p.i2p". Press "Finish."
pt_br: Na caixa de diálogo "Import Preview", você pode revisar a estrutura do projeto. Vários projetos devem aparecer em "i2p.i2p". Pressione "Finish".
tr: "Import Preview" bölümünde proje yapısını inceleyebilirsiniz. "i2p.i2p" altında birden fazla proje görünmelidir. "Finis" üzerine tıklayın.

source: Done! Your workspace should now contain all projects within the I2P branch, and their build dependencies should be correctly set up.
pt_br: Pronto! Seu workspace agora deve conter todos os projetos dentro do branch I2P, e suas dependências de build devem estar configuradas corretamente.
tr: Tamamdır! Çalışma alanınız artık I2P dalındaki tüm projeleri içermeli ve bunların derleme bağımlılıkları doğru şekilde ayarlanmış olmalıdır.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain NetBeans project files.
pt_br: Os principais ramos do desenvolvimento da I2P (<code>i2p.i2p</code> e derivados) contém arquivos de projeto do NetBeans.
tr: Ana I2P geliştirme dallarında (<code>i2p.i2p</code> ve ondan ayrılan dallar), NetBeans proje dosyaları bulunur.

source: Monotone Guide
pt_br: Guia do Monotone
tr: Monotone rehberi

source: Operating a Monotone client
pt_br: Operando um cliente do Monotone
tr: Bir Monotone istemcisi işletmek

source: Generating Monotone keys
pt_br: Gerando as chaves do Monotone
tr: Monotone anahtarları üretmek

source: Trust and initializing your repository
pt_br: Confie e inicialize seu repositório
tr: Güven ve deponuzu hazırlamak

source: Obtaining and deploying developers' keys
pt_br: Obtendo e empregando as chaves dos desenvolvedores
tr: Geliştirici anahtarlarını edinmek ve dağıtmak

source: Setting up trust evaluation hooks
pt_br: Configurando ganchos de avaliação de confiança
tr: Güven değerlendirme bağlantılarını kurmak

source: Pulling the <code>i2p.i2p</code>, <code>i2p.www</code> and <code>i2p.syndie</code> branches
pt_br: Puxando os ramos <code>i2p.i2p</code>, <code>i2p.www</code> e <code>i2p.syndie</code>
tr: <code>i2p.i2p</code>, <code>i2p.www</code> ve <code>i2p.syndie</code> dallarını çekmek

source: Verifying that trust evaluation works
pt_br: Verificando se a avaliação de confiança funciona
tr: Güven değerlendirmesinin işe yaradığını doğrulamak

source: Checking out a working copy of the latest version
pt_br: Verificando uma cópia de trabalho da versão mais recente
tr: Son sürümün çalışan bir kopyasına geçmek

source: Updating your working copy to the latest version
pt_br: Atualizando sua cópia de trabalho para a versão mais recente
tr: Çalışan kopyanızı son sürüme güncellemek

source: Operating a Monotone Server
pt_br: Operando um servidor do Monotone
tr: Bir Monotone sunucusu işletmek

source: Obtaining and deploying developers’ transport keys
pt_br: Obtendo e implantando chaves de transporte de desenvolvedores
tr: Geliştirici taşıyıcı anahtarlarını edinmek ve dağıtmak

source: Granting push and pull access
pt_br: Concedendo acesso push e pull
tr: Çekme ve itme erişimi izinlerini vermek

source: Running Monotone in server mode
pt_br: Executando o Monotone no modo servidor
tr: Monotone uygulamasını sunucu kipinde çalıştırmak

source: Differences under Debian GNU/Linux
pt_br: Diferenças sob o Debian GNU/Linux
tr: Debian GNU/Linux altındaki farklılıklar

source: This is a revised version of <a href="%(transitionguide)s">Complication's original guide</a> detailing the use of Monotone in I2P development. For basic instructions see the <a href="%(newdevs)s">quick-start guide</a>.
pt_br: Esta é uma versão revisada do guia original <a href="%(transitionguide)s">Complication </a> detalhando o uso do Monotone no desenvolvimento I2P. Para instruções básicas, consulte o <a href="%(newdevs)s">guia de início rápido</a>.
tr: I2P geliştirmede Monotone kullanımının ayrıntılarını açıklayan ve <a href="%(transitionguide)s">Complication tarafından hazırlanmış özgün rehber</a> gözden geçirilmiş olarak sunulmaktadır. Temel yönergeler için <a href="%(newdevs)s">hızlı başlangıç rehberine</a> bakabilirsiniz.

source: I2P has a distributed development model. The source code is replicated across independently administered <a href="http://www.monotone.ca/">Monotone</a> ("MTN") repositories. Developers with commit rights are able to push their changes to the repository (a <a href="%(licenses)s#commit">license agreement</a> needs to be signed before commit rights are granted).
pt_br: O I2P tem um modelo de desenvolvimento distribuído. O código-fonte é replicado em repositórios administrados de forma independente <a href="http://www.monotone.ca/">Monotone</a> ("MTN"). Desenvolvedores com direitos de commit podem enviar suas alterações para o repositório (um <a href="%(licenses)s#commit">contrato de licença</a> precisa ser assinado antes que os direitos de commit sejam concedidos).
tr: I2P dağıtılmış bir geliştirme modeli kullanır. Kaynak kodu, bağımsız olarak yönetilen <a href="http://www.monotone.ca/">Monotone</a> ("MTN") depolarına kopyalanmıştır. Kod gönderme hakkı olan geliştiriciler, değişikliklerini depoya itebilir (gönderme hakkı verilmeden önce bir <a href="%(licenses)s#commit">lisans anlaşması</a> imzalanmalıdır).

source: Some of Monotone's noteworthy qualities are: distributed version control, cryptographic authentication, access control, its small size, having few dependencies, storage of projects in a compressed SQLite database file, and having the ability to resume interrupted synchronization attempts.
pt_br: Algumas das qualidades notáveis do Monotone são: controle de versão distribuído , autenticação criptográfica, controle de acesso, seu tamanho pequeno, tendo poucas dependências, armazenamento de projetos em um arquivo de banco de dados SQLite compactado e tendo a capacidade de retomar tentativas de sincronização interrompidas.
tr: Dikkate değer Monotone özelliklerinden bazıları şunlardır: Dağıtılmış sürüm denetimi, şifreli kimlik doğrulama, erişim denetimi, küçük boyutu, az sayıda bağımlılığı olması, projeleri sıkıştırılmış bir SQLite veri tabanı dosyasında depolaması ve kesintiye uğramış eşitleme girişimlerini sürdürme yeteneğinin olması.

source: Operating a Monotone Client
pt_br: Operando um cliente Monotone
tr: Bir Monotone istemcisi işletmek
