Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: Get Involved
pt_br: Envolva-se
tr: Katkıda bulunun

source: There are many ways you can help I2P.
pt_br: Você pode ajudar o I2P de várias formas.
tr: I2P projesine çeşitli şekillerde katkıda bulunabilirsiniz.

source: Grow the Community
pt_br: Aumente a Comunidade
tr: Topluluğu büyütün

source: Support I2P Core Development
pt_br: Suporte ao desenvolvimento do núcleo I2P
tr: I2P çekirdek geliştirmesini destekleyin

source: The project hosts meetings on the first Tuesday of every month that are open to the community. This is a great opportunity to see what is happening with I2P core development and familiarize yourself with Roadmap tasks. Additionally, protocol development meetings take place every Tuesday and zzz's development forum is available all of the time as a place to participate in development and issues that need fixing. See the new developer's guide for how to get started.
pt_br: O projeto organiza reuniões na primeira terça-feira de cada mês que são abertas à comunidade. Esta é uma ótima oportunidade para ver o que está acontecendo com o desenvolvimento do núcleo I2P e se familiarizar com as tarefas do Roadmap. Além disso, as reuniões de desenvolvimento de protocolo acontecem toda terça-feira e o fórum de desenvolvimento do zzz está disponível o tempo todo como um lugar para participar do desenvolvimento e dos problemas que precisam ser corrigidos. Veja o novo guia do desenvolvedor para saber como começar.
tr: Projede, her ayın ilk Salı günü topluluğa açık toplantılar yapılır. Bu toplantılar, I2P çekirdek geliştirmesinde neler olduğunu görmek ve yol haritasındaki görevleri anlamak için harika bir fırsattır. Ek olarak, her Salı günü iletişim kuralı geliştirme toplantıları yapılır ve zzz'nin geliştirme forumu, geliştirilmesi ve düzeltilmesi gereken konulara katılmak için her zaman kullanılabilir. Nasıl başlayacağınızı öğrenmek için yeni geliştirici rehberine bakabilirsiniz.

source: Spread the Word.
pt_br: Espalhe a palavra.
tr: Dünyaya yayılmamıza yardımcı olun.

source: Tell people about I2P on forums, blogs, and comments to articles. Fix up the <a href="https://wikipedia.org/wiki/I2P">Wikipedia article about I2P in your language</a>. Tell your friends, and more importantly, use I2P to communicate with your friends. We have many tools that can help you keep your private conversations private.
pt_br: Conte às pessoas sobre o I2P em fóruns, blogs e comentários de artigos. Corrija o artigo da Wikipedia <a href="https://wikipedia.org/wiki/I2P">sobre o I2P no seu idioma</a>. Conte aos seus amigos e, mais importante, use o I2P para se comunicar com seus amigos. Temos muitas ferramentas que podem ajudar você a manter suas conversas privadas privadas.
tr: Forumlarda, bloglarda ve makalelere yapılan yorumlarda insanlara I2P hakkında bilgi verin. I2P hakkındaki <a href="https://wikipedia.org/wiki/I2P">Wikipedia makalesini kendi dilinizde düzeltin</a>. Arkadaşlarınıza söyleyin ve daha da önemlisi arkadaşlarınızla iletişim kurmak için I2P kullanın. Özel konuşmalarınızı gizli tutmanızı sağlayacak birçok araç geliştirdik.

source: Translation and Documentation
pt_br: Tradução e Documentação
tr: Çeviri ve belgelendirmeye destek olun

source: Help translate the website and the software into your language. Translators are a very important part of this decentralized project and your work is always appreciated. See the new translator's guide for details. The project also welcomes support to help keep its documentation updated. See the <a href="%(newtrans)s">new translator's guide</a> for details.
pt_br: Ajude a traduzir este website e o software para o seu idioma. Tradutores são uma parte muito importante deste projeto descentralizado e seu trabalho é sempre bem-vindo. Veja o guia para novos tradutores para mais detalhes. Também é bem-vindo ao projeto apoio para manter sua documentação atualizada. Veja o <a href="%(newtrans)s">guia para novos tradutores</a> para mais detalhes.
tr: Site ve yazılımın kendi dilinize çevrilmesine yardımcı olun. Çevirmenler bu merkezi olmayan projenin çok önemli bir parçasıdır ve çalışmaları her zaman takdir edilmektedir. Bu proje, ayrıca belgelerinin güncel tutulmasını sağlayacak desteği de memnuniyetle karşılar. Ayrıntılı bilgi almak için <a href="%(newtrans)s">yeni çevirmen rehberine</a> bakabilirsiniz.

source: Host Services for Yourself and Others
pt_br: Hospede Seviços para Você e Outros
tr: Kendiniz ve başkaları için hizmetler sunun

source: Services
pt_br: Serviços
tr: Hizmetler

source: Self-hosting almost anything, from an SSH server for yourself to an ActivityPub forum for everyone and anything in between, is helpful to the I2P network, especially if you write down instructions for others. Almost anything you can think of can be made to work with I2P, and your service is valuable to the network.
pt_br: Hospedagem própria de quase qualquer coisa, desde um servidor SSH para você mesmo até um fórum ActivityPub para todo mundo, e qualquer coisa entre esses dois extremos, é de ajuda para a rede I2P, especialmente se você escrever instruções para os outros. Quase tudo em que você puder pensar pode ser feito funcionar com o I2P, e o seu serviço é de valor para a rede.
tr: Kendiniz için bir SSH sunucusundan herkes için bir ActivityPub forumuna kadar hemen hemen her şeyi kendiniz barındırabilirsiniz. Özellikle başkaları için yönergeler yazarsanız, I2P ağı için yararı çok olur. Aklınıza gelebilecek hemen hemen her şey I2P ile çalıştırılabilir ve sunacağınız hizmetler ağ için değerlidir.

source: Reseeding
pt_br: Repropagando
tr: Yeniden tohumlama

source: Getting new users onto the network is a very important task, and that task is handled by our reseed servers. The more reseed servers we have, the more de-centralized and redundant our infrastructure is. It's a big responsibility, but it's pretty easy to set up a reseed server for new routers to bootstrap from. Detailed instructions are on our <a href="%(reseed)s">reseed server page</a>.
pt_br: Colocar novos usuários na rede é uma tarefa muito importante, e essa tarefa é tratada por nossos servidores de reseed. Quanto mais servidores de reseed tivermos, mais descentralizada e redundante será nossa infraestrutura. É uma grande responsabilidade, mas é bem fácil configurar um servidor de reseed para novos roteadores inicializarem. Instruções detalhadas estão em nossa página do servidor de reseed <a href="%(reseed)s"></a>.
tr: Ağa yeni kullanıcılar katmak çok önemli bir görevdir ve bu görev yeniden tohumlama sunucularımız tarafından gerçekleştirilir. Ne kadar çok yeniden tohumlama sunucumuz olursa, altyapımız o kadar merkezi olmayan şekilde ve yedekli olur. Bu büyük bir sorumluluktur, ancak yeni yönelticilerin önyükleme yapması için bir yeniden tohumlama sunucusu kurmak oldukça kolaydır. Ayrıntılı yönergeleri <a href="%(reseed)s">yeniden tohumlama sunucusu sayfamızda</a> bulabilirsiniz.

source: Develop and Test Software
pt_br: Desenvolver e testar software
tr: Yazılımı geliştirme ve deneme

source: Applications
pt_br: Aplicativos
tr: Uygulamalar

source: Write or port applications for I2P. There's some guidelines and a list of ideas on the <a href="%(apps)s">applications page</a>.
pt_br: Desenvolva ou porte aplicações para o I2P. Há algumas diretivas e uma lista de ideias na <a href="%(apps)s">página de aplicações</a>.
tr: I2P uygulamalarını geliştirin ya da başka platformlara taşıyın. <a href="%(apps)s">Uygulamalar sayfasında</a> bazı yönergeleri ve fikirlerin listesini bulabilirsiniz.

source: Coding
pt_br: Programando
tr: Kodlama

source: There's plenty to do if you know Java or are ready to learn. Check for open tickets on <a href="http://%(trac)s/report/1">Trac</a> or the TODO list on <a href="http://%(zzz)s">%(zzz)s</a> for some ideas on where to start. See the <a href="%(newdevs)s">new developer's guide</a> for details.
pt_br: Há bastante para fazer se você sabe Java ou está pronto para aprender. Verifique tickets abertos em <a href="http://%(trac)s/report/1">Trac</a> ou na lista "TODO" em <a href="http://%(zzz)s">%(zzz)s</a> para algumas ideias de por onde começar. Veja o <a href="%(newdevs)s">guia para novos desenvolvedores</a> para mais detalhes.
tr: Java biliyorsanız veya öğrenmeye hazırsanız yapacak çok şey var. Nereden başlayacağınıza karar vermenize yardımcı olabilecek bazı fikirler için <a href="http://%(trac)s/report/1">Trac</a> üzerindeki açık kayıtlara ya da <a href="http://%(zzz)s">%(zzz)s</a> YAPILACAKLAR listesine bakabilirsiniz. Ayrıntılı bilgi almak için <a href="%(newdevs)s">yeni geliştirici rehberine</a> bakabilirsiniz.

source: Analysis
pt_br: Análise
tr: İnceleme

source: Study or test the code to look for vulnerabilities. Both anonymity vulnerabilities from the various <a href="%(threatmodel)s">threat models</a>, and DOS and other weaknesses due to security holes, benefit from ongoing research.
pt_br: Estude ou teste o código para buscar por vulnerabilidades. Tanto vulnerabilidades de anonimato quanto dos vários <a href="%(threatmodel)s">modelos de ameaça</a>, e ataques de negação de serviço (DOS) e outros fraquezas em decorrência de falhas de segurança, são beneficiadas por pesquisa em andamento.
tr: Güvenlik açıklarını bulmak için kodu inceleyin veya sınayın. Çeşitli <a href="%(threatmodel)s">tehdit modellerindeki</a> anonimlik güvenlik açıkları ile güvenlik açıklarından kaynaklanan DOS ve diğer zayıflıklar, sürdürülen araştırmalar sayesinde kapatılır.

source: When you're ready, join us on our Gitlab
pt_br: Quando você estiver pronto, junte-se a nós em nosso Gitlab
tr: Hazır olduğunuzda GitLab üzerinde bize katılın

source: Inside I2P - (http://git.idk.i2p)
pt_br: Dentro do I2P - (http://git.idk.i2p)
tr: I2P ağı içinden - (http://git.idk.i2p)

source: Outside I2P - (https://i2pgit.org)
pt_br: Fora do I2P - (https://i2pgit.org)
tr: I2P ağı dışından - (https://i2pgit.org)

source: Roadmap
pt_br: Plano de ação
tr: Yol haritası

source: Looking for older releases? Check the roadmap archive by following this link.
pt_br: Buscando versões mais antigas? Verifique o arquivo do plano de ação acessando este link.
tr: Eski sürümleri mi arıyorsunuz? Bu bağlantıyı kullanarak yol haritası arşivine bakabilirsiniz.

source: I2P Project Targets
pt_br: Objetivos do Projeto I2P
tr: I2P projesinin hedefleri

source: Core functionality
pt_br: Funcionalidade essencial
tr: Çekirdek işlevsellik

source: NetworkDB and profile tuning and ejection policy for large nets
pt_br: NetworkDB e política de ajuste de perfil e ejeção para grandes redes
tr: Büyük ağlar için ağ veri tabanı ile profil ayarlama ve çıkarma ilkesi

source: Security / anonymity
pt_br: Segurança / anonimato
tr: Güvenlik /anonimlik

source: Full blown n-hop restricted routes with optional trusted links
pt_br: Rotas restritas de n-hop completas com links confiáveis opcionais
tr: İsteğe bağlı güvenilir bağlantılarla tam gelişmiş n-durak kısıtlamalı rotalar

source: Hashcash for routerIdentity, destination, and tunnel request
pt_br: Hashcash para routerIdentity, destino e solicitação de túnel
tr: “Yöneltici kimliği” (RouterIdentity), hedef ve tünel isteği için Hashcash

source: Advanced tunnel operation (batching/mixing/throttling/padding)
pt_br: Operação avançada de túnel (loteamento/mistura/regulagem/preenchimento)
tr: Gelişmiş tünel işlemleri (toplu işlem/karıştırma/kısıtlama/yastıklama)

source: Stop &amp; go mix w/ garlics &amp; tunnels
pt_br: Pare &amp; vá misturar com alhos &amp; túneis
tr: Garlic ve tünelleri karıştırma ile durma ve kalkma

source: Performance
pt_br: Desempenho
tr: Başarım

source: Note: This page is not up-to-date. See <a href="%(roadmap)s">the roadmap</a> for current plans.
pt_br: Nota: Esta página não está atualizada. Ver <a href="%(roadmap)s">o roteiro</a> para os planos atuais.
tr: Not: Bu sayfadaki bilgiler güncel değildir. Geçerli planlar için <a href="%(roadmap)s">yol haritası</a> bölümüne bakabilirsiniz.

source: Below is a more detailed (yet still incomplete) discussion of the major areas of future development on the core I2P network, spanning the plausibly planned releases. This does not include stego transports, porting to wireless devices, or tools to secure the local machine, nor does it include client applications that will be essential in I2P's success. There are probably other things that will come up, especially as I2P gets more peer review, but these are the main 'big things'. See also <a href="%(roadmap)s">the roadmap</a>. Want to help? <a href="%(volunteer)s">Get involved</a>!
pt_br: Abaixo está uma discussão mais detalhada (mas ainda incompleta) das principais áreas de desenvolvimento futuro na rede I2P principal, abrangendo os lançamentos plausivelmente planejados . Isso não inclui transportes stego, portabilidade para dispositivos sem fio, ou ferramentas para proteger a máquina local, nem inclui aplicativos cliente que serão essenciais para o sucesso do I2P. Provavelmente há outras coisas que surgirão, especialmente à medida que o I2P obtém mais revisão por pares, mas essas são as principais 'grandes coisas'. Veja também <a href="%(roadmap)s">o roteiro</a>. Quer ajudar? <a href="%(volunteer)s">Envolva-se</a>!
tr: Aşağıda, çekirdek I2P ağının gelecekteki gelişiminin sürümlere dağıtılmış şekilde ana başlıkları hakkında ayrıntılı (ancak henüz tamamlanmamış) bir tartışma bulunuyor. Bu geliştirmeler, stego taşıyıcılarını, kablosuz aygıtlara taşımayı, yerel bilgisayarı güvenceye alacak araçları ya da I2P başarısı için gereken istemci uygulamalarını içermez. Özellikle I2P eşlerden daha fazla değerlendirme aldıkça ortaya çıkacak başka şeyler de var. Ancak bunlar ana 'büyük şeyler'. Ayrıca <a href="%(roadmap)s">yol haritasına</a> bakabilirsiniz. Yardım etmek ister misiniz? <a href="%(volunteer)s">Katkıda bulunun</a>!

source: Within the current network database and profile management implementation, we have taken the liberty of some practical shortcuts. For instance, we don't have the code to drop peer references from the K-buckets, as we don't have enough peers to even plausibly fill any of them, so instead, we just keep the peers in whatever bucket is appropriate. Another example deals with the peer profiles - the memory required to maintain each peer's profile is small enough that we can keep thousands of full blown profiles in memory without problems. While we have the capacity to use trimmed down profiles (which we can maintain 100s of thousands in memory), we don't have any code to deal with moving a profile from a "minimal profile" to a "full profile", a "full profile" to a "minimal profile", or to simply eject a profile altogether. It just wouldn't be practical to write that code yet, since we aren't going to need it for a while.
pt_br: Dentro da implementação atual de gerenciamento de perfil e banco de dados de rede, tomamos a liberdade de alguns atalhos práticos. Por exemplo, não temos o código para remover referências de pares dos K-buckets, pois não temos pares suficientes para sequer preencher plausivelmente nenhum deles, então, em vez disso, apenas mantemos os pares em qualquer balde que seja apropriado. Outro exemplo lida com os perfis de pares - a memória necessária para manter o perfil de cada par é pequena o suficiente para que possamos manter milhares de perfis completos na memória sem problemas. Embora tenhamos a capacidade de usar perfis reduzidos (que podemos manter centenas de milhares na memória), não temos nenhum código para lidar com a movimentação de um perfil de um "perfil mínimo" para um "perfil completo", um "perfil completo" para um "perfil mínimo" ou para simplesmente ejetar um perfil completamente. Simplesmente não seria prático escrever esse código ainda, já que não vamos precisar dele por um tempo.
tr: Var olan ağ veri tabanı ve profil yönetimi uygulamasında bazı pratik kısayolların özgürlüğünü kullandık. Örneğin, herhangi birini makul bir şekilde doldurmak için yeterli eşimiz olmadığından K-kovalarından eş referansları bırakacak kodumuz yok. Bu yüzden eşleri yalnızca uygun olan kovada tutuyoruz. Başka bir örnek, eş profillerle ilgili. Her bir eşin profilini korumak için gereken bellek çok küçük olduğundan bellekte sorunsuz bir şekilde binlerce tam gelişmiş profili tutabiliriz. Kırpılmış profilleri kullanma kapasitemiz olsa da (böylece 100 binlercesini bellekte tutabiliriz), bir profili bir "minimal profilden" bir "tam profile", bir "tam profilden" bir "minimal profile" taşımakla ya da bir profili tamamen çıkarmakla ilgilenecek bir kodumuz yok. Bir süre buna gerek duymayacağımızdan, bu kodu şimdiden yazmak pratik olmaz.

source: That said, as the network grows we are going to want to keep these considerations in mind. We will have some work to do, but we can put it off for later.
pt_br: Dito isso, conforme a rede cresce, vamos querer manter essas considerações em mente. Teremos algum trabalho a fazer, mas podemos adiá-lo para mais tarde.
tr: Bununla birlikte, ağ büyüdükçe bu konuları gündeme almak isteyeceğiz. Biraz işimiz olacak ama sonraya erteleyebiliriz.

source: The restricted route functionality described before was simply a functional issue - how to let peers who would not otherwise be able to communicate do so. However, the concept of allowing restricted routes includes additional capabilities. For instance, if a router absolutely cannot risk communicating directly with any untrusted peers, they can set up trusted links through those peers, using them to both send and receive all of its messages. Those hidden peers who want to be completely isolated would also refuse to connect to peers who attempt to get them to (as demonstrated by the garlic routing technique outlined before) - they can simply take the garlic clove that has a request for delivery to a particular peer and tunnel route that message out one of the hidden peer's trusted links with instructions to forward it as requested.
pt_br: A funcionalidade de rota restrita descrita antes era simplesmente uma questão funcional - como permitir que pares que de outra forma não seriam capazes de se comunicar o façam. No entanto, o conceito de permitir rotas restritas inclui capacidades adicionais. Por exemplo, se um roteador não pode arriscar se comunicar diretamente com quaisquer pares não confiáveis, ele pode configurar links confiáveis por meio de esses pares, usando-os para enviar e receber todas as suas mensagens. Esses pares ocultos que querem ficar completamente isolados também se recusariam a se conectar aos pares que tentam obtê-los (como demonstrado pela técnica de roteamento de alho descrita anteriormente) - eles podem simplesmente pegar o dente de alho que tem uma solicitação de entrega a um par específico e fazer um túnel dessa mensagem para um dos links confiáveis do par oculto com instruções para encaminhá-la conforme solicitado.
tr: Daha önce açıklanan kısıtlanmış rota işlevi, yalnızca işlevsel bir sorundu. Başka türlü iletişim kuramayacak olan eşlerin bunu yapması nasıl sağlanabilir. Bununla birlikte, kısıtlanmış rotalara izin verme kavramı için ek yetenekler gerekir. Örneğin, bir yöneltici güvenilmeyen eşlerle doğrudan iletişim kurma riskini kesinlikle alamıyorsa, tüm iletilerini hem göndermek hem de almak için bu eşler aracılığıyla güvenilir bağlantılar kurabilir. Tamamen yalıtılmış olmak isteyen gizli eşler, onları elde etmeye çalışan eşlerle bağlantı kurmayı da reddeder (daha önce ana hatları verilen Garlic yöneltme tekniğinin gösterdiği gibi) yalnızca belirli bir eşe teslimat isteği bulunan bir Garlic dişi alarak gizli eşin güvenilir bağlantılarından birini istendiği gibi iletmek için yönergelerle birlikte ileti gönderen tünelin yöneltmesini alabilirler.

source: Within the network, we will want some way to deter people from consuming too many resources or from creating so many peers to mount a <a href="%(link)s">Sybil</a> attack. Traditional techniques such as having a peer see who is requesting a resource or running a peer aren't appropriate for use within I2P, as doing so would compromise the anonymity of the system. Instead, we want to make certain requests "expensive".
pt_br: Dentro da rede, queremos alguma forma de impedir que as pessoas consumam muitos recursos ou criem tantos pares para montar um ataque <a href="%(link)s">Sybil</a> . Técnicas tradicionais como ter um par vendo quem está solicitando um recurso ou executar um par não são apropriadas para uso dentro do I2P, pois fazer isso comprometeria o anonimato do sistema. Em vez disso, queremos tornar certas solicitações "caras".
tr: Ağ içinde, insanların çok fazla kaynak tüketmesini ya da <a href="%(link)s">Sybil</a> saldırısı gerçekleştirmek için çok sayıda eş oluşturmasını engelleyecek bir yol isteyeceğiz. Bir kaynağı kimin istediğini görmek ya da bir eş işletmek gibi geleneksel teknikler, sistemin anonimliğini tehlikeye atacağından I2P içinde kullanmaya uygun değildir. Bunun yerine, belirli istekleri "pahalı" hale getirmek istiyoruz.

source: <a href="http://www.hashcash.org/">Hashcash</a> is one technique that we can use to anonymously increase the "cost" of doing certain activities, such as creating a new router identity (done only once on installation), creating a new destination (done only once when creating a service), or requesting that a peer participate in a tunnel (done often, perhaps 2-300 times per hour). We don't know the "correct" cost of each type of certificate yet, but with some research and experimentation, we could set a base level that is sufficiently expensive while not an excessive burden for people with few resources.
pt_br: <a href="http://www.hashcash.org/">Hashcash</a> é uma técnica que podemos usar para aumentar anonimamente o "custo" de fazer certas atividades, como criar uma nova identidade de roteador (feito apenas uma vez na instalação), criar um novo destino (feito apenas uma vez ao criar um serviço) ou solicitar que um par participe de um túnel (feito frequentemente, talvez 2-300 vezes por hora). Não sabemos o custo "correto" de cada tipo de certificado ainda, mas com alguma pesquisa e experimentação, poderíamos definir um nível base que seja suficientemente caro, mas não um fardo excessivo para pessoas com poucos recursos.
tr: <a href="http://www.hashcash.org/">Hashcash</a>, yeni bir yöneltici kimliği oluşturma (kurulumda yalnızca bir kez yapılır), yeni bir hedef oluşturma (bir hizmet oluşturulurken yalnızca bir kez yapılır) ya da bir akrandan bir tünele katılmasını istemek (belki saatte 200-300 kez yapılır) gibi belirli işlemleri yapmanın "maliyetini" anonim olarak artırmak için kullanabileceğimiz bir tekniktir. Henüz her bir sertifika türünün "doğru" maliyetini bilmiyoruz. Ancak biraz araştırma ve deneyle, az kaynağa sahip insanlar için aşırı bir yük olmasa da yeterince pahalı olan bir temel düzey belirleyebiliriz.

source: There are a few other algorithms that we can explore for making those requests for resources "nonfree", and further research on that front is appropriate.
pt_br: Existem alguns outros algoritmos que podemos explorar para tornar essas solicitações de recursos "não livres", e pesquisas adicionais nessa área são apropriadas.
tr: Kaynaklara yönelik bu istekleri "ücretsiz olmayan" hale getirmek için keşfedebileceğimiz birkaç algoritma daha var ve bu konuda daha fazla araştırma yapılması uygun.
