Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: You can fetch these from an I2P installation, or add the following dependencies from Maven Central:
pt_br: Você pode obtê-los de uma instalação I2P ou adicionar as seguintes dependências do Maven Central:
tr: Bunları bir I2P kurulumundan alabilir veya Maven Central üzerinden aşağıdaki bağımlılıkları ekleyebilirsiniz:

source: Network communication requires the usage of I2P network sockets. To demonstrate this, we will create an application where a client can send text messages to a server, who will print the messages and send them back to the client. In other words, the server will function as an echo.
pt_br: A comunicação de rede requer o uso de soquetes de rede I2P. Para demonstrar isso, criaremos um aplicativo onde um cliente pode enviar mensagens de texto para um servidor, que imprimirá as mensagens e as enviará de volta ao cliente. Em outras palavras, o servidor funcionará como um eco.
tr: Ağ iletişimi için, I2P ağ soketlerinin kullanımı gerekir. Bunu göstermek için, bir istemcinin bir sunucuya metin iletileri gönderebileceği, iletileri yazdıracak ve istemciye geri gönderecek bir uygulama oluşturacağız. Başka bir deyişle, sunucu bir yankı işlevi görecek.

source: We will start by initializing the server application. This requires getting an I2PSocketManager and creating an I2PServerSocket. We will not provide the I2PSocketManagerFactory with the saved keys for an existing Destination, so it will create a new Destination for us. So we will ask the I2PSocketManager for an I2PSession, so we can find out the Destination that was created, as we will need to copy and paste that information later so the client can connect to us.
pt_br: Começaremos inicializando o aplicativo do servidor. Isso requer obter um I2PSocketManager e criar um I2PServerSocket. Não forneceremos ao I2PSocketManagerFactory as chaves salvas para um Destination existente, então ele criará um novo Destination para nós. Então pediremos ao I2PSocketManager uma I2PSession, para que possamos descobrir o Destination que foi criado, pois precisaremos copiar e colar essas informações mais tarde para que o cliente possa se conectar a nós.
tr: Sunucu uygulamasını başlatarak başlayacağız. Bu, bir I2PSocketManager almayı ve bir I2PServerSocket oluşturmayı gerektirir. I2PSocketManagerFactory üzerine var olan bir hedef için kaydedilmiş anahtarları sağlamayacağız, bu nedenle bizim için yeni bir hedef oluşturacak. Oluşturulan hedefi bulabilmemiz için I2PSocketManager üzerinden bir I2PSession isteyeceğiz. Daha sonra istemcinin bizimle bağlantı kurabilmesi için bu bilgileri kopyalayıp yapıştırmamız gerekecek.

source: Code example 1: initializing the server application.
pt_br: Exemplo de código 1: inicializando o aplicativo servidor.
tr: 1. kod örneği: Sunucu uygulamasını başlatma.

source: Once we have an I2PServerSocket, we can create I2PSocket instances to accept connections from clients. In this example, we will create a single I2PSocket instance, that can only handle one client at a time. A real server would have to be able to handle multiple clients. To do this, multiple I2PSocket instances would have to be created, each in separate threads. Once we have created the I2PSocket instance, we read data, print it and send it back to the client. The bold code is the new code we add.
pt_br: Depois que tivermos um I2PServerSocket, podemos criar instâncias I2PSocket para aceitar conexões de clientes. Neste exemplo, criaremos uma única instância I2PSocket, que pode manipular apenas um cliente por vez. Um servidor real teria que ser capaz de manipular vários clientes. Para fazer isso, várias instâncias I2PSocket teriam que ser criadas, cada uma em threads separadas. Depois de criarmos a instância I2PSocket, lemos os dados, imprimimos e os enviamos de volta ao cliente. O código em negrito é o novo código que adicionamos.
tr: Bir I2PServerSocket elde ettiğimizde, istemcilerden geliş bağlantılarını kabul etmek için I2PSocket kopyaları oluşturabiliriz. Bu örnekte, aynı anda yalnızca bir istemciyi işleyebilen tek bir I2PSocket kopyası oluşturacağız. Gerçek bir sunucunun birden fazla istemciyi idare edebilmesi gerekir. Bunu yapmak için, her biri ayrı bir işlem olarak çalışan birden çok I2PSocket kopyasının oluşturulması gerekir. I2PSocket kopyasını oluşturduktan sonra verileri okur, yazdırır ve istemciye geri göndeririz. Eklediğimiz yeni kod kalın yazılmıştır.

source: Code example 2: accepting connections from clients and handling messages.
pt_br: Exemplo de código 2: aceitando conexões de clientes e manuseando mensagens.
tr: 2. kod örneği: İstemcilerden gelen bağlantıları kabul etme ve iletileri işleme.

source: When you run the above server code, it should print something like this (but without the line endings, it should just be one huge block of characters):
pt_br: Quando você executa o código do servidor acima, ele deve imprimir algo como isto (mas sem as terminações de linha, deve ser apenas um enorme bloco de caracteres):
tr: Yukarıdaki sunucu kodunu çalıştırdığınızda, bunun gibi bir şey yazdırmalıdır (ancak satır sonları olmadan, yalnızca büyük bir karakter bloğu olmalıdır):

source: This is the base64-representation of the server Destination. The client will need this string to reach the server.
pt_br: Esta é a representação base64 do servidor Destination. O cliente precisará desta string para alcançar o servidor.
tr: Bu, sunucu hedefinin base64 gösterimidir. İstemci, sunucuya ulaşmak için bu dizgeye gerek duyacaktır.

source: Now, we will create the client application. Again, a number of steps are required for initialization. Again, we will need to start by getting an I2PSocketManager. We won't use an I2PSession and an I2PServerSocket this time. Instead, we will use the server Destination string to start our connection. We will ask the user for the Destination string, and create an I2PSocket using this string. Once we have an I2PSocket, we can start sending and receiving data to and from the server.
pt_br: Agora, criaremos o aplicativo cliente. Novamente, uma série de etapas são necessárias para a inicialização. Novamente, precisaremos começar obtendo um I2PSocketManager. Não usaremos um I2PSession e um I2PServerSocket desta vez. Em vez disso, usaremos a string Destination do servidor para iniciar nossa conexão. Solicitaremos ao usuário a string Destination e criaremos um I2PSocket usando essa string. Assim que tivermos um I2PSocket, podemos começar a enviar e receber dados de e para o servidor.
tr: Şimdi istemci uygulamasını oluşturacağız. Yine, başlatma için birkaç adım gereklidir. Yine, bir I2PSocketManager alarak başlamamız gerekecek. Bu sefer bir I2PSession ve bir I2PServerSocket kullanmayacağız. Bunun yerine, bağlantımızı başlatmak için sunucu hedef dizgesini kullanacağız. Kullanıcıdan hedef dizgesini isteyeceğiz ve bu dizgeyi kullanarak bir I2PSocket oluşturacağız. Bir I2PSocket elde ettiğimizde, sunucuya veri göndermeye ve sunucudan veri almaya başlayabiliriz.

source: Code example 3: starting the client and connecting it to the server application.
pt_br: Exemplo de código 3: inicializando o cliente e conectando-o ao aplicativo servidor.
tr: 3. kod örneği: İstemciyi başlatma ve sunucu uygulaması ile bağlantı kurma.

source: Finally, you can run both the server and the client application. First, start the server application. It will print a Destination string (like shown <a href="#start.streaming.destination">above</a>). Next, start the client application. When it requests a Destination string, you can enter the string printed by the server. The client will then send 'Hello I2P!' (along with a newline) to the server, who will print the message and send it back to the client.
pt_br: Finalmente, você pode executar tanto o servidor quanto o aplicativo cliente. Primeiro, inicie o aplicativo servidor. Ele imprimirá uma sequência de caracteres Destination (como mostrado <a href="#start.streaming.destination">acima</a>). Em seguida, inicie o aplicativo cliente. Quando ele solicitar uma sequência de caracteres Destination, você pode inserir a sequência impressa pelo servidor. O cliente enviará então 'Hello I2P!' (junto com uma nova linha) para o servidor, que imprimirá a mensagem e a enviará de volta para o cliente.
tr: Son olarak, hem sunucuyu hem de istemci uygulamasını çalıştırabilirsiniz. İlk olarak, sunucu uygulamasını başlatın. Bir hedef dizgesi yazdıracaktır (<a href="#start.streaming.destination">yukarıda</a> gösterildiği gibi). Ardından, istemci uygulamasını başlatın. Bir hedef dizgesi istediğinde, sunucu tarafından yazdırılan dizgeyi yazabilirsiniz. Ardından istemci sunucuya 'Hello I2P!' (yeni bir satırla birlikte) iletisini gönderecek ve sunucuda yazdırılan ileti istemciye geri gönderilecek.

source: Congratulations, you have successfully communicated over I2P!
pt_br: Parabéns! Você se comunicou com sucesso através da I2P!
tr: Tebrikler, I2P üzerinden iletişim kurmuş oldunuz!

source: Existing Applications
pt_br: Aplicativos existentes
tr: Uygulamalardan çıkmak

source: Contact us if you would like to contribute.
pt_br: Contacte-nos se você deseja contribuir.
tr: Katkıda bulunmak isterseniz bizimle görüşün.

source: Application Ideas
pt_br: Idéias para aplicativos
tr: Uygulama fikirleri

source: NNTP server - there have been some in the past, none at the moment
pt_br: Servidor NNTP - houve alguns no passado, nenhum no momento
tr: NNTP sunucusu: Geçmişte bazıları vardı, şu anda yok

source: Jabber server - there have been some in the past, and there is one at the moment, with access to the public internet
pt_br: Servidor Jabber - houve alguns no passado e há um no momento, com acesso à Internet pública
tr: Jabber sunucusu: Geçmişte bazıları vardı ve şu anda herkese açık İnternete erişimi olan bir tane var

source: PGP Key server and/or proxy
pt_br: Servidor e/ou proxy de chaves PGP
tr: PGP anahtar sunucusu ve/veya vekil sunucu

source: Content Distribution / DHT applications - resurrect feedspace, port dijjer, look for alternatives
pt_br: Distribuição de conteúdo / aplicações DHT - ressuscitar feedspace, porta dijjer, procurar alternativas
tr: İçerik dağıtımı / "Dağıtılmış karma tablosu" (DHT) uygulamaları: Akış alanını diriltme, bağlantı noktası dijjer, alternatif arama

source: Help out with <a href="http://syndie.i2p2.de/">Syndie</a> development
pt_br: Ajude com o desenvolvimento de <a href="http://syndie.i2p2.de/">Syndie</a>
tr: <a href="http://syndie.i2p2.de/">Syndie</a> geliştirmesine yardım edin

source: Web-based applications - The sky is the limit for hosting web-server-based applications such as blogs, pastebins, storage, tracking, feeds, etc. Any web or CGI technology such as Perl, PHP, Python, or Ruby will work.
pt_br: Aplicações baseadas na Web - O céu é o limite para hospedar aplicações baseadas em servidores Web como blogs, pastebins, armazenamento, rastreamento, feeds, etc. Qualquer tecnologia Web ou CGI como Perl, PHP, Python ou Ruby funcionará.
tr: İnternet tabanlı uygulamalar - bloglar, yapıştırma kutuları, depolama, izleme, akış gibi site sunucusu tabanlı uygulamaları barındırmanın sınırı yoktur. Perl, PHP, Python veya Ruby gibi herhangi bir internet veya CGI teknolojisinin çalışması beklenir.

source: Resurrect some old apps, several previously in the i2p source package - bogobot, pants, proxyscript, q, stasher, socks proxy, i2ping, feedspace
pt_br: Ressuscitar alguns aplicativos antigos, vários anteriormente no pacote de origem i2p - bogobot, pants, proxyscript, q, stasher, socks proxy, i2ping, feedspace
tr: Daha önce i2p kaynak paketinde bulunan bazı eski uygulamaları yeniden canlandırın - bogobot, pantol, proxyscript, q, stasher, çorap proxy, i2ping, feedspace

source: I2P Developer's MTN Keys
pt_br: Chaves MTN dos desenvolvedores da I2P
tr: I2P geliştiricisinin MTN anahtarları

source: Monotone servers used by the I2P project require two types of keys to be used.
pt_br: Os servidores Monotone usados pelo projeto I2P exigem o uso de dois tipos de chaves.
tr: I2P projesi Monotone sunucularının kullanılabilmesi için iki tür anahtar gerekir.

source: <a href="#commit">Commit Keys</a> to sign changes checked-in to the respository; and
pt_br: <a href="#commit">Chaves de confirmação</a> para assinar as alterações registradas no repositório; e
tr: Depoya gönderilen değişiklikleri imzalamak için <a href="#commit">Gönderim anahtarları</a> ve

source: <a href="#transport">Transport Keys</a> to push changes to remote servers.
pt_br: <a href="#transport">Chaves de transporte</a> para enviar alterações para servidores remotos.
tr: Değişiklikleri uzak sunuculara itmek için <a href="#transport">Taşıyıcı anahtarları</a>.

source: Everyone that uses Monotone to checkout the I2P codebase will need to <a href="%(monotone)s#obtaining-and-deploying-developers-keys">import</a> the developer commit keys, but only Monotone <a href="%(monotone)s#operating-a-monotone-server"> server operators</a> will need to import the <a href="#transport">transport keys</a>.
pt_br: Todos que usam o Monotone para verificar a base de código I2P precisarão <a href="%(monotone)s#obtaining-and-deploying-developers-keys">importar</a> as chaves de confirmação do desenvolvedor, mas apenas os operadores de servidor Monotone <a href="%(monotone)s#operating-a-monotone-server"> </a> precisarão importar as <a href="#transport">chaves de transporte</a>.
tr: I2P kod tabanında sürümler arasında geçiş yapmak için Monotone kullanan herkesin geliştiricinin gönderim anahtarlarını <a href="%(monotone)s#obtaining-and-deploying-developers-keys">içe aktarması</a> gerekir, ancak yalnızca Monotone <a href="%(monotone)s#operating-a-monotone-server">sunucu işletmecilerinin</a> ayrıca <a href="#transport">Taşıyıcı anahtarlarını</a> içe aktarması gerekir.

source: Developer Commit keys
pt_br: Chaves de confirmação do desenvolvedor
tr: Geliştirici gönderim anahtarları

source: Developer Transport Keys
pt_br: Chaves de transporte do desenvolvedor
tr: Geliştirici taşıyıcı anahtarları

source: <b>Note:</b> Transport keys are only needed for setting up a <a href="%(monotone)s#operating-a-monotone-server">Monotone server</a>.
pt_br: <b>Observação:</b> Chaves de transporte são necessárias apenas para configurar um <a href="%(monotone)s#operating-a-monotone-server">servidor do Monotone</a>.
tr: <b>Not:</b> Taşıyıcı anahtarları yalnızca <a href="%(monotone)s#operating-a-monotone-server">Monotone sunucusu</a> kurmak için gereklidir.

source: License Agreements
pt_br: Acordos de Licença
tr: Lisans sözleşmeleri

source: For more information see <a href="%(licenses)s">the licenses page</a>.
pt_br: Para mais informações, veja <a href="%(licenses)s">a página de licenças</a>.
tr: Ayrıntılı bilgi almak için <a href="%(licenses)s">lisanslar sayfasına</a> bakabilirsiniz.

source: Following is a monotonerc file defining the current trust list. Developers must use this file in ~/.monotone/monotonerc or _MTN/montonerc in their i2p.i2p workspace.
pt_br: A seguir está um arquivo monotonerc que define a lista de confiança atual. Os desenvolvedores devem usar este arquivo em ~/.monotone/monotonerc ou _MTN/montonerc em seu espaço de trabalho i2p.i2p.
tr: Aşağıda, geçerli güven listesini tanımlayan bir monotonerc dosyası bulunmaktadır. Geliştiriciler bu dosyayı ~/.monotone/monotonerc veya _MTN/montonerc i2p.i2p çalışma alanlarında kullanmalıdır.

source: Agreements
pt_br: Acordos
tr: Sözleşmeler

source: I2P Software Licenses
pt_br: I2P - Licenças de software
tr: I2P yazılım lisansları

source: As required by our <a href="%(threatmodel)s">threat model</a> (among other reasons), the software developed to support the anonymous communication network we call I2P must be freely available, open source, and user modifiable. To meet these criteria, we make use of a variety of legal and software engineering techniques so as to remove as many barriers to entry for those considering making use of or contributing to the I2P effort.
pt_br: Como requerido pelo nosso <a href="%(threatmodel)s">modelo de risco</a> (entre outras razões), o software desenvolvido para dar suporte a rede comunicação anônima que chamamos I2P deve ser disponibilizado gratuitamente, ter código aberto, e poder ser modificado pelo usuário. Para atingir esses critérios, fazemos uso de uma variedade de técnicas jurídicas e de engenharia de software de modo a remover um punhado de barreiras para aqueles que consideram fazer uso de ou contribuir com o esforço de manter a I2P.
tr: <a href="%(threatmodel)s">Tehdit modelimizin</a> gerektirdiği gibi (diğer nedenlerin yanı sıra), I2P dediğimiz anonim iletişim ağını desteklemek için geliştirilen yazılımın ücretsiz olarak erişilebilir, açık kaynak kodlu ve kullanıcı tarafından değiştirilebilir olması gerekir. Bu kriterleri karşılamak amacıyla, I2P çabasını kullanmayı veya katkıda bulunmayı düşünenler için giriş engellerini ortadan kaldıracak çeşitli hukuk ve yazılım mühendisliği tekniklerinden yararlanıyoruz.

source: While the information below may be more confusing than just simply stating "I2P is BSD", "I2P is GPL", or "I2P is public domain", the short answer to the question "How is I2P licensed?" is this:
pt_br: Ainda que as informações abaixo possam ser mais confusas do que apenas dizer "I2P usa a licença BSD", "I2P usa a licença GPL", ou "I2P pertence ao domínio público", a resposta mais breve a questão "Como é licenciado o software I2P?" é a seguinte:
tr: Aşağıdaki bilgiler yalnızca "I2P BSD'dir", "I2P GPL'dir" veya "I2P kamu malıdır" şeklinde ifade etmekten daha kafa karıştırıcı olsa da, "I2P nasıl lisanslanır?" sorusunun kısa yanıtı şöyledir:

source: All software bundled in the I2P distributions will allow:
pt_br: Todo software empacotado numa distribuição I2P permitirá:
tr: I2P dağıtımlarında bulunan tüm yazılımlar şu koşulları sağlar:

source: use without fee
pt_br: o uso sem quaisquer custos
tr: Ücretsiz kullanılır

source: use with no restrictions on how, when, where, why, or by whom is running it
pt_br: o uso irrestrito independentemente de como, onde, porque ou por quem seja executado
tr: Nasıl, ne zaman, nerede, neden veya kimin tarafından çalıştırıldığı konusunda herhangi bir kısıtlama olmaksızın kullanılır

source: access to the source code without fee
pt_br: o acesso ao código-fonte sem quaisquer custos
tr: Kaynak koduna ücretsiz erişilir

source: modifications to the source
pt_br: modificações do código-fonte
tr: Kaynak kodunda değişiklik yapılabilmelidir

source: Most of the software guarantees much more - the ability of <b>anyone</b> to distribute the modified source however they choose. However, not all of the software bundled provides this freedom - the GPL restricts the ability of developers who wish to integrate I2P with their own applications that are not themselves open source applications. While we applaud the noble goals of increasing the resources in the commons, I2P is best served by removing any barriers that stand in the way of its adoption - if a developer considering whether they can integrate I2P with their application has to stop and check with their lawyer, or conduct a code audit to make sure their own source can be released as GPL-compatible, we lose out.
pt_br: A maioria dos softwares garante muito mais - a capacidade de <b>qualquer um</b> de distribuir o código-fonte modificado da forma que escolher. No entanto, nem todos os softwares empacotados oferecem essa liberdade - a GPL restringe a capacidade de desenvolvedores que desejam integrar o I2P com seus próprios aplicativos que não sejam aplicativos de código aberto. Embora aplaudamos os objetivos nobres de aumentar os recursos nos bens comuns, o I2P é melhor atendido pela remoção de quaisquer barreiras que impeçam sua adoção - se um desenvolvedor considerando se pode integrar o I2P com seu aplicativo tiver que parar e verificar com seu advogado, ou conduzir uma auditoria de código para garantir que seu próprio código-fonte possa ser lançado como compatível com GPL, nós perdemos.
tr: Yazılımların çoğu çok daha fazlasını garanti ederek <b>herkese</b> değiştirilmiş kaynağı istediği gibi dağıtma olanağı sunar. Bununla birlikte, paketteki yazılımların tümü bu özgürlüğü sunmaz. GPL, I2P yazılımını açık kaynak kodlu uygulamalar olmayan kendi uygulamalarıyla bütünleştirmek isteyen geliştiricilerin yapabileceklerini kısıtlar. Ortak alanlardaki kaynakları arttırmak gibi asil bir hedefi alkışlıyoruz. Bununla birlikte I2P için en iyi hizmet, benimsenmesinin önündeki engellerin kaldırılmasıyla yapılmış olur. Eğer bir geliştiricinin, I2P yazılımını uygulamalarıyla bütünleştirip bütünleştiremeyeceğini düşünürken kendi kaynaklarının GPL uyumlu olarak yayınlanabileceğinden emin olması için durup avukatıyla görüşmesi ya da bir kod denetimi yapması gerekirse kaybederiz.

source: Component licenses
pt_br: Licenças componentes
tr: Bileşen lisansları

source: The I2P distribution contains several resources, reflecting the partitioning of the source code into components. Each component has its own license, which all developers who contribute to it agree to - either by explicitly declaring the release of code committed under a license compatible with that component, or by implicitly releasing the code committed under the component's primary license. Each of these components has a lead developer who has the final say as to what license is compatible with the component's primary license, and the I2P project manager has the final say as to what licenses meet the above four guarantees for inclusion in the I2P distribution.
pt_br: A distribuição I2P contém vários recursos, refletindo o particionamento de o código-fonte em componentes. Cada componente tem sua própria licença, com a qual todos os desenvolvedores que contribuem para ele concordam - seja declarando explicitamente o lançamento do código comprometido sob uma licença compatível com esse componente, ou implicitamente liberando o código comprometido sob a licença primária do componente. Cada um desses componentes tem um desenvolvedor líder que tem a palavra final sobre qual licença é compatível com a licença primária do componente, e o gerente de projeto I2P tem a palavra final como sobre quais licenças atendem às quatro garantias acima para inclusão na distribuição I2P.
tr: I2P dağıtımı, kaynak kodun bileşenlerini oluşturan birkaç kaynak içerir. Her bileşenin, kendisine katkıda bulunan tüm geliştiricilerin kabul ettiği - ya bu bileşenle uyumlu bir lisans altında yayınlanan kodun serbest bırakıldığını açıkça beyan eden ya da yayınlanan kodu bileşenin birincil lisansı koşulları altında serbest bırakan - kendi lisansı vardır. Bu bileşenlerin her birinin, hangi lisansın bileşenin birincil lisansıyla uyumlu olduğu konusunda son sözü söyleyen bir lider geliştiricisi vardır ve I2P dağıtımına katmak için hangi lisansların yukarıdaki dört garantiyi karşıladığı konusunda son sözü I2P proje yöneticisi söyler.

source: Component
pt_br: Componente
tr: Bileşen

source: Source path
pt_br: Caminho do código-fonte
tr: Kaynak kod yolu

source: Resource
pt_br: Recurso
tr: Kaynak

source: Primary license
pt_br: Licença primária
tr: Birincil lisans

source: Alternate licenses
pt_br: Licenças alternativas
tr: Alternatif lisanslar

source: Lead developer
pt_br: Desenvolvedor-chefe
tr: Baş geliştirici

source: GPL + java exception
pt_br: GPL + exceção relativa ao java
tr: GPL + java istisnası
