Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/get-involved.po
Languages: pt_br, tr

source: To powerful passive external observers as well as large colluding internal observers, standard tunnel routing is vulnerable to traffic analysis attacks - simply watching the size and frequency of messages being passed between routers. To defend against these, we will want to essentially turn some of the tunnels into its own mix cascade - delaying messages received at the gateway and passing them in batches, reordering them as necessary, and injecting dummy messages (indistinguishable from other "real" tunnel messages by peers in the path). There has been a significant amount of <a href="%(pdf)s">research</a> on these algorithms that we can lean on prior to implementing the various tunnel mixing strategies.
pt_br: Para observadores externos passivos poderosos, bem como grandes observadores internos em conluio, o roteamento de túnel padrão é vulnerável a ataques de análise de tráfego - simplesmente observando o tamanho e a frequência das mensagens sendo passadas entre roteadores. Para nos defendermos contra isso, queremos essencialmente transformar alguns dos túneis em sua própria cascata de mixagem - atrasando mensagens recebidas no gateway e passando-as em lotes, reordenando-as conforme necessário, e injetando mensagens fictícias (indistinguíveis de outras mensagens de túnel "reais" por pares no caminho). Houve uma quantidade significativa de <a href="%(pdf)s">pesquisas</a> sobre esses algoritmos nos quais podemos nos apoiar antes de implementar as várias estratégias de mistura de túneis.
tr: Güçlü pasif dış gözlemcilerden büyük gizli iç gözlemcilere kadar, yalnızca yönelticiler arasında aktarılan iletilerin boyutunu ve sıklığını izleyerek yapılan standart tünel yöneltme trafik incelemesi saldırılarına karşı savunmasızdır. Bunlara karşı savunma geliştirmek için, bazı tünelleri kendi karma çağlayanına dönüştürmek isteyeceğiz Ağ geçidinde alınan iletileri geciktirmek ve bunları gruplar halinde iletmek, gerektiğinde yeniden sıralamak ve sahte iletiler eklemek (yoldaki eşler tarafından diğer "gerçek" tünel iletilerinden ayırt edilmesini engelleyecek şekilde) gibi çeşitli tünel karıştırma stratejilerini uygulamadan önce destek alabileceğimiz bu algoritmalar üzerinde önemli miktarda <a href="%(pdf)s">araştırma</a> yapılmıştır.

source: In addition to the anonymity aspects of more varied tunnel operation, there is a functional dimension as well. Each peer only has a certain amount of data they can route for the network, and to keep any particular tunnel from consuming an unreasonable portion of that bandwidth, they will want to include some throttles on the tunnel. For instance, a tunnel may be configured to throttle itself after passing 600 messages (1 per second), 2.4MB (4KBps), or exceeding some moving average (8KBps for the last minute). Excess messages may be delayed or summarily dropped. With this sort of throttling, peers can provide ATM-like QoS support for their tunnels, refusing to agree to allocate more bandwidth than the peer has available.
pt_br: Além dos aspectos de anonimato de uma operação de túnel mais variada, há uma dimensão funcional também. Cada peer tem apenas uma certa quantidade de dados que pode rotear para a rede, e para evitar que qualquer túnel em particular consuma uma porção irracional dessa largura de banda, eles desejarão incluir alguns aceleradores no túnel. Por exemplo, um túnel pode ser configurado para se autoacelerar após passar 600 mensagens (1 por segundo), 2,4 MB (4 KBps) ou exceder alguma média móvel (8 KBps para o último minuto). Mensagens em excesso podem ser atrasadas ou sumariamente descartadas. Com esse tipo de limitação, os pares podem fornecer suporte de QoS semelhante ao ATM para seus túneis, recusando-se a concordar em alocar mais largura de banda do que o par tem disponível.
tr: Daha çeşitli tünel işlemlerinin anonimlik yönlerine ek olarak, işlevsel bir boyutu da vardır. Her eşin ağ için yönlendirebileceği yalnızca belirli bir miktarda verisi vardır ve belirli bir tünelin, bu bant genişliğinin makul sayılamayacak bir bölümünü tüketmesini engellemek için tünele bazı kısıtlamalar eklemek isteyeceklerdir. Örneğin, bir tünel sınır olarak, 600 iletiyi (saniyede 1), 2,4 MB (4 KBps) ya da bir hareketli ortalamayı (son dakika için 8 KBps) aştığında kendisini kısacak şekilde yapılandırılabilir. Artan iletiler ertelenebilir veya toptan yok sayılabilir. Bu tür bir kısıtlama ile eşler, tünelleri için ATM benzeri QoS desteği sağlayabilir ve eşin sahip olduğundan daha fazla bant genişliği sağlamayı kabul etmeyebilir.

source: In addition, we may want to implement code to dynamically reroute tunnels to avoid failed peers or to inject additional hops into the path. This can be done by garlic routing a message to any particular peer in a tunnel with instructions to redefine the next-hop in the tunnel.
pt_br: Adicionalmente, talvez queiramos implementar código para redefinir as rotas de túneis dinamicamente de modo a evitar pares com falhas ou a injetar saltos adicionais no caminho. Isso pode ser feito com roteamento-alho encaminhando uma mensagem para qualquer par particular num túnel com instruções para redefinir o próximo salto no túnel.
tr: Ek olarak, başarısız eşlerden kaçınmak veya yola ek duraklar eklemek için tünelleri devingen olarak yeniden yönlendirecek bir kod geliştirmek isteyebiliriz. Bu işlem, tüneldeki bir sonraki sıçramayı yeniden tanımlamak için yönergeler içeren bir iletinin, bir tüneldeki belirli herhangi bir eşe Garlic yöntemiyle yöneltmesiyle yapılabilir.

source: Beyond the per-tunnel batching and mixing strategy, there are further capabilities for protecting against powerful attackers, such as allowing each step in a garlic routed path to define a delay or window in which it should be forwarded on. This would enable protections against the long term intersection attack, as a peer could send a message that looks perfectly standard to most peers that pass it along, except at any peers where the clove exposed includes delay instructions.
pt_br: Além da estratégia de loteamento e mistura por túnel, há mais capacidades para proteção contra atacantes poderosos, como permitir cada passo em um caminho roteado de alho para definir um atraso ou janela na qual ele deve ser encaminhado. Isso permitiria proteções contra o ataque de interseção de longo prazo, pois um par poderia enviar uma mensagem que parece perfeitamente padrão para a maioria dos pares que a passam adiante, exceto em quaisquer pares onde o cravo exposto inclui instruções de atraso.
tr: Her tünel için gruplama ve karıştırma stratejisinin ötesinde, Garlic yöneltmeli bir yoldaki her adımın aktarılması gereken bir gecikme veya aralık tanımlanabilmesini sağlamak gibi güçlü saldırganlara karşı koruma sağlayan başka yetenekler de vardır. Bu özellikler, işlemin uzun dönemli kesiştirilmesi saldırısına karşı koruma sağlar. Bir eş, gecikme yönergelerini içeren Garlic parçasının aktarıldığı tüm eşler dışında, onu ileten tüm eşlere mükemmel standartta görünen bir ileti gönderebilir.

source: Performance related improvements are listed on the <a href="%(futureperf)s">Performance</a> page.
pt_br: Os aperfeiçoamentos relacionados ao desempenho estão relacionados na página de <a href="%(futureperf)s">Desempenho</a>.
tr: Başarımla ilgili iyileştirmeler <a href="%(futureperf)s">Başarım</a> sayfasında bulunur.

source: Application Development
pt_br: Desenvolvimento de aplicativos
tr: Uygulama geliştirme

source: May 2013
pt_br: Maio de 2013
tr: Mayıs 2013

source: Why write I2P-specific code?
pt_br: Por que escrever código especificamente para a I2P?
tr: Neden I2P için özel kod yazmalısınız?

source: Important concepts
pt_br: Conceitos importantes
tr: Önemli kavramlar

source: Development options
pt_br: Opções de desenvolvimento
tr: Geliştirme seçenekleri

source: Start developing - a simple guide
pt_br: Comece a desenvolver - um guia simples
tr: Geliştirmeye giriş: Basit bir rehber

source: There are multiple ways to use applications in I2P. Using <a href="%(i2ptunnel)s">I2PTunnel</a>, you can use regular applications without needing to program explicit I2P support. This is very effective for client-server scenario's, where you need to connect to a single website. You can simply create a tunnel using I2PTunnel to connect to that website, as shown in <a href="#tunnel.serverclient">Figure 1</a>.
pt_br: Existem várias maneiras de usar aplicativos no I2P. Usando <a href="%(i2ptunnel)s">I2PTunnel</a>, você pode usar aplicativos regulares sem precisar programar suporte I2P explícito. Isso é muito eficaz para cenários cliente-servidor, onde você precisa se conectar a um único site. Você pode simplesmente criar um túnel usando o I2PTunnel para se conectar a esse site, conforme mostrado na <a href="#tunnel.serverclient">Figura 1</a>.
tr: I2P üzerinde uygulamaları kullanmanın birden çok yolu vardır. <a href="%(i2ptunnel)s">I2PTunnel</a> kullanarak, açık I2P desteğini programlamanıza gerek kalmadan normal uygulamaları kullanabilirsiniz. Bu kullanım, tek bir site ile bağlantı kurmanız gereken istemci-sunucu senaryoları için çok etkilidir. <a href="#tunnel.serverclient">Şekil 1</a>'de gösterildiği gibi, bu siteye bağlanmak için I2PTunnel kullanarak bir tünel oluşturabilirsiniz.

source: If your application is distributed, it will require connections to a large amount of peers. Using I2PTunnel, you will need to create a new tunnel for each peer you want to contact, as shown in <a href="#tunnel.peertopeer">Figure 2</a>. This process can of course be automated, but running a lot of I2PTunnel instances creates a large amount of overhead. In addition, with many protocols you will need to force everyone to use the same set of ports for all peers - e.g. if you want to reliably run DCC chat, everyone needs to agree that port 10001 is Alice, port 10002 is Bob, port 10003 is Charlie, and so on, since the protocol includes TCP/IP specific information (host and port).
pt_br: Se seu aplicativo for distribuído, ele exigirá conexões com uma grande quantidade de pares. Usando o I2PTunnel, você precisará criar um novo túnel para cada par que deseja contatar, conforme mostrado na <a href="#tunnel.peertopeer">Figura 2</a>. Esse processo pode, é claro, ser automatizado, mas executar muitas instâncias do I2PTunnel cria uma grande sobrecarga. Além disso, com muitos protocolos, você precisará forçar todos a usar o mesmo conjunto de portas para todos os pares - por exemplo, se você quiser executar o bate-papo DCC de forma confiável, todos precisam concordar que a porta 10001 é Alice, a porta 10002 é Bob, a porta 10003 é Charlie e assim por diante, já que o protocolo inclui informações específicas de TCP/IP (host e porta).
tr: Uygulamanız dağıtılmış yapıdaysa, çok sayıda eşle bağlantı kurması gerekir. I2PTunnel kullanarak, <a href="#tunnel.peertopeer">Şekil 2</a>'de gösterildiği gibi, iletişim kurmak istediğiniz her eş için yeni bir tünel oluşturmanız gerekir. Bu süreç elbette otomatikleştirilebilir. Ancak çok sayıda I2PTunnel kopyası çalıştırmak büyük miktarda ek yük oluşturur. Ek olarak, birçok iletişim kuralıyla, herkesi tüm eşler için aynı bağlantı noktası kümesini kullanmaya zorlamanız gerekir. Örneğin DCC sohbetini güvenilir bir şekilde çalıştırmak istiyorsanız, TCP/IP iletişim kuralına özel bilgiler (sunucu adresi ve bağlantı noktası) içerdiğinden, herkesin 10001 numaralı bağlantı noktasının Alice, 10002 numaralı bağlantı noktasının Bob, 10003 numaralı bağlantı noktasının da Charlie olduğu konusunda hemfikir olması gerekir.

source: General network applications often send a lot of additional data that could be used to identify users. Hostnames, port numbers, time zones, character sets, etc. are often sent without informing the user. As such, designing the network protocol specifically with anonymity in mind can avoid compromising user identities.
pt_br: Aplicações gerais de rede geralmente enviam muitos dados adicionais que podem ser usados para identificar usuários. Nomes de host, números de porta, fusos horários, conjuntos de caracteres, etc. são frequentemente enviados sem informar o usuário. Assim, projetar o protocolo de rede especificamente com o anonimato em mente pode evitar comprometer as identidades dos usuários.
tr: Genel ağ uygulamalarında genellikle kullanıcıların kimliğini belirlemek için kullanılabilecek birçok ek veri gönderilir. Sunucu adları, bağlantı noktaları, saat dilimleri, karakter kümeleri gibi pek çok veri kullanıcının bilgisi olmadan gönderilir. Bu nedenle, ağ iletişim kuralını özellikle anonimliği göz önünde bulundurarak tasarlamak, kullanıcı kimliklerinin belirlenmesini önleyebilir.

source: There are also efficiency considerations to review when determining how to interact on top of I2P. The streaming library and things built on top of it operate with handshakes similar to TCP, while the core I2P protocols (I2NP and I2CP) are strictly message based (like UDP or in some instances raw IP). The important distinction is that with I2P, communication is operating over a long fat network - each end to end message will have nontrivial latencies, but may contain payloads of up to several KB. An application that needs a simple request and response can get rid of any state and drop the latency incurred by the startup and teardown handshakes by using (best effort) datagrams without having to worry about MTU detection or fragmentation of messages.
pt_br: Há também considerações de eficiência a serem revisadas ao determinar como interagir em cima do I2P. A biblioteca de streaming e as coisas construídas em cima dela operam com handshakes semelhantes ao TCP, enquanto os protocolos I2P principais (I2NP e I2CP) são estritamente baseados em mensagens (como UDP ou, em alguns casos, IP bruto). A distinção importante é que com o I2P, a comunicação está operando em uma rede longa e gorda - cada mensagem de ponta a ponta terá latências não triviais, mas pode conter cargas úteis de até vários KB. Um aplicativo que precisa de uma solicitação e resposta simples pode se livrar de qualquer estado e eliminar a latência incorrida pelos handshakes de inicialização e desmontagem usando datagramas (de melhor esforço) sem ter que se preocupar com detecção de MTU ou fragmentação de mensagens.
tr: I2P üzerinde nasıl etkileşim kurulacağını belirlerken gözden geçirilmesi gereken verimlilik konuları da vardır. Akış kitaplığı ve bunun üzerine kurulan şeyler, TCP yapısındakine benzer el sıkışmaları ile çalışır. Çekirdek I2P iletişim kuralları (I2NP ve I2CP) ise kesinlikle ileti tabanlıdır (UDP veya bazı durumlarda ham IP adresi gibi). Önemli fark, I2P ile iletişimin uzun ve dolu bir ağ üzerinden çalışmasıdır. Her uçtan uca iletide önemsiz gecikmeler olacaktır, ancak birkaç KB boyutunda yükler bulunabilir. Basit bir istek ve yanıta gerek duyan bir uygulama, MTU algılaması veya iletilerin parçalanması konusunda endişelenmeden (en iyi çaba) veri şemalarını kullanarak herhangi bir durumdan kurtularak, başlatma ve kapatma el sıkışmalarından kaynaklanan gecikmeyi azaltabilir.

source: Creating a server-client connection using I2PTunnel only requires creating a single tunnel.
pt_br: Para criar uma conexão servidor-cliente usando I2PTunnel requer-se apenas um único túnel.
tr: I2PTunnel kullanarak bir sunucu-istemci bağlantısı oluşturmak için yalnızca tek bir tünel oluşturulması gerekir.

source: Figure 1:
pt_br: Figura 1:
tr: Şekil 1:

source: Setting up connections for a peer-to-peer applications requires a very large amount of tunnels.
pt_br: Configurar conexões para aplicações p2p requer uma quantidade bastante grande de túneis.
tr: Eşler arası uygulamalarla bağlantı kurmak için çok büyük sayıda tünel oluşturulması gerekir.

source: Figure 2:
pt_br: Figura 2:
tr: Şekil 2:

source: In summary, a number of reasons to write I2P-specific code:
pt_br: Em suma, há inúmeros motivos para escrever código específico para a I2P:
tr: Özetle, I2P uygulamasına özel kod yazmak için birkaç neden:

source: Creating a large amount of I2PTunnel instances consumes a non-trivial amount of resources, which is problematic for distributed applications (a new tunnel is required for each peer).
pt_br: Criar uma grande quantidade de instâncias I2PTunnel consome uma quantidade não trivial de recursos, , o que é problemático para aplicativos distribuídos (um novo túnel é necessário para cada par).
tr: Büyük miktarda I2PTunnel kopyası oluşturmak, önemsiz sayılamayacak miktarda kaynak tüketir ve bu, dağıtılmış uygulamalar için sorunlu bir durumdur (her eş için yeni bir tünel gerekir).

source: General network protocols often send a lot of additional data that can be used to identify users. Programming specifically for I2P allows the creation of a network protocol that does not leak such information, keeping users anonymous and secure.
pt_br: Protocolos de rede gerais geralmente enviam muitos dados adicionais que podem ser usados para identificar usuários. A programação específica para I2P permite a criação de um protocolo de rede que não vaza tais informações, mantendo os usuários anônimos e seguros.
tr: Genel ağ iletişim kurallarında genellikle kullanıcıların kimliğini belirlemek için kullanılabilecek birçok ek veri gönderilir. Özellikle I2P için program geliştirmek, bu tür bilgileri sızdırmayan, kullanıcıları anonim ve güvende tutan bir ağ iletişim kuralının oluşturulmasını sağlar.

source: Network protocols designed for use on the regular internet can be inefficient on I2P, which is a network with a much higher latency.
pt_br: Protocolos de rede projetados para uso na internet comum podem ser ineficientes em I2P, que é uma rede com latência muito maior.
tr: Normal İnternet üzerinde kullanılmak üzere tasarlanmış ağ iletişim kuralları, çok daha yüksek gecikme süresine sahip bir ağ olan I2P üzerinde verimsiz olabilir.

source: I2P supports a standard <a href="%(plugins)s">plugins interface</a> for developers so that applications may be easily integrated and distributed.
pt_br: A I2P suporta uma <a href="%(plugins)s">interface de extensões</a> padrão para desenvolvedores e, assim, aplicações podem ser facilmente integradas e distribuídas.
tr: I2P, geliştiriciler için standart bir <a href="%(plugins)s">eklenti arayüzünü</a> destekler böylece uygulamalar kolayca bütünleştirilebilir ve dağıtılabilir.

source: Applications written in Java and accessible/runnable using an HTML interface via the standard webapps/app.war may be considered for inclusion in the i2p distribution.
pt_br: Aplicações escritas em Java e acessíveis/executáveis usando uma interface HTML via webapps/app.war padrão podem ser consideradas para inclusão na distribuição i2p.
tr: Java ile yazılmış ve standart webapps/app.war aracılığıyla bir HTML arayüzü kullanılarak erişilebilen/çalıştırılabilen uygulamaların I2P dağıtımına katılması düşünülebilir.

source: There are a few changes that require adjusting to when using I2P:
pt_br: Há umas poucas modificações que requerem ajustes para o uso na I2P:
tr: I2P kullanırken değiştirilmesi gereken birkaç ayar bulunuyor:

source: Destination ~= host+port
pt_br: Destino ~= host+porta
tr: Hedef ~= sunucu + bağlantı noktası

source: An application running on I2P sends messages from and receives messages to a unique cryptographically secure end point - a "destination". In TCP or UDP terms, a destination could (largely) be considered the equivalent of a hostname plus port number pair, though there are a few differences.
pt_br: Um aplicativo em execução no I2P envia mensagens de e recebe mensagens para um ponto final criptograficamente seguro exclusivo - um "destino". Em termos de TCP ou UDP , um destino poderia (amplamente) ser considerado o equivalente a um par de nome de host mais número de porta, embora haja algumas diferenças.
tr: I2P üzerinde çalışan bir uygulama, şifreleme açısından güvenli benzersiz bir uç noktadan - bir "hedef" üzerinden iletiler gönderir ve alır. TCP veya UDP tanımlarında, bir hedef (genellikle) bir sunucu adı ile bağlantı noktası çiftinin eşdeğeri olarak kabul edilebilir. Ancak birkaç fark vardır.

source: An I2P destination itself is a cryptographic construct - all data sent to one is encrypted as if there were universal deployment of IPsec with the (anonymized) location of the end point signed as if there were universal deployment of DNSSEC.
pt_br: Um destino I2P em si é uma construção criptográfica - todos os dados enviados para um são criptografados como se houvesse uma implantação universal de IPsec com a localização (anonimizada) do ponto final assinada como se houvesse uma implantação universal de DNSSEC.
tr: Bir I2P hedefinin kendisi şifrelenmiş bir yapıdır. Birine gönderilen tüm veriler, evrensel IPsec dağıtımı varmış gibi şifrelenir ve uç noktanın (anonimleştirilmiş) konumu, evrensel DNSSEC dağıtımı varmış gibi imzalanır.

source: I2P destinations are mobile identifiers - they can be moved from one I2P router to another (or it can even "multihome" - operate on multiple routers at once). This is quite different from the TCP or UDP world where a single end point (port) must stay on a single host.
pt_br: Destinos I2P são identificadores móveis - eles podem ser movidos de um roteador I2P para outro (ou podem até mesmo ser "multihome" - operar em vários roteadores em uma vez). Isso é bem diferente do mundo TCP ou UDP, onde um único ponto final (porta) deve permanecer em um único host.
tr: I2P hedefleri mobil tanımlayıcılardır. Bir I2P yönelticiden diğerine taşınabilirler (veya "birden çok barındırma" kullanıyor bile olabilir ya da aynı anda birden fazla yöneltici üzerinde çalışabilirler). Bu, tek bir uç noktanın (bağlantı noktası) tek bir bilgisayarda bulunması gereken TCP veya UDP dünyasından oldukça farklıdır.

source: I2P destinations are ugly and large - behind the scenes, they contain a 2048 bit ElGamal public key for encryption, a 1024 bit DSA public key for signing, and a variable size certificate, which may contain proof of work or blinded data.
pt_br: Os destinos I2P são feios e grandes - nos bastidores, eles contêm uma chave pública ElGamal de 2048 bits para criptografia, uma chave pública DSA de 1024 bits para assinatura e um certificado de tamanho variável , que pode conter prova de trabalho ou dados ocultos.
tr: I2P hedefleri çirkin ve büyüktür. Perde arkasında, şifreleme için herkese açık 2048 bit ElGamal anahtarı, imzalama için herkese açık 1024 bit DSA anahtarı ve çalışıyor olmanın kanıtı veya kör veriler içerebilen değişken boyutlu bir sertifika içerirler.
