Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: pt_br, tr

source: Within a few seconds, the 'tunnel' should now be active, and remote clients should be able to reach your server anonymously. Remember to let your router "warm up" before opening clients to it.
pt_br: Em poucos segundos, o 'túnel' deve estar ativo, e clientes remotos devem conseguir alcançar seu servidor anonimamente. Lembre-se de deixar seu roteador "aquecer" antes de abrir clientes para ele.
tr: Birkaç saniye içinde, 'tünel' etkin olmalı ve uzak istemciler sunucunuza anonim olarak erişebilmelidir. İstemcileri açmadan önce yönelticinizin "ısınmasına" izin vermeyi unutmayın.

source: 4 - Update Your hosts.txt File
pt_br: 4 - Atualize seu arquivo hosts.txt
tr: 4 - hosts.txt dosyanızı güncelleyin

source: To test your own server locally, you'll need to create an entry in your hosts.txt file, so I2P can translate the simple URL you place in the browser's address bar into the full public key text needed to find your server.
pt_br: Para testar seu próprio servidor localmente, você precisará criar uma entrada no seu arquivo hosts.txt, para que o I2P possa traduzir o URL simples que você coloca na barra de endereços do navegador no texto completo da chave pública necessária para encontrar seu servidor.
tr: Kendi sunucunuzu yerel olarak sınamak için hosts.txt dosyanızda bir kayıt oluşturmanız gerekir.Bböylece I2P, tarayıcının adres çubuğuna yazdığınız basit adresi sunucunuzu bulmak için gereken tam herkese açık anahtar metnine çevirebilir.

source: Edit your hosts.txt, and add the line myserver.i2p=blahblahblah, where myserver.i2p is an I2P 'domain' you want to associate with your site, and the blahblahblah is the text of the base64 public key you created earlier in the file myWebPubKey.txt
pt_br: Edite seu hosts.txt e adicione a linha myserver.i2p=blahblahblah, onde myserver.i2p é um 'domínio' I2P que você deseja associar ao seu site, e blahblahblah é o texto da chave pública base64 que você criou anteriormente no arquivo myWebPubKey.txt.
tr: hosts.txt dosyanızı düzenleyin ve myserver.i2p=blahblahblah satırını ekleyin. Burada myserver.i2p, sitenizle ilişkilendirmek istediğiniz bir I2P 'etki alanı' ve blahblahblah, daha önce oluşturduğunuz myWebPubKey.txt dosyasındaki herkese açık anahtarın base64 metnidir.

source: With this in place, you and others can reach your server with the simple domain name myserver.i2p in the browser's address bar.
pt_br: Com isso, você e outras pessoas podem acessar seu servidor com o simples nome de domínio myserver.i2p na barra de endereços do navegador.
tr: Bundan sonra, siz ve başkaları, tarayıcının adres çubuğuna myserver.i2p basit etki alanı adını yazarak sunucunuza ulaşabilirsiniz.

source: 5 - Surf Your Site Within I2P
pt_br: 5 - Navegue no seu site dentro do I2P
tr: 5 - Sitenizde I2P içinde gezin

source: Using your secondary browser - the one you earlier configured to use localhost:4444 as a proxy - point this browser to the address <a href="http://myserver.i2p" target="_blank">http://myserver.i2p</a>
pt_br: Usando seu navegador secundário - aquele que você configurou anteriormente para usar localhost:4444 como proxy - aponte este navegador para o endereço <a href="http://myserver.i2p" target="_blank">http://myserver.i2p</a>
tr: Daha önce localhost:4444 adresini vekil sunucu olarak kullanmak üzere yapılandırdığınız ikinci tarayıcınızı kullanarak, bu tarayıcıdan <a href="http://myserver.i2p" target="_blank">http://myserver.i2p</a> adresini açın

source: You should see the main page of your webserver come up.
pt_br: Você deverá ver a página principal do seu servidor web aparecer.
tr: Sunucunuzun açılış sayfasını görmelisiniz.

source: 6 - Create a Local Client Tunnel Connection
pt_br: 6 - Crie uma conexão de túnel de cliente local
tr: 6 - Yerel istemci tüneli bağlantısı oluşturun

source: We now have to think beyond just web servers.
pt_br: Agora temos que pensar além de apenas servidores web.
tr: Şimdi site sunucularının ötesinde düşünmek zorundayız.

source: As you grow into I2P and get more of a 'feel' for it, you will want to use all manner of servers and clients.
pt_br: À medida que você se familiariza com o I2P e adquire mais "sensação" dele, você vai querer usar todos os tipos de servidores e clientes.
tr: I2P üzerinde geliştikçe ve daha fazla 'aşina' oldukça, her türden sunucu ve istemciyi kullanmak isteyeceksiniz.

source: The beauty of I2P is that it allows standard Internet clients and servers for most protocols to be transparently 'tunneled' through the anonymous network.
pt_br: A beleza do I2P é que ele permite que clientes e servidores padrão da Internet para a maioria dos protocolos sejam "encapsulados" de forma transparente através da rede anônima.
tr: I2P güzelliğini, çoğu iletişim kuralı için standart İnternet istemci ve sunucularının anonim ağ üzerinden şeffaf bir şekilde "tünellenmesini" sağlamasından alır.

source: You can run mailservers/clients, nameservers/clients, newsservers/clients - almost anything at all - perhaps even FTP in passive mode.
pt_br: Você pode executar servidores/clientes de e-mail, servidores/clientes de nomes, servidores/clientes de notícias - quase tudo - talvez até FTP no modo passivo.
tr: E-posta sunucuları/istemcileri, ad sunucuları/istemcileri, haber sunucuları/istemcileri, hemen hemen her şeyi, hatta belki pasif kipte FTP sunucusunu bile çalıştırabilirsiniz.

source: Now, we'll create a client tunnel. This is like the server tunnel we created earlier, but works in reverse. It listens to a port on your local machine; your local client connects to this port; the connection gets forwarded through I2P to the service on the other end.
pt_br: Agora, criaremos um túnel de cliente. É como o túnel de servidor que criamos anteriormente, mas funciona ao contrário. Ele escuta uma porta na sua máquina local; seu cliente local se conecta a essa porta; a conexão é encaminhada por I2P para o serviço na outra ponta.
tr: Şimdi bir istemci tüneli oluşturacağız. Bu, daha önce oluşturduğumuz sunucu tüneli gibidir, ancak tersine çalışır. Yerel bilgisayarınızdaki bir bağlantı noktasını dinler. Yerel istemciniz bu bağlantı noktasına bağlanır. Bağlantı, I2P üzerinden diğer uçtaki hizmete iletilir.

source: To open your client tunnel for your server, type the command <code>java -jar lib/i2ptunnel.jar -nogui -e "config localhost 7654" -e "client 10888 textofbase64key"</code> (all one line).
pt_br: Para abrir o túnel do cliente para seu servidor, digite o comando <code>java -jar lib/i2ptunnel.jar -nogui -e "config localhost 7654" -e "client 10888 textofbase64key"</code> (tudo em uma linha).
tr: Sunucunuza istemci tünelinizi açmak için <code>java -jar lib/i2ptunnel.jar -nogui -e "config localhost 7654" -e "client 10888 textofbase64key"</code> komutunu yazın (tümünü aynı satıra).

source: The port 10888 is arbitrary - it just needs to be something other than the physical port your server is listening on.
pt_br: A porta 10888 é arbitrária - ela só precisa ser diferente da porta física em que seu servidor está escutando.
tr: 10888 numaralı bağlantı noktası isteğe bağlıdır. Yalnızca sunucunuzun dinlediği fiziksel bağlantı noktasından başka bir şey olması gerekir.

source: textofbase64key is simply the contents of the public key text file myWebPubKey.txt, reproduced fully on one line (alternately, instead of textofbase64key, you can specify the name from your hosts.txt - e.g. myserver.i2p)
pt_br: textofbase64key é simplesmente o conteúdo do arquivo de texto da chave pública myWebPubKey.txt, reproduzido integralmente em uma linha (alternativamente, em vez de textofbase64key, você pode especificar o nome do seu hosts.txt - por exemplo myserver.i2p)
tr: textofbase64key, myWebPubKey.txt herkese açık anahtar metin dosyasının tamamen bir satırda çoğaltılan içeriğidir (alternatif olarak, textofbase64key yerine, hosts.txt dosyanızda adı belirtebilirsiniz. Örnek: myserver.i2p)

source: Within a minute or two of launching this command, the client tunnel from your local machine into I2P will be open and ready for use.
pt_br: Dentro de um ou dois minutos após iniciar este comando, o túnel do cliente da sua máquina local para o I2P estará aberto e pronto para uso.
tr: Bu komutu başlattıktan bir veya iki dakika sonra, yerel bilgisayarınızdan I2P üzerine gidiş istemci tüneli açık ve kullanıma hazır olacaktır.

source: Point your regular web browser (ie, not the one you configured to use localhost:4444), and point it to <a href="http://localhost:10888" target="_blank">http://localhost:10888</a>
pt_br: Aponte seu navegador web regular (ou seja, não aquele que você configurou para usar localhost:4444) e aponte-o para <a href="http://localhost:10888" target="_blank">http://localhost:10888</a>
tr: Normal tarayıcınıza (localhost:4444 kullanacak şekilde yapılandırdığınız tarayıcıyı değil) geçin ve <a href="http://localhost:10888" target="_blank">http://localhost:10888</a> adresini açın

source: Verify that the main page of your server eventually comes up in your browser.
pt_br: Verifique se a página principal do seu servidor finalmente aparece no seu navegador.
tr: Tarayıcınızda sunucunuzun açılış sayfasının göründüğünü doğrulayın.

source: You use the same procedure for using any local client program to access a remote I2P server - just get the base64 public key (called destination key) of the remote server, choose a local port to connect to the remote server, open the tunnel, and just connect with your client to your heart's content.
pt_br: Use o mesmo procedimento para usar qualquer programa cliente local para acessar um servidor I2P remoto: basta obter a chave pública base64 (chamada chave de destino) do servidor remoto, escolher uma porta local para se conectar ao servidor remoto, abrir o túnel e conectar-se ao seu cliente conforme desejar.
tr: Uzak bir I2P sunucusuna erişmek amacıyla herhangi bir yerel istemci programını kullanmak için aynı prosedürü kullanırsınız. Uzak sunucunun herkese açık base64 anahtarını (hedef anahtar olarak adlandırılır) alın. Uzak sunucuyla bağlantı kurmak için bir yerel bağlantı noktası seçin, tüneli açın ve sadece istemcinizle gönlünüzden geçen içeriğe bağlanın.

source: 7 - Share your server details with others
pt_br: 7 - Compartilhe os detalhes do seu servidor com outras pessoas
tr: 7 - Sunucu bilgilerinizi başkalarıyla paylaşın

source: Using an anonymous medium (eg the one of the I2P IRC servers or ugha's wiki), post your domain name (eg <a href="http://www.mynick.i2p" target="_blank">www.mynick.i2p</a> as well as your destination key. Others will then be able to reach your server remotely, without either of you jeopardizing your anonymity.
pt_br: Usando um meio anônimo (por exemplo, um dos servidores IRC do I2P ou o wiki do ugha), publique seu nome de domínio (por exemplo, <a href="http://www.mynick.i2p" target="_blank">www.mynick.i2p</a> , bem como sua chave de destino. Outros poderão então acessar seu servidor remotamente, sem que nenhum de vocês coloque em risco seu anonimato.
tr: Anonim bir ortam kullanarak (örneğin I2P IRC sunucularından biri ya da ugha wiki sayfası), etki alanı adınızı (örneğin <a href="http://www.mynick.i2p" target="_blank">www.mynick.i2p</a> ve hedef anahtarınızı) gönderin. Ardından başkaları sunucunuza uzaktan erişebilecek. Bunlardan herhangi biri olmadan. anonimliğinizi tehlikeye atıyorsunuz.

source: Remember, you can go to What's on I2P and find the latest public keys linked to their URL. You should also post your own public key and URL their. However, you will want to do this anonymously, of course. Drupal.i2p.net is currently, as of this writing, only accessible from the net. So, to access the outside WWW anonymously from inside of I2P, you will need to start up your script called startSquid. Do it the same way you have been doing these other scripts. Reconfigure your browser to proxy on localhost:5555, as defined in the script, and when the script has generated it's keys, you can access the squid proxy. Put any WWW URL (such as Google or this i2p site) into your browser's address bar and you will be surfing the World Wide Web anonymously. Now you can safely post your public key, and no one can detect your IP address.
pt_br: Lembre-se, você pode ir para What's on I2P e encontrar as últimas chaves públicas vinculadas à URL deles. Você também deve postar sua própria chave pública e URL lá. No entanto, você vai querer fazer isso anonimamente, é claro. Drupal.i2p.net está atualmente, no momento em que este artigo foi escrito, acessível somente pela rede. Então, para acessar a WWW externa anonimamente de dentro do I2P, você precisará iniciar seu script chamado startSquid. Faça da mesma forma que você tem feito esses outros scripts. Reconfigure seu navegador para proxy em localhost:5555, conforme definido no script, e quando o script tiver gerado suas chaves, você pode acessar o proxy squid. Coloque qualquer URL WWW (como Google ou este site i2p) na barra de endereços do seu navegador e você estará navegando na World Wide Web anonimamente. Agora você pode postar com segurança sua chave pública, e ninguém pode detectar seu endereço IP.
tr: Unutmayın, I2P üzerinde neler var bölümüne giderek adresleriyle bağlantılı en son herkese açık anahtarları bulabilirsiniz. Ayrıca kendi herkese açık anahtarınızı ve adreslerini de göndermelisiniz. Ancak, bunu elbette anonim olarak yapmak isteyeceksiniz. Drupal.i2p.net, bu yazı yazıldığında yalnızca ağdan erişilebilir durumdadır. Bu nedenle, I2P içinden anonim olarak bir dış WWW adresine erişmek için startSquid adlı komut dosyasını başlatmanız gerekir. Bunu diğer komut dosyalarına yaptığınız gibi yapın. Tarayıcınızı, komut dosyasında tanımlandığı gibi localhost:5555 vekil sunucusunu kullanacak şekilde yeniden yapılandırın. Komut dosyası anahtarlarını oluşturduğunda, squid vekil sunucusuna erişebilirsiniz. Herhangi bir WWW adresini (Google veya bu i2p sitesi gibi) tarayıcınızın adres çubuğuna yazın. Böylece World Wide Web üzerinde anonim olarak gezinebilirsiniz. Artık herkese açık anahtarınızı güvenle yayınlayabilirsiniz ve hiç kimse IP adresinizi tespit edemez.

source: 8 - Write Some Scripts To Handle All This Menial Nonsense
pt_br: 8 - Escreva alguns scripts para lidar com todo esse absurdo servil
tr: 8 - Tüm bu önemsiz saçmalıklarla başa çıkmak için bazı komut dosyaları yazın

source: It would drive most people crazy, going through all these steps every time one sets up an I2P server, and/or deploys a client.
pt_br: Muitas pessoas ficariam loucas se tivessem que passar por todas essas etapas toda vez que configurassem um servidor I2P e/ou implementassem um cliente.
tr: Bir I2P sunucusu her kurulduğunda ve/veya bir istemci kurduğunda tüm bu adımlardan geçmek çoğu insanı çıldırtır.

source: Aum's website <a href="http://www.freenet.org.nz/i2p/" target="_blank">http://www.freenet.org.nz/i2p/</a> has a script called setupServer.py which automates all this nonsense into one simple command line . But I respect that people's tastes in user interfaces differ, and trying to write something which satisfies everyone's needs usually results in something so complex that it turns into newbie-repellent.
pt_br: O site do Aum <a href="http://www.freenet.org.nz/i2p/" target="_blank">http://www.freenet.org.nz/i2p/</a> tem um script chamado setupServer.py que automatiza todo esse absurdo em uma linha de comando simples. Mas eu respeito que os gostos das pessoas em interfaces de usuário diferem, e tentar escrever algo que satisfaça as necessidades de todos geralmente resulta em algo tão complexo que se torna repelente para novatos.
tr: Aum sitesinde <a href="http://www.freenet.org.nz/i2p/" target="_blank">http://www.freenet.org.nz/i2p/</a> tüm bu saçmalıkları tek bir basit komut satırında otomatikleştiren setupServer.py adlı bir komut dosyası bulunuyor. Ancak, insanların kullanıcı arayüzlerindeki zevklerinin farklı olmasına saygı duyuyorum ve herkesin ihtiyacını karşılayacak bir şeyler yazmaya çalışmak genellikle o kadar karmaşık bir şeyle sonuçlanır ki, yeni başlayanlar için itici olur.

source: So please feel free to use and/or customize setupServer.py to taste, or write your own in Python or another language.
pt_br: Então sinta-se à vontade para usar e/ou personalizar setupServer.py como preferir, ou escrever o seu próprio em Python ou outra linguagem.
tr: Bu yüzden lütfen setupServer.py komut dosyasını kullanmaktan ve/veya zevkinize göre özelleştirmekten veya Python ya da başka bir dilde kendi dosyanızı yazmaktan çekinmeyin.

source: Also, you may want to write a script which handles the startup of the I2P Router, the eepProxy, plus any and all tunnels you are using. I've got such a script called startEverything.sh, which gets launched at system startup. (Be sure to search this site for template scripts to automate your I2P commands. If I create a page for one, I'll try to remember to link it here.
pt_br: Além disso, você pode querer escrever um script que lide com a inicialização do roteador I2P, o eepProxy, além de todos e quaisquer túneis que você esteja usando. Eu tenho um script chamado startEverything.sh, que é iniciado na inicialização do sistema. (Certifique-se de pesquisar neste site por scripts de modelo para automatizar seus comandos I2P. Se eu criar uma página para um, tentarei lembrar de vinculá-lo aqui.
tr: Ayrıca, I2P yönelticinin, eepProxy uygulamasının ve kullandığınız tüm tünellerin başlatılmasını yöneten bir komut dosyası yazmak isteyebilirsiniz. Sistem başlangıcında başlatılan startEverything.sh adında bir komut dosyam var. (Bu sitede I2P komutlarınızı otomatikleştirmek için kalıp komut dosyaları aradığınızdan emin olun. Bir sayfa oluşturursam, buraya bağlamayı hatırlamaya çalışırım.

source: Exercise for Windows users - port setupServer.py into a MS-DOS .BAT file.
pt_br: Exercício para usuários do Windows: transfira o setupServer.py para um arquivo .BAT do MS-DOS.
tr: Windows kullanıcıları için alıştırma - setupServer.py dosyasını bir MS-DOS .BAT dosyasına taşıyın.

source: Old Documents
pt_br: Documentos antigos
tr: Eski Belgeler

source: Following is a list of documents originally on www.invisiblenet.net/i2p/ and rescued via the <a href="http://www.archive.org/">Wayback Machine</a>. They are quite dated and may or may not be accurate. However, the I2CP and I2NP documents in particular have some good information.
pt_br: A seguir está uma lista de documentos originalmente em www.invisiblenet.net/i2p/ e resgatados via <a href="http://www.archive.org/">Wayback Machine</a>. Eles são bem antigos e podem ou não ser precisos. No entanto, os documentos I2CP e I2NP em particular têm algumas boas informações.
tr: Aşağıda, özgün hali www.invisiblenet.net/i2p/ adresinde bulunan ve <a href="http://www.archive.org/">Wayback Machine</a> aracılığıyla kurtarılan belgelerin bir listesi bulunuyor. Bunlar oldukça eskidir ve içeriği doğru olabileceği gibi olmayabilir de. Bununla birlikte, özellikle I2CP ve I2NP belgelerinde bazı iyi bilgiler bulunur.

source: August 2011
pt_br: Agosto de 2011
tr: Ağustos 2011

source: Overview
pt_br: Visão geral
tr: Özet

source: Using JNI (Java Native Interface), a bit of C code (thanks ugha!), a little manual work and a piece of chewing gum we have made several cryptography operations quite a bit faster.
pt_br: Usando JNI (Java Native Interface), um pouco de código C (obrigado, ugh!), um pouco de trabalho manual e um pedaço de goma de mascar, tornamos várias operações de criptografia bem mais rápidas.
tr: JNI (Java Native Interface), biraz C kodu (teşekkürler ugha!), biraz el emeği ve bir parça sakız kullanarak birkaç şifreleme işlemini biraz daha hızlı hale getirdik.

source: The speedup comes from the super-fast <a href="%(gmplib)s">GNU MP Bignum library (libgmp)</a>. We use a single function from libgmp - <a href="%(func)s">mpz_powm()</a> as a replacement for the <a href="%(bigint)s">Java Math library's BigInteger modPow()</a>. As modPow() is a significant computational portion of many crypto operations, this is of significant benefit.
pt_br: A aceleração vem da biblioteca super-rápida <a href="%(gmplib)s">GNU MP Bignum (libgmp)</a>. Usamos uma única função da libgmp - <a href="%(func)s">mpz_powm()</a> como uma substituição para o BigInteger modPow() da biblioteca Java Math <a href="%(bigint)s"></a>. Como modPow() é uma parte computacional significativa de muitas operações criptográficas, isso é um benefício significativo.
tr: Hızlanma, süper hızlı <a href="%(gmplib)s">GNU MP Bignum kitaplığından (libgmp)</a> gelir. <a href="%(bigint)s">Java Math kitaplığı BigInteger modPow()</a> yerine libgmp - <a href="%(func)s">mpz_powm()</a> içinden tek bir işlev kullanıyoruz. modPow() birçok şifreleme işleminin önemli bir hesaplama kısmı olduğundan, bu önemli bir faydadır.

source: The standard I2P installation includes about 20 versions of the library for different platforms, each about 50KB, inside the jbigi.jar file. The initialization of the JBigI library, including CPU identification, selection, and extraction of the correct loadable module, is handled by the <a href="%(nativebigint)s">NativeBigInteger class</a>. If no module is available for the current platform, the standard <a href="%(bigint)s">Java Math library's BigInteger modPow()</a> is used.
pt_br: A instalação padrão do I2P inclui cerca de 20 versões da biblioteca para diferentes plataformas, cada uma com cerca de 50KB, dentro do arquivo jbigi.jar. A inicialização da biblioteca JBigI, incluindo identificação da CPU, seleção e extração do módulo carregável correto, é gerenciada pela <a href="%(nativebigint)s">a classe NativeBigInteger</a>. Se nenhum módulo estiver disponível para a plataforma atual, a biblioteca padrão <a href="%(bigint)s">Java Math library's BigInteger modPow()</a> é utilizada.
tr: Standart I2P kurulumu, jbigi.jar dosyasının içinde her biri yaklaşık 50 KB olan farklı platformlar için kitaplığın yaklaşık 20 sürümünü içerir. İşlemcinin belirlenmesi, seçimi ve doğru yüklenebilir modülün ayıklanması ile JBigI kitaplığının başlatılması, <a href="%(nativebigint)s">NativeBigInteger class</a> tarafından gerçekleştirilir. Var olan platform için herhangi bir modül yoksa, standart <a href="%(bigint)s">Java Math kitaplığı BigInteger modPow()</a> kullanılır.

source: Rebuilding and Testing JBigI
pt_br: Reconstruindo e testando JBigI
tr: JBigI yeniden oluşturma ve sınama

source: Following are the instructions to build a new jbigi library for your own platform and testing its performance.
pt_br: A seguir estão as instruções para construir uma nova biblioteca jbigi para sua própria plataforma e testar seu desempenho.
tr: Aşağıda, kendi platformunuz için yeni bir jbigi kitaplığı oluşturma ve başarımını sınama yönergelerini bulabilirsiniz.

source: Requirements
pt_br: Requisitos
tr: Gereksinimler

source: This works on Linux, and with a few changes in build.sh probably also on other platforms. FreeBSD has also been reported to work too. On Kaffee the speedup is very small, because it already uses native BitInteger internally. Blackdown seems to cause strange errors. Because you are going to do compilation, you need JDK; JRE won't work.
pt_br: Isso funciona no Linux e, com algumas mudanças no build.sh, provavelmente também em outras plataformas. O FreeBSD também foi relatado como funcionando. No Kaffee, o aumento de velocidade é muito pequeno, porque ele já usa BitInteger nativo internamente. Blackdown parece causar erros estranhos. Como você vai fazer compilação, você precisa do JDK; o JRE não funcionará.
tr: Bu, Linux üzerinde çalışır ve build.sh dosyasındaki birkaç değişiklikle diğer platformlarda da çalışabilir. FreeBSD üzerinde çalıştığı bildirildi. Kaffee üzerinde hızlanma çok küçüktür. Çünkü zaten içinde yerel BitInteger kullanır. Blackdown, garip hatalara neden oluyor gibi görünüyor. Derleme yapacağınız için JDK gereklidir, JRE çalışmaz.
