Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: pt_br, tr

source: The data that the MinWWW proxy and server need to wrap is trivial - when the proxy wants to send "GET /", it prepends it with the I2P Destination sending the request, followed by a 4 byte request ID. The MinWWW server receives those requests, contacts the appropriate HTTPD, sends the request, waits for the response, and sends a reply to the MinWWW proxy containing the response, prefixed with the original request ID. That response is taken and passed back to the browser and the connection is closed.
pt_br: Os dados que o proxy e o servidor MinWWW precisam encapsular são triviais - quando o proxy quer enviar "GET /", ele o prefixa com o Destino I2P enviando a solicitação, seguido por um ID de solicitação de 4 bytes. O servidor MinWWW recebe essas solicitações, contata o HTTPD apropriado, envia a solicitação, aguarda a resposta e envia uma resposta ao proxy MinWWW contendo a resposta, prefixada com o ID de solicitação original. Essa resposta é obtida e passada de volta para o navegador e a conexão é fechada.
tr: MinWWW vekil sunucusunun ve sunucunun sarmalaması gereken veriler önemsizdir - proxy "GET /" paketi göndermek istediğinde, isteği gönderen I2P hedefi ve ardından 4 baytlık bir istek kimliği ile onu hazırlar. MinWWW vekil sunucusu bu istekleri alır, uygun HTTPD ile bağlantı kurar, isteği gönderir, yanıtı bekler ve özgün istek kimliğinin ön ekiyle birlikte yanıtı içeren MinWWW vekil sunucusuna bir yanıt gönderir. Bu yanıt alınarak tarayıcıya geri gönderilir ve bağlantı kapatılır.

source: In addition, the MinWWW proxy can choose the MinWWW server to use from a list, going through some round robin or other algorithm, so that there are multiple outproxies merged transparently. The bandwidth required for running one of these outproxies is also greatly reduced, since it will only handle 128KB files (aka no one is going to be downloading porn, warez, etc).
pt_br: Além disso, o proxy MinWWW pode escolher o servidor MinWWW a ser usado de uma lista , passando por algum algoritmo round robin ou outro, para que haja múltiplos outproxies mesclados transparentemente. A largura de banda necessária para executar um desses outproxies também é bastante reduzida, já que ele manipulará apenas arquivos de 128 KB (ou seja, ninguém vai baixar pornografia, warez, etc.).
tr: Ek olarak, MinWWW vekil sunucusu, round robin veya başka bir algoritma ile bir listeden kullanacağı MinWWW sunucusunu seçebilir. Böylece şeffaf bir şekilde birleştirilmiş birden fazla çıkış vekil sunucusu kullanılır. Bu çıkış vekil sunucularından birini işletmek için gereken bant genişliği de büyük ölçüde azaltılmış olur, çünkü yalnızca 128KB dosyalar işlerler (yani hiç kimse porno, yasal olmayan yazlım kopyaları, vb. indiremez).

source: The functionality /is/ limited, but 128KB of data is a lot for a single HTTP request or response. The above diagrams are also unrealistic in their hops - ROUTERA will really never talk directly to ROUTERB. ROUTERA will send each of the messages through two additional outbound routers, then forwarded to two additional inbound routers to ROUTERB, so the lag there is significant - while the above only saves 11 steps, 8 of those steps need to traverse the entire tunnel path (4+ remote hops each time when tunnels are 2 remote hops in each stretch), leaving MinWWW with only two full traversals (one for the request, one for the response), instead of 10.
pt_br: A funcionalidade /é/ limitada, mas 128 KB de dados é muito para uma única solicitação ou resposta HTTP . Os diagramas acima também são irrealistas em seus saltos - ROUTERA realmente nunca falará diretamente com ROUTERB. O ROUTERA enviará cada das mensagens por meio de dois roteadores de saída adicionais e, em seguida, encaminhará para dois roteadores de entrada adicionais para o ROUTERB, então o atraso é significativo - enquanto o acima economiza apenas 11 etapas, 8 dessas etapas precisam percorrer todo o caminho do túnel (4+ saltos remotos a cada vez quando os túneis são 2 saltos remotos em cada trecho), deixando o MinWWW com apenas duas travessias completas (uma para a solicitação , uma para a resposta), em vez de 10.
tr: İşlevsellik sınırlıdır, ancak 128 KB veri, tek bir HTTP isteği veya yanıtı için çok fazladır. Yukarıdaki diyagramlar da gerçekçi değildir - YÖNELTİCİ-A gerçekte asla doğrudan YÖNELTİCİ-B ile konuşmaz. YÖNELTİCİ-A, iletilerin her birini iki tane ek çıkış yönelticisi üzerinden gönderir, ardından iki tane ek geliş yönelticisi ile YÖNELTİCİ-B üzerine iletir. Bu nedenle gecikme önemlidir - yukarıdaki yalnızca 11 adım tasarruf eder, bu adımlardan 8 tanesinin tüm tünel yolunu geçmesi gerekir (tüneller her uzanmada 2 uzak durak kullandığında 4+ uzak durak, MinWWW 10 yerine yalnızca iki tam geçişle (biri istek için, biri yanıt için) işlemi tamamlar.

source: Implementing the MinWWW proxy and server should be fairly easy - read an HTTP request from the client fully (perhaps only start out with HTTP GET, leaving HTTP POST for later), wrap the message, and wait for the response. The server in turn simply needs to parse the request to either open a socket or URL, send the request, wait for the response, and send it back through the network. If someone were to implement this, it would be Good :)
pt_br: Implementar o proxy e o servidor MinWWW deve ser bem fácil - leia uma solicitação HTTP do cliente completamente (talvez comece apenas com HTTP GET, deixando HTTP POST para depois), envolva a mensagem e aguarde a resposta. O servidor por sua vez precisa simplesmente analisar a solicitação para abrir um soquete ou URL, enviar a solicitação, aguardar a resposta e enviá-la de volta pela rede. Se alguém implementasse isso, seria bom :)
tr: MinWWW vekil sunucusu ve sunucuyu eklemek oldukça kolay olmalıdır - istemciden gelen bir HTTP isteğini tam olarak okunur (belki de yalnızca HTTP GET ile başlanır, HTTP POST sonraya bırakılır), ileti sarılır ve yanıt beklenir. Sunucunun, bir soket veya adres açmak için isteği işlemesi, isteği göndermesi, yanıtı beklemesi ve ağ üzerinden geri göndermesi yeterlidir. Birisi bunu yapacak olsa, iyi olur :)

source: [1] Why 128KB files? Currently I2CP allows functionally arbitrary message size, but that's going to be going away since it involves either excessive memory overhead on intermediary routers, or additional implementation details to handle. I2PTunnel is currently limited to 128KB and hasn't been a burden, so perhaps it could be increased to 256KB when the I2CP spec is updated)
pt_br: [1] Por que arquivos de 128 KB? Atualmente, o I2CP permite tamanho de mensagem funcionalmente arbitrário , mas isso vai acabar, pois envolve sobrecarga excessiva de memória em roteadores intermediários ou detalhes adicionais de implementação para manipular. O I2PTunnel está atualmente limitado a 128 KB e não tem sido um fardo, então talvez possa ser aumentado para 256 KB quando a especificação do I2CP for atualizada)
tr: [1] Neden 128KB boyutunda dosyalar? Şu anda I2CP, işlevsel olarak isteğe bağlı ileti boyutu kullanılamasına izin veriyor. Ancak bu seçenek, ara yönelticilerde aşırı bellek yükü ya da yapılması gereken ek işlemler gerektirdiğinden kaldırılacak. I2PTunnel şu anda 128 KB ile sınırlıdır ve bir yük oluşturmamıştır. Bu nedenle I2CP teknik özellikleri güncellendiğinde belki 256 KB olarak değiştirilebilir)

source: There has been discussion about a distributed blogging application for a few months now called "MyI2P". While the original discussions were lost, we were able to retrieve a Google <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html">cache</a> of it. It isn't pretty, but it includes the basic overview and some discussion that ensued.
pt_br: Há discussões sobre um aplicativo de blog distribuído há alguns meses chamado "MyI2P". Enquanto as discussões originais foram perdidas, fomos capazes de recuperar um cache do Google <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html"></a> dele. Não é bonito, mas inclui a visão geral básica e alguma discussão que se seguiu.
tr: Birkaç aydır "MyI2P" adıyla dağıtılan bir blog uygulaması hakkında tartışmalar var. Özgün tartışmalar kaybolmuş olsa da, bunun bir Google <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html">ön bellek dökümünü</a>alabildik. Hoş değil, ancak temel özeti ve ardından gelen bazı tartışmaları içeriyor.

source: The application itself is not yet implemented, and the ideas behind it have been made less ambitious over time, but they are still valid and the current <a href="%(roadmap)s">plan</a> is to have the core MyI2P functionality available along side the I2P 1.0 release. That will include a distributed address book to enable secure, distributed, and human readable naming by sacrificing the need for global uniqueness - basically everyone has their own local address book and can 'subscribe' to other people's address books, letting MyI2P periodically retrieve new name to destination mappings (leaving conflicts up to the user to resolve). In addition to the address book, there will be a distributed blogging system using a reduced and secured subset of <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode">bbcode</a> to essentially provide an anonymous <a href="http://www.livejournal.com/">LiveJournal</a> with a 'friends list' and transparent access control (authenticated by the I2P <a href="%(datagrams)s">datagrams</a> with rules defined based on the address book).
pt_br: O aplicativo em si ainda não foi implementado, e as ideias por trás dele foram menos ambiciosas ao longo do tempo, mas ainda são válidas e o plano atual <a href="%(roadmap)s"></a> é ter a funcionalidade principal do MyI2P disponível junto com o lançamento do I2P 1.0. Isso incluirá um catálogo de endereços distribuído para permitir nomes seguros, distribuídos e legíveis por humanos, sacrificando a necessidade de exclusividade global - basicamente, todos têm seu próprio catálogo de endereços local e podem "assinar" os catálogos de endereços de outras pessoas, permitindo que o MyI2P periodicamente recupere novos nomes para mapeamentos de destino (deixando os conflitos para o usuário resolver). Além do catálogo de endereços, haverá um sistema de blogs distribuídos usando um subconjunto reduzido e seguro de <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode">bbcode</a> para essencialmente fornecer um <a href="http://www.livejournal.com/">LiveJournal</a> anônimo com uma 'lista de amigos' e controle de acesso transparente (autenticado pelos datagramas I2P <a href="%(datagrams)s"></a> com regras definidas com base no catálogo de endereços).
tr: Uygulamanın kendisi henüz hazırlanmadı ve arkasındaki fikirler zamanla daha az iddialı hale getirildi. Ancak bunlar hala geçerli ve var olan <a href="%(roadmap)s">planda</a>, I2P 1.0 sürümünün yanında temel MyI2P işlevselliğine sahip olacak. Bu uygulama, küresel eşsizliğe olan gereksinimi feda ederek, güvenli, dağıtılmış ve insan tarafından okunabilir adlandırma yapabilmek için dağıtılmış bir adres defteri içerecek - temelde herkesin kendi yerel adres defteri vardır ve başkalarının adres defterlerine 'abone olması', MyI2P uygulamasının düzenli aralıklarla hedef eşleştirmeleri ile yeni ad almasına yol açar (çakışmaları kullanıcının çözmesi gerekir). Adres defterine ek olarak, esas olarak bir 'arkadaş listesi' ve şeffaf erişim denetimi ile anonim bir <a href="http://www.livejournal.com/">LiveJournal</a> sağlamak için azaltılmış ve güvenli bir <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode">bbcode</a> alt kümesi kullanan dağıtılmış bir bloglama sistemi olacaktır (adres defterine dayanarak tanımlanan kurallarla I2P <a href="%(datagrams)s">veri şemaları</a> tarafından doğrulanır).

source: Additional functionality, such as integration with a DHT backing store or swarming file transfers for 'attachments' can be added later. Email may or may not get in the first pass either, though its implementation is essentially just a blog entry with private access, so perhaps some UI designer can come up with something. Exporting the data to RSS or access through ATOM will be an option down the road as well.
pt_br: Funcionalidades adicionais, como integração com um armazenamento de apoio DHT ou transferências de arquivos de enxame para 'anexos' podem ser adicionadas mais tarde. O e-mail pode ou não entrar na primeira passagem, embora sua implementação seja essencialmente apenas uma entrada de blog com acesso privado, então talvez algum designer de IU possa inventar algo. Exportar os dados para RSS ou acessar por meio do ATOM também será uma opção no futuro.
tr: "Dağıtılmış karma tablosu" (DHT) destek deposuyla bütünleştirme veya "ek dosyalar" için dosya aktarımları yığını gibi ek özellikler daha sonra eklenebilir. E-posta ilk geçişte olabilir ya da olmayabilir. Ancak uygulaması aslında yalnızca özel erişime sahip bir blog kaydı olacağından, belki bazı kullanıcı arayüzü tasarımcıları bir şeyler bulabilir. Verileri RSS üzerine aktarmak veya ATOM üzerinden erişme seçeneği de daha sonra eklenebilir.

source: RateStat list
pt_br: Lista RateStat
tr: Hız istatistikleri listesi

source: I2P enables the collection of a wide range of rates.
pt_br: O I2P permite a coleta de uma ampla variedade de taxas.
tr: I2P, çok geniş bir aralıktaki hızları derler.

source: The list was gathered using the following command in the top directory of the branch i2p.i2p:
pt_br: A lista foi coletada usando o seguinte comando no diretório superior do branch i2p.i2p:
tr: Liste, aşağıdaki komut kullanılarak i2p.i2p dalının en üst dizininde toplanmıştır:

source: All options aren't needed, but it works.
pt_br: Nem todas as opções são necessárias, mas funciona.
tr: Tüm seçenekler gerekli değildir, ancak çalışır.

source: The I2P sourcecode is kept in several distributed monotone repositories. See the <a href="http://www.monotone.ca/">Monotone website</a> for information on monotone. See <a href="http://%(forum)s/viewtopic.php?t=2524">this forum post on i2p monotone</a> for more information on how to get started and check out the source anonymously. There is also a quick-start guide on the <a href="%(newdevs)s">new developer's page</a>.
pt_br: O código-fonte do I2P é mantido em vários repositórios monotone distribuídos. Veja o <a href="http://www.monotone.ca/">site do Monotone</a> para obter informações sobre o monotone. Veja <a href="http://%(forum)s/viewtopic.php?t=2524">esta postagem do fórum sobre o i2p monotone</a> para obter mais informações sobre como começar e verificar o código-fonte anonimamente. Há também um guia de início rápido na <a href="%(newdevs)s">página para novos desenvolvedores</a>.
tr: I2P kaynak kodu, birkaç dağıtılmış monotone deposunda tutulur. Monotone hakkında ayrıntılı bilgi almak için <a href="http://www.monotone.ca/">Monotone sitesine</a> bakabilirsiniz. Nasıl başlayacağınız ve anonim olarak kaynağı nasıl denetleyeceğiniz hakkında ayrıntılı bilgi almak için <a href="http://%(forum)s/viewtopic.php?t=2524">i2p monotone üzerine olan bu forum başlığına</a> bakabilirsiniz. <a href="%(newdevs)s">Yeni geliştiricinin sayfasında</a>bir hızlı başlangıç rehberi de bulabilirsiniz.

source: If you want to get the source non-anonymously, pull from the public server mtn.welterde.de. The i2p source code branch is "i2p.i2p".
pt_br: Se você quiser obter o código-fonte de forma não anônima, extraia do servidor público mtn.welterde.de. O branch do código-fonte do i2p é "i2p.i2p".
tr: Kaynak kodunu anonim olmadan almak istiyorsanız, herkese açık mtn.welterde.de sunucusundan alın. i2p kaynak kodu dalı "i2p.i2p".

source: Guide
pt_br: Guia
tr: Rehber

source: The following is a detailed guide by Complication.
pt_br: O seguinte é um guia detalhado da Complication.
tr: Aşağıda, Complication tarafından hazırlanmış ayrıntılı rehberi görebilirsiniz.

source: How to Upgrade from 0.6.1.30 and Earlier
pt_br: Como atualizar de 0.6.1.30 e versões anteriores
tr: 0.6.1.30 ve öncesindeki sürümlerden nasıl yükseltilir

source: Upgrading from 0.6.1.30 and Earlier Releases
pt_br: Atualizando de 0.6.1.30 e versões anteriores
tr: 0.6.1.30 ve önceki sürümlerden yükseltmek

source: Since i2p's lead developer <a href="%(jrandom)s">has gone AWOL</a>, we do not have his update signing key or access to www.i2p[.net] or dev.i2p[.net]. Complication and zzz have generated new signing keys, and they and Amiga are providing update file hosting. These changes must be configured in your router to take effect.
pt_br: Como o desenvolvedor líder do i2p <a href="%(jrandom)s">desapareceu</a>, não temos sua chave de assinatura de atualização ou acesso a www.i2p[.net] ou dev.i2p[.net]. Complication e zzz geraram novas chaves de assinatura, e eles e o Amiga estão fornecendo hospedagem de arquivo de atualização. Essas alterações devem ser configuradas em seu roteador para entrarem em vigor.
tr: i2p baş geliştiricisi <a href="%(jrandom)s">haber vermeden ortadan kaybolduğundan</a>, onun güncelleme imzalama anahtarına veya www.i2p[.net] ya da dev.i2p[.net] sitelerine erişimimiz yok. Complication ve zzz, yeni imzalama anahtarları üretti ve onlarla birlikte Amiga, güncelleme dosyası barındırma hizmetini sağlıyor. Bu değişikliklerin uygulanabilmesi için yöneltici yapılandırılmanızı değiştirmelisiniz.

source: Make the following configuration changes and your router will automatically install the latest release.
pt_br: Faça as seguintes alterações de configuração e seu roteador instalará automaticamente a versão mais recente.
tr: Yapılandırmanızı aşağıdaki gibi değiştirin. Yönelticiniz son sürümü otomatik olarak kuracaktır.

source: We recommend the automated process as it will verify the key of the signed update file. If you do not make these changes, you may manually download the i2pupdate.zip file from <a href="%(downloads)s">the download page</a>.
pt_br: Recomendamos o processo automatizado, pois ele verificará a chave do arquivo de atualização assinado. Se você não fizer essas alterações, você pode baixar manualmente o arquivo i2pupdate.zip da <a href="%(downloads)s">página de download</a>.
tr: İmzalı güncelleme dosyasının anahtarı doğrulanacağından otomatik işlemi öneririz. Bu değişiklikleri yapmak istemiyorsanız, <a href="%(downloads)s">indirme sayfasından</a> i2pupdate.zip dosyasını el ile indirebilirsiniz.

source: Change the News URL to: %(url)s
pt_br: Alterar a URL da notícia para: %(url)s
tr: News URL adresini şununla değiştirin: %(url)s

source: Select ONE of the following new Update URLs at random and enter it into the Update URL box:
pt_br: Selecione UM dos seguintes novos URLs de atualização aleatoriamente e insira-o na caixa URL de atualização:
tr: Aşağıdaki yeni güncelleme adreslerinden rastgele BİRİNİ seçin ve Adresi güncelle alanına yazın:

source: Check the box "Update through the eepProxy?"
pt_br: Marque a caixa "Atualizar através do eepProxy?"
tr: "Güncelleme eepProxy üzerinden yapılsın" seçeneğini işaretleyin.

source: Click "Save"
pt_br: Clique em "Salvar"
tr: "Kaydet" üzerine tıklayın

source: Add the following line:
pt_br: Adicione a seguinte linha:
tr: Şu satırı ekleyin:

source: Click "Apply"
pt_br: Clique em "Aplicar"
tr: "Uygula" üzerine tıklayın

source: You are now ready to automatically receive the release update file, either by setting your update policy to "download and install" or by clicking on the "update available" link when it appears.
pt_br: Agora você está pronto para receber automaticamente o arquivo de atualização de lançamento, definindo sua política de atualização como "baixar e instalar" ou clicando no link "atualização disponível" quando ele aparecer.
tr: Artık, güncelleme ilkenizi "download and install" olarak ayarlayarak veya panoda gördüğünüzde "güncelleme yayınlanmış" bağlantısına tıklayarak sürüm güncelleme dosyasını otomatik olarak alabilirsiniz.

source: If you would like to verify the trusted update keys, they are also <a href="%(url)s">posted and signed here</a>. Thank you for your support during this transition. For help please contact us on #i2p.
pt_br: Se você quiser verificar as chaves de atualização confiáveis, elas também estão <a href="%(url)s">postadas e assinadas aqui</a>. Obrigado pelo seu suporte durante esta transição. Para obter ajuda, entre em contato conosco em #i2p.
tr: Güvenilen güncelleme anahtarlarını doğrulamak isterseniz, bunları da <a href="%(url)s">burada yayınlanmış ve imzalanmıştır</a>. Bu geçiş sürecindeki desteğiniz için teşekkür ederiz. Yardım almak için #i2p üzerinden bizimle görüşebilirsiniz.
