Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: pt_br, tr

source: I2P at CLT and PetCon 2009.1
pt_br: I2P na CLT e PetCon 2009.1
tr: CLT ve PetCon 2009.1 Etkinliklerinde I2P

source: Members of I2P will held a talk at CLT and PetCon 2009.1 Two members of the I2P team will be at two forthcoming Linux day and security convention.
pt_br: Membros do I2P farão uma palestra na CLT e na PetCon 2009.1 Dois membros da equipe do I2P estarão em dois próximos dias do Linux e convenções de segurança.
tr: I2P üyeleri CLT ve PetCon 2009.1 etkinliğinde bir konuşma yapacak. I2P ekibinin iki üyesi, önümüzdeki iki Linux gününde ve güvenlik kongresinde olacak.

source: On 14th march of 2009 there will be a short talk about general introduction to I2P at the <a href="%(chemnitzer)s">Chemnitz Linux Tag 2009</a> hold by echelon. Echelon and some other members of the I2P family will attend to the Linux meeting the whole two days (Saturday and Sunday) and will be recognizable as I2P family members. Meet them, ask them your questions, show them your props! Show your support!
pt_br: No dia 14 de março de 2009, haverá uma breve palestra sobre introdução geral ao I2P no <a href="%(chemnitzer)s">Chemnitz Linux Tag 2009</a> realizado pela echelon. Echelon e alguns outros membros da família I2P participarão da reunião Linux durante os dois dias inteiros (sábado e domingo) e serão reconhecidos como membros da família I2P. Conheça-os, faça perguntas, mostre seus adereços! Mostre seu apoio!
tr: 14 Mart 2009 tarihinde echelon tarafından düzenlenen <a href="%(chemnitzer)s">Chemnitz Linux Tag 2009</a> etkinliğinde I2P dünyasına genel giriş hakkında kısa bir konuşma yapılacak. Echelon ve I2P ailesinin diğer bazı üyeleri, iki gün boyunca (Cumartesi ve Pazar) Linux toplantısına katılacak ve I2P ailesinin üyeleri olarak tanınacak. Onlarla tanışın, sorularınızı sorun, önerilerinizi sunun! Desteğinizi gösterin!

source: Just 10 days later the <a href="%(petcon)s">Privacy and Data Security convention</a> in Dresden will take place. Again, echelon will attend this event and hold a short talk about general introduction to I2P. Another talk about the profiling by the I2P clients will be held.
pt_br: Apenas 10 dias depois, a convenção <a href="%(petcon)s">Privacidade e Segurança de Dados</a> em Dresden acontecerá. Novamente, a echelon participará deste evento e fará uma breve palestra sobre introdução geral ao I2P. Outra palestra sobre o perfilamento pelos clientes do I2P será realizada.
tr: Yalnızca 10 gün sonra Dresden'de <a href="%(petcon)s">Gizlilik ve Veri Güvenliği kongresi</a> gerçekleşecek. Echelon bu etkinliğe de katılacak ve I2P dünyasına genel giriş hakkında kısa bir konuşma yapacak. I2P istemcileri ile profil oluşturma hakkında başka bir konuşma yapılacak.

source: The I2P sourcecode was kept in a CVS repository. Nowadays it is kept in a <a href="%(monotone)s">Monotone</a> repository. For those who aren't very familiar with CVS, there is a <a href="http://cvsbook.red-bean.com/cvsbook.html">fantastic book</a> on the subject (developers only need to deal with the first chapter - "An Overview of CVS", as subsequent chapters go into some nasty details very few ever need to touch).
pt_br: O código-fonte do I2P era mantido em um repositório CVS. Hoje em dia, ele é mantido em um repositório <a href="%(monotone)s">Monotone</a> . Para aqueles que não estão muito familiarizados com o CVS, há um <a href="http://cvsbook.red-bean.com/cvsbook.html">livro fantástico</a> sobre o assunto (os desenvolvedores só precisam lidar com o primeiro capítulo - "Uma Visão Geral do CVS", pois os capítulos subsequentes entram em alguns detalhes desagradáveis que muito poucos precisam tocar).
tr: I2P kaynak kodu bir CVS deposunda tutuldu. Bugünlerde <a href="%(monotone)s">Monotone</a> deposunda tutuluyor. CVS deposuna çok aşina olmayanlar için, konuyla ilgili <a href="http://cvsbook.red-bean.com/cvsbook.html">harika bir kitap</a> var (geliştiricilerin yalnızca ilk bölümle ilgilenmeleri gerekiyor - "An Overview of CVS". Sonraki bölümler çok azının gerek duyacağı bazı edepsiz ayrıntılara girdiğinden bakmaya gerek yok).

source: Humorous quote from WinCVS: "Did you know... Never experiment with new CVS commands on your working repository. Create a sample module instead."
pt_br: Citação humorística do WinCVS: "Você sabia... Nunca experimente novos comandos CVS em seu repositório de trabalho. Crie um módulo de amostra em vez disso."
tr: WinCVS'den komik bir alıntı: "Biliyor musunuz... Yeni CVS komutlarını asla çalışan deponuzda denemeyin. Onun yerine bir örnek modül oluşturun."

source: I2PTunnel migration
pt_br: Migração do I2PTunnel
tr: I2PTunnel aktarımı

source: After upgrading to the new architecture, you'll have to do a little work to get your old I2PTunnel-driven servers running. Lets walk through a simple example. For an I2P Site with the old clientApp configuration, you had:
pt_br: Após atualizar para a nova arquitetura, você terá que fazer um pequeno trabalho para colocar seus antigos servidores controlados pelo I2PTunnel em execução. Vamos analisar um exemplo simples. Para um Site I2P com a antiga configuração clientApp, você tinha:
tr: Yeni mimariye yükselttikten sonra, eski I2PTunnel yapısını kullanan sunucularınızı çalıştırmak için biraz uğraşmanız gerekecek. Basit bir örnek üzerinden yürüyelim. Eski clientApp yapılandırması olan bir I2P sitesi için şunlar var:

source: To provide that same functionality on the new web architecture:
pt_br: Para fornecer a mesma funcionalidade na nova arquitetura da web:
tr: Aynı işlevi yeni internet mimarisinde sağlamak için:

source: Jump to <a href="%(url)s">%(url)s</a>
pt_br: Pular para <a href="%(url)s">%(url)s</a>
tr: <a href="%(url)s">%(url)s</a> bölümüne gidin

source: Click on Add new: [Server tunnel] "GO"
pt_br: Clique em Adicionar novo: [Túnel do servidor] "GO"
tr: Yeni ekle üzerine tıklayın: [Sunucu tüneli] "Git"

source: For the name: <code>"I2P Site"</code>
pt_br: Para o nome: <code>"Site I2P"</code>
tr: Ad olarak: <code>"I2P Sitesi"</code>

source: For the description: <code>"My I2P Site, isn't it pretty?"</code>
pt_br: Para a descrição: <code>"Meu site I2P, não é bonito?"</code>
tr: Açıklama olarak: <code>"I2P Sitem, güzel değil mi?"</code>

source: >For the target host:
pt_br: >Para o host de destino:
tr: >Hedef sunucu olarak:

source: For the target port:
pt_br: Para a porta de destino:
tr: Hedef bağlantı noktası olarak:

source: For the private key file: <code>path to "myWebPriv.dat"</code><br /> (it is recommended to copy that .dat to your new install dir)
pt_br: Para o arquivo de chave privada: <code>caminho para "myWebPriv.dat"</code><br /> (é recomendável copiar esse .dat para seu novo diretório de instalação)
tr: Özel anahtar dosyası için: <code>"myWebPriv.dat" yolu</code><br /> (bu .dat dosyasını yeni kurulum klasörünüze kopyalamanız önerilir)

source: Check the "Start automatically?" checkbox
pt_br: Marque a caixa de seleção "Iniciar automaticamente?"
tr: "Otomatik olarak başlatılsın" kutusunu işaretleyin

source: Click <code>"Save"</code>
pt_br: Clique em <code>"Salvar"</code>
tr: <code>"Kaydet"</code> üzerine tıklayın

source: It will come back saying:
pt_br: Ele retornará dizendo:
tr: Şunu göreceksiniz:

source: That's it! Creating a new I2PTunnel server works the same way too, except you don't need to "copy the old file", obviously. Behind the scenes, it is all driven by the <code>i2ptunnel.config</code> file, which you may modify externally (if you do, hit "Reload config" on the I2PTunnel web page, which will tear down all of your existing tunnels and rebuild new ones)
pt_br: É isso! Criar um novo servidor I2PTunnel funciona da mesma forma também, exceto que você não precisa "copiar o arquivo antigo", obviamente. Nos bastidores, tudo é controlado pelo arquivo <code>i2ptunnel.config</code> , que você pode modificar externamente (se fizer isso, clique em "Recarregar configuração" na página da web do I2PTunnel, o que derrubará todos os seus túneis existentes e reconstruirá novos)
tr: Bu kadar! Yeni bir I2PTunnel sunucusu oluşturmak da aynı şekildedir. Yalnızca "eski dosyayı kopyalamanıza" gerek yoktur. Perde arkasında, hepsi dışarıdan değiştirebileceğiniz <code>i2ptunnel.config</code> dosyası tarafından yürütülür (dışarıdan değişiklik yaparsanız, I2PTunnel site sayfasındaki "Yapılandırmayı yeniden yükle" üzerine tıklayın. Bu işlem var olan tüm tünellerinizi kapatıp yenilerini oluşturur)

source: Note that you WILL need to wait until your router is integrated into the network before you are able to use the /i2ptunnel/ web interface. It will say "Please be patient" if you try to beforehand, which means that it is still trying to build the necessary I2PTunnel sessions it has been configured to create.
pt_br: Note que você PRECISARÁ esperar até que seu roteador esteja integrado na rede antes de poder usar a interface /i2ptunnel/ web . Ele dirá "Por favor, seja paciente" se você tentar antes, o que significa que ele ainda está tentando construir as sessões I2PTunnel necessárias que ele foi configurado para criar.
tr: /i2ptunnel/ internet arayüzünü kullanabilmeniz için yönelticinizin ağ ile bütünleşmesini beklemeniz gerekeceğini unutmayın. Daha önce denerseniz "Lütfen sabırlı olun" iletisni görürsünüz. Hala yapılandırmada belirtilen gerekli I2PTunnel oturumlarını oluşturmaya çalışıyordur.

source: I2PTunnel services
pt_br: Serviços I2PTunnel
tr: I2PTunnel hizmetleri

source: Below is quick copy of aum's I2P Site deployment guide.
pt_br: Abaixo está uma cópia rápida do guia de implantação do site I2P da aum.
tr: Aşağıda, aum tarafından hazırlanmış I2P Sitesi dağıtım rehberinin kısa kopyasını bulabilirsiniz.

source: 1. - Deploy a local server
pt_br: 1. - Implantar um servidor local
tr: 1. - Yerel bir sunucu yayınlayın

source: For simplicity's sake, we will walk through the setup of a web server; however, this procedure is the same regardless what protocol of servers and/or clients you are setting up.
pt_br: Para simplificar, mostraremos a configuração de um servidor web; no entanto, esse procedimento é o mesmo, independentemente do protocolo de servidores e/ou clientes que você estiver configurando.
tr: Basit olması için, bir site sunucusunun kurulumunu inceleyeceğiz. Ancak bu işlemler, hangi sunucu ve/veya istemci iletişim kuralını kurduğunuzdan bağımsız olarak aynıdır.

source: I recommend the Tiny Httpd web server, thttpd, (windows version available on site) although you can use anything that you feel comfortable with.
pt_br: Recomendo o servidor web Tiny Httpd, thttpd, (versão para Windows disponível no site), embora você possa usar qualquer um com o qual se sinta confortável.
tr: thttpd Tiny Httpd site sunucusunu öneririm (sitede Windows sürümü var). Ancak kendinizi rahat hissettiğiniz herhangi bir şeyi kullanabilirsiniz.

source: Another more robust option would be to use EasyPHP, which is also open source. It comes with PHP, PHPmyadmin, mySQL, and Apache web server. For newbies who have no experience setting up and hosting content over servers, see the hosting page for help.
pt_br: Outra opção mais robusta seria usar o EasyPHP, que também é de código aberto. Ele vem com PHP, PHPmyadmin, mySQL e servidor web Apache. Para novatos que não têm experiência em configurar e hospedar conteúdo em servidores, veja a página de hospedagem para obter ajuda.
tr: Daha sağlam bir seçenek de, kendisi de açık kaynaklı olan EasyPHP kullanmak olacaktır. PHP, PHPmyadmin, mySQL ve Apache site sunucusu ile birlikte gelir. Sunucular üzerine içerik barındırma kurulumu deneyimi olmayan yeni başlayan kişiler için uygundur. Yardım almak için barındırma sayfasına bakabilirsiniz.

source: With the web server you've chosen, configure it to listen on a port of your choice, and serve its documents from a directory of your choice. For this example, we'll assume port 10880.
pt_br: Com o servidor web que você escolheu, configure-o para escutar em uma porta de sua escolha e servir seus documentos de um diretório de sua escolha. Para este exemplo, assumiremos a porta 10880.
tr: Seçtiğiniz site sunucusunu, seçtiğiniz bir bağlantı noktasını dinleyecek ve seçtiğiniz bir klasördeki belgeleri sunacak şekilde yapılandırın. Bu örnek için, 10880 numaralı bağlantı noktası kullanacağız.

source: Make sure your firewall is set up so that you cannot receive incoming connections on this port (which would breach your anonymity).
pt_br: Certifique-se de que seu firewall esteja configurado para que você não possa receber conexões de entrada nesta porta (o que violaria seu anonimato).
tr: Güvenlik duvarınızı, bu bağlantı noktasından geliş bağlantılarını almayacak şekilde ayarlandığından emin olun (yoksa anonimliğiniz bozulur).

source: Test the webserver, by pointing your normal browser (the one with the "direct connection") at <a href="http://localhost:10880" target="_blank">http://localhost:10880</a> (changing the 10880 to the port number you have chosen).
pt_br: Teste o servidor web apontando seu navegador normal (aquele com a "conexão direta") para <a href="http://localhost:10880" target="_blank">http://localhost:10880</a> (alterando o 10880 para o número da porta que você escolheu).
tr: Normal tarayıcınıza ("doğrudan bağlantılı" olan) <a href="http://localhost:10880" target="_blank">http://localhost:10880</a> (10880 yerine kullanmayı seçtiğiniz bağlantı noktasını yazın) adresini yazarak site sunucusunun çalışıp çalışmadığına bakabilirsiniz.

source: Once your webserver is working, and you can access it locally with your browser, continue to the next step.
pt_br: Quando seu servidor web estiver funcionando e você puder acessá-lo localmente com seu navegador, continue para a próxima etapa.
tr: Site sunucunuzu çalıştırıp tarayıcınızla yerel olarak erişebildiğinizi görünce bir sonraki adıma geçin.

source: 2 - Generate an I2P Destination Keypair
pt_br: 2 - Gerar um par de chaves de destino I2P
tr: 2 - Bir I2P hedef anahtar çifti oluşturun

source: I2P does not deal in IP addresses. To protect your anonymity, it deals in unique addresses called destination keys.
pt_br: O I2P não lida com endereços IP. Para proteger seu anonimato, ele lida com endereços únicos chamados chaves de destino.
tr: I2P, IP adreslerini kullanmaz. Anonimliğinizi korumak için hedef anahtarlar adı verilen benzersiz adresler kullanır.

source: A destination key works a lot like a regular IP address, except that it can't be traced to your IP address or physical location. When users place a request to speak with you, your gateways are the ones that answer for you. So the requesting user can only know the IP address of your gateways. However, gateways don't know your IP address, because gateways are the last nodes on your tunnels, and you anonymously create tunnels by way of garlic routing. (So gateways are like puppets that can't see their masters, and everyone communicates through these puppets)
pt_br: Uma chave de destino funciona muito como um endereço IP regular, exceto que não pode ser rastreada até seu endereço IP ou localização física. Quando os usuários fazem uma solicitação para falar com você, seus gateways são os que respondem por você. Então, o usuário solicitante só pode saber o endereço IP dos seus gateways. No entanto, os gateways não sabem seu endereço IP, porque os gateways são os últimos nós em seus túneis, e você cria túneis anonimamente por meio do roteamento garlic. (Então os gateways são como marionetes que não podem ver seus mestres, e todos se comunicam por meio desses marionetes)
tr: Hedef anahtar, IP adresinize veya fiziksel konumunuza kadar izlenememesi dışında normal bir IP adresi gibi çalışır. Kullanıcılar sizinle konuşmak istediklerinde, sizin adınıza ağ geçitleriniz yanıt verir. Böylece istekte bulunan kullanıcı yalnızca ağ geçitlerinizin IP adresini bilebilir. Ancak ağ geçitleri IP adresinizi bilmez, çünkü ağ geçitleri tünellerinizdeki son düğümlerdir ve Garlic yöneltme yoluyla tünelleri anonim kalarak oluşturursunuz. (Yani ağ geçitleri efendisini göremeyen kuklalar gibidir ve herkes bu kuklalar aracılığıyla iletişim kurar)

source: To deploy a server on I2P, you create a destination keypair. You use the private key to authenticate your server when connecting it to I2P, and you make the public key (aka destination key) known publicly, so others can connect to your server. (indirectly, through your gateways)
pt_br: Para implantar um servidor no I2P, você cria um par de chaves de destino. Você usa a chave privada para autenticar seu servidor ao conectá-lo ao I2P, e você torna a chave pública (também conhecida como chave de destino) conhecida publicamente, para que outros possam se conectar ao seu servidor. (indiretamente, por meio de seus gateways)
tr: I2P üzerinde bir sunucu yayınlamak için bir hedef anahtar çifti oluşturursunuz. Sunucunuzu I2P ağına bağlarken kimliğini doğrulamak için özel anahtarı kullanırsınız. Başkalarının sunucunuza bağlanabilmesi için herkese açık anahtarı (diğer adıyla hedef anahtar) herkese açık hale getirirsiniz (ağ geçitleriniz aracılığıyla dolaylı olarak).

source: Each service you run on I2P requires a different keypair.
pt_br: Cada serviço executado no I2P requer um par de chaves diferente.
tr: I2P üzerinde çalıştırdığınız her hizmet için farklı bir anahtar çifti gerekir.

source: To generate your keypair, type the command: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code> (all on one line)
pt_br: Para gerar seu par de chaves, digite o comando: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code> (tudo em uma linha)
tr: Anahtar çiftinizi oluşturmak için şu komutu yazın: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code> (tümünü aynı satıra)

source: In windows, to generate your keypair, type the command: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code>
pt_br: No Windows, para gerar seu par de chaves, digite o comando: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code>
tr: Windows üzerinde, anahtar çiftinizi oluşturmak için şu komutu yazın: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code>

source: The filenames <code>myWebPrivKey.dat</code> and <code>myWebPubKey.dat</code> are arbitrary - choose whatever you want here, as long as you understand your own choices.
pt_br: Os nomes de arquivo <code>myWebPrivKey.dat</code> e <code>myWebPubKey.dat</code> são arbitrários - escolha o que quiser aqui, desde que você entenda suas próprias escolhas.
tr: <code>myWebPrivKey.dat</code> ve <code>myWebPubKey.dat</code> dosya adları isteğe bağlıdır. Kendi seçimlerinizi anladığınız sürece burada istediğiniz gibi seçebilirsiniz.

source: We now need to export your public key into base64 format, which you will share with others.
pt_br: Agora precisamos exportar sua chave pública para o formato base64, que você compartilhará com outras pessoas.
tr: Şimdi herkese açık anahtarınızı başkalarıyla paylaşacağınız base64 biçimine dönüştürmemiz gerekiyor.

source: To convert your myWebPubKey.dat file into shareable base64, type the command <code>java -cp lib/i2p.jar net.i2p.data.Base64 encode myWebPubKey.dat &gt; myWebPubKey.txt</code> (all on one line).
pt_br: Para converter seu arquivo myWebPubKey.dat em base64 compartilhável, digite o comando <code>java -cp lib/i2p.jar net.i2p.data.Base64 encode myWebPubKey.dat &gt; myWebPubKey.txt</code> (tudo em uma linha).
tr: myWebPubKey.dat dosyanızı paylaşılabilir base64 biçimine dönüştürmek için <code>java -cp lib/i2p.jar net.i2p.data.Base64 encode myWebPubKey.dat &gt; myWebPubKey.txt</code> komutunu yazın (tümünü aynı satıra).

source: This file you have just generated, <code>myWebPubKey.txt</code>, contains a long base64 string (516 chars at last count), which we call a destination key. All you need to know about this string for now is that it allows remote clients to uniquely pinpoint and connect to your server, just the same way as an IP address allows remote machines to pinpoint and connect to your machine.
pt_br: Este arquivo que você acabou de gerar, <code>myWebPubKey.txt</code>, contém uma longa string base64 (516 caracteres na última contagem), que chamamos de chave de destino. Tudo o que você precisa saber sobre essa string por enquanto é que ela permite que clientes remotos localizem e se conectem exclusivamente ao seu servidor, da mesma forma que um endereço IP permite que máquinas remotas localizem e se conectem à sua máquina.
tr: Yeni oluşturduğunuz bu dosya, <code>myWebPubKey.txt</code>, hedef anahtar dediğimiz uzun bir base64 dizgesi (son sayımda 516 karakter) içerir. Şimdilik bu dizge hakkında bilmeniz gereken tek şey, uzak istemcilerin benzersiz bir şekilde sunucunuzun tam yerini belirlemesini ve bağlanmasını sağlamasıdır. Tıpkı bir IP adresinin uzak bilgisayarların bilgisayarınızı tam olarak belirleyip bağlanmasını sağlaması gibi.

source: However, in contrast to an IP address, there is no way to trace your machine's physical location - even though your server can be addressed via I2P, your IP address cannot be traced or associated with this destination key.
pt_br: Entretanto, diferentemente de um endereço IP, não há como rastrear a localização física da sua máquina. Embora seu servidor possa ser endereçado via I2P, seu endereço IP não pode ser rastreado ou associado a essa chave de destino.
tr: Bununla birlikte, bir IP adresinin aksine, bilgisayarınızın fiziksel konumunu izlemenin bir yolu yoktur. Sunucunuz I2P aracılığıyla adreslenebilse bile, IP adresiniz izlenemez veya bu hedef anahtarıyla ilişkilendirilemez.

source: 3 - Open a 'Tunnel' from I2P To Your Server
pt_br: 3 - Abra um 'Túnel' do I2P para o seu servidor
tr: 3 - I2P üzerinden sunucunuza bir 'Tünel' açın

source: For clients elsewhere in I2P to be able to access your server, you must run a 'bridge' or 'tunnel', which takes connections from these clients and forwards them to your local server.
pt_br: Para que clientes em outros lugares no I2P possam acessar seu servidor, você deve executar uma 'ponte' ou 'túnel', que pega as conexões desses clientes e as encaminha para seu servidor local.
tr: I2P üzerinde herhangi bir yerdeki istemcilerin sunucunuza erişebilmesi için, bu istemcilerden bağlantıları alan ve bunları yerel sunucunuza ileten bir 'köprü' veya 'tünel' işletmeniz gerekir.

source: To activate such a tunnel, type the command <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code> (all one line).
pt_br: Para ativar esse túnel, digite o comando <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code> (tudo em uma linha).
tr: Böyle bir tüneli etkinleştirmek için <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code> komutunu yazın (tümünü aynı satıra).

source: If you used different filenames or port number earlier on, change these accordingly
pt_br: Se você usou nomes de arquivo ou números de porta diferentes anteriormente, altere-os de acordo
tr: Daha önce farklı dosya adları veya bağlantı noktası kullandıysanız, bunları uygun şekilde değiştirin.

source: Windows users, remember to replace apostrophes with double quotes. Thus: <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code>
pt_br: Usuários do Windows, lembrem-se de substituir apóstrofos por aspas duplas. Assim: <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code>
tr: Windows kullanıcıları, kesme işaretlerini çift tırnak işaretiyle değiştirmeyi unutmayın. Yani: <code>java -jar lib/i2ptunnel.jar -nogui -e "sunucu localhost 10880 myWebPrivKey.dat"</code>
