Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: pt_br, tr

source: The required code is available in monotone database and the latest source tarball.
pt_br: O código necessário está disponível no banco de dados monotone e no último tarball de origem.
tr: Gerekli kod monoton veri tabanında ve en son kaynak paketinde bulunur.

source: The GNU MP Bignum library (libgmp) needs to be installed, if it isn't included in your OS / distribution or installed already, it can be received from <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>. Even if you have already installed it as binary, it might still be worth a try to compile GMP yourself, since then it will be able to use the specific instructions of your processor. The latest GMP may also be used instead of GMP 5.0.2, but it hasn't been tested by us.
pt_br: A biblioteca GNU MP Bignum (libgmp) precisa ser instalada, se não estiver incluída no seu SO/distribuição ou já instalada, ela pode ser recebida de <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>. Mesmo se você já a tiver instalado como binária, ainda pode valer a pena tentar compilar o GMP você mesmo, pois assim ele poderá usar as instruções específicas do seu processador. O GMP mais recente também pode ser usado em vez do GMP 5.0.2, mas não foi testado por nós.
tr: İşletim sisteminizde ya da dağıtımızınızda bulunmuyorsa, GNU MP Bignum kitaplığının (libgmp) kurulması gerekir. <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a> adresinden alınabilir. Binary olarak kurmuş olsanız bile, GMP paketini kendinizin derlemesi denemeye değer olabilir. Bu durumda işlemcinizin özel komutları kullanılabilir. GMP 5.0.2 yerine son GMP sürümü de kullanılabilir, ancak tarafımızdan denenmemiştir.

source: Step-by-step instructions
pt_br: Instruções passo a passo
tr: Adım adım yönergeler

source: Look at <a href="http://localhost:7657/logs.jsp">your running environment on the logs.jsp page</a>. There should be one of two status messages for JBigI - either
pt_br: Veja <a href="http://localhost:7657/logs.jsp">seu ambiente de execução na página logs.jsp</a>. Deve haver uma das duas mensagens de status para JBigI -
tr: logs.jsp sayfasından <a href="http://localhost:7657/logs.jsp">çalışan ortamınıza bakın</a>. JBigI için iki durum iletisinden biri görüntülenmedir. Ya

source: Locally optimized native BigInteger loaded from the library path
pt_br: BigInteger nativo otimizado localmente carregado do caminho da biblioteca
tr: Kitaplık yolundan yüklenen iyileştirilmiş yerel BigInteger

source: or
pt_br: ou
tr: ya da

source: Native BigInteger library jbigi not loaded - using pure java
pt_br: Biblioteca nativa BigInteger jbigi não carregada - usando java puro
tr: Yerel BigInteger kitaplığı jbigi yüklü değil - saf java kullanarak

source: If the native BitInteger library was NOT loaded, you definitely need to compile your own. Certain platforms, such as OS X, OpenSolaris, and 64-bit systems, may require you to compile your own library. If the BigInteger library was loaded, do at least the next step to see what your performance is.
pt_br: Se a biblioteca nativa BitInteger NÃO foi carregada, você definitivamente precisa compilar a sua própria. Certas plataformas, como OS X, OpenSolaris e sistemas de 64 bits, podem exigir que você compile sua própria biblioteca. Se a biblioteca BigInteger foi carregada, execute pelo menos o próximo passo para ver qual é o seu desempenho.
tr: Yerel BitInteger kitaplığı YÜKLENMEDİYSE, kesinlikle kendi derlemenizi yapın. OS X, OpenSolaris ve 64 bit sistemler gibi belirli platformlar için kendi kitaplığınızı derlemeniz gerekebilir. BigInteger kitaplığı yüklendiyse, başarımınızın nasıl olduğunu görmek için en azından bir sonraki adımı uygulayın.

source: Look on <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> to see what the lifetime average values for <code>crypto.elGamal.decrypt</code> and <code>crypto.elGamal.encrypt</code> are. The numbers are times in milliseconds. Copy these somewhere so you can compare them later on. The network average for encrypt time is about 20ms. If your encrypt time is less than 50ms for a relatively new processor, or less than 100ms for an older processor, and the native BigInteger library was loaded, you are probably fine.
pt_br: Veja em <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> para ver quais são os valores médios de tempo de vida para <code>crypto.elGamal.decrypt</code> e <code>crypto.elGamal.encrypt</code> . Os números são tempos em milissegundos. Copie-os em algum lugar para que você possa compará-los mais tarde. A média da rede para o tempo de criptografia é de cerca de 20 ms. Se o seu tempo de criptografia for menor que 50 ms para um processador relativamente novo, ou menor que 100 ms para um processador mais antigo, e a biblioteca nativa BigInteger foi carregada, provavelmente está tudo bem.
tr: <code>crypto.elGamal.decrypt</code> ve <code>crypto.elGamal.encrypt</code> için yaşam boyu ortalama değerlerin ne olduğunu <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> adresinden görebilirsiniz. Sayılar milisaniye cinsindendir. Bunları daha sonra karşılaştırabilmek için bir yere kopyalayın. Şifreleme süresi için ağ ortalaması yaklaşık 20 milisaniyedir. Şifreleme süreniz nispeten yeni bir işlemci için 50 milisaniyeden, daha eski bir işlemci için 100 milisaniyeden düşükse ve yerel BigInteger kitaplığı yüklendiyse, sorun olmaması gerekir.

source: Get the latest released source code of I2P from <a href="%(downloads)s">the download page</a>, or get the cutting-edge source out of the monotone database mtn.i2p2.de
pt_br: Obtenha o código-fonte mais recente do I2P lançado em <a href="%(downloads)s">a página de download</a>ou obtenha o código-fonte de ponta do banco de dados monotone mtn.i2p2.de
tr: <a href="%(downloads)s">İndirme sayfasından</a> güncel I2P kaynak kodunu alın veya monoton veri tabanının güncel kaynak kodunu mtn.i2p2.de üzerinden alın

source: Inside the source tree change directory to: <code>core/c/jbigi</code>
pt_br: Dentro da árvore de origem, altere o diretório para: <code>core/c/jbigi</code>
tr: Kaynak ağacında şu klasöre gidin: <code>core/c/jbigi</code>

source: Read the README file. If you have a /usr/lib/libgmp.so file, you do not have to download GMP. Use the 'dynamic' argument to build.sh. Otherwise, you must download GMP version 5.0.2 from from <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>, saving it to gmp-5.0.2.tar.bz2. If you decide to use a newer version, change the VER= line in <code>core/c/jbigi/build.sh</code>.
pt_br: Leia o arquivo README. Se você tiver um arquivo /usr/lib/libgmp.so, não precisará baixar o GMP. Use o argumento 'dynamic' para build.sh. Caso contrário, você deve baixar a versão 5.0.2 do GMP de de <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>, salvando-a em gmp-5.0.2.tar.bz2. Se você decidir usar uma versão mais recente, altere a linha VER= em <code>core/c/jbigi/build.sh</code>.
tr: README dosyasını okuyun. Bir /usr/lib/libgmp.so dosyanız varsa, GMP indirmeniz gerekmez. build.sh ile 'dynamic' argümanını kullanın. Yoksa, <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a> adresinden GMP 5.0.2 sürümünü indirmeniz ve gmp-5.0.2.tar.bz2 olarak kaydetmeniz gerekir. Daha yeni bir sürüm kullanmaya karar verirseniz, <code>core/c/jbigi/build.sh</code> dosyasındaki VER= satırını değiştirin.

source: Take a look at <code>build.sh</code>, if your <code>JAVA_HOME</code> environment variable is set and you are using Linux then it might just work. Otherwise change the settings. Remember, you need the Java SDK installed.
pt_br: Dê uma olhada em <code>build.sh</code>, se sua variável de ambiente <code>JAVA_HOME</code> estiver definida e você estiver usando Linux, então pode funcionar. Caso contrário, altere as configurações. Lembre-se, você precisa do Java SDK instalado.
tr: <code>JAVA_HOME</code> ortam değişkeniniz ayarlanmışsa ve Linux kullanıyorsanız <code>build.sh</code> dosyasına bir göz atmanız işe yarayabilir. Olmuyorsa ayarları değiştirin. Unutmayın, Java SDK yazılımını yüklemeniz gerekir.

source: Run <code>build.sh</code> (if you downloaded GMP) or <code>build.sh dynamic</code> (if you have /usr/lib/libgmp.so).<br/> Maybe the build spewed out some errors of missing jni.h and jni_md.h files. Either copy these files from your java install into the core/c/jbigi/jbigi/include/ directory, or fix $JAVA_HOME.<br> You can run the <code>build.sh</code> from the <code>core/c/</code> directory which will build all available jbigi libs into a jbigi.jar.</br> A file named <code>libjbigi.so</code> should be created in the current directory. If this doesn't happen and/or you get errors then please report them.
pt_br: Execute <code>build.sh</code> (se você baixou o GMP) ou <code>build.sh dynamic</code> (se você tiver /usr/lib/libgmp.so).<br/> Talvez a compilação tenha gerado alguns erros de arquivos jni.h e jni_md.h ausentes. Copie esses arquivos da sua instalação do Java para o diretório core/c/jbigi/jbigi/include/, ou corrija $JAVA_HOME.<br> Você pode executar o <code>build.sh</code> do diretório <code>core/c/</code> que irá construir todas as bibliotecas jbigi disponíveis em um jbigi.jar.</br> Um arquivo chamado <code>libjbigi.so</code> deve ser criado no diretório atual. Se isso não acontecer e/ou você receber erros, por favor, os informe.
tr: <code>build.sh</code> (GMP indirdiyseniz) veya <code>build.sh dynamic</code> (elinizde /usr/lib/libgmp.so varsa) komutunu yürütün.<br/> Derleme, eksik jni.h ve jni_md.h dosyalarının bazı hatalarını yaymış olabilir. Bu dosyaları Java kurulumunuzdan core/c/jbigi/jbigi/include/ klasörüne kopyalayın ya da $JAVA_HOME değerini düzeltin.<br> <code>build.sh</code> komutunu <code>core/c/</code> klasöründen çalıştırabilirsiniz. Böylece var olan tüm jbigi kitaplıkları bir jbigi.jar içine toplanır. Geçerli klasörde <code>libjbigi.so</code> adlı bir dosya oluşturulmalıdır. Bu olmazsa ve/veya hata iletisi alırsanız lütfen bunları bildirin.

source: Follow the instructions in core/c/README to install the library and run the speed test. Read the final lines of the speed test's output for some additional info, it will be something like this:
pt_br: Siga as instruções em core/c/README para instalar a biblioteca e executar o teste de velocidade. Leia as linhas finais da saída do teste de velocidade para obter algumas informações adicionais, será algo assim:
tr: Kitaplığı kurmak ve hız sınamasını yapmak için core/c/README içindeki yönergeleri izleyin. Bazı ek bilgiler için hız sınamasının çıktısının son satırlarını okuyun. Şuna benzer bir şey olacaktır:

source: If the native is indeed 5-7x faster (or more) then it looks all good. If not, please report.
pt_br: Se o nativo for de fato 5-7x mais rápido (ou mais), então parece estar tudo bem. Se não, por favor, reporte.
tr: Doğal, gerçekten 5-7 kat veya (daha fazla) hızlıysa her şey yolunda görünüyor. Değilse, lütfen bildirin.

source: Copy <code>libjbigi.so</code> to your i2p directory
pt_br: Copie <code>libjbigi.so</code> para seu diretório i2p
tr: <code>libjbigi.so</code> dosyasını i2p klasörünüze kopyalayın

source: Restart your I2P programs.
pt_br: Reinicie seus programas I2P.
tr: I2P programlarınızı yeniden başlatın.

source: On <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> the <code>crypto.elGamal.decrypt</code> and <code>crypto.elGamal.encrypt</code> should be a lot faster.
pt_br: Em <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> o <code>crypto.elGamal.decrypt</code> e <code>crypto.elGamal.encrypt</code> devem ser muito mais rápidos.
tr: <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> üzerinde <code>crypto.elGamal.decrypt</code> ve <code>crypto.elGamal.encrypt</code> çok daha hızlı olmalıdır.

source: Jrandom's Announcement
pt_br: Anúncio de Jrandom
tr: Jrandom duyurusu

source: The following message was received in mid-November 2007. We have no further information on jrandom's status.
pt_br: A mensagem a seguir foi recebida em meados de novembro de 2007. Não temos mais informações sobre o status do jrandom.
tr: Aşağıdaki ileti 2007 Kasım ortalarında alındı. jrandom hakkında başka bir bilgimiz yok.

source: Subsequently, in an unrelated incident, the hosting company for all *.i2p.net servers (except forum.i2p.net) suffered a power outage on January 13, 2008, and the i2p.net servers did not fully return to service. As only jrandom has the credentials required to restore service, and he could not be contacted, we moved all public services to <a href="%(site)s">www.i2p2.de</a> and related subdomains.
pt_br: Posteriormente, em um incidente não relacionado, a empresa de hospedagem de todos os servidores *.i2p.net (exceto forum.i2p.net) sofreu uma queda de energia em 13 de janeiro de 2008, e os servidores i2p.net não retornaram totalmente ao serviço. Como apenas jrandom tem as credenciais necessárias para restaurar o serviço, e ele não pôde ser contatado, movemos todos os serviços públicos para <a href="%(site)s">www.i2p2.de</a> e subdomínios relacionados.
tr: Ardından, ilgisiz bir olayda, tüm *.i2p.net sunucularının (forum.i2p.net dışında) barındırma hizmeti sağlayıcısında 13 Ocak 2008 tarihinde bir elektrik kesintisi yaşandı ve i2p.net sunucuları tam olarak hizmet vermeye geri dönemedi. Hizmeti geri yüklemek için gereken kimlik doğrulama bilgilerine yalnızca jrandom sahip olduğundan ve kendisiyle bağlantı kurulamadığından, herkese açık tüm hizmetleri <a href="%(site)s">www.i2p2.de</a> ve ilgili alt etki alanı adlarına taşıdık.

source: Approximately two months later, for unrelated reasons, forum.i2p.net was moved to <a href="http://%(forum)s/">%(forum)s</a>.
pt_br: Aproximadamente dois meses depois, por razões não relacionadas, forum.i2p.net foi movido para <a href="http://%(forum)s/">%(forum)s</a>.
tr: Yaklaşık iki ay sonra ilgisiz başka nedenlerle, forum.i2p.net <a href="http://%(forum)s/">%(forum)s</a> adresine taşındı.

source: Manually Installing the Java Wrapper
pt_br: Instalando manualmente o Java Wrapper
tr: Java sarmalayıcıyı el ile kurmak

source: The installation package for the <a href="%(downloads)s">I2P router</a> comes with a Java wrapper for the most common architectures. If your system is not supported by our installer&mdash;or if you want to update the wrapper to a newer version&mdash;the following steps describe installing the wrapper manually.
pt_br: O pacote de instalação para o roteador I2P <a href="%(downloads)s"></a> vem com um wrapper Java para as arquiteturas mais comuns. Se seu sistema não for suportado pelo nosso instalador&mdash;ou se você quiser atualizar o wrapper para uma versão mais nova&mdash;as etapas a seguir descrevem a instalação manual do wrapper.
tr: <a href="%(downloads)s">I2P yöneltici</a>kurulum paketinde, en yaygın mimariler için Java sarmalayıcı bulunur. Kurulum paketi sisteminizi desteklemiyorsa &mdash;ya da sarmalayıcıyı daha yeni bir sürüme güncellemek istiyorsanız&mdash;aşağıdaki adımları izleyerek sarmalayıcıyı el ile kurabilirsiniz.

source: Check Tanuki Software's <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable">download page</a> for your platform. Is your platform listed? If so, you're in luck! Download the most recent version of the Community Edition for your OS and CPU and move to <a href="#packaged">the next step</a>.
pt_br: Verifique a página de download <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable">da Tanuki Software</a> para sua plataforma. Sua plataforma está listada? Se sim, você está com sorte! Baixe a versão mais recente da Community Edition para seu SO e CPU e vá para <a href="#packaged">a próxima etapa</a>.
tr: Platformunuz için Tanuki Software <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable">indirme sayfasına</a> bakın. Platformunuz listede var mı? Varsa, şanslısınız! İşletim sisteminize ve işlemcinize uygun en son Community Edition sürümünü indirin ve <a href="#packaged">sonraki adıma geçin</a>.

source: If your platform does not have an already compiled wrapper available, you may be able to compile it yourself. If you are willing to have a go at it, move on to <a href="#compiling">compiling</a> the wrapper for your system.
pt_br: Se sua plataforma não tiver um wrapper já compilado disponível, você pode ser capaz de compilá-lo você mesmo. Se você estiver disposto a tentar, vá para <a href="#compiling">compilar</a> o wrapper para seu sistema.
tr: Platformunuz için önceden derlenmiş bir sarmalayıcı yoksa, kendiniz derleyebilirsiniz. Denemeye hazırsanız, sisteminiz için sarmalayıcıyı <a href="#compiling"> derlemeye</a> geçin.

source: Using existing binaries
pt_br: Usando binários existentes
tr: Var olan binary dosyaları kullanmak

source: In the steps below, $I2P means <em>the location I2P was installed to</em>.
pt_br: Nas etapas abaixo, $I2P significa <em>o local onde o I2P foi instalado</em>.
tr: Aşağıdaki adımlarda $I2P, <em>I2P uygulamasının kurulu olduğu konum</em> anlamına gelir.

source: Try to start I2P using <code>$I2P/i2prouter start</code>
pt_br: Tente iniciar o I2P usando <code>$I2P/i2prouter start</code>
tr: <code>$I2P/i2prouter start</code> komutuyla I2P uygulamasını başlatmayı deneyin

source: <code>tail -f /tmp/wrapper.log</code> and look for any problems.
pt_br: <code>tail -f /tmp/wrapper.log</code> e procure por quaisquer problemas.
tr: <code>tail -f /tmp/wrapper.log</code> komutu ile bir sorun var mı bakın.

source: If this did not work you'll need to use <code>runplain.sh</code> to start I2P.
pt_br: Se isso não funcionar, você precisará usar <code>runplain.sh</code> para iniciar o I2P.
tr: Sorun çıkarsa I2P uygulamasını başlatmak için <code>runplain.sh</code> kullanmalısınız.

source: Compiling from source
pt_br: Compilando da fonte
tr: Kaynak kodundan derlemek

source: These steps worked to compile the wrapper for use on a mipsel system running Debian. The steps <strong>will</strong> need to be altered for your system.
pt_br: Essas etapas funcionaram para compilar o wrapper para uso em um sistema mipsel executando Debian. As etapas <strong>precisarão</strong> ser alteradas para seu sistema.
tr: Bu adımlar, sarmalayıcıyı Debian çalıştıran bir mipsel sisteminde kullanmak üzere derledi. Adımlarının sisteminize uygun olarak <strong>değiştirilmesi</strong> gerekir.

source: Download the source archive for the community version of the wrapper from <a href="http://wrapper.tanukisoftware.com/downloads">wrapper download page</a>.
pt_br: Baixe o arquivo de origem para a versão da comunidade do wrapper em <a href="http://wrapper.tanukisoftware.com/downloads">página de download do wrapper</a>.
tr: Sarmalayıcı topluluk sürümünün kaynak arşiv paketini <a href="http://wrapper.tanukisoftware.com/downloads">sarmalayıcı indirme sayfasından</a> indirin.

source: Extract the tarball
pt_br: Extraia o tarball
tr: Tarball paketini ayıklamak

source: Set environment variables <code>ANT_HOME</code> and <code>JAVA_HOME</code>. For example, in Debian:
pt_br: Defina as variáveis de ambiente <code>ANT_HOME</code> e <code>JAVA_HOME</code>. Por exemplo, no Debian:
tr: <code>ANT_HOME</code> ve <code>JAVA_HOME</code> ortam değişkenlerini ayarlayın. Örneğin Debian için:

source: Since there isn't a Makefile for Mipsel, we'll make a copy of an already existing makefile:
pt_br: Como não há um Makefile para o Mipsel, faremos uma cópia de um makefile já existente:
tr: Mipsel için bir Makefile bulunmadığından, var olan bir makefile kopyasını alacağız:

source: Now we can attempt to compile the wrapper:
pt_br: Agora podemos tentar compilar o wrapper:
tr: Şimdi sarmalayıcıyı derlemeye çalışabiliriz:

source: use <code>./build64.sh</code> if you have a 64bit CPU and JVM
pt_br: use <code>./build64.sh</code> se você tiver uma CPU de 64 bits e JVM
tr: 64 bit işlemci ve JVM kullanıyorsanız <code>./build64.sh</code> komutunu kullanın

source: Copy the wrapper into its proper place:
pt_br: Copie o wrapper para o seu devido lugar:
tr: Sarmalayıcıyı olması gereken yere kopyalayın:

source: Here's an outline and rationale for a minimal WWW proxy app for use over I2P.
pt_br: Aqui está um esboço e uma justificativa para um aplicativo proxy WWW mínimo para uso em I2P.
tr: I2P üzerinde minimal bir WWW vekil sunucu uygulaması kullanma taslağı ve gerekçesi.

source: HTTP operation over I2P using I2PTunnel. When the base SocketLibrary is out, the only significant difference will be the 'wrapRequest' and 'unwrapRequest' will functionally be placed in the socketLibrary, not in the router (but later versions of the SocketLibrary will be able to use selective ACK and large window sizes, allowing more ACKs to be skipped)
pt_br: Operação HTTP sobre I2P usando I2PTunnel. Quando a SocketLibrary base estiver fora, a única diferença significativa será que o 'wrapRequest' e 'unwrapRequest' serão colocados funcionalmente na socketLibrary, não no roteador (mas versões posteriores da SocketLibrary poderão usar ACK seletivo e tamanhos de janela grandes, permitindo que mais ACKs sejam ignorados)
tr: I2PTunnel kullanarak I2P üzerinden HTTP işlemi. Temel SocketLibrary çıktığında, tek önemli fark 'wrapRequest' olacaktır ve 'unwrapRequest' işlevsel olarak yönelticiye değil socketLibrary üzerine yerleştirilecektir (ancak sonraki SocketLibrary sürümleri seçici ACK ve büyük pencere kullanarak, daha fazla ACK atlayabilir)

source: An optimized form, designed to handle only 128KB [1] files and pages, can operate significantly faster:
pt_br: Um formulário otimizado, projetado para lidar com apenas arquivos e páginas de 128 KB [1], pode operar significativamente mais rápido:
tr: Yalnızca 128KB [1] dosya ve sayfaları işlemek üzere tasarlanmış ve ayarlanmış bir form, önemli ölçüde daha hızlı çalışabilir:

source: The difference in network load and latency is significant - this is essentially a UDP version of HTTP. On the normal web, we can't really do that, since most HTTP requests and responses are orders of magnitude larger than UDP packets functionally support, but in I2P, messages can be large. The savings for the network load comes from the fact that we don't need to send any ACK messages - rather than the earlier wrap/unwrap request (that bundles a DataMessage with a DeliveryStatusMessage to provide guaranteed delivery), the MinWWW proxy deals with resends (if necessary - in I2PTunnel today, there are no resends).
pt_br: A diferença na carga de rede e latência é significativa - isto é essencialmente uma versão UDP do HTTP. Na web normal, não podemos realmente fazer isso, já que a maioria das requisições e respostas HTTP são ordens de magnitude maiores do que os pacotes UDP suportam funcionalmente, mas no I2P, as mensagens podem ser grandes. A economia para a carga de rede vem do fato de que não precisamos enviar nenhuma mensagem ACK - ao invés da requisição wrap/unwrap anterior (que agrupa uma DataMessage com uma DeliveryStatusMessage para fornecer entrega garantida), o proxy MinWWW lida com reenvios (se necessário - no I2PTunnel hoje, não há reenvios).
tr: Ağ yükü ve gecikme süresindeki fark önemlidir. Bu aslında bir HTTP UDP sürümüdür. Normal internet üzerinde bunu gerçekten yapamayız, çünkü çoğu HTTP istek ve yanıtı, UDP paketlerinin işlevsel olarak destekleyebileceğinden daha büyük boyutlarda olduğundan, iletiler büyük olabilir. Ağ yükü için tasarruf, daha önceki sarma/açma isteği (garantili teslimat sağlamak için bir "Veri iletisi" ve "Aktarım durumu iletisi", DataMessage ve DeliveryStatusMessage ikilisi) yerine, herhangi bir ACK iletisi göndermemize gerek olmaması gerçeğinden kaynaklanmaktadır. MinWWW vekil sunucusu yeniden göndermelerle ilgilenir (gerekiyorsa. Bugün I2PTunnel üzerinde yeniden gönderim yapılmaz).
