Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: If you want to browse hidden websites ('eepsites') on the I2P network, you need to configure your browser. Instructions for configuring a range of browsers are available on <a href="%(browser)s">the browser configuration page</a>.
fr: Si vous voulez naviguez sur des sites cachés ('eepsites') sur le réseau I2P, vous aurez besoin de configurer votre navigateur. Les instructions pour configurer une variété de navigateurs sont disponible sur <a href="%(browser)s">la page de configuration de navigateur</a>.
id: Jika Anda ingin menelusuri situs web tersembunyi ('eepsites') di jaringan I2P, Anda perlu mengkonfigurasi browser Anda. Instruksi untuk mengkonfigurasi berbagai browser tersedia di <a href="%(browser)s"> halaman konfigurasi browser </a>.
ja: 秘匿ウェブサイト（ I2P サイト ）を I2P ネットワーク上で閲覧したいなら、ブラウザを 設定する必要があります。様々なブラウザの設定方法は、<a href="%(browser)s">ブラウザ設定ページ</a>で 見ることができます。
pl: Jeśli chcesz przeglądać ukryte strony ('eepsites') w sieci I2P, musisz skonfigurować swoją przeglądarkę. Instrukcje dotyczące konfiguracji różnych przeglądarek są na <a href="%(browser)s">stronie konfiguracji przeglądarek</a>.
pt: Se você quiser navegar por websites ocultos ('eepsites') na rede I2P, você precisará configurar seu navegador. Instruções para configurar diversos navegadores estão disponíveis na <a href="%(browser)s">página de configuração do navegador</a>.
tr: I2P ağında gizli internet sitelerine ('eepsiteleri') göz atmak istiyorsanız, tarayıcınızı yapılandırmanız gerekir. <a href="%(browser)s">Tarayıcı yapılandırma sayfasında</a> bir dizi tarayıcıyı yapılandırma yönergesi bulabilirsiniz.

source: Two important reasons, 1) because this package is a .dmg, it can be signed with a certificate which will be recognized by your computer. This means that your computer can automatically make sure that you've obtained I2P from the I2P Project, rather than a potentially altered or "fake" installer, and 2) because it makes I2P easier to install and work with on Apple computers by using tools that are familiar and built-into the operating system.
fr: Deux raisons importantes, 1) parce que ce paquet est un .dmg, il peut être signé avec un certificat qui sera reconnu par votre ordinateur. Cela veut dire que votre ordinateur pourra automatiquement vérifier que vous avez obtenu I2P par le projet I2P, au lieu d'un programme d'installation faux ou potentiellement modifié et 2) parce que cela rend I2P plus facile à installer et fonctionner sur les ordinateurs Apple en utilisant des outils qui sont familier et intégrés dans le système opérateur.
id: Ada dua alasan penting, 1) Karena paket ini adalah paket .dmg, paket ini dapat ditandatangani dengan sertifikat yang akan dikenali oleh komputer Anda. Ini berarti bahwa komputer Anda dapat secara otomatis memastikan bahwa Anda telah memperoleh I2P dari I2P Project, bukan dari installer yang berpotensi diubah atau "palsu", dan 2) karena I2P dibuat lebih mudah untuk diinstal dan digunakan di komputer Apple dengan menggunakan alat yang familiar dan terintegrasi dengan sistem operasi.
ja: 二つの重要な理由があります。1）このパッケージは .dmg であるのでコンピューターが認識している 証明書で署名できます。つまり、ご利用のコンピューターが自動的に、潜在的に改変が加えられた 「偽の」インストーラーではない、 I2P プロジェクトから取得した I2P であると確認することが可能ですし 2）オペレーティングシステムに内蔵されている慣れ親しんだツールを使用して Apple コンピューター に簡単に I2P をインストールでき、動作させることができるためです。
pt: Dois motivos importantes, 1) por este pacote ser um .dmg, ele pode ser assinado com um certificado que será reconhecido pelo seu computador. Isso significa que seu computador consegue automaticamente garantir que você obteve a I2P do Projeto I2P, e não um instalador potencialmente alterado ou "falso", e 2) porque ele torna a I2P mais fácil de instalar e de trabalhar com ela em computadores Apple ao usar ferramentas que são familiares e embutidas no sistema operacional.
tr: İki önemli neden, 1) bu paket bir .dmg olduğu için bilgisayarınız tarafından tanınacak bir sertifika ile imzalanabilir. Böylece, bilgisayarınız I2P paketinin potansiyel olarak değiştirilmiş veya "sahte" bir kurucu olmadığını, I2P Projesi üzerinden aldığınızdan gerçek kurucu olduğunu otomatik olarak anlayabilir ve 2) Apple bilgisayarlarındaki işletim sisteminde bulunan tanıdık araçları kullanarak I2P kurulumu ve kullanımını kolaylaştırır.

source: Instructions
de: Anleitung
es_ar: Instrucciones
id: Instruksi
ja: 説明
pl: Instrukcje
pt: Instruções
tr: Yönergeler

source: Download the appropriate file for your Mac hardware and double-click on it. Accept the License Agreement, then drag the <code>I2P</code> icon on top of the <code>Applications</code> icon. Launch I2P from Finder.
fr: Téléchargez le fichier correspondant à votre matériel Mac et cliquez deux fois dessus. Acceptez l'accord de licence, puis faites glisser l'icône <code>I2P</code> au dessus de l'icône <code>Applications</code>. Démarrez I2P à partir de Finder.
id: Unduh file yang sesuai untuk perangkat keras Mac Anda lalu klik dua kali. Setujui License Agreement, lalu Seret ikon <code> i2p </code> di atas ikon <code> Applications </code>. Luncurkan I2P dari Finder.
pt: Baixe o arquivo apropriado para seu hardware Mac e dê dois cliques nele. Aceite o Acordo de Licença, então arraste o ícone da <code>I2P</code>em cima do ícone de <code>Applications</code>. Inicie a I2P a partir do Finder.
tr: Mac donanımıza uygun dosyayı indirin ve üzerine çift tıklayın. Lisans sözleşmesini kabul edin. Ardından <code>I2P</code> simgesini <code>Uygulamalar</code> simgesinin üzerine sürükleyin. Finder üzerinden I2P uygulamasını başlatın.

source: Apple Silicon Notes
fr: Notes Apple Silicon
id: Catatan Apple Silicon
pt: Notas para Apple Silicon
tr: Apple Silicon Notları

source: If you own an Apple silicon Mac and have previously installed the Intel bundle on it you need to change the update configuration to make sure the next I2P update does not revert your bundle to Intel.
fr: Si vous êtes en possession d'un Mac Apple Silicon et avez précédemment installé le paquet Intel dessus, vous aurez besoin de changer la configuration de mise à jour pour être sûr que la prochaine mise à jour I2P ne fera pas revenir en arrière votre paquet à Intel.
id: Jika Anda memiliki Apple Silicon Mac dan sebelumnya telah menginstal bundel Intel di dalamnya, Anda perlu mengubah konfigurasi pembaruan untuk memastikan pembaruan I2P berikutnya tidak mengembalikan bundel Anda ke Intel.
pt: Se você tem um Mac com Apple Silicon e instalou anteriormente o pacote da Intel nele, você precisa mudar a configuração de atualização para garantir que a próxima atualização da I2P não reverta seu pacote para Intel.
tr: Apple Silicon işlemcili bir Mac kullanıyorsanız ve daha önce Intel paketini kurduysanız, bir sonraki I2P güncellemesinin paketinizi Intel biçimine döndürmediğinden emin olmak için güncelleme yapılandırmasını değiştirmeniz gerekir.

source: Go to the "Configure Update" page, usually located at:
fr: Allez à la page "Configurer Mises à jour", habituellement située sur :
id: Buka halaman "Configure Update", yang biasanya terletak di:
pt: Vá para a página "Configurar Atualização", geralmente localizada em:
tr: "Güncelleme yapılandırması" bölümüne gidin. Genellikle şurada bulunur:

source: Then copy-paste the following in the "News URL" field:
fr: Puis copiez-coller le suivant dans le champ "Nouveautés URL" :
id: Kemudian copy-paste berikut ini di bidang "News URL":
pt: Então copie e cole o seguinte no campo "URL de Notícias":
tr: Aşağıdaki satırı kopyalayıp "Haber adresi" alanına yapıştırın:

source: Limitations
de: Einschränkungen
es_ar: Limitaciones
id: Limitasi
ja: 制約
pl: Ograniczenia
pt: Limitações
tr: Sınırlamalar

source: I2P will not install any launch agents on your Mac. If you want I2P to start on system startup, you need to configure a launch agent yourself. You can configure I2P to launch when your user logs in by right-clicking on the I2P Dock icon.
fr: I2P ne n'installera aucun agents de lancement sur votre Mac. Si vous voulez que I2P démarre en lançant le système, vous devrez configurer un agent de lancement vous-même. Vous pouvez configurer I2P pour qu'il se lance quand votre utilisateur se connecte en faisant clique droit sur l'icône Dock I2P.
id: I2P tidak akan menginstal launch agent apa pun di Mac Anda. Jika Anda ingin I2P mulai saat komputer Anda dinyalakan, Anda perlu mengkonfigurasi sendiri launch agent-nya. Anda dapat mengonfigurasi I2P untuk diluncurkan ketika pengguna log in dengan mengklik kanan pada ikon I2P Dock.
ja: I2P はご利用の Mac に Launchd エージェントをインストールしません。システムのスタートアップで I2P を起動させたい場合、自分で Launchd エージェントを設定する必要があります。I2P のドックアイコン を右クリックすることでログイン時に I2P を起動するよう設定することができます。
pt: A I2P não instalará quaisquer agentes de inicialização no seu Mac. Se você quiser que a I2P inicie na inicialização do sistema, você mesmo precisa configurar um agente de inicialização. Você pode configurar a I2P para iniciar quando o seu usuário fizer login clicando com o botão direito no ícone da I2P no Dock.
tr: I2P, Mac bilgisayarınıza herhangi bir başlatma aracısı kurmaz. Sistem başlatıldığında I2P uygulamasının da başlatılmasını istiyorsanız, kendinizin bir başlatma aracısı yapılandırmanız gerekir. I2P uygulamasını, kullanıcınız oturum açtığında I2P dock simgesine sağ tıklayarak başlatacak şekilde yapılandırabilirsiniz.

source: If you would like to examine the source code for individual components, you may find it on i2pgit.org.
fr: Si vous souhaitez examiner le code source pour des composants individuellement, vous pouvez le trouver sur i2pgit.org.
id: Jika Anda ingin memeriksa source code untuk masing-masing komponen, Anda dapat mendapatkannya di i2pgit.org.
ja: 個々のコンポーネントのソースコードを吟味したい場合、i2pgit.org で見つけることができます。
pl: Jeśli chciałbyś zbadać kod źródłowy dla poszczególnych komponentów, możesz go znaleźć na stronie i2pgit.org.
pt: Se você gostaria de examinar o código-fonte para componentes individuais, você pode encontrá-lo em i2pgit.org.
tr: Ayrı ayrı bileşenlerin kaynak kodunu incelemek isterseniz, i2pgit.org üzerinde bulabilirsiniz.

source: If you wish to file an issue about the DMG Bundle, please use Gitlab to contact us. For security-sensitive issues, please remember to check the "This issue is confidential and should only be visible to team members with at least Reporter access" option when filing the issue.
fr: Si vous souhaitez déposer un problème par rapport au Paquet DMG, veuillez utiliser Gitlab pour nous contacter. En raison de problèmes liés à la sécurité, n'oubliez pas de vérifier l'option "Ce problème est confidentiel et ne devrait être visible seulement aux membres de l'équipe avec au moins accès Reporter" en déposant le problème.
id: Jika Anda ingin melaporkan masalah tentang bundle DMG, silakan gunakan Gitlab untuk menghubungi kami. Untuk masalah keamanan, mohon untuk mencentang "Masalah ini rahasia dan hanya boleh terlihat oleh anggota tim dengan setidaknya akses reporter" opsi saat melaporkan masalah.
ja: DMG バンドルに関して問題を報告したい場合、Gitlabを使って、 連絡してください。セキュリティに影響する問題については、問題を報告する際 「この問題は機密であり、少なくとも報告者アクセスを持つチームメンバーにのみ 閲覧可能であるべきです」というオプションを確認することを忘れないでください。
pt: Se você desejar abrir uma "issue" sobre o Pacote DMG, por favor, use o Gitlab para contatar-nos. Para problemas de segurança sensíveis, por favor, lembre de marcar a opção "This issue is confidential and should only be visible to team members with at least Reporter access" ao preencher a "issue".
tr: DMG paketi hakkında bir sorun bildirmek isterseniz, bizimle GitLab üzerinden iletişim kurun. Güvenlik açısından hassas konularda, sorunu bildirirken "This issue is confidential and should only be visible to team members with at least Reporter access" seçeneğini işaretlemeyi unutmayın.

source: After running the installer on windows, simply click on the "Start I2P" button which will bring up the <a href="http://localhost:7657/index.jsp">router console</a>, which has further instructions.
de: Nach der Installation unter Windows einfach den "Start I2P" Button drücken, wodurch die <a href="http://localhost:7657/index.jsp">Router Konsole</a> mit weiteren Anleitungen erscheint.
es_ar: Después de ejecutar el instalador en Windows simplemente pulse en el botón "Iniciar I2P" que abrirá la <a href="http://localhost:7657/index.jsp">consola del router I2P</a>, donde encontrará más instrucciones.
fr: Après avoir exécuté le programme d’installation sous Windows, cliquer simplement sur le bouton « Démarrer I2P » qui fera apparaître la <a href="http://localhost:7657/index.jsp">console du routeur</a> avec de plus amples instructions.
id: Setelah menjalankan installer Windows, klik tombol "Mulai I2P" yang akan memunculkan <a href="http://localhost:7657/index.jsp">router console</a>, yang memiliki instruksi lebih lanjut.
ja: windows でインストーラーを起動した後、「I2P を始める」ボタンをクリックするだけで <a href="http://localhost:7657/index.jsp">ルーターコンソール</a>が現れ さらなる指示が表示されます。
pl: Po uruchomieniu instalatora pod Windowsem, kliknij w przycisk „start I2P” który wyświetli <a href="http://localhost:7657/index.jsp">konsolę węzła</a> zawierającą dalsze instrukcje.
pt: Depois de executar o instalador no Windows, basta clicar em "Iniciar I2P" que mostrará a <a href="http://localhost:7657/index.jsp">consola do roteador</a>, que tem mais instruções.
tr: Windows üzerinde kurucuyu çalıştırdıktan sonra "I2P Uygulamasını Başlat" düğmesine tıklayarak ayrıntılı bilgileri görebileceğiniz <a href="http://localhost:7657/index.jsp">yöneltici panosunu</a> başlatın.

source: On Unix-like systems, I2P can be started as a service using the "i2prouter" script, located in the directory you selected for I2P. Changing to that directory in a console and issuing "sh i2prouter status" should tell you the router's status. The arguments "start", "stop" and "restart" control the service. The <a href="http://localhost:7657/index.jsp">router console</a> can be accessed at its usual location. For users on OpenSolaris and other systems for which the wrapper (i2psvc) is not supported, start the router with "sh runplain.sh" instead.
de: Auf Unix-artigen Systemen kann I2P als Service gestartet werden mit dem "i2prouter" script aus dem von Ihnen gewählten I2P Installationsverzeichnis. Aus dem Verzeichnis heraus "sh i2prouter status" aufruden sollte Ihnen den Status des Routers mitteilen. Die Argumente "start","stop" und "restart" kontrollieren den Service. Die <a href="http://localhost:7657/index.jsp">Router Konsole</a> kann am gewohnten Ort erreicht werden. Für User von OpenSolaris und anderen Systemen, auf denen der Wrapper (i2psvc) nicht unterstützt wird, starten Sie den Router stattdessen mit "sh runplain.sh".
es_ar: En sistemas tipo-Unix, I2P puede ser ejecutado como un servicio usando el script "i2prouter" ubicado en el directorio seleccionado para I2P. En un terminal, llendo a ese directorio y ejecutando "sh i2prouter status" debería mostrarle el estado del router I2P. Los argumentos "start", "stop" y "restart" controlan el servicio. A la <a href="http://localhost:7657/index.jsp">consola del router</a> se puede acceder en su ubicación habitual. Para usuarios de OpenSolaris y otros sistemas para los que no está soportado el wrapper (i2psvc, encapsulador como servicio para Java), ejecute el router I2P con "sh runplain.sh" en lugar del anterior.
fr: Sur les systèmes de type Unix, I2P peut être démarré en tant que service en utilisant le script « i2prouter » situé dans le répertoire que vous avez sélectionné pour I2P. En vous rendant dans ce répertoire dans un terminal et en exécutant la commande « sh i2prouter status », vous devriez obtenir l’état du routeur. Les arguments « start », « stop » et « restart » contrôlent le service. L’on peut accéder à la <a href="http://localhost:7657/index.jsp">console du routeur</a> à son emplacement habituel. Pour les utilisateurs d’OpenSolaris et d’autres systèmes pour lesquels l’enveloppeur (i2psvc) n’est pas pris en charge. Le routeur sera plutôt démarré avec la commande « sh runplain.sh ».
id: Pada sistem jenis Unix, I2P dapat dimulai sebagai service menggunakan skrip "i2prouter", yang terletak di direktori yang dipilih untuk I2P. Mengubah ke direktori tersebut di console dan menjalankan perintah "sh i2prouter status" akan menampilkan status router. Argumen "start", "stop" dan "restart" akan mengendalikan service I2P. <a href="http://localhost:7657/index.jsp">router console</a> dapat diakses di lokasi biasa. Untuk pengguna OpenSolaris atau sistem lain di mana wrapper (i2psvc) tidak didukung, start router dengan perintah "sh runplain.sh
ja: Unixライクなシステムでは、 I2P は I2P 用に選択したディレクトリにある "i2prouter" スクリプトを使用するサービスとして起動します。 コンソールでそのディレクトリに変更し、 "sh i2prouter status" とすることで ルータの状態が示されるはずです。引数 "start" や "stop" 、 "restart" はサービスをコントロールします。<a href="http://localhost:7657/index.jsp">ルーターコンソール</a> は通常の位置でアクセスできます。 OpenSolaris 及びラッパー (i2psvc) がサポートされていないその他のシステムのユーザーについては、代わりに "sh runplain.sh" でルータを起動してください。
pl: Na systemach uniksopodobnych, I2P może być uruchomiony jako usługa używając skryptu „i2prouter”, znajdującego się w katalogu który wybrałeś dla I2P. Po przejściu do tego katalogu w terminalu i wpisaniu „sh i2prouter status” powinno pokazać Ci jaki jest status węzła. Argumenty „start”, „stop” i „restart” kontrolują usługę. <a href="http://localhost:7657/index.jsp">Konsola węzła</a> jest dostępna tam gdzie zawsze. Użytkownicy OpenSolaris i innych systemów dla których powłoka (i2psvc) jest nieobsługiwana, mogą uruchomić węzeł korzystając z „sh runplain.sh”.
pt: Em sistemas da família Unix, o I2P pode se iniciar como serviço usando o script "i2prouter", localizado no duretório que você selecionou para o I2P. Indo para esse diretório por um terminal e digitando "sh i2prouter status" exibirá o status do roteador. Os parâmetros "start", "stop" e "restart" controlam o serviço. O <a href="http://localhost:7657/index.jsp">console do roteador</a> pode ser acessado de sua localização usual. Para usuários do OpenSolaris e outros sistemas para os quais o wrapper (i2psvc) incompatível, dêem partida no roteador com "sh runplain.sh".
tr: Unix benzeri sistemlerde I2P uygulaması yüklendiği klasörün içindeki "i2prouter" betiği kullanılarak bir hizmet olarak başlatılabilir. Panoda bu klasöre gidip "sh i2prouter status" komutunu yazarak yönelticinizin durum bilgilerini görebilirsiniz. "start", "stop" ve "restart" komutları ile hizmeti denetleyebilirsiniz. <a href="http://localhost:7657/index.jsp">Yöneltici Panosuna</a> her zamanki konumdan erişilebilir. OpenSolaris ve diğer sistemlerde kapsayıcı (i2psvc) desteklenmiyor. Bu yüzden yönelticiyi "sh runplain.sh" yazarak başlatın.

source: When installing for the first time, please remember to <b>adjust your NAT/firewall</b> if you can, bearing in mind the Internet-facing ports I2P uses, <a href="%(faq)s#ports">described here</a> among other ports. If you have successfully opened your port to inbound TCP, also enable inbound TCP on the <a href="http://localhost:7657/confignet.jsp">configuration page</a>.
de: Passen Sie bitte bei der ersten Installation <b>ihre Firewall/NAT Regeln</a>, soweit möglich, an. Beachten Sie dabei die I2P Ports für die Internetverbindung, die neben anderen Ports <a href="%(faq)s#ports">hier beschrieben sind</a>. Nachdem Sie erfolgreich Ihren Port für eingehende TCP Verbindungen geöffnet haben, aktivieren Sie bitte eingehenden TCP Verkehr auf der <a href="http://localhost:7657/confignet.jsp">Konfigurationsseite</a>.
es_ar: Cuando instale I2P por primera vez, por favor recuerde <b>ajustar su NAT/cortafuegos</b> sin olvidarse de los puertos que I2P usa para Internet, <a href="%(faq)s#ports">descritos aquí</a>. Si ha abierto con éxito su puerto TCP de entrada en su NAT/cortafuegos, habilítelo también en la <a href="http://localhost:7657/confignet.jsp">página de configuración</a>.
fr: Lors d’une première installation, veuillez si vous le pouvez vous rappeler <b>de paramétrer votre traduction d’adresses réseau ou votre pare-feu</b> en tenant compte des ports dirigés vers Internet qu’I2P utilise, <a href="%(faq)s#ports">décrits ici</a> parmi d’autres ports. Si vous avez ouvert avec succès votre port au TCP entrant, activer aussi le TCP entrant sur la <a href="http://localhost:7657/confignet.jsp">page de configuration</a>.
id: Ketika meng-instal untuk pertama kalinya, harap ingat untuk <b>menyesuaikan NAT/firewall anda</b> jika anda dapat melakukannya. Ingat bahwa I2P menggunakan port yang digunakan untuk internet,<a href="%(faq)s#ports">dijelaskan di sini</a> dan juga berbagai port lain. Jika Anda telah berhasil membuka port anda untuk inbound TCP, juga buka inbound TCP pada <a href="http://localhost:7657/confignet.jsp">halaman konfigurasi</a>.
ja: 初めてインストールする際は、 可能であれば、 I2P が使用するインターネット接続ポートを念頭に入れて <b>NAT/ファイアーウォール</b>を調整することを忘れないでください。 他のポートの中で<a href="%(faq)s#ports">ここで説明されています</a>。 正常に入力 TCP にポートを開放できたら、 <a href="http://localhost:7657/confignet.jsp">設定ページ</a>でも 入力 TCP が有効になります。
pl: Podczas pierwszej instalacji prosimy pamiętać o <b>skonfigurowaniu swojego NAT-u/zapory sieciowej</b> mając na uwadze porty używane przez I2P <a href="%(faq)s#ports">opisane tutaj</a>. Jeśli pomyślnie otworzyłeś swój port TCP przychodzący, także aktywuj nasłuch na TCP na <a href="http://localhost:7657/confignet.jsp">stronie konfiguracji</a>.
pt: Ao instalar pela primeira vez, lembre-se de <b>ajustar seu NAT/firewall</b> Se puder, tendo em mente as portas que o I2P expõe à internet, <a href="%(faq)s#ports">descritas aqui</a> dentre outras portas. Se você conseguiu abrir sua porta para entrada de TCP, habilite também a entrada de TCP na <a href="http://localhost:7657/confignet.jsp">página de configuração</a>.
tr: İlk kez kurarken <b>NAT/Güvenlik Duvarı ayarlarınızı yapmayı unutmayın</b> Bu ayarları yapabiliyorsanız diğer bağlantı noktalarının yanında I2P tarafından <a href="%(faq)s#ports">burada belirtilen</a> İnternet bağlantı noktalarını unutmayın. Geliş TCP bağlantı noktasını açabiliyorsanız, <a href="http://localhost:7657/confignet.jsp">Yapılandırma bölümünden</a> geliş TCP bağlantısı seçeneğini etkinleştirin.

source: Also, please review and <b>adjust the bandwidth settings</b> on the <a href="http://localhost:7657/config.jsp">configuration page</a>, as the default settings of 96 KBps down / 40 KBps up are fairly slow.
de: Bitte kontrollieren und <b>passen Sie die Bandbreiteneinstellungen</b> auf der <a href="http://127.0.0.1:7657/config.jsp">Einstellungsseite</a> an,⏎ da die Standardeinstellungen von 96 KB/sec Download / 40 KB/sec Upload gering gesetzt sind.
es_ar: Además, por favor revise y <b>ajuste su configuración de ancho de banda</b> en la <a href="http://localhost:7657/config.jsp">página de configuración</a>, ya que la configuración por defecto de 96 KBps de bajada / 40 KBps de subida es bastante lenta.
fr: Veuillez aussi réviser et <b>ajuster les paramètres de bande passante</b> sur la <a href="http://localhost:7657/config.jsp">page de configuration</a>, car les paramètres par défaut de 96 ko/s en aval et 40 ko/s en amont sont plutôt lents.
id: Juga, harap meninjau dan <b>menyesuaikan pengaturan bandwidth</b> pada <a href="http://localhost:7657/config.jsp">halaman konfigurasi</a>, karena kecepatan default 96 KBps unduh / 40 KBps unggah masih cukup lambat.
ja: また、<a href="http://localhost:7657/config.jsp">設定ページ</a>にて 規定の設定である 96KBps ダウン 40KBps アップはかなり遅いので <b>帯域幅設定を確認・調整</b>してください。
pl: Prosimy także o sprawdzenie i <b>dostosowanie ustawień przepustowości</b> na <a href="http://localhost:7657/config.jsp">stronie konfiguracji</a>, ponieważ domyślne ustawienia 96 KB/s pobierania i 40 KB/s wysyłania są bardzo wolne.
pt: Além disso, reveja e <b>ajuste as configurações de largura de banda</b> na <a href="http://localhost:7657/config.jsp">página de configuração</a>, já que as configurações padrão de 96 KBps para download / 40 KBps para upload são bem lentas.
tr: Lütfen <a href="http://localhost:7657/config.jsp">yapılandırma bölümündeki</a>, <b>bant genişliği ayarlarını</b> gözden geçirin. Varsayılan ayarlar olan 96 KB/s indirme ve 40 KB/s yükleme değerleri oldukça yavaştır.
