Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: A typical symptom of a failed reseed is the "Known" indicator (on the left sidebar of the router console) displaying a very small value (often less than 5) which does not increase. This can occur, among other things, if your local firewall limits outbound traffic or if the reseed request is blocked entirely.
de: Ein typisches Symptom eines fehlgeschlagenen Reseedens ist eine geringe Anzeige der "Bekannten" Peers (in der linken Seite der Router Konsole) (oft weniger als 5) und diese Nummer nicht ansteigt. Dieses passiert, neben anderen Gründen, wenn Ihre lokale Firewall eingehenden Verkehr blockiert oder reseed Anfragen komplett blockiert werden.
es_ar: Un síntoma típico de un resembrado fallido es el indicador "Conocidos" (a la izquierda de la barra lateral de la consola del router I2P) mostrando un valor muy pequeño (a menudo menor que 5) que no se incrementa. Esto puede ocurrir, entre otras cosas, si su cortafuegos (firewall) local limita el tráfico saliente o si la petición de resembrado está bloqueada por completo.
fr: Un symptôme habituel d’un réensemencement échoué est l’affichage d’une valeur très petite (souvent moins de 5) qui n’augmente pas par l’indicateur « Connus » (dans la barre latérale gauche de la console du routeur). Cela peut se produire, entre autres, si votre pare-feu local limite le trafic sortant ou si la demande de réensemencement est complètement bloquée.
id: Gejala khas reseed yang gagal adalah indikator "Known" (di bilah sisi kiri router console) yang menampilkan nilai yang sangat kecil (seringkali kurang dari 5) yang tidak bertambah. Hal ini dapat terjadi, antara lain, jika firewall lokal anda membatasi lalu lintas keluar atau jika permintaan reseed diblokir seluruhnya.
ja: 再シード失敗の典型的症状は、「既知」インジケータ（ルーターコンソールの左サイドバー）が 極めて小さな値（たいてい5未満）を示し増加しないというものです。 中でも、ローカルのファイアウォールがアウトバウンドトラフィックを制限したり再シード要求を完全にブロックした場合に起こります。
pl: Typowym objawem nieudanego reseedowania jest wskaźnik „znani” (po lewej stronie konsoli węzła) wyświetlający bardzo małą wartość (często mnij niż 5), która nie rośnie. To może się zdarzyć, między innymi gdy Twoja zapora sieciowa blokuje ruch wychodzący lub żądanie reseedowania jest całkowicie zablokowane.
pt: Um sintoma típico de uma repropagação falhada é o indicador "Conhecido" (na barra lateral esquerda do painel do roteador) mostrando um valor muito pequeno (muitas vezes inferior a 5) que não aumenta. Isto pode ocorrer, entre outras coisas, se seu firewall local limitar o tráfego de saída ou se o pedido de repropagação for totalmente bloqueado.
tr: Bir yeniden tohumlama işleminin başarısız olduğu "Bilinen" göstergesinde (yöneltici panosunun sol yan çubuğunda) çok küçük bir değer (genellikle 5 değerinden küçük) görüntülenmesi ve artmaması ile anlaşılabilir. Bu duruma neden olabilecek pek çok şeyin yanında yerel güvenlik duvarı gidiş bağlantısı trafiği kısıtlıyor ya da yeniden tohumlama isteklerini tümüyle engelliyor olabilir.

source: If you are stuck behind an ISP firewall or filter, you can use the following manual method (non-automated technical solution) to join the I2P network.
de: Falls Sie hinter einer Firewall oder Filter ihres ISP sind, können Sie folgende manuelle Methode (nicht automatische, technische Lösung) nutzen um dem I2P Netzwerk beizutreten.
es_ar: Si está atrapado detrás de un cortafuegos o filtro de su proveedor de Internet (ISP), puede usar el siguiente método manual (solución técnica no-automatizada) para unirse a la red I2P.
fr: Si vous vous trouvez derrière le pare-feu ou le filtre d’un FAI, vous pouvez utiliser la méthode manuelle suivante (solution technique non automatisée) pour vous joindre au réseau I2P.
id: Jika Anda terjebak di balik firewall atau filter ISP, anda dapat menggunakan metode manual berikut (solusi teknis non-otomatis) untuk bergabung dengan jaringan I2P.
ja: プロバイダのファイアウォールやフィルタに阻まれている場合、次の手順（手動の技術的解決法）を使ってI2Pネットワークに入れます。
pl: Jeżeli utknąłeś za zaporą Twojego dostawcy internetu lub jakiegoś filtra, możesz ręcznie połączyć się z siecią I2P.
pt: Se você estiver preso atrás de um firewall ou filtro de seu provedor de internet, você pode usar o seguinte método manual (solução técnica não-automatizada) para aderir a rede I2P.
tr: Bir İnternet Hizmeti Sağlayıcısının güvenlik duvarı ya da süzgeci arkasında bulunuyorsanız I2P ağına katılmak için aşağıdaki el ile ayarlanan (otomatik olmayan teknik çözüm) yöntemi kullanabilirsiniz.

source: As of release 0.9.33, you may also configure your router to reseed through a proxy. Go to <a href="%(url)s">%(url)s</a> and configure the proxy type, hostname, and port.
de: Seit Version 0.9.33 können Sie Ihren Router auch aufs Reseeden via eines Proxies konfigurieren. Besuchen Sie <a href="%(url)s">%(url)s</a> und geben Sie den Proxytyp, Hostname und Port an.
es_ar: Desde la versión 0.9.33, también puede configurar su router I2P para resembrar a través de proxy. Vaya a <a href="%(url)s">%(url)s</a> y configure el tipo de proxy, nombre de servidor, y puerto.
fr: À partir de la version 0.9.33, vous pouvez aussi configurer votre routeur pour passer par un mandataire pour le réensemencement. Allez sur <a href="%(url)s">%(url)s</a> et configurez le type de mandataire, le nom d’hôte et le port.
id: Mulai dari rilis 0.9.33, Anda dapat mengatur router untuk melakukan reseed melalui proxy. Buka <a href="%(url)s">%(url)s</a> lalu atur tipe proxy hostname, dan port.
ja: バージョン0.9.33時点で、プロキシを通じて再シードを行うように設定できます。 <a href="%(url)s">%(url)s</a> に行き、プロキシのタイプ、ホスト名、ポートを指定しましょう。
pl: Wraz z wydaniem 0.9.33 możesz także skonfigurować swój węzeł, aby reseedował przez proxy. Przejdź do <a href="%(url)s">%(url)s</a> i skonfiguruj rodzaj proxy, nazwę hosta i port.
pt: A partir do lançamento 0.9.33, você também pode configurar seu roteador I2P para ser repropagado via proxy. Vá para <a href="%(url)s">%(url)s</a> e configure o tipo de proxy, nome do host, e porta.
tr: 0.9.33 sürümüyle birlikte yönelticinizi bir vekil sunucu üzerinden yeniden tohumlama yapacak şekilde yapılandırabilirsiniz. <a href="%(url)s">%(url)s</a> adresine giderek vekil sunucu türü, sunucu adı ve bağlantı noktasını yapılandırın.

source: Joining the I2P Network using a reseed file
de: Mit Hilfe einer Reseed Datei dem I2P Netzwerk beitreten.
es_ar: Unirse a la red I2P usando un fichero de resembrado
fr: Se joindre au réseau I2P en utilisant un fichier de réensemencement
id: Bergabung dengan Jaringan I2P dengan menggunakan file reseed
ja: 再シードファイルを使ったI2Pネットワークへの参加
pl: Dołączanie do sieci I2P za pomocą pliku reseed
pt: Juntar-se à Rede I2P utilizando um arquivo de repropagação
tr: Bir yeniden tohumlama dosyası kullanarak I2P ağına katılmak

source: Please contact a known trustworthy friend who has a running I2P router, and ask them for help with reseeding your I2P router. Request that they send you a reseed file exported from their running I2P router. It is vital that the file is exchanged over a secure channel, e.g. encrypted to avoid external tampering (PGP Sign, Encrypt and Verified with a trusted public key). The file itself is unsigned, so please accept files only from known trusted friends. Never import a reseed file if you can not verify its source.
de: Bitte kontaktieren Sie einen bekannte, vertrauenswürdigen Bekannten mit einem funktionierenden I2P Router und fragen Sie diesen nach Hilfe beim Reseeden ihres I2P Routers. Fragen Sie nach einer aus dem laufenden Router exportiereten Reseed Datei. Diese Datei sollte unbedingt über einen sicheren Kanal (zB. PGP verschlüsselt mit einem vertrauenswürdigen Schlüssel) versendet werden, damit sie nicht modifiziert werden kann. Die Datei selber ist nicht signiert, bitte akzeptieren Sie diese Datei nur aus vertrauenswürdiger Quelle. Importieren Sie nie eine Reseed Datei wenn Sie nicht ihre Quelle verifizieren können.
es_ar: Por favor, contacte con un amigo de conocida confianza que tenga un router I2P en ejecución, y pídale ayuda con el resembrado de su router I2P. Pídale que le envíe un fichero de resembrado exportado desde su router I2P en ejecución. Es vital que el fichero sea intercambiado a través de un canal seguro, ej. cifrado para evitar alteraciones externas (firma PGP, cifrado y verificado con una clave pública de confianza). El propio fichero no está firmado, así que, por favor, sólo acepte ficheros de amigos de conocida confianza. Nunca importe un fichero de resembrado si no puede verificar su procedencia.
fr: Veuillez contacter un ami connu, de confiance, qui utilise un routeur I2P fonctionnel et demandez-lui de vous aider à réensemencer votre routeur I2P en vous envoyant un fichier de réensemencement exporté à partir de son routeur I2P fonctionnel. Il est essentiel que le fichier soit échangé par un moyen de communication sécurisé, chiffré par exemple, afin d’éviter les altérations externes (signature, chiffrement et vérification PGP avec une clé publique fiable). Le fichier même n’est pas signé et n’acceptez que des fichiers provenant d’amis en qui vous avez confiance. N’importez jamais un fichier de réensemencement si vous ne pouvez pas en vérifier la source.
id: Silakan hubungi teman yang Anda percaya yang memiliki router I2P dan minta mereka untuk membantu dalam reseed ulang router I2P Anda. Minta agar mereka mengirimi Anda file reseed yang diekspor dari router I2P mereka. Sangat penting bahwa file dikirim melalui saluran yang aman, mis. dienkripsi untuk menghindari gangguan eksternal (PGP Sign, Encrypt dan Verified with a trusted public key). File itu sendiri tidak bertanda tangan, jadi tolong terima file hanya dari teman terpercaya yang Andakenal. Jangan pernah mengimpor file bekas jika anda tidak dapat memverifikasi sumbernya.
ja: 運用中のI2Pルーターを持っている既知の信頼できる友人に連絡して、 あなたのI2Pルーターの再シードを手伝ってもらいましょう。 彼の動作中I2Pルーターから再シードファイルをエクスポートして送ってくれるよう頼みましょう。 このファイルの受け渡しは安全な経路で行うことが肝要です。 例えば外的な改竄を避けるために暗号化する（信頼済み公開鍵でのPGP署名、暗号化、検証）など。 ファイルそれ自体は署名されていないので、既知の信頼できる友人からのみファイルを受け取りましょう。 情報源が検証できない再シードファイルは絶対にインポートしてはいけません。
pl: Skontaktuj się z zaufanym kolegą posiadającym węzeł I2P i poproś go o pomoc w reseedowaniu Twojego węzła I2P. Poproś go o przesłanie pliku reseed wyeksportowanego z jego węzła I2P. Jest ważne, aby ten plik został przesłany bezpiecznym kanałem, np. w postaci zaszyfrowanej (PGP, podpisz, zaszyfruj i zweryfikuj zaufanym kluczem publicznym), aby nie został przez kogoś zmodyfikowany. Plik ten jest niepodpisany, więc ufaj tylko plikom od zaufanych osób. Nigdy nie importuj pliku reseed z nieznanego źródła.
pt: Entre em contato com um amigo que você conhece e confia que tenha um Roteador I2P em funcionamento, e peça que o ajude com a repropagação de seu Roteador I2P. Peça-lhe que lhe envie um arquivo de repropagação exportado de seu Roteador I2P em funcionamento. É vital que o arquivo seja trocado através de um canal seguro, por exemplo, criptografado para evitar adulterações externas (PGP Assinado, Criptografado e Verificado com uma chave pública de confiança). O arquivo em si não está assinado, portanto, por favor, apenas aceite arquivos somente de amigos que você sabe confiar. Nunca importe um arquivo de repropagação se você não pode verificar sua procedência.
tr: Lütfen I2P yönelticisi kullanan güvendiğiniz bir arkadaşınızdan I2P yönelticinizi yeniden tohumlamakta size yardımcı olmasını isteyin. Kendi yönelticisinde yeniden tohumlanmış dosyayı dışa aktardıktan sonra size göndermesini isteyin. Dosyanın güvenli bir kanaldan alınıp verilmesi çok önemlidir. Dışarıdan müdahaleye engel olacak şekilde şifreleyebilirsiniz (PGP İmzası ve herkese açık bir anahtar ile şifreleyip doğrulayabilirsiniz). Dosyanın kendisi imzalanmadığından yalnızca güvenilir arkadaşlarınızdan gelen dosyaları kabul edin. Kaynağını doğrulayamadığınız bir yeniden tohumlama dosyasını asla içe aktarmayın.

source: To import the received %(filename)s file into your local I2P router:
de: So importieren Sie die erhaltende %(filename)s Datei in Ihren lokalen I2P Router:
es_ar: Para importar el fichero %(filename)s recibido a su router I2P local:
fr: Pour importer le fichier %(filename)s reçu dans votre routeur I2P local :
id: Untuk mengimpor file %(filename)s yang diterima ke router I2P lokal anda:
ja: 受け取った%(filename)sファイルをあなたのI2Pルーターにインポートするには：
pl: Aby zaimportować otrzymany plik %(filename)s do swojego węzła:
pt: Para importar o arquivo %(filename)srecebido para seu Roteador I2P:
tr: Alınan %(filename)s dosyasını yerel I2P yönelticinizde içe aktarmak için:

source: Go to <a href="%(url)s">%(url)s</a>
de: Gehen Sie auf <a href="%(url)s">%(url)s</a>
es_ar: Vaya a <a href="%(url)s">%(url)s</a>
fr: Rendez-vous sur <a href="%(url)s">%(url)s</a>
id: Kunjungi <a href="%(url)s">%(url)s</a>
ja: <a href="%(url)s">%(url)s</a> に行く
pl: przejdź na stronę <a href="%(url)s">%(url)s</a>
pt: Siga para <a href="%(url)s">%(url)s</a>
tr: <a href="%(url)s">%(url)s</a> adresine gidin

source: Under "Manual Reseed from File" click "Browse..."
de: Unter "Manuelles Reseeden aus einer Datei" klciken sie auf "Durchsuchen"
es_ar: Bajo "Resembrado manual desde fichero" pulse "Examinar..."
fr: Sous « Réensemencement manuel à partir d’un fichier », cliquez sur « Parcourir… »
id: Di menu "Manual Reseed from File" klik "Browse..."
ja: 「ファイルから手動再シード」の下の「ファイル選択」をクリック
pl: w sekcji „reseed z pliku” kliknij „przeglądaj…”
pt: Em "Repropagação Manual do Arquivo" clique em "Procurar..."
tr: "Dosyadan El İle Yeniden Tohumla" altında "Göz at..." üzerine tıklayın

source: Select the %(filename)s file
de: Wählen Sie die %(filename)s Datei
es_ar: Seleccione el fichero %(filename)s
fr: Sélectionnez le fichier %(filename)s
id: Pilih file %(filename)s
ja: %(filename)sファイルを選択
pl: wybierz plik %(filename)s
pt: Selecione o arquivo %(filename)s
tr: %(filename)s dosyasını seçin

source: Click "Reseed from File"
de: Klicken sie auf "Reseed aus Datei"
es_ar: Pulse "Resembrar desde fichero"
fr: Cliquez sur « Réensemencer à partir d’un fichier »
id: Klik "Reseed from File"
ja: 「ファイルから再シード」をクリック
pl: kliknij „reseeduj z pliku”
pt: Clique em "Repropagar do Arquivo"
tr: "Dosyadan Yeniden Tohumla" üzerine tıklayın

source: Check the <a href="%(url)s">log</a> for the following message:
de: Kontrollieren Sie ihr <a href="%(url)s">log</a> auf die folgende Nachricht:
es_ar: Compruebe el <a href="%(url)s">registro</a> (log) para el siguiente mensaje:
fr: Vérifiez la présence du message suivant dans le <a href="%(url)s">journal</a> :
id: Cek <a href="%(url)s">log</a> untuk pesan ini:
ja: <a href="%(url)s">ログ</a>から次のメッセージを探しましょう：
pl: Sprawdź, czy w <a href="%(url)s">dzienniku</a> pojawił się wpis:
pt: Verifique o <a href="%(url)s">registro</a> para a seguinte mensagem:
tr: <a href="%(url)s">Günlük</a> dosyasında şu kaydın olup olmadığına bakın:

source: Sharing a reseed file
de: Eine Reseed Datei verteilen
es_ar: Compartir un fichero de resembrado
fr: Partager un fichier de réensemencement
id: Berbagi file yang telah di-reseed
ja: 再シードファイルの共有
pl: Udostępnianie pliku reseed
pt: Compartilhamento de um arquivo de repropagação
tr: Yeniden tohumlama dosyasını paylaşmak

source: For trusted friends you can use your local I2P router to give them a jump start:
de: Sie können ihren lokalen I2P Router nutzen um vertrauenswürdigen Bekannten einen Start ins I2P Netz zu geben.
es_ar: Para amigos de confianza puede usar su router I2P local para brindarles un arranque asistido:
fr: Pour les amis de confiance, vous pouvez utiliser votre routeur I2P local pour les aider à démarrer :
id: Untuk teman tepercaya, anda dapat menggunakan router I2P lokal anda untuk membantu mereka untuk memulai:
ja: 信頼できる友人を、自分のI2Pルーターを使って始動させることができます：
pl: Zaufani znajomi mogą wykorzystać Twój węzeł I2P, aby podłączyć się do sieci:
pt: Para amigos de confiança você pode usar seu roteador I2P local para dar a eles um salto:
tr: Güvendiğiniz arkadaşlarınızı başlatmak için yerel I2P yönelticinizi kullanabilirsiniz:

source: Under "Create Reseed File" click "Create reseed file"
de: Klicken Sie auf "Reseed Datei erzeugen" unter "Reseed Daei erzeugen"
es_ar: Bajo "Crear Fichero de Resembrado" pulse "Crear fichero de resembrado"
fr: Sous « Créer un fichier de réensemencement », cliquez sur « Créer un fichier de réensemencement »
id: Di menu "Create Reseed File" klik "Create reseed file"
ja: 「再シードファイルの作成」の下の「再シードファイルの作成」をクリック
pl: przejdź do sekcji „utwórz plik reseedowania”
pt: Em "Criar Arquivo de Repropagação" clique em "Criar Arquivo de Repropagação"
tr: "Yeniden Tohumlama Dosyası Oluştur" bölümünden "Yeniden tohumlama dosyası oluştur" üzerine tıklayın

source: Securely send the %(filename)s file to your friend
de: Senden Sie die %(filename)s Datei gesichert zu Ihren Bekannten.
es_ar: Enviar de forma segura el fichero %(filename)s a un amigo
fr: Envoyez le fichier %(filename)s à votre ami de façon sécurisée
id: Kirim secara aman file %(filename)ske teman anda
ja: 安全に%(filename)sファイルを友人に送信
pl: bezpiecznie wyślij plik %(filename)s swojemu znajomemu
pt: Envie com segurança o arquivo %(filename)s para seu amigo
tr: %(filename)s dosyasını arkadaşınıza güvenli bir yöntemle gönderin

source: Do not reveal this file in any case to unknown users, since it contains sensitive private data (100 RouterInfo) from your own I2P router! In order to protect your anonymity: you may wait a few random hours/days before you share the file with your trusted friend. It is also advisable to use this procedure sparingly (< 2 per week).
de: Geben Sie diese Datei keinesfalls an unbekannte Nutzer, da es sensitive, private Daten (100 Router Informationen) ihres I2P Routers enthält! Um ihre Anonymität zu wahren sollten sie ein paar Stunden/Tage warten bevor Sie die Datei weitergeben. Es ist ausserdem empfolen, dieses nur selten zu machen (<2 mal je Woche).
es_ar: ¡No revele este fichero a usuarios desconocidos en ningún caso, ya que contiene datos privados sensibles (100 RouterInfo) de su propio router I2P! Para proteger su anonimato: puede esperar unas pocas horas/días antes de compartir el fichero con su amigo de confianza. También es aconsejable usar este procedimiento con moderación (< 2 veces por semana).
fr: Ne révélez en aucun cas ce fichier à des utilisateurs inconnus, car il contient des données confidentielles délicates (100 RouterInfo) provenant de votre propre routeur I2P ! Afin de protéger votre anonymat, vous pourriez patienter, au hasard, pendant quelques heures ou jours avant de partager le fichier avec votre ami de confiance. Il est aussi recommandé d’utiliser cette procédure avec modération (< 2 par semaine).
id: Jangan berikan file ini untuk alasan apapun kepada pengguna yang tidak dikenal, karena berisi data pribadi yang sensitif (100 RouterInfo) dari router I2P Anda sendiri! Untuk melindungi anonimitas Anda: sebaiknya Anda menunggu beberapa jam/hari secara acak sebelum anda berbagi file dengan teman tepercaya Anda. Sebaiknya gunakan prosedur ini dengan jarang (<2 per minggu).
ja: 未知のユーザにこのファイルを公開することは、いかなる場合でもやってはいけません。 あなた自身のI2Pからの機密個人データ（100 ルーター情報）が含まれてるからです！ 匿名性を保護するために：信頼できる友人とファイルを共有する前に何時間か何日かランダムに待つといいでしょう。 またこの手順は控え目に（1週に2回未満で）行うことが推奨されます。
pl: Nie udostępniaj tego pliku nieznajomym gdyż zawiera on wrażliwe informacje prywatne (100 informacji o węzłach) z Twojego węzła I2P! Aby chronić swoją anonimowość możesz poczekać kilka godzin/dni zanim udostępnisz ten plik przyjacielowi. Zaleca się oszczędnie korzystać z tej procedury (< 2 razy na tydzień).
pt: Não revele este arquivo a usuários desconhecidos em nenhuma circunstância, pois ele contém dados privado sensíveis (100 informeDeRoteador) de seu próprio roteador I2P! Para proteger seu anonimato: você pode esperar algumas horas/dias antes de você compartilhar o arquivo com seu amigo de confiança. Também é aconselhável usar este procedimento com moderação (< 2 por semana).
tr: İçinde I2P yönelticiniz ile ilgili özel bilgiler (100 "Yöneltici bilgileri" (RouterInfo)) bulunduğundan bu dosyayı hiç bir durumda tanımadığınız kullanıcılar ile paylaşmayın! Anonim kalmanızı sağlamak için dosyayı güvenilir bir arkadaşınız ile paylaşmadan önce rastgele saat ya da gün boyunca bekleyin. Ayrıca bu işlemi uzun aralıklar ile (haftada 2 kereden az) yapmanız önerilir.

source: General guidelines for manual reseeding of I2P
de: Generelle Hinweise zum Manuellen Reseeden von I2P
es_ar: Directrices generales para el resembrado manual de I2P
fr: Directives générales pour le réensemencement manuel d’I2P
id: Pedoman umum untuk reseeding I2P secara manual
ja: I2Pの手動再シードの全般ガイドライン
pl: Ogólne wytyczne dotyczące ręcznego reseedu I2P
pt: Diretrizes gerais para repropagação manual do I2P
tr: I2P yeniden tohumlaması ile ilgili genel bilgiler

source: Do not publicly publish the reseed file or share these files with a friend of a friend!
de: Publizieren Sie nicht die Reseed Datei oder reichen diese an Freunde eines Freundes weiter.
es_ar: ¡No publique abiertamente el fichero de resembrado (clearnet) ni comparta estos ficheros con un amigo de un amigo (darknet)!
fr: Ne publiez pas publiquement le fichier de réensemencement ni ne partagez ces fichiers avec l’ami d’un ami !
id: Jangan publikasikan file yang sudah di-reseed ulang atau bagikan file ini dengan teman dari teman!
ja: 再シードファイルを公に開示したり友人の友人と共有してはいけません！
pl: Nie udostępniaj publicznie lub znajomemu znajomego pliku reseed!
pt: Não publique publicamente o arquivo de repropagação ou compartilhe estes arquivos com um amigo de um amigo!
tr: Yeniden tohumlama dosyasını herkese açık olarak yayınlamayın ya da arkadaşınızın arkadaşları ile paylaşmayın!

source: This file should be used only for a very limited number of friends (< 3)!
de: Diese Datei sollte nur für eine geringe Anzahl an Bekannten (<3) genutzt werden!
es_ar: ¡Este fichero sólo se debe usar para un número muy limitado de amigos (<3)!
fr: Ce fichier ne devrait être utilisé que pour un nombre très limité d’amis (< 3) !
id: File ini harus digunakan hanya untuk jumlah teman yang sangat terbatas (<3)!
ja: 限られた数の友人（3人未満）だけでファイルを使用しましょう！
pl: Udostępniaj ten plik tylko ograniczonej liczbie osób (< 3)!
pt: Este arquivo deve ser usado somente para um número muito limitado de amigos (< 3)!
tr: Bu dosyayı çok az sayıda arkadaşınız için kullanmalısınız (3 kişiden az)!

source: The file is valid only a few days (< 20)!
de: Die Datei ist nur wenige Tage gültig (<20)!
es_ar: ¡El fichero sólo es válido unos pocos días (< 20)!
fr: Le fichier n’est valide que pendant quelques jours (< 20) !
id: File ini valid beberapa hari (<20)!
ja: このファイルが有効なのは数日だけです！（20日未満）
pl: Plik ten jest ważny tylko kilka dni (< 20)!
pt: O arquivo é válido apenas por alguns dias (< 20)!
tr: Dosya yalnızca bir kaç gün süreyle kullanılabilir (20 günden az)!
