Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Chromium-Based Browsers like Chrome have slightly different places for their proxy settings depending on variant and platform. These instructions may be slightly different in Brave or Iridium, for instance. From the <em>Main</em> menu, navigate to the <em>Settings</em>, and search for the <em></em> menu item. Clicking it will open the right settings for your platform.
fr: Les navigateurs basés sur le Chromium comme Chrome ont un emplacement légèrement différent dans les paramètres de mandataire en fonction du varient et de la plateforme. Ces instructions peuvent être légèrement différentes en Brave ou Iridium par exemple. À partir du menu <em>principal</em>, naviguez vers les <em>Paramètres</em>, et chercher l'élément<em></em>du menu. Cliquer dessus ouvrira les bons paramètres pour votre plateforme.
id: Browser Berbasis Chromium seperti Chrome memiliki tempat yang sedikit berbeda untuk pengaturan proxy-nya bergantung pada varian dan platform. Instruksi ini mungkin sedikit berbeda, misalnya di dalam browser Brave atau Iridium. Dari menu <em> Main </em>, masuk ke <em>Settings</em>, dan cari menu <em></em>. Mengkliknya akan membuka pengaturan yang tepat untuk platform yang Anda gunakan.
ja: Chrome等のChromiumベースのブラウザは種類やプラットフォームにより少しプロキシ設定の場所が異なります。この説明は、例えばBrave かIridiumでは少し違います。<em>メイン</em>メニューから <em>設定</em>を開き、 <em></em> メニュー項目を探してください。クリックするとお使いのプラットフォーム向けの正しい設定が開かれます。
pt: Navegadores baseados em Chromium como o Chrome têm lugares um pouco diferentes para suas configurações de proxy dependendo da variante e da plataforma. Estas instruções podem ser um pouco diferente no Brave ou no Iridium, por exemplo. A partir do <em>Menu principal</em>, navegue até as <em>Configurações</em>, e busque pelo item de menu <em>proxy</em>. Clicar nele abrirá as configurações corretas para a sua plataforma.
tr: Chrome gibi Chromium Tabanlı Tarayıcılarda çeşidine ve platformuna göre vekil sunucu ayarları farklı yerlerde bulunabilir. Örneğin bu yönergeler Brave ya da Iridium için biraz farklıdır. <em>Ana</em> menüden <em>Ayarlar</em> bölümüne gidin ve <em></em> menu ögesini arayın. Bu öge üzerine tıklayarak platformunuz için doğru ayarları açabilirsiniz.

source: Chrome Proxy Options
de: Chrome Proxy-Optionen
fr: Options mandataire pour Chrome
id: Opsi Proksi Chrome
ja: Chrome プロキシ設定
pl: Chrome: ustawienia proxy
pt: Opções de Proxy para o Chrome
tr: Chrome Vekil Sunucu Ayarları

source: On Windows, this button will launch you into the shared proxy settings used by <a href="#ie8"><em>Internet Explorer</em></a>, and you can configure it by following the Internet Explorer 8 guide.
fr: Sur Windows, ce bouton vous amènera vers les paramètres partagés de mandataire utilisé par <a href="#ie8"><em>Internet Explorer</em></a>, et vous pouvez le configurer en suivant le guide Internet Explorer 8.
id: Di Windows, tombol ini akan membawa Anda ke pengaturan shared proxy yang digunakan oleh <a href="#ie8"><em>Internet Explorer</em></a>, dan Anda dapat mengonfigurasinya dengan mengikuti panduan Internet Explorer 8 .
ja: Windowsでは、このボタンを押すと、<a href="#ie8"><em>Internet Explorer</em></a>で使われている共有プロキシ設定画面が開かれます。Internet Explorer 8のガイドに従って設定することが可能です。
pt: No Windows, esse botão levará você para as configurações de proxy compartilhadas usadas pelo <a href="#ie8"><em>Internet Explorer</em></a>, e você pode configurar seguindo o guia para o Internet Explorer 8.
tr: Windows üzerinde bu düğme sizi <a href="#ie8"><em>Internet Explorer</em></a> tarafından kullanılan paylaşılan vekil sunucu ayarlarına ulaştırır. Buradan ayarları Internet Explorer 8 rehberine göre yapabilirsiniz.

source: IceRaven and other Firefoxes for Android
de: IceRaven und andere Firefox-Derivate für Android
fr: IceRaven et d'autres Firefoxes pour Android
id: IceRaven dan Firefox versi lain untuk Android
ja: IceRaven およびその他のFirefox for Android
pl: IceRaven i Firefox na Androida
pt: IceRaven e outros Firefoxes para Android
tr: Android için IceRaven ve diğer Firefox Sürümleri

source: Extension-based Configuration
de: Erweiterung-basierte Konfiguration
fr: Configuration basé sur l'extension
id: Konfigurasi Berbasis Ekstensi
ja: 拡張機能を用いた設定
pl: Konfiguracja z użyciem rozszerzenia
pt: Configuração baseada em extensão
tr: Eklenti Temelli Yapılandırma

source: Modern Firefoxes(The "Fenix" based Firefoxes) do not generally have an about:config page for you to configure proxy settings manually. It is further not possible to use most extensions in Fenix-based Firefoxes. It is possible to enable support about:config and enable more extensions in Firefox Nightly at the time of this writing, but it's a manual and difficult process. <em>IceRaven</em> is a fork of Firefox which enables a collection of extensions while Mozilla and the Mozilla Community work on adding support for extensions to Firefox for Android. It provides the easiest way of configuring a modern Firefox-based Browser for Android. It does not come from Mozilla and carries no guarantees from them. <em>Installing the extension in IceRaven will proxy all your IceRaven browsing over I2P.</em>
fr: Les Firefoxes modernes (les Firefoxes basés sur "Fenix") n'ont généralement pas une page about:config pour que vous puissiez configurez manuellement vos paramètres de mandataire. C'est d'autant plus impossible d'utiliser la plupart des extensions sur les Firefoxes basés sur Fenix. Il est possible d'activer la prise en charge about:config et activer plus d'extensions dans Firefox Nightly au moment de cette rédaction, mais c'est un processus manuel et difficile. <em>IceRaven</em> est une fourche de Firefox qui permet d'accéder à une collection d'extensions sur pendant que Mozilla et sa communauté travaille pour ajouter la prise en charge des extensions pour Firefox sur Android. Il fournit la manière la plus simple de configurer un navigateur moderne basé sur Firefox sur Android. Cela ne vient pas de Mozilla et ne garantis rien d'eux. <em>Installer cette extension dans IceRaven mandatera toutes vos navigations IceRaven vers I2P.</em>
id: Firefox modern (firefox berbasis "Fenix") umumnya tidak memiliki halaman about:config untuk mengkonfigurasi pengaturan proxy secara manual. Tidak mungkin untuk menggunakan sebagian besar ekstensi di firefox berbasis Fenix. Dimungkinkan untuk mengaktifkan dukungan about:config dan mengaktifkan lebih banyak ekstensi di Firefox Nightly pada saat ini, tetapi ini adalah proses yang manual dan sulit dilakukan. <em> IceRaven </em> adalah fork dari Firefox yang memungkinkan kumpulan ekstensi sementara Mozilla dan komunitas Mozilla berusaha untuk menambahkan dukungan ekstensi ke Firefox untuk Android. Ini menyediakan cara termudah untuk mengkonfigurasi browser berbasis Firefox modern untuk Android. Itu dikembangkan langsung oleh Mozilla sehingga ada jaminan dari mereka. <em> menginstal ekstensi Di IceRaven akan memproksikan semua penelusuran IceRaven Anda menggunakan i2p. </em>
ja: モダンなFirefox(「Fenix」ベースFirefox) には通常about:configページがなく、そこで手動でプロキシ設定を行うことができません。さらにFenixベースのFirefoxでは大半の拡張機能が使用できません。本稿執筆時点では、Firefox Nightlyではabout:configのサポートを有効化でき、より多くの拡張機能に対応していますが、マニュアルとなり、難解な手順になります。<em>IceRaven</em>は種々の拡張機能に対応したFirefoxのフォークで、MozillaとMozillaコミュニティがAndroid向けFirefoxに拡張機能のサポートの追加を続けています。それがモダンなAndroid向けFirefoxベースブラウザを設定する一番簡単なやり方になります。Mozillaのものではなければ、保証もありません。<em>IceRavenで拡張機能をインストールすると、IceRavenでのブラウジングはすべてI2Pプロキシ経由となります。</em>
pt: Os Firefoxes modernos (Os Firefoxes baseados em "Fenix") geralmente não têm uma página about:config para você configurar definições de proxy manualmente. Não é mais possível usar a maioria das extensões em Firefoxes baseados em Fenix. É possível habilitar suporte para a about:config e habilitar mais extensões no Firefox Nightly no momento da escrita deste texto, mas é um processo manual e difícil. O <em>IceRaven</em> é um fork do Firefox que habilita uma coleção de extensões enquanto a Mozilla e a comunidade da Mozilla trabalham em adicionar suporte para extensões para o Firefox no Android. Ele proporciona a forma mais fácil de configurar um navegador moderno baseado em Firefox para Android. Ele não é de procedência da Mozilla and não leva qualquer garantia desta. <em>Instalar a extensão no IceRaven irá redirecionar por proxy pela I2P toda a sua navegação no IceRaven.</em>
tr: Modern Firefox sürümlerinde ("Fenix" tabanlı Firefox sürümleri) genellikle vekil sunucu ayarlarının el ile yapılabileceği bir about:config sayfası bulunmaz. Sonraki Fenix ​​tabanlı Firefox sürümlerinde çoğu eklenti kullanılamaz. Bu yazının yazıldığı sırada, about:config üzerinden destek ya da Firefox Nightly sürümünde başka eklentileri etkinleştirilebilir. Ancak bu el ile yapılması gereken zor bir süreçtir. Bir Firefox dalı olan <em>IceRaven</em>, Mozilla ve Mozilla Topluluğu Android için Firefox uygulamasına eklenti desteğini eklemeye çalışırken, bir eklenti derlemesini kullanır. Bu uygulama, Android için Firefox tabanlı modern bir Tarayıcı yapılandırmanın en kolay yoludur. Mozilla tarafından sunulmaz ve herhangi bir Mozilla garantisi yoktur. <em>Eklenti IceRaven üzerine kurulduğunda, tüm IceRaven taramaları vekil sunucu olarak I2P üzerinden geçer.</em>

source: If you have not installed IceRaven yet, go to the next step. If you have been using IceRaven for a while, go to the main menu, select the History tab, and make sure that you have cleared information about your past browsing by tapping the "Delete History" button.
fr: Si vous n'avez pas encore traduit IceRaven, allez à la prochaine étape. Si cela fait longtemps que vous utilisez IceRaven, allez au menu principal, sélectionnez l'onglet Historique et soyez sûr que vous avez supprimer les informations de navigations passées en appuyant sur le bouton "Supprimer l'Historique".
id: Jika Anda belum menginstal IceraVen, lanjutkan ke langkah berikutnya. Jika Anda telah menggunakan IceRaven, buka menu utama, pilih tab History, dan pastikan Anda telah menghapus informasi tentang browsing Anda sebelumnya dengan mengetuk tombol "Delete History".
ja: IceRavenをまだインストールしていなければ、次のステップに進んでください。既にIceRavenを使用中の場合、メインメニューを開き、履歴タブを選択して、「履歴を削除」ボタンをタップして過去のブラウジングに関する情報を削除してください。
pt: Se você ainda não instalou o IceRaven, vá para o próximo passo. Se você usa o IceRaven há um tempo, vá até o menu principal, selecione a aba Histórico, e certifique-se de que você limpou informações sobre sua navegação no passado tocando no botão "Excluir Histórico".
tr: Henüz IceRaven uygulamasını kurmadıysanız, sonraki adıma geçin. IceRaven uygulamasını bir süredir kullanıyorsanız, ana menüye gidin, History sekmesine tıklayın ve "Delete History" düğmesine tıklayarak göz atma geçmişinizle ilgili bilgileri temizlediğinizden emin olun.

source: Open the IceRaven main menu, and scroll to the top until you see the "Add-Ons" submenu. Tap the "Add-Ons Manager" option in the "Add-Ons" submenu. Install the extension named <em>I2P Proxy for Android and other Systems</em>.
fr: Ouvrez le menu principal de IceRaven et défilez en haut jusqu'à ce que vous voyez le sous-menu "Add-Ons". appuyez sur l'option "Gestionnaire d'Add-Ons" dans le sous-menu en question. Installez l'extension nommée <em>Mandataire I2P pour Android et autres systèmes</em>.
id: Buka menu utama IceRaven, dan scroll ke atas sampai Anda melihat submenu "Add-Ons". Ketuk opsi "Add-Ons Manager" di submenu "Add-Ons". Instal ekstensi bernama <em>I2P Proxy for Android and other Systems</em>.
ja: IceRavenのメインメニューを開き、「拡張機能」サブメニューが見えるまで上にスクロールしてください。「アドオン」サブメニュー内「アドオンマネージャー」オプションをタップします。Androidおよびその他のシステム用I2Pプロキシという名前の拡張機能をインストールしてください。
pt: Abra o menu principal do IceRaven, e role para cima até você enxergar o submenu "Add-Ons". Toque na opção "Gerenciador de Add-Ons" no submenu "Add-Ons". Instale a extensão chamada <em>I2P Proxy for Android and other Systems</em>.
tr: IceRaven ana menüsünü açın ve "Add-Ons" alt menüsünü görene kadar yukarı kaydırın. "Add-Ons" alt menüsündeki "Add-Ons Manager" üzerine tıklayın. Şu eklentiyi kurun: <em>I2P Proxy for Android and other Systems</em>.

source: Your IceRaven browser is now configured to use I2P.
fr: Votre navigateur IceRaven est désormais configuré pour utiliser I2P.
id: Browser IceRaven Anda sekarang telah dikonfigurasi untuk menggunakan I2P.
ja: IceRavenブラウザのI2Pを利用するための設定が整いました。
pl: Twoja przeglądarka IceRaven jest teraz skonfigurowana do używania I2P.
pt: O seu navegador IceRaven está agora configurado para usar a I2P.
tr: IceRaven tarayıcınız I2P kullanacak şekilde yapılandırıldı.

source: This extension also works in pre-Fenix(Pre-Firefox-68) Firefox based web browsers, if installed from the following addons.mozilla.org URL. <em><a href="https://addons.mozilla.org/en-US/android/addon/i2p-proxy/">I2P Proxy for Android and Other Systems</a></em>
fr: Cette extension marche aussi sous les navigateurs pre-Fenix(Pre-Firefox-68) basés sur Firefox si ils sont installés par les URL addons.mozilla.org suivantes. <em><a href="https://addons.mozilla.org/en-US/android/addon/i2p-proxy/">Mandataire I2P pour Android et Autres Systèmes</a><em>
id: Ekstensi ini juga berfungsi di browser web berbasis Firefox pra-Fenix ​​(Pra-Firefox-68), jika diinstal dari URL addons.mozilla.org berikut ini. <em><a href="https://addons.mozilla.org/en-US/android/addon/i2p-proxy/">I2P Proxy for Android and Other Systems</a></em>
ja: この拡張機能は、以下のaddons.mozilla.orgのURLからインストールした場合、Fenix以前(Firefox-68以前)のFirefoxがベースのウェブブラウザでも動作します。 <em><a href="https://addons.mozilla.org/en-US/android/addon/i2p-proxy/">Androidおよびその他のシステム向けI2Pプロキシ</a></em>
pt: Essa extensão também funciona em navegadores web Firefox pré-Fenix (Pré-Firefox-68), se instalado a partir da seguinte URL de addons.mozilla.org. <em><a href="https://addons.mozilla.org/en-US/android/addon/i2p-proxy/">I2P Proxy for Android and Other Systems</a></em>
tr: Bu eklenti Fenix(Firefox-68) öncesi Firefox temelli tarayıcılarda da çalışır. Kurulum addons.mozilla.org üzerindeki şu adresten yapılmalıdır. <em><a href="https://addons.mozilla.org/en-US/android/addon/i2p-proxy/">I2P Proxy for Android and Other Systems</a></em>

source: This extension is identical to the Chromium extension and is built from the same source.
fr: Cette extension est identique à l'extension Chromium et est construite à partir de la même source.
id: Ekstensi ini identik dengan ekstensi Chromium dan dibangun dari source code yang sama.
ja: この拡張機能は Chromium 拡張機能と同一で、同じソースからビルドされています。
pl: Rozszerzenie to jest takie same jak rozszerzenie do Chromium i jest skompilowane z tego samego kodu źródłowego.
pt: Esta extensão é idêndtica à extensão Chromium e é construída a partir da mesma fonte.
tr: Bu eklenti Chromium eklentisi ile aynıdır ve aynı kaynak kodundan derlenmiştir.

source: In order to enable extension support in Firefox Nightly, you should follow the steps provided by Mozilla on their <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">Blog</a>
es_ar: Para habilitar el soporte de extensiones en Firefox Nightly, debes seguir los pasos proporcionados por Mozilla en su <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">Blog</a>
fr: Pour activer la prise en charge de l'extension dans Firefox Nightly, vous devrez suivre les étapes fournies par Mozilla sur leur <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">Blogue</a>
id: Untuk mengaktifkan dukungan ekstensi di Firefox Nightly, Anda harus mengikuti langkah-langkah yang disediakan oleh Mozilla di <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">Blog< /a>
ja: Firefox Nightlyで拡張機能のサポートを有効にするには、Mozillaが <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">ブログ</a>で提供しているステップを踏む必要があります。
pl: Aby włączyć wsparcie rozszerzeń w Firefoksie Nightly, przeczytaj <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">następujący artykuł</a> (w j. angielskim) na blogu Mozilli.
pt: Para habilitar suporte a extensões no Firefox Nightly, você deve seguir os passos descritos pela Mozilla em seu <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">Blog</a>
tr: Firefox Nightly sürümünde eklentiyi etkinleştirebilmek için Mozilla tarafından <a href="https://blog.mozilla.org/addons/2020/09/29/expanded-extension-support-in-firefox-for-android-nightly/">Günlükte açıklanan</a> adımları izlemeniz gerekir.

source: In the start menu search for the the "Network and Internet Settings" to open the settings. The last entry in the menu is the Proxy Settings, click it to your proxy to connect to I2P.
es_ar: En el menú de inicio, busque "Configuración de red e Internet" para abrir la configuración. configuración. La última entrada en el menú es la Configuración del proxy, haga clic en él para su proxy para conectarse a I2P.
fr: Dans le menu d'accueil cherchez le "Paramètres réseaux et internet" pour ouvrir les paramètres. La dernière entrée dans le menu sont les paramètres mandataire, cliquez dessus pour connecter votre mandataire à I2P.
id: Di start menu, cari "Network and Internet Settings" untuk membuka pengaturan. Entri terakhir dalam menu ada Proxy Settings, klik supaya proxy Anda terhubung ke I2P.
ja: スタートメニューで「ネットワークとインターネット」を検索し、設定画面を 開きます。メニューの最後の項目がプロキシ設定ですのでプロキシ設定を クリックしてI2Pに接続しましょう。
pl: W menu start wyszukaj „Sieć i internet”, aby otworzyć ustawienia. Kliknij ostatnią pozycję w menu – „Proxy”.
pt: No menu iniciar pesquise por "Configurações de Rede e Internet" para abrir as configurações. O último item no menu são as Configurações de Proxy, clique nele para seu proxy se conectar à I2P.
tr: Ayarları açmak için başlat ​​menüsünde "Ağ ve İnternet Ayarları" seçeneğini arayın. Menüdeki son kayıt Vekil Sunucu Ayarlarıdır. I2P bağlantısı kurmak için vekil sunucunuz üzerine tıklayın.

source: IE Internet Options
de: IE Internetoptionen
es_ar: Opciones de Internet de IE
id: Opsi Internet IE
ja: IE インターネットオプション
pl: Opcje internetowe IE
pt: Opções da Internet do IE
tr: IE İnternet Ayarları

source: Now set the checkmark at "use a proxy server for your LAN" and at the "Bypass proxy server for local addresses". With a click on Advanced-button you open the window to open the ports. Enter the values like on the picture, IP 127.0.0.1 and port 4444 for HTTP, port 4445 for HTTPS. With clicks on OK you save the settings and your browser is set to use the I2P proxy.
de: Jetzt setzen Sie das Häkchen bei "verwenden Sie einen Proxyserver für Ihr LAN" und bei "umgehe Proxyserver für lokale Adressen". Mit einem Klick auf den Fortgeschritten-Button öffnen Sie das Fenster, um die Ports zu öffnen. Geben Sie die Werte wie auf dem Bild ein, IP 127.0.0.1 und Port 4444 für HTTP, Port 4445 für HTTPS. Mit Klick auf OK speichern Sie die Einstellungen und ihr Browser ist bereit, die I2P Proxy zu benützen.
es_ar: Ahora active en la casilla de confirmación "usar un servidor proxy para la LAN" y también en "Ignorar servidor para conexiones locales". Pulsando en opciones avanzadas abrirá la ventana para abrir puertos. Entre los valores de la imagen, IP 127.0.0.1y puerto 4444 para HTTP, puerto 4445 para HTTPS.
fr: Maintenant, cochez la case "Utiliser un serveur proxy pour votre réseau local" et "Ne pas utiliser de serveur proxy pour les adresses locales". Cliquez sur le bouton "Avancé" pour ouvrir la fenêtre afin d'ouvrir les ports. Entrez les valeurs comme sur la photo, IP 127.0.0.1 et le port 4444 pour le protocole HTTP, le port 4445 pour le protocole HTTPS. Cliquez sur OK, vous enregistrez les réglages et votre navigateur est configuré pour utiliser le proxy I2P.
id: Sekarang tandai pada "use a proxy server for your LAN" dan pada "Bypass proxy server for local addresses". Dengan mengklik tombol Advanced Anda membuka jendela untuk membuka port. Masukkan value seperti pada gambar, IP 127.0.0.1 dan port 4444 untuk HTTP, port 4445 untuk HTTPS. Dengan mengklik OK Anda menyimpan pengaturan dan peramban Anda sudah disetel untuk menggunakan proxy I2P.
ja: それでは「LANにプロキシサーバーを使用する」と「ローカルアドレスには プロキシサーバーを使用しない」のチェックマークをつけてください。詳細設定のボタンをクリックすると ポートの設定ウィンドウが開きます。図のように、IP 127.0.0.1、ポート番号 がHTTPに4444、HTTPSに4445と数値を入力してください。OKをクリックすると 設定が保存され、ブラウザはI2Pプロキシを使用する準備ができました。
pl: Następnie zaznacz „Użyj serwera proxy dla sieci LAN” i „Nie używaj serwera proxy dla adresów lokalnych”. Następnie kliknij przycisk „Zaawansowane” i wprowadź numery portów. Wprowadź wartości z poniższego obrazka, IP 127.0.0.1, port 4444 dla HTTP i 4445 dla HTTPS. Kliknij OK, aby zapisać ustawienia proxy, co sprawi, że Twoja przeglądarka będzie skonfigurowana do pracy z I2P.
pt: Agora marque na caixa de confirmação "usar um servidor para a LAN" e também "Ignorar servidor para conexões locais". Clicando nas opções avançadas, abrirá a janela para abrir as portas. Digite os valores da imagem, IP 127.0.0.1 e porta 4444 para HTTP, porta 4445 para HTTPS. Com os cliques em OK você salva as definições e seu navegador está configurado para usar a I2P.
tr: "Yerel ağınız için bir proxy sunucu kullanın" ve "Yerel adresler için proxy sunucuyu atla" seçeneklerini işaretleyin. Gelişmiş düğmesine tıklayarak bağlantı noktalarını (iletişim noktası) ayarlayabileceğiniz pencereyi açın. IP adresi için 127.0.0.1 ve iletişim noktası için HTTP için 4444, HTTPS için 4445 olarak görseldeki gibi yazın. Tamam üzerine tıklayın. Ayarlar kaydedilir ve tarayıcınız I2P vekil sunucusunu kullanabilir.

source: IE Proxy Settings
de: IE-Proxyeinstellungen
es_ar: Configuración proxy en IE
fr: Paramètres de mandataire d’IE
id: Setting Proxy IE
ja: IE プロキシ設定
pl: IE: ustawienia proxy
pt: Definições do Proxy do IE
tr: IE Vekil Sunucu Ayarları

source: I2P is not designed for creating proxies to the Internet. Instead, it is meant to be used as an internal network.
es_ar: I2P no está diseñado para crear proxies hacia Internet. Por el contrario, está pensada para utilizarse como red interna.
fr: I2P n'a pas été conçu pour créer des serveurs mandataires vers Internet. À la place, il est censé être utilisé comme réseau interne.
id: I2P tidak dirancang untuk membuat proxy ke Internet. Sebagai gantinya, I2p dimaksudkan untuk digunakan sebagai jaringan internal.
ja: I2Pはインターネットに向けたプロキシを作成するよう設計されていません。 内部ネットワークとしてを使用されるものと企図されています。
pl: I2P nie jest zaprojektowane dla tworzenia serwerów pośredniczących do Internetu. Zamiast tego ma być używane jako sieć wewnętrzna.
pt: A I2P não é projetada para criar proxies para a Internet. Em vez disso, a intenção é usá-la como uma rede interna.
tr: I2P uygulaması İnternet vekil sunucusu olmak için tasarlanmamıştır. Bir iç ağ olarak kullanılmak üzere geliştirilmiştir.
