Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: A comparison of some of the available Java Runtime Environments (JRE) is available here: <a href="%(chart)s">%(chart)s</a>. Using Sun/Oracle Java or OpenJDK is recommended.
de: Ein Vergleich von verschiedenen Java Runtime Environments (JREs) ist hier zu finden: <a href="%(chart)s">%(chart)s</a>. Unsere Empfehlung ist, Sun/Oracle Java oder OpenJDK zu benutzen .
fr: Une comparaison de certains moteurs d’exécution Java (JRE) est proposée ici : <a href="%(chart)s">%(chart)s</a>. Il est recommandé d’utiliser Java de Sun/Oracle ou OpenJDK.
id: Perbandingan beberapa Java Runtime Environments (JRE) yang tersedia ada di sini: <a href="%(grafik)s">%(grafik)s</a>. Disarankan menggunakan Sun/Oracle Java atau OpenJDK.
ja: Java Runtime Environments (JRE) ごとの比較は <a href="%(chart)s">%(chart)s</a> で閲覧可能。 Sun/Oracle Java か OpenJDK の使用が推奨されています。
pl: Porównanie kilku dostępnych środowisk uruchomieniowych Javy (JRE) dostępne jest pod adresem: <a href="%(chart)s">%(chart)s</a>. Zaleca się korzystanie z Javy od Sun/Oracle lub z OpenJDK.
pt: Uma comparação de alguns dos ambientes de tempo de execução Java (JRE) disponíveis está disponível aqui: <a href="%(chart)s">%(chart)s</a>. Recomenda-se a utilização de Sun/Oracle Java ou OpenJDK.
tr: Kullanılabilecek bazı Java Runtime Environments (JRE) sürümleri ile ilgili karşılaştırmalara şuradan bakabilirsiniz: <a href="%(chart)s">%(chart)s</a>. Sun/Oracle Java ya da OpenJDK kullanılması önerilir.

source: While the main I2P client implementation requires Java, there are several <a href="%(alt)s">alternative clients</a> which don't require Java.
de: Während die Haupt-I2P-Client-Implementierung Java erfordert, gibt es mehrere <a href="%(alt)s">alternative Clients</a>, die Java nicht benötigen.
es_ar: Aunque la principal implementación de cliente I2P requiere Java, hay varios <a href="%(alt)s">clientes alternativos</a> que no requieren Java.
fr: Tandis que la mise en œuvre principale du client I2P exige Java, il existe plusieurs <a href="%(alt)s">clients de substitution</a> qui n’exige pas Java.
id: Sementara implementasi klien I2P utama membutuhkan Java, ada beberapa <a href="%(alt)s">alternatif klien</a> yang tidak memerlukan Java.
ja: メインのI2PクライアントにはJavaが必要ですが、Javaを必要としない<a href="%(alt)s">代替クライアント</a>がいくつかあります。
pl: Podczas gdy główna implementacja klienta I2P wymaga Javy, istnieje kilka <a href="%(alt)s">alternatywnych klientów</a>, które jej nie wymagają.
pt: Embora a principal implementação do cliente I2P requeira Java, existem vários <a href="%(alt)s">clientes alternativo</a> que não requerem Java.
tr: Ana I2P istemci uygulamaları için Java gerekirken, Java gerektirmeyen bazı <a href="%(alt)s">alternatif istemciler</a> de vardır.

source: What is an "I2P Site?"
fr: Qu'est-ce qu'un "Site I2P" ?
id: Apa itu "Situs I2P?"
ja: I2P サイトとは何？
pl: Czym jest strona .i2p?
pt: O que é um "Site I2P"?
tr: "I2P sitesi" nedir?

source: Formerly called an eepSite, an I2P Site is a website that is hosted anonymously, a hidden service which is accessible through your web browser. It can be accessed by setting your web browser's HTTP proxy to use the I2P web proxy (typically it listens on localhost port 4444), and browsing to the site. Detailed instructions for configuring your browse can be found on the <a href="%(browsers)s">browser configuration page</a>.
fr: Auparavant appelé un eepSite, un site I2P est un site web qui est hébergé anonymement, un service caché accessible à partir de votre navigateur. Il peut être accéder en paramétrant votre mandataire HTTP du navigateur pour utiliser le mandataire web I2P (normalement il écoute sur le port d'hébergement local 4444) et naviguer vers le site. Des instructions détaillées pour configurer votre navigateur sont trouvable sur la <a href="%(browsers)s">page de configuration de navigateur</a>.
id: Sebelumnya disebut eepSite, Situs I2P adalah situs web yang dihosting secara anonim, layanan tersembunyi yang dapat diakses melalui browser web Anda. Dapat diakses dengan mengatur proksi HTTP browser web Anda dengan menggunakan proksi web I2P (biasanya mendengarkan pada port localhost 4444) untuk menjelajahi situs. Petunjuk mendetail untuk mengonfigurasi browser Anda dapat ditemukan di <a href="%(browsers)s">halaman konfigurasi browser</a>.
ja: かつてeepSiteと呼ばれていたI2Pサイトは匿名でホストされているウェブサイトであり、ウェブブラウザからアクセスできる秘匿サービスです。 I2Pウェブプロキシ（通常はローカルホストのポート4444でリッスン）を利用するためにウェブブラウザのHTTPプロキシを設定して、サイトをブラウザで開くことでアクセスすることができます。ブラウザの詳細な設定方法は<a href="%(browsers)s">ブラウザ設定ページ</a>を参照してください。
pl: Strona w domenie .i2p jest anonimowo hostowaną stroną internetową, ukrytą usługą dostępną poprzez przeglądarkę internetową. Można na nią wejść uprzednio konfigurując proxy swojej przeglądarki (zwykle na <tt>localhost</tt> i port <tt>4444</tt>). Szczegółowe instrukcje znajdują się na <a href="%(browsers)s">stronie konfiguracji przeglądarki</a>.
pt: Anteriormente designado por eepSite, um site I2P é um site alojado anonimamente, um serviço oculto que é acessível através do seu navegador Web. Pode ser acedido configurando o proxy HTTP do seu navegador web para utilizar o proxy web I2P (normalmente escuta na porta localhost 4444), e navegando para o site. Instruções detalhadas para configurar o seu navegador podem ser encontradas na <a href="%(browsers)s">página de configuração do navegador</a>.
tr: Eskiden eepSite olarak adlandırılan bir I2P sitesi, anonim olarak barındırılan bir sitedir ve tarayıcı ile erişilebilen gizli bir hizmettir. Tarayıcınızın HTTP vekil sunucusunu I2P internet vekil sunucusunu (genellikle localhost 4444 numaralı bağlantı noktasını dinler) kullanacak şekilde ayarlayarak ve siteye göz atarak erişilebilir. Tarayıcıyı yapılandırmak için ayrıntılı yönergeler <a href="%(browsers)s">tarayıcı yapılandırma bölümünde</a> bulunabilir.

source: x is the number of peers you've sent or received a message from successfully in the last minute, y is the number of peers seen in the last hour or so. Try hovering your cursor over the other lines of information for a brief description.
de: x ist die Anzahl an Peers, von denen Sie eine Nachricht erhalten oder gesendet haben in der letzten Minute, y ist die Anzahl der in der letzten Stunde gesehenen Peers, oder so. Versuche Sie mit dem Cursor über die anderen Informationszeilen zu gleiten um eine kurze Erklärung dazu zu bekommen.
fr: x est le nombre de pairs auxquels vous avez envoyé un message ou de qui vous en avez reçu un avec succès au cours de la dernière minute, y est le nombre de pairs vus au cours de la dernière heure environ. Essayez de survoler les autres lignes d’informations avec votre curseur pour obtenir une brève description.
id: x jumlah peers Anda telah berhasil dikirim atau diterima pesan di menit terakhir, y adalah jumlah peer yang dilihat dalam satu jam terakhir atau lebih. Coba arahkan kursor ke baris informasi lainnya untuk mendapatkan penjelasan singkat.
ja: x は直近1分でメッセージの受け渡しがうまくできたピアの数、y は直近1時間程度で見かけたピアの数です。 マウスカーソルを情報行にホバーさせると簡単な説明が見られます。
pl: X oznacza liczbę uczestników do których wysłałeś lub otrzymałeś wiadomość w przeciągu ostatniej minuty, Y oznacza liczbę uczestników z którymi kontaktowałeś się w ciągu ostatniej godziny. Najedź kursorem nad inne elementy, aby wyświetlić ich krótki opis.
pt: x é o número de pares de quem enviou ou recebeu uma mensagem com sucesso no último minuto, y é o número de pares vistos na última hora. Tente passar o cursor sobre as outras linhas de informação para obter uma breve descrição.
tr: x son dakikada ileti gönderilen ya da alınan eşlerin sayısı, y son saatte görüntülenen eşlerin sayısı şeklinde gider. Kısa açıklamaları görüntülemek için imleci diğer bilgi satırlarının üzerinde gezdirin.

source: I2P is an anonymous network - it is designed to withstand attempts at blocking or censoring of content, thus providing a means for communication that anyone can use. I2P traffic that transits through your router is encrypted with several layers of encryption. Except in the case of a serious security vulnerability (of which none are currently known), it is not possible to know what the contents of the traffic are and thus not possible to distinguish between traffic which one is opposed to or not opposed to. We consider the 3 parts of the question:
de: I2P ist ein anonymisierendes Netzwerk - es wurde designed um Angriffen und Zensuren von Inhalten zu widerstehen und somit eine wichtige Kommunikationsplatform anzubieten, die von jedem genutzt werden kann. Jeder I2P Verkehr, der durch Ihren Router geht, ist mit mehreren Schichten Verschlüsselung gesichert. Ausgenommen des Falles einer schwerwiegenden Sicherheitslücke (von denen bisher keine einzige bekannt ist), ist es nicht möglich, zu erkennen, welchen Inhalt der Datenverkehr enthält, und somit kann auch nicht unterschieden werden, welcher Datenverkehr erwünscht und welcher unerwünscht ist. Wir unterscheiden 3 Teile der Frage:
fr: I2P est un réseau anonyme. Il est conçu pour résister aux tentatives de blocage ou de censure du contenu, offrant ainsi un moyen de communication que tout le monde peut utiliser. Le trafic d’I2P qui transite par votre routeur est chiffré par plusieurs couches de chiffrement. Sauf vulnérabilité informatique majeure (dont rien n’est connu actuellement), il est impossible de connaître le contenu du trafic, et par conséquent, de faire une distinction entre le trafic auquel quelqu’un serait opposé et le trafic auquel il ne serait pas opposé.
id: I2P adalah jaringan anonim - jaringan ini dirancang untuk menahan upaya pemblokiran atau penyensoran konten, sehingga menyediakan sarana komunikasi yang dapat digunakan siapa saja. Lalu lintas I2P yang melewati router Anda dienkripsi dengan beberapa lapisan enkripsi. Kecuali dalam kasus kerentanan keamanan yang serius (yang saat ini tidak ada yang diketahui), Tidak mungkin untuk mengetahui apa isi lalu lintas dan dengan demikian tidak mungkin untuk membedakan antara lalu lintas yang ditentang atau tidak. Kami mempertimbangkan 3 bagian pertanyaan:
ja: I2Pは匿名ネットワークです - コンテンツのブロックや検閲に耐えるよう作られており、誰もが使えるコミュニケーション手段を提供しています。 あなたのルーターを通るI2Pのトラフィックは複数の暗号層で暗号化されています。 （今のところ知られてはいませんが）重大なセキュリティ脆弱性がない限り、 トラフィックの中身が何であるかを知る術はありません。従って、あなたが問題視するトラフィックとそうでないものの区別はつきません。 この質問の3つの側面を考えてみましょう。
pl: I2P jest siecią anonimową – została zaprojektowana do walki z blokadą i cenzurą treści, i ma na celu umożliwienie komunikacji każdemu bez wyjątków. Ruch tunelowany przez Twój węzeł jest zabezpieczony kilkoma warstwami szyfrowania. Pomijając przypadek wystąpienia poważnej podatności bezpieczeństwa (żadna jest obecnie znana), nie jest możliwe ustalenie co jest przesyłane, więc nie ma możliwości rozróżnienia treści pożądanych od niepożądanych. Odpowiedź na to pytanie składa się z 3 części:
pt: O I2P é uma rede anónima - foi concebida para resistir a tentativas de bloqueio ou censura de conteúdos, proporcionando assim um meio de comunicação que qualquer pessoa pode utilizar. O tráfego I2P que passa pelo seu roteador é encriptado com várias camadas de encriptação. Exceto no caso de uma vulnerabilidade de segurança grave (de que não se conhece nenhuma atualmente), não é possível saber qual é o conteúdo do tráfego e, portanto, não é possível distinguir entre o tráfego a que se está a opor ou não. Consideramos as 3 partes da questão:
tr: I2P anonim bir ağdır - içerikleri engelleme ya da sansürleme girişimlerini aşmak için tasarlanmıştır ve herkes tarafından kolay kullanılan kesintisiz bir iletişim sağlar. Yönelticinizden geçen I2P trafiği, birkaç katmanda şifrelenir. Ciddi bir güvenlik açığı olması dışında (şu anda bilinmeyen), trafiğin içeriğinde ne olduğu bilinemez ve bu nedenle buna karşı olan ya da olmayan trafik ayırt edilemez. Sorunu 3 aşamada ele alıyoruz:

source: <b>Distribution</b><br> All traffic on I2P is encrypted in multiple layers. You don't know a message's contents, source, or destination. All traffic you route is internal to the I2P network, you are not an <a href="#exit">exit node</a> (referred to as an outproxy in our documentation). Your only alternative is to refuse to route <i>any</i> traffic, by setting your share bandwidth or maximum participating tunnels to 0 (see above). It would be nice if you didn't do this, you should help the network by routing traffic for others. Over 95&#37; of users route traffic for others.
de: <b>Verteilung</b><br> Jeder Datenverkehr in I2P ist in mehreren Schichten verschlüsselt. Sie kennen weder den Inhalt der Nachrichten, ihre Herkunft oder das Ziel. Jeder von Ihnen weitergeleitete Datenverkehr ist und bleibt innerhalb des I2P Netzwerkes, Sie sind kein <a href="#exit">Exit Node</a> (in unserer Dokumentation Outproxy genannt). Ihre einzige Alternative ist es, <i>jegliche</i> Weiterleitung von Datentransfer zu unterbinden, in dem Sie Ihre angeboten Bandbreite oder die maximale Anzahl der teilnehmenden Tunnel auf 0 setzen (schauen Sie dazu oben nach). Es wäre nett, wenn Sie dieses nicht machen, Sie sollten dem N etzwerk durch das Weiterleiten von Datenverkehr anderer helfen. Über 95&#37; unserer Benutzer leiten Datenverkehr anderer durch ihre Router.
fr: <b>Distribution</b><br> Tout le trafic d’I2P est chiffré en plusieurs couches. Vous ne connaissez ni le contenu, ni la source, ni la destination d’un message. Tout le trafic que vous acheminez est interne au réseau I2P, vous n’êtes pas un <a href="#exit">nœud de sortie</a> (appelé mandataire sortant dans notre documentation). Votre seule option est de refuser d’acheminer <i>tout</i> trafic en paramétrant votre bande passante partagée ou le nombre maximal de tunnels participants à 0 (voir ci-dessus). Il serait que vous ne le fassiez pas, car vous devriez aider le réseau en acheminant le trafic d’autrui. Plus de 95 &#37; des utilisateurs acheminent le trafic des autres.
id: <b>Distribusi</b> - Semua lalu lintas pada I2P dienkripsi dalam beberapa lapisan. Anda tidak tahu isi pesan, sumber, atau tujuan. Semua lalu lintas yang Anda rutekan bersifat internal ke jaringan I2P, Anda bukan <a href="#exit">node keluar</a> (disebut sebagai outproxy dalam dokumentasi kami). Alternatifnya adalah untuk menolak untuk merutekan lalu lintas <i>apapun,</i> dengan menetapkan share bandwidth atau maximum participating tunnel ke 0 (lihat di atas). Akan lebih baik jika Anda tidak melakukan ini, Anda harus membantu jaringan dengan merutekan lalu lintas untuk orang lain. Lebih dari 95 &#37; pengguna merutekan lalu lintas untuk orang lain.
ja: <b>拡散</b><br> I2P上の全てのトラフィックは複数の層で暗号化されます。あるメッセージの内容・発信者・宛先を知ることはできません。 あなたが中継する全てのトラフィックはI2Pネットワークで閉じており、あなたは<a href="#exit">出口ノード</a>ではありません（我々の文書ではアウトプロキシと呼んでいます）。 唯一の選択肢は<i>あらゆる</i>トラフィックの中継を拒否することです。それには共有帯域幅か最大参加トンネルを0に設定します（先述）。 これはやらない方がいいでしょう。他の参加者のためにトラフィック中継をしてネットワークを援助すべきです。 95&#37;以上のユーザは他人のためにトラフィックを中継しています。
pl: <b>rozsyłanie</b><br> Cały ruch w sieci I2P jest szyfrowany kilkoma warstwami. Ni znasz zawartości, źródła ani przeznaczenia wiadomości. Cały ruch przesyłany przez Twój węzeł jest ruchem wewnętrznym sieci I2P, nie jesteś <a href="#exit">węzłem wyjściowym</a> (dokładnie «outproxy» w terminologii I2P). Jedyną alternatywą jest odmowa przesyłania <i>całego</i> ruchu poprzez ustawienie opcji „udostępnij” (w zakładce „przepustowość”) lub parametru <tt>maxParticipatingTunnels</tt> (w zakładce „zaawansowane”) na 0. Byłoby miło, gdybyś tego nie robił i pomógł sieci poprzez uczestnictwo w przesyłaniu ruchu innych użytkowników. Ponad 95&#37; użytkowników uczestniczy w przesyłaniu ruchu innych użytkowników.
pt: <b>Distribuição</b><br> Todo o tráfego na I2P é encriptado em várias camadas. O utilizador não conhece o conteúdo, a origem ou o destino de uma mensagem. Todo o tráfego que encaminha é interno à rede I2P, não é um <a href="#exit">nó de saída</a> (referido como um outproxy na nossa documentação). A sua única alternativa é recusar-se a encaminhar <i>qualquer</i> tráfego, definindo a largura de banda partilhada ou o máximo de túneis participantes para 0 (ver acima). Seria bom se não o fizesse, pois deve ajudar a rede encaminhando o tráfego para os outros. Mais de 95&#37; dos utilizadores encaminham o tráfego para outros.
tr: <b>Dağıtım</b> - I2P üzerindeki tüm trafik birden çok katman kullanılarak şifrelenmiştir. Bir iletinin içeriğini, kaynağını ya da hedefini bilemezsiniz. Bir <a href="#exit">çıkış durağı</a> (belgelerimizde çıkış vekil sunucusu olarak geçer) olmadığınızdan, yönelttiğiniz tüm trafik I2P ağının içinde kullanılır. <i>Hiç bir</i> trafiğin yöneltilmemesi için tek alternatifiniz paylaşım bant genişliğini ya da en fazla katkı verilen tünel sayısını 0 olarak ayarlamaktır (yukarı bakın). Bunu yapmamanız ve trafiklerini yönelterek ağdaki diğer kullanıcılara yardımcı olmanız güzel olur. 95&#37; üzerinde kullanıcı diğer kullanıcıların trafiğini yöneltiyor.

source: <b>Storage</b><br> I2P does not do distributed storage of content, this has to be specifically installed and configured by the user (with Tahoe-LAFS, for example). That is a feature of a different anonymous network, <a href="http://freenetproject.org/">Freenet</a>. By running I2P, you are not storing content for anyone.
de: <b>Datenspeicher</b><br> I2P alleine ist kein verteilter Datenspeicher, diese Funktion muß vom Nutzer explizit installiert und konfiguriert werden (z.B. mit Tahoe-LAFS). Dieses ist eine Funktion eines anderen anonymen Netzwerkes, <a href="http://freenetproject.org/">Freenet</a>. Beim Betrieb von I2P speichern Sie keine Daten für andere.
fr: <b>Stockage</b><br> I2P ne distribue pas le stockage du contenu. Le stockage distribué doit être spécialement installé et configuré par l’utilisateur (avec Tahoe-LAFS par exemple). C’est une caractéristique d’un réseau anonyme différent, <a href="http://freenetproject.org/">Freenet</a>. En exécutant I2P, vous ne stockez le contenu de personne d’autre.
id: <b>Penyimpanan</b><br> I2P tidak melakukan penyimpanan konten terdistribusi, ini harus diinstal dan dikonfigurasi secara khusus oleh pengguna (dengan Tahoe-LAFS, misalnya). Itu adalah fitur dari jaringan anonim yang berbeda, <a href="http://freenetproject.org/"> freenet </a>. Dengan menjalankan I2P, Anda tidak menyimpan konten untuk siapa pun.
ja: <b>保存</b><br> I2Pはコンテンツの分散保持をしません。それには特別なインストールと設定が必要です（例えばTahoe-LAFSで）。 分散保持は別の匿名ネットワーク<a href="http://freenetproject.org/">Freenet</a>の特徴であって、 I2Pの動作によって他ノード用にコンテンツが保持されることはありません。
pl: <b>przechowywanie</b><br> I2P nie jest rozproszonym magazynem treści, tego typu usługa musi być uprzednio zainstalowana przez użytkownika (przykładem jest Tahoe-LAFS). Rzoproszonym magazynem treści jest inna sieć anonimowa: <a href="http://freenetproject.org/">Freenet</a>. Mając uruchomiony węzeł I2P, nie przechowujesz jakichkolwiek treści innych użytkowników.
pt: <b>Armazenamento</b><br> O I2P não faz armazenamento distribuído de conteúdos, o que tem de ser especificamente instalado e configurado pelo utilizador (com o Tahoe-LAFS, por exemplo). Essa é uma caraterística de uma rede anónima diferente, a <a href="http://freenetproject.org/">Freenet</a>. Ao executar o I2P, não está a armazenar conteúdo para ninguém.
tr: <b>Depolama</b><br> I2P depolama birimlerinin içeriğini dağıtmaz. Böyle bir gereksiniminiz varsa, bu özellikle ayrıca kurulup yapılandırılmalıdır (örneğin Tahoe-LAFS kullanılarak). Bu özellik farklı bir anonim ağ olan <a href="http://freenetproject.org/">Freenet</a> üzerinde bulunur. I2P kullanarak, başkalarının içeriğini depoluyor olmazsınız.

source: <b>Access</b><br> If there are hidden services which you dislike, you may refrain from visiting them. Your router will not request any content without your specific instruction to do so.
de: <b>Zugriff</b><br> Falls hidden Services existieren, die Sie nicht befürworten, besuchen Sie diese nicht. Ihr I2P Router fordert automatisch keine Daten an, die Sie nicht explizit angefordert haben.
es_ar: <b>Acceso</b><br> Si hay servicios ocultos que no le gustan, puede abstenerse de visitarlos. Su router no solicitará ningún contenido sin que usted se lo indique expresamente.
fr: <b>Accès</b><br> Si certains services cachés vous déplaisent, vous pouvez vous abstenir de les visiter. Votre routeur ne demandera aucun contenu sans votre instruction expresse.
id: <b>Akses</b><br> Jika ada layanan tersembunyi yang tidak Anda sukai, Anda dapat menahan diri untuk tidak mengunjunginya. Router Anda tidak akan meminta konten apa pun tanpa instruksi khusus Anda untuk melakukannya.
ja: <b>アクセス</b><br> 気に入らない秘匿サービスがあったら訪問を控えればよいでしょう。 あなたがそうしろと指示しない限り、ルーターは何もコンテンツを要求しません。
pl: <b>oglądanie</b><br> Jeżeli jest jakaś ukryta usługa z treściami co do których masz uprzedzenia, po prostu na nią nie wchodź. Twój węzeł nie będzie pobierał jakiejkolwiek treści bez Twojego żądania.
pt: <b>Acesso</b><br> Se existirem serviços ocultos que não lhe agradem, pode abster-se de os visitar. O roteador não solicitará qualquer conteúdo sem instruções específicas do utilizador para o fazer.
tr: <b>Erişim</b><br> Hoşunuza gitmeyen gizli hizmetler varsa, onları ziyaret etmekten kaçınabilirsiniz. Yönelticiniz sizin özellikle almak istemediğiniz hiç bir içerik için istekte bulunmaz.
