Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: UDP from the random port listed on the <a href="http://127.0.0.1:7657/confignet">configuration page</a> to arbitrary remote UDP ports, allowing for replies
de: UDP von dem zufällig gewähltem Port, notiert auf der <a href="http://127.0.0.1:7657/confignet">Konfigurationsseite</a> ausgehend zu externen UDP Ports, inklusive eingehende Antworten.
fr: UDP provenant de la liste de ports aléatoires sur la <a href="http://127.0.0.1:7657/confignet">page de configuration</a> vers des ports UDP distants arbitraires, permettant les réponses
id: UDP dari port acak yang tercantum pada <a href="http://127.0.0.1:7657/confignet.jsp">halaman konfigurasi</a> untuk arbitrary remote UDP ports, memungkinkan balasan
ja: UDP：<a href="http://127.0.0.1:7657/confignet">設定ページ</a>に表示されているランダムなポートから任意のリモートUDPポートまで。返信用。
pl: UDP losowego portu wyświetlanego na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji</a> do dowolnych zdalnych portów UDP, z możliwością odpowiedzi
pt: UDP da porta aleatória listada na <a href="http://127.0.0.1:7657/confignet">página de configuração</a> para portas UDP remotas arbitrárias, permitindo respostas
tr: UDP iletişim kuralı için <a href="http://127.0.0.1:7657/confignet">yapılandırma bölümünde</a> görülebilecek rastgele bağlantı noktasından, isteğe bağlı uzak UDP bağlantı noktalarına verilen yanıtlara izin verir

source: TCP from random high ports to arbitrary remote TCP ports
de: TCP-Verkehr von zufälligen, hohen Ports hin zu allen möglichen externen TCP-Ports
fr: TCP provenant de ports élevés aléatoires vers des ports TCP distants arbitres
id: TCP dari random high ports kepada arbitrary remote TCP ports
ja: TCP：ランダムなハイポートから任意のリモートTCPポートまで。
pl: losowy wysoki TCP do dowolnych zdalnych portów TCP
pt: TCP de portas altas aleatórias para portas TCP remotas arbitrárias
tr: TCP iletişim kuralı için rastgele yüksek bağlantı noktalarından isteğe bağlı uzak TCP bağlantı noktalarına

source: Outbound UDP on port 123, allowing for replies. This is necessary for I2P's internal time sync (via SNTP - querying a random SNTP host in pool.ntp.org or another server you specify)
de: Ausgehend UDP auf Port 123, Antworten annehmend. Dieses ist für das I2P interne Abgleichen der Uhrzeit nötig (via SNTP - ein zufälliger SNTP Server aus dem pool.ntp.org Pool oder ein von Ihnen festgelegter Server wird genutzt)
fr: UDP sortant sur le port 123, permettant les réponses. Cela est nécessaire pour la synchronisation interne de l’heure d’I2P (par SNTP en envoyant une requête à un hôte SNTP aléatoire dans pool.ntp.org ou un autre serveur que vous aurez indiqué)
id: Outbound UDP pada port 123, memungkinkan balasan. Hal ini diperlukan untuk sinkronisasi waktu internal I2P's (melalui SNTP - query sejumlah SNTP acak di pool.ntp.org atau server lain yang Anda tentukan)
ja: 123番ポートのアウトバウンドUDPは返信用に確保されています。これはI2Pの内部時刻同期に必要です。（SNTP経由で。pool.ntp.org内または指定したサーバーのSNTPホストからランダムに問い合わせ。）
pl: UDP do portu 123, z możliwością odpowiedzi (jest to niezbędne do wewnętrznej usługi synchronizacji czasu I2P poprzez SNTP – odpytuje losowy serwer SNTP z pool.ntp.org lub inny wybrany przez użytkownika)
pt: UDP de saída na porta 123, permitindo respostas. Isto é necessário para a sincronização da hora interna do I2P (via SNTP - consulta de um anfitrião SNTP aleatório em pool.ntp.org ou noutro servidor que especificar)
tr: Gidiş UDP bağlantısı 123 numaralı bağlantı noktasını kullanır ve yanıtlara izin verir. I2P iç zaman eşitlemesi için gereklidir (pool.ntp.org havuzundan rastgele bir SNTP sunucusunu ya da belirteceğiniz başka bir sunucuyu sorgular)

source: INBOUND
de: EINGEHEND
fr: ENTRANT
ja: 着信側
pl: PRZYCHODZĄCE
pt: ENTRADA
tr: GELİŞ

source: (Optional, recommended) UDP to the port noted on the <a href="http://127.0.0.1:7657/confignet">configuration page</a> from arbitrary locations
de: (Optional, empfohlen) UDP zu dem auf der <a href="http://127.0.0.1:7657/confignet">Konfigurationsseite</a> genanntem Port, von allen externen Adressen.
fr: (Facultatif, recommandé) UDP vers le port indiqué sur la <a href="http://127.0.0.1:7657/confignet">page de configuration</a> à partir d’emplacements arbitraires
id: <b>(opsional, tetapi disarankan) Inbound UDP port yang tercantum pada <a href="http://127.0.0.1:7657/confignet.jsp">halaman konfigurasi</a> dari lokasi arbitrary</b>
ja: （任意、推奨）UDP：任意のポートから<a href="http://127.0.0.1:7657/confignet">設定ページ</a>に表示されているポートまで。
pl: (opcjonalny, zalecany) UDP wyświetlany na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji</a> z dowolnych zdalnych adresów
pt: (Opcional, recomendado) UDP para a porta indicada na <a href="http://127.0.0.1:7657/confignet">página de configuração</a> a partir de locais arbitrários
tr: İsteğe bağlı konumlardan <a href="http://127.0.0.1:7657/confignet">yapılandırma bölümünde</a> belirtilen bağlantı noktasına UDP (isteğe bağlı ancak önerilir)

source: (Optional, recommended) TCP to the port noted on <a href="http://127.0.0.1:7657/confignet">configuration page</a> from arbitrary locations
de: (Optional, empfohlen) TCP zu dem auf der <a href="http://127.0.0.1:7657/confignet"> Konfigurationsseite</a> genanntem Port, von allen externen Adressen.
fr: (Facultatif, recommandé) TCP vers le port indiqué sur la <a href="http://127.0.0.1:7657/confignet">page de configuration</a> à partir d’emplacements arbitraires
id: <b>(opsional, tetapi disarankan) Inbound TCP port yang tercantum pada <a href="http://127.0.0.1:7657/confignet.jsp">halaman konfigurasi</a> dari lokasi arbitrary</b>
ja: （任意、推奨）TCP：任意のポートから<a href="http://127.0.0.1:7657/confignet">設定ページ</a>に表示されているポートまで。
pl: (opcjonalny, zalecany) TCP wyświetlany na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji</a> z dowolnych zdalnych adresów
pt: (Opcional, recomendado) TCP para a porta indicada na <a href="http://127.0.0.1:7657/confignet">página de configuração</a> a partir de locais arbitrários
tr: İsteğe bağlı konumlardan <a href="http://127.0.0.1:7657/confignet">yapılandırma bölümünde</a> belirtilen bağlantı noktasına TCP (isteğe bağlı ancak önerilir)

source: Inbound TCP can be disabled on the <a href="http://127.0.0.1:7657/confignet">configuration page</a>
de: Eingehender TCP-Verkehr kann auf der <a href="http://127.0.0.1:7657/confignet">Konfigurationsseite</a>deaktiviert werden
fr: Le TCP entrant peut être désactivé sur la <a href="http://127.0.0.1:7657/confignet">page de configuration</a>
id: Inbound TCP dapat dinonaktifkan di <a href="http://127.0.0.1:7657/confignet">halaman konfigurasi</a>
ja: 着信TCPは<a href="http://127.0.0.1:7657/confignet">設定ページ</a>で無効にできます。
pl: przychodzący TCP można dezaktywować na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji</a>
pt: O TCP de entrada pode ser desativado na <a href="http://127.0.0.1:7657/confignet">página de configuração</a>
tr: Geliş TCP bağlantısı <a href="http://127.0.0.1:7657/confignet">yapılandırma bölümünden</a> devre dışı bırakılabilir

source: Local I2P ports, listening only to local connections by default, except where noted:
de: Lokale I2P-Ports, die voreingestellt nur auf lokale Verbindungen reagieren, Ausnahmen werden explizit genannt:
fr: Ports I2P locaux n’écoutant par défaut que les connexions locales, sauf indication contraire :
id: Port lokal I2P, mendengarkan hanya koneksi lokal secara default, kecuali di sebutkan:
ja: ローカルI2Pポート。デフォルトではローカル接続のみを受け付ける。ただし以下を除く：
pl: Lokalne porty I2P, nasłuchujące domyślnie tylko lokalnych połączeń, o ile nie zanotowano inaczej:
pt: Portas I2P locais, escutando apenas conexões locais por padrão, exceto onde indicado:
tr: <b>Yerel I2P bağlantı noktaları</b>, şu durumlar dışında varsayılan olarak yalnızca yerel bağlantılar dinlenir:

source: PORT
ja: ポート
pt: PORTA
tr: BAĞLANTI NOKTASI

source: PURPOSE
de: VERWENDUNG
fr: BUT
id: TUJUAN
ja: 目的
pl: WYKORZYSTANIE
pt: PROPÓSITO
tr: AMAÇ

source: DESCRIPTION
de: BESCHREIBUNG
es_ar: DESCRIPCIÓN
id: DESKRIPSI
ja: 説明
pl: OPIS
pt: DESCRIÇÃO
tr: AÇIKLAMA

source: Cannot be changed. Binds to all interfaces. May be disabled on <a href="http://127.0.0.1:7657/confignet">confignet</a>.
de: Kann nicht geändert werden. Wird an alle Schnittstellen gebunden. Kann auf <a href="http://127.0.0.1:7657/confignet">confignet</a> deaktiviert werden.
fr: Ne peut pas être changé. Se lie à toutes les interfaces. Peut être désactivé sur <a href="http://127.0.0.1:7657/confignet">confignet</a>.
id: Tidak bisa diubah. Bind ke semua interface. Dapat dinonaktifkan di <a href="http://127.0.0.1:7657/confignet"> Confignet </a>.
ja: 変更不可。全てのインターフェイスにバインドされている。<a href="http://127.0.0.1:7657/confignet">confignet</a>で無効にできる
pl: Niezmienialny. Podpina się pod wszystkie interfejsy. Może zostać wyłączony na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji „sieć”</a>.
pt: Não pode ser alterado. Liga-se a todas as interfaces. Pode ser desativado em <a href="http://127.0.0.1:7657/confignet">confignet</a>.
tr: Değiştirilemez. Tüm arabirimlere bağlanır. <a href="http://127.0.0.1:7657/confignet">confignet</a> üzerinden devre dışı bırakılabilir.

source: A higher level socket API for clients. Disabled by default. May be enabled/disabled on <a href="http://127.0.0.1:7657/configclients">configclients</a>. May be changed in the bob.config file.
de: Eine High-Level API für Klienten. Per Default inaktiv, kannauf der <a href="http://127.0.0.1:7657/configclients">Klientenkonfigurationsseite</a>aktiviert/deaktiviert werden. Kann in der bob.config Datei geändert werden.
fr: Une API de connexion logicielle de plus haut niveau pour les clients. Peut être activée ou désactivée sur <a href="http://127.0.0.1:7657/configclients">configclients</a>. Peut être modifiée dans le fichier bob.config.
id: API soket tingkat yang lebih tinggi untuk klien. Dinonaktifkan secara default. Dapat diaktifkan/dinonaktifkan di <a href="http://127.0.0.1:7657/configclient"> configclients </a>. Dapat diubah dalam file bob.config.
ja: クライアント用の高級ソケットAPI。既定では無効。<a href="http://127.0.0.1:7657/configclients">configclients</a>で有効/無効設定。 bob.configファイルで変更可
pl: Gniazdo wysokopoziomowego API dla aplikacji klienckich. Domyślnie wyłączone. Może zostać włączony/wyłączony na <a href="http://127.0.0.1:7657/configclients">stronie konfiguracji „klienty”</a>. Można zmienić w pliku bob.config.
pt: Uma API de socket de nível superior para clientes. Desactivada por defeito. Pode ser ativado/desativado em<a href="http://127.0.0.1:7657/configclients">configclients</a>. Pode ser alterado no ficheiro bob.config.
tr: İstemciler için daha yüksek düzeyli bir API soketi. Varsayılan olarak devre dışıdır. <a href="http://127.0.0.1:7657/configclients">configclients</a> üzerinden etkinleştirilebilir ya da devre dışı bırakılabilir. bob.config dosyasından değiştirilebilir..

source: May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.
de: Kann auf der i2ptunnel-Seite in der Router-Konsole deaktiviert oder geändert werden. Kann ausserdem per Konfiguration an eine bestimmte Schnittstelle oder alle Schnittstellen gebunden werden.
fr: Peut être désactivée ou changée sur la page d’i2ptunnel de la console du routeur. Peut aussi être configurée pour être liée à une interface particulière ou à toutes les interfaces.
id: Dapat dinonaktifkan atau diubah pada halaman I2PTunnel di router console. Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
ja: ルーターコンソールのi2ptunnelページで無効化/変更可。またインターフェイスのバインドを特定のものに限るか全てにするか設定可
pl: Może zostać wyłączony lub zmieniony na stronie „zarządzanie ukrytymi usługami” w konsoli węzła. Można również przypiąć do określonego lub wszystkich interfejsów sieciowych.
pt: Pode ser desativado ou alterado na página i2ptunnel na consola do roteador. Também pode ser configurado para ser vinculado a uma interface específica ou a todas as interfaces.
tr: Yöneltici panosundaki i2ptunnel bölümünden devre dışı bırakılabilir ya da değiştirilebilir. Belirli bir arabirime ya da tüm arabirimlere bağlanacak şekilde yapılandırılabilir.</i>

source: Binds to the LAN address. May be changed with advanced config <code>i2np.upnp.HTTPPort=nnnn</code>. May be disabled on <a href="http://127.0.0.1:7657/confignet">confignet</a>.
de: Bindung an die LAN Adresse. Kann mit der erwiterten Einstellung <code>i2np.upnp.HTTPPort=nnnn</code>geändert werden. Kann auf der Seite für<a href="http://127.0.0.1:7657/confignet">Netzkonfiguration</a>deaktiviert werden.
fr: Se lie aux adresses du réseau local. Peut être changé avec la configuration avancée <code>i2np.upnp.HTTPPort=nnnn</code>. Peut être désactivée sur <a href="http://127.0.0.1:7657/confignet">confignet.</a>
id: Bind ke alamat LAN. Dapat diubah dengan konfigurasi lanjutan <code>i2np.upnp.HTTPPort=nnnn</code>. Dapat dinonaktifkan di <a href="http://127.0.0.1:7657/confignet"> Confignet </a>.
ja: LANアドレスにバインド。高度な設定<code>i2np.upnp.HTTPPort=nnnn</code>で変更可。 <a href="http://127.0.0.1:7657/confignet">confignet</a>で無効にできる
pl: Podpina się pod adresy LAN. Może zostać zmieniony używając zaawansowanego ustawienia <code>i2np.upnp.HTTPPort=nnnn</code>. Może zostać wyłączony na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji „sieć”</a>.
pt: Liga-se ao endereço LAN. Pode ser alterado com configuração avançada <code>i2np.upnp.HTTPPort=nnnn</code>. Pode ser desativado em <a href="http://127.0.0.1:7657/confignet">confignet</a>.
tr: Tüm yerel ağ adreslerine bağlanır. Gelişmiş ayarlar bölümünden <code>i2np.upnp.HTTPPort=nnnn</code> ile değiştirilebilir. <a href="http://127.0.0.1:7657/confignet">confignet</a> üzerinden devre dışı bırakılabilir.

source: Binds to the LAN address. May be changed with advanced config <code>i2np.upnp.SSDPPort=nnnn</code>. May be disabled on <a href="http://127.0.0.1:7657/confignet">confignet</a>.
de: Bindung an die LAN Adresse. Kann mit der erwiterten Einstellung<code>i2np.upnp.SSDPPort=nnnn</code> geändert werden. Kann auf der Seite für <a href="http://127.0.0.1:7657/confignet">Netzkonfiguration</a> geäandert werden.
fr: Se lie aux adresses du réseau local. Peut être changé avec la configuration avancée <code>i2np.upnp.SSDPPort=nnnn</code>. Peut être désactivée sur <a href="http://127.0.0.1:7657/confignet">confignet.</a>
id: Bind ke alamat LAN. Dapat diubah dengan konfigurasi lanjutan <code>i2np.upnp.HTTPPort=nnnn</code>. Dapat dinonaktifkan di <a href="http://127.0.0.1:7657/confignet"> Confignet </a>.
ja: LANアドレスにバインド。高度な設定<code>i2np.upnp.SSDPPort=nnnn</code>で変更可。 <a href="http://127.0.0.1:7657/confignet">confignet</a>で無効にできる
pl: Podpina się pod adresy LAN. Może zostać zmieniony używając zaawansowanego ustawienia <code>i2np.upnp.SSDPPort=nnnn</code>. Może zostać wyłączony na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji „sieć”</a>.
pt: Liga-se ao endereço LAN. Pode ser alterado com configuração avançada <code>i2np.upnp.SSDPPort=nnnn</code>. Pode ser desativado em <a href="http://127.0.0.1:7657/confignet">confignet</a>.
tr: Tüm yerel ağ adreslerine bağlanır. Gelişmiş ayarlar bölümünden <code>i2np.upnp.SSDPort=nnnn</code> ile değiştirilebilir. <a href="http://127.0.0.1:7657/confignet">confignet</a> üzerinden devre dışı bırakılabilir.

source: Used by client apps. May be changed to a different port on <a href="http://127.0.0.1:7657/configclients">configclients</a> but this is not recommended. May be to bind to a different interface or all interfaces, or disabled, on <a href="http://127.0.0.1:7657/configclients">configclients</a>.
de: Von Klienten Programmen genutzt. Kann auf der Seite für die Konfiguration der <a href="http://127.0.0.1:7657/configclients">Klienten</a> auf einen anderen Port gesetzt werden, ist aber nicht empfohlen. Kann sich an ein anderes, oder alle Interfaces binden, oder inaktiv gesetzt werden, besuchen Sie dazu die Seite zur Konfiguration der <a href="http://127.0.0.1:7657/configclients">Klienten</a>.
fr: Utilisé par les applications client. Peut être changée pour un port différent sur <a href="http://127.0.0.1:7657/configclients">configclients</a>, mais ce n’est pas recommandé. Peut être liée à une interface différente ou à toutes les interfaces, ou encore désactivée sur <a href="http://127.0.0.1:7657/configclients">configclients</a>.
id: Digunakan oleh aplikasi klien. Dapat diubah ke port yang berbeda di <a href="http://127.0.0.1:7657/configclient"> configclients </a> Tapi ini tidak disarankan. Mungkin bind ke interface berbeda atau semua interface, atau dinonaktifkan, di <a href="http://127.0.0.1:7657/configclient"> configclients </a>.
ja: クライアントアプリで使われる。 <a href="http://127.0.0.1:7657/configclients">configclients</a>で別のポートに変更可、ただし非推奨。 <a href="http://127.0.0.1:7657/configclients">configclients</a>でインターフェイスのバインドを別のものにするか全てにするか無効化するか設定可
pl: Używane przez aplikacje klienckie. Można zmienić port na <a href="http://127.0.0.1:7657/configclients">stronie konfiguracji „klienty”</a>, ale nie jest to zalecane. Można podpiąć do określonego lub wszystkich interfejsów sieciowych, lub zostać wyłączony.
pt: Utilizado por aplicações cliente. Pode ser alterado para uma porta diferente em <a href="http://127.0.0.1:7657/configclients">configclients</a>, mas isso não é recomendado. Pode ser para ligar a uma interface diferente ou a todas as interfaces, ou desativado em <a href="http://127.0.0.1:7657/configclients">configclients</a>.
tr: İstemci uygulamaları tarafından kullanılır. <a href="http://127.0.0.1:7657/configclients">configclients</a> içinden farklı bir bağlantı noktası kullanacak şekilde değiştirilebilir ancak önerilmez. <a href="http://127.0.0.1:7657/configclients">configclients</a> içinden farklı bir arabirime ya da tüm arabirimlere bağlanabilir ya da devre dışı bırakılabilir.

source: A higher level socket API for clients Only opened when a SAM V3 client requests a UDP session. May be enabled/disabled on <a href="http://127.0.0.1:7657/configclients">configclients</a>. May be changed in the <code>clients.config</code> file with the SAM command line option <code>sam.udp.port=nnnn</code>.
de: Eine Highlevel API für Klienten, nur geöffnet, wenn ein SAM v3 Klient eine UDP Session anfordert. Kann auf der <a href="http://127.0.0.1:7657/configclients">Klientenkonfigurationsseite</a> aktiviert und deaktivert werden. Kann in der Datei <code>clients.config</code> mit der SAM Kommandozeilenoption <code>sam.udp.port=nnnn</code> konfiguriert werden.
fr: Une API de connexion logicielle de plus haut niveau pour les clients. N’est ouverte que si un client SAM V3 demande une session UDP. Peut être activée ou désactivée sur <a href="http://127.0.0.1:7657/configclients">configclients</a>. Peut être modifiée dans le fichier <code>clients.config</code> avec l’option de ligne de commande SAM <code>sam.udp.port=nnnn</code>.
id: API soket tingkat yang lebih tinggi untuk klien hanya dibuka ketika klien SAM V3 meminta sesi UDP. Dapat diaktifkan/dinonaktifkan di <a href="http://127.0.0.1:7657/configclient"> configclients </a>. Dapat diubah dalam file <code> clients.config </code> dengan opsi baris perintah SAM <code>sam.udp.port = nnnn </code>.
ja: クライアント用の高級ソケットAPI。SAM V3 クライアントがUDPセッションを要求した場合のみ開放。 <a href="http://127.0.0.1:7657/configclients">configclients</a>で有効/無効設定。 <code>clients.config</code>ファイルのSAMコマンドラインオプション<code>sam.udp.port=nnnn</code>で変更可
pl: Gniazdo wysokopoziomowego API dla aplikacji klienckich. Otwierany tylko gdy klient SAM v3 zażąda sesji UDP. Może zostać włączony/wyłączony na <a href="http://127.0.0.1:7657/configclients">stronie konfiguracji „klienty”</a>. Może zostać zmieniony w pliku <code>clients.config</code> w linijce <code>sam.udp.port=nnnn</code>.
pt: Uma API de socket de nível superior para clientes Só é aberta quando um cliente SAM V3 solicita uma sessão UDP. Pode ser ativado/desativado em <a href="http://127.0.0.1:7657/configclients">configclients</a>. Pode ser alterado no ficheiro <code>clients.config</code> com a opção de linha de comando SAM <code>sam.udp.port=nnnn</code>.
tr: Yalnızca SAM v3 istemcileri bir UPD oturumu istediğinde açılan daha yüksek düzeyli bir API soketi. <a href="http://127.0.0.1:7657/configclients">configclients</a> içinden etkinleştirilebilir ya da devre dışı bırakılabilir. <code>clients.config</code> dosyasından <code>sam.udp.port=nnnn</code> komut satırı seçeneği ile değiştirilebilir.

source: A higher level socket API for clients Disabled by default for new installs as of release 0.6.5. May be enabled/disabled on <a href="http://127.0.0.1:7657/configclients">configclients</a>. May be changed in the <code>clients.config</code> file.
de: Eine Highlevel Socket-API für Klienten, seit Version 0.6.5 standardmässig deaktiviert. Kann auf der <a href="http://127.0.0.1:7657/configclients">Klientenkonfigurationsseite</a> aktiviert und deaktiviert werden. Kan in der Datei <code>clients.config</code> geändert werden.
fr: Une API de connexion logicielle de plus haut niveau pour les clients, désactivée par défaut pour les nouvelles installations à partir de la version 0.6.5. Peut être activée ou désactivée sur <a href="http://127.0.0.1:7657/configclients">configclients</a>. Peut être modifiée dans le fichier <code>clients.config</code>.
id: API soket level yang lebih tinggi untuk klien dinonaktifkan secara default untuk instalasi baru pada saat rilis 0.6.5. Dapat diaktifkan/dinonaktifkan di <a href="http://127.0.0.1:7657/configclient"> configclients </a>. Dapat diubah dalam file <code> clients.config </code>.
ja: クライアント用の高級ソケットAPI。バージョン0.6.5以降の新規インストールでは既定で無効。 <a href="http://127.0.0.1:7657/configclients">configclients</a>で有効/無効設定。 <code>clients.config</code>ファイルで変更可
pl: Gniazdo wysokopoziomowego API dla aplikacji klienckich. Domyślnie wyłączony dla świeżych instalacji od wersji 0.6.5. Może zostać włączony/wyłączony na <a href="http://127.0.0.1:7657/configclients">stronie konfiguracji „klienty”</a>. Może zostać zmieniony w pliku <code>clients.config</code>.
pt: Uma API de socket de nível superior para clientes Desativado por defeito para novas instalações a partir da versão 0.6.5. Pode ser ativado/desativado em <a href="http://127.0.0.1:7657/configclients">configclients</a>. Pode ser alterado no ficheiro <code>clients.config</code>.
tr: İstemciler için daha yüksek düzeyli bir API soketi. 0.6.5 sürümünden başlayarak yeni kurulumlarda varsayılan olarak devre dışıdır. <a href="http://127.0.0.1:7657/configclients">configclients</a>üzerinden etkinleştirilebilir ya da devre dışı bırakılabilir. <code>clients.config</code> dosyasından değiştirilebilir.

source: May be disabled in the <code>clients.config</code>file. May also be configured to be bound to a specific interface or all interfaces in that file.
de: Kann in der Datei<code>clients.config</code>deaktiviert werden. Kann in dieser Datei auch zum Binden an ein spezifisches Interface, oder auch an alle Interface konfiguriert werden.
fr: Peut être désactivée dans le fichier <code>clients.config</code>. Peut également être configurée pour être liée à une interface particulière ou à toutes les interfaces dans ce fichier.
id: Dapat dinonaktifkan dalam file <code> clients.config </code>. Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface di file tersebut.
ja: <code>clients.config</code>ファイルで無効にできる。 またインターフェイスのバインドを特定のものに限るか全てにするか設定可
pl: Może zostać wyłączony w pliku <code>clients.config</code>. Może również zostać przypisany do określonego lub wszystkich interfejsów sieciowych w tym pliku konfiguracyjnym.
pt: Pode ser desativado no ficheiro <code>clients.config</code>. Pode também ser configurado para estar ligado a uma interface específica ou a todas as interfaces desse ficheiro.
tr: <code>clients.config</code>dosyasından devre dışı bırakılabilir. Bu dosyadaki istenilen ya da tüm arayüzlere bağlanacak şekilde ayarlanabilir.
