Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: How do I configure my browser?
de: Wie kann ich meinen Browser entsprechend einstellen?
es_ar: ¿Cómo configuro mi navegador web?
fr: Comment puis-je configurer mon navigateur ?
id: Bagaimana cara mengkonfigurasi browser saya?
ja: ブラウザを設定するには？
pl: Jak mam skonfigurować przeglądarkę?
pt: Como faço para configurar meu navegador?
tr: Tarayıcımı nasıl ayarlamalıyım?

source: How do I connect to IRC within I2P?
de: Wie verbinde ich mich mit dem IRC innerhalb von I2P?
es_ar: ¿Cómo conecto a un IRC dentro de I2P?
fr: Comment puis-je me connecter à IRC dans I2P ?
id: Bagaimana mengakses IRC dalam I2P?
ja: I2P 内の IRC につなぐには？
pl: Jak mam się połączyć do IRC na I2P?
pt: Como eu conecto no IRC dentro do I2P?
tr: I2P içinden IRC bağlantısı nasıl yapılır?

source: How do I set up my own I2P Site?
es_ar: ¿Cómo puedo crear mi propio sitio I2P?
fr: Comment configurer mon propre site I2P ?
id: Bagaimana cara mengatur situs I2P saya sendiri?
ja: 自分の I2P サイトを立ち上げるには？
pl: Jak założyć własną stronę w sieci I2P?
pt: Como eu monto meu próprio site I2P?
tr: Kendi I2P Sitemi nasıl oluştururum?

source: If I host a website at I2P at home, containing only HTML and CSS, is it dangerous?
es_ar: Si alojo un sitio web en I2P en casa, que sólo contenga HTML y CSS, ¿es peligroso?
fr: Si j'héberge un site web I2P chez moi, contenant seulement du HTML et du CSS, est-ce dangereux ?
id: Jika saya meng-hosting situs web di I2P di rumah, yang hanya berisi HTML dan CSS, apakah itu berbahaya?
ja: 自宅の I2P で、 HTML と CSS だけのウェブサイトをホストしたら危険ですか？
pl: Czy hostowanie na komputerze w domu strony .i2p napisaną tylko w HTML i CSS jest niebezpieczne?
pt: Se eu hospedar um site na I2P em casa, contendo apenas HTML e CSS, é perigoso?
tr: Evimde yalnızca HTML ve CSS dosyaları bulunduran bir I2P sitesi barındırmak tehlikeli midir?

source: How Does I2P find ".i2p" websites?
es_ar: ¿Cómo encuentra I2P los sitios web ".i2p"?
fr: Comment I2P trouve les sites web ".i2p" ?
id: Bagaimana cara I2P menemukan situs web ".i2p"?
ja: I2Pはどのようにして".i2p"のウェブサイトを見つけるのですか？
pl: W jaki sposób węzeł I2P znajduje strony .i2p?
pt: Como é que o I2P encontra sites ".i2p"?
tr: I2P, ".i2p" sitelerini nasıl bulur?

source: How do I add to the Address Book?
es_ar: ¿Cómo se añade a la Agenda?
fr: Comment ajouter au carnet d'adresse ?
id: Bagaimana cara menambah Address Book?
ja: アドレス帳に追加するには？
pl: Jak dodać stronę do książki adresowej?
pt: Como faço para adicionar ao Catálogo de Endereços?
tr: Adres Defterine nasıl eklerim?

source: What ports does I2P use?
de: Welche Ports werden von I2P genutzt?
es_ar: ¿Qué puertos usa I2P?
fr: Quels ports I2P utilise-t-il ?
id: Port apa saya yang digunakan I2P?
ja: I2P はどのポートを使用しますか？
pl: Jakich portów używa I2P?
pt: Que portas é que o I2P utiliza?
tr: I2P hangi bağlantı noktalarını kullanır?

source: I'm missing lots of hosts in my address book. What are some good subscription links?
es_ar: Me faltan muchos anfitriones en mi libreta de direcciones. ¿Cuáles son algunos buenos enlaces de suscripción?
fr: Il me manque beaucoup d'hébergeurs dans mon carnet d'adresse. Quel sont quelques bons liens d'abonnement ?
id: Saya kehilangan banyak host di buku alamat saya. Apa ada link yang bagus untuk berlangganan?
ja: アドレス帳に記載された多くのホストをなくしてしまいました。どこかいい購読リンクはありませんか?
pl: Brakuje mnóstwa adresów w mojej książce adresowej. Gdzie są jakieś dobre linki do subskrypcji?
pt: Estou a perder muitos anfitriões no meu livro de endereços. Quais são algumas boas ligações de subscrição?
tr: Adres defterimdeki pek çok sunucu bulunamıyor. İyi abonelik bağlantıları hangileridir?

source: How can I access the web console from my other machines or password protect it?
de: Wie können Sie die Webkonsole von anderen Systemen erreichen oder mit einem Passwort absichern?
es_ar: ¿Cómo puedo acceder a la consola web desde máquinas remotas y cómo la protejo con contraseña?
fr: Comment puis-je accéder à la console Web à partir de mes autres machines ou la protéger par mot de passe ?
id: Bagaimana saya dapat mengakses console web dari mesin saya yang lain atau melindunginya dengan password?
ja: 他のマシンからウェブコンソールにアクセスしたり、パスワードで保護するには？
pl: Jak mogę dostać się do konsoli węzła z innych komputerów lub zablokować dostęp hasłem?
pt: Como posso acessar o painel web a partir das minhas outras máquinas ou protegê-lo com senha?
tr: Diğer bilgisayarlardan internet panosuna nasıl erişebilir ya da parola ile koruyabilirim?

source: How can I use applications from my other machines?
de: Wie können Sie Applikationen von anderen Systemen aus nutzen?
es_ar: ¿Cómo puedo usar aplicaciones desde máquinas remotas?
fr: Comment puis-je utiliser des applications de mes autres machines ?
id: Bagaimana cara menggunakan aplikasi dari mesin saya yang lain?
ja: 他のマシンからアプリケーションを利用するには？
pl: Jak mogę używać aplikacji z moich innych komputerów?
pt: Como posso usar aplicações a partir das minhas outras máquinas?
tr: Diğer bilgisayarlardan uygulamaları nasıl kullanabilirim?

source: Is it possible to use I2P as a SOCKS proxy?
de: Ist es m&ouml;glich, I2P als SOCKS Proxy zu nutzen?
es_ar: ¿Es posible usar I2P como un proxy SOCKS?
fr: Est-il possible d’utiliser I2P en tant que mandataire SOCKS ?
id: Apakah mungkin untuk menggunakan I2P sebagai SOCKS proxy?
ja: SOCKS プロキシとして I2P を使用することは可能ですか？
pl: Czy jest możliwe użycie I2P jako proxy SOCKS?
pt: É possível usar I2P como um proxy SOCKS?
tr: I2P SOCKS vekil sunucusu olarak kullanılabilir mi?

source: How do I access IRC, BitTorrent, or other services on the regular Internet?
de: Wie stelle ich Verbindung zu IRC, BitTorrent oder anderen Diensten im normalen Internet her?
es_ar: ¿Cómo accedo al IRC, Bittorrent u otros servicios en la Internet regular?
fr: Comment puis-je accéder à IRC, BitTorrent ou autres services sur l’Internet ordinaire ?
id: Bagaimana cara mengakses IRC, BitTorrent, atau layanan lainnya di Internet biasa?
ja: IRC や BitTorrent 、その他通常のインターネット上にあるサービスには？
pl: Jak mogę połączyć się z IRC, BitTorrentem, lub innymi usługami w normalnym Internecie?
pt: Como acesso IRC, BitTorrent ou outros serviços na Internet normal?
tr: Normal İnternet üzerindeki IRC, BitTorrent ya da diğer hizmetlere nasıl erişebilirim?

source: Reseeds
fr: Réensemencer
ja: 再シード
pl: Reseed
pt: Repropagação
tr: Yeniden tohumlamalar

source: My router has been up for several minutes and has zero or very few connections
de: Ihr Router ist für einige Minuten aktiv und hat keine oder wenige Verbindungen
es_ar: Mi router ha estado activo durante varios minutos y aún tiene ninguna o muy pocas conexiones
fr: Mon routeur est en ligne depuis plusieurs minutes, mais n’a pas ou très peu de connexions
id: Router saya telah aktif selama beberapa menit dan memiliki koneksi nol atau sangat sedikit
ja: 自分のルーターは、数分間待っていても、接続はゼロかほとんどありません
pl: Mój węzeł jest aktywny od kilku minut i nawiązał zero lub bardzo mało połączeń
pt: Meus roteador está funcionando há vários minutos mas tem zero ou poucas conexões
tr: Yönelticim bir kaç dakikadır çalıştığı halde sıfır ya da çok az sayıda bağlantı var

source: How do I reseed manually?
de: Wie reseede ich manuell?
es_ar: ¿Cómo resiembro ('reseed') manualmente?
fr: Comment puis-je réensemencer manuellement ?
id: Bagaimana saya melakukan reseed secara manual?
ja: 手動で再シードするには？
pl: Jak przeprowadzić ręczny reseed?
pt: Como realizo propagação manualmente?
tr: Yeniden tohumlama el ile nasıl yapılır?

source: Privacy-Safety
es_ar: Privacidad-Seguridad
fr: Protection des données-Sécurité
id: Privasi-Keamanan
ja: プライバシー-安全性
pl: Prywatność i bezpieczeństwo
pt: Privacidade-Segurança
tr: Gizlilik-Güvenlik

source: Is my router an "exit node"(outproxy) to the regular Internet? I don't want it to be.
de: Ist mein Router ein "Ausgangsknoten" (Ausgangsproxy) ins normale Internet? Das will ich nicht!
es_ar: ¿Es mi router un "nodo de salida" (outproxy) hacia la Internet regular? No quiero que lo sea.
fr: Mon routeur est-il un « nœud de sortie » (mandataire sortant) vers l’Internet ordinaire ? Je ne veux pas qu’il le soit.
id: Apakah router saya adalah "exit node" (outproxy) ke Internet biasa? Saya tidak ingin hal itu terjadi.
ja: ルーターは通常のインターネットへの「出口ノート」(アウトプロキシ)ですか？そうしたくありません。
pl: Czy mój węzeł jest „węzłem wyjściowym” (proxy wyjściowym - outproxy) do normalnego Internetu? Nie chcę aby nim był.
pt: O meu roteador é um "nodo de saída" para a Internet regular? Eu não quero que este o seja.
tr: Yönelticim normal İnternet için bir "çıkış düğümü" (çıkış vekil sunucusu) olarak mı kullanılıyor? Bunu istemiyorum?

source: Is it easy to detect the use of I2P by analyzing network traffic?
es_ar: ¿Es fácil detectar el uso de I2P analizando el tráfico de red?
fr: Est-ce facile de détecter l'utilisation de I2P en analysant la circulation réseau
id: Apakah mudah mendeteksi penggunaan I2P dengan menganalisis lalu lintas jaringan?
ja: ネットワークのトラフィックを分析することで、I2Pの使用を簡単に検出することができますか？
pl: Jak łatwo można wykryć korzystanie z I2P analizując ruch sieciowy?
pt: É fácil detetar o uso de I2P analisando o tráfego de rede?
tr: I2P kullanımı ağ trafiğini incelenerek kolayca tespit edilebilir mi?

source: Is using I2P Safe?
es_ar: ¿Es seguro utilizar I2P?
fr: Est-ce que I2P est sécurisé ?
id: Apakah menggunakan I2P aman?
ja: I2Pの使用は安全ですか？
pl: Czy korzystanie z I2P jest bezpieczne?
pt: Usar I2P é Seguro?
tr: I2P kullanmak güvenli midir?

source: I see IP addresses of all other I2P nodes in the router console. Does that mean my IP address is visible by others?
de: Ich sehe die I2P Adressen aller anderen I2P Knoten in der Router Konsole. Bedeuted dieses, dass meine IP von anderen gesehen werden kann?
es_ar: Veo las direcciones IP de todos los demás nodos I2P en la consola del router. ¿Significa eso que mi dirección IP es visible por los demás?
fr: Dans la console du routeur, je vois les adresses IP de tous les autres nœuds d’I2P. Cela signifie-t-il que les autres peuvent voir mon adresse IP ?
id: Saya melihat alamat IP dari semua node I2P lainnya di router console. Apakah itu berarti alamat IP saya terlihat oleh orang lain?
ja: ルーターコンソールからほかのすべてのI2PノードのIPアドレスが見えます。つまり私のIPアドレスも他者から見えていますか？
pl: Widzę adresy IP innych użytkowników sieci I2P w konsoli węzła. Czy to oznacza, że mój adres IP jest widoczny dla innych?
pt: Vejo os endereços IP de todos os outros nós I2P na consola do roteador. Isso significa que o meu endereço IP é visível para os outros?
tr: Yöneltici panosunda tüm diğer I2P düğümlerinin IP adreslerini görebiliyorum. Bu durum benim IP adresimin de diğerleri tarafından görülebildiği anlamına mı geliyor?

source: Is using an outproxy safe?
de: Ist es sicher, einen Ausgangsproxy zu benutzen?
es_ar: ¿Es seguro usar un proxy de salida de I2P a Internet?
fr: Peut-on utiliser un mandataire sortant en toute sécurité ?
id: Apakah aman untuk menggunakan outproxy?
ja: アウトプロキシの使用は安全ですか？
pl: Czy używanie proxy wyjściowego (outproxy) jest bezpieczne?
pt: Está usando um outproxy seguro?
tr: Bir çıkış vekil sunucusu kullanmak güvenli mi?

source: What about "De-Anonymizing" attacks?
es_ar: ¿Qué pasa con los ataques de "Desanonimización"?
fr: Pourquoi pas "désanonymiser" les attaques ?
id: Bagaimana dengan serangan "De-Anonymizing"?
ja: 「脱匿名性」攻撃とは何ですか？
pl: Co z atakami deanonimizującymi?
pt: E os ataques de "desanonimização"?
tr: "Anonimliği kaldırma" saldırısı nedir?

source: I can't access regular Internet sites through I2P.
de: Ich kann keine normalen Internetseiten &uuml;ber I2P erreichen.
es_ar: No puedo acceder a la Internet regular a través de I2P.
fr: Je ne peux pas accéder aux sites de l’Internet ordinaire par I2P.
id: Saya tidak dapat mengakses situs Internet biasa melalui I2P.
ja: I2P を通じて通常のインターネットサイトにアクセスできません。
pl: Nie mogę przeglądać normalnych stron internetowych przez I2P.
pt: Não consigo acessar sites regulares da Internet através do I2P.
tr: I2P üzerinden normal İnternet sitelerine erişemiyorum.

source: I can't access https:// or ftp:// sites through I2P.
de: Ich kann keine https:// oder ftp:// Seiten &uuml; I2P besuchen.
es_ar: No puedo acceder a sitios https:// o ftp:// a través de I2P.
fr: Je ne peux pas accéder aux sites https:// ou ftp:// par I2P.
id: Saya tidak dapat mengakses situs https:// atau ftp:// melalui I2P.
ja: I2P を通じて https:// または ftp://にアクセスできません。
pl: Nie mogę połączyć się z stronami https:// lub ftp:// przez I2P.
pt: Não consigo acessar sites https:// ou ftp:// através do I2P.
tr: I2P üzerinden https:// ya da ftp:// sitelerine erişemiyorum.

source: Why is my router using too much CPU?
es_ar: ¿Por qué mi router utiliza demasiada CPU?
fr: Pourquoi est-ce que mon routeur utilise trop d'UCT ?
id: Mengapa router saya menggunakan terlalu banyak CPU?
ja: ルータのCPU使用量が多いのはなぜですか？
pl: Dlaczego mój węzeł wykorzystuje zbyt dużo mocy procesora?
pt: Por que meu roteador está usando muita CPU?
tr: Yönelticim neden çok fazla işlemci gücü kullanıyor?

source: My active peers / known peers / participating tunnels / connections / bandwidth vary dramatically over time! Is anything wrong?
de: Meine active Peers / known Peers / Participating Tunnel / Verbindungen / Bandbeite &auml;ndern sich stark! Ist irgendwas kaputt?
es_ar: ¡Mis pares activos / pares conocidos / túneles participantes / conexiones / ancho de banda, varían dramáticamente a lo largo del tiempo! ¿Está mal algo?
fr: Mes pairs actifs / pairs connus / tunnels participants / connexions / bande passante varient considérablement au fil du temps ! Y a-t-il un problème ?
id: Peer aktif saya / known peers / participating tunnels / connections / bandwidth bervariasi secara dramatis dari waktu ke waktu! Apakah ada sesuatu yang salah?
ja: 自分のアクティブなピア / 既知のピア / 参加中のトンネル / 接続 / 帯域幅 がそのうちに著しく変化します！何かおかしいのでしょうか？
pl: Moi aktywni uczestnicy / znani uczestnicy / uczestniczące tunele / połączenia / przepustowość zmieniają się jak szalone z czasem! Czy jest coś nie tak?
pt: Meus peers ativos / peers conhecidos / túneis participantes / conexões / largura de banda variam dramaticamente ao longo do tempo! Tem algo errado?
tr: Etkin eşlerim / bilinen eşlerim / katıldığım tüneller / bağlantılar / bant genişliği zaman içinde büyük oranda değişti. Bir sorun mu var?

source: What makes downloads, torrents, web browsing, and everything else slower on I2P as compared to the regular internet?
de: Warum ist Downloaden, Filesharing, Surfen und alles andere mit I2P langsamer als beim normalen Internet?
es_ar: ¿Qué hace que las descargas, los torrents, la navegación web y todo lo demás sea más lento en I2P en comparación con Internet normal?
fr: Pourquoi les téléchargements, les torrents, la navigation sur la Toile et tout le reste sont plus lents sur I2P comparés à l’Internet ordinaire ?
id: Apa yang membuat unduhan, torrent, penelusuran web, dan lainnya, lebih lambat di I2P dibandingkan dengan internet biasa?
ja: ダウンロード、Torrent、ウェブブラウジングなどがどれもI2P上では通常のインターネットに比べ低速になるのはなぜですか？
pl: Dlaczego pobieranie plików, przeglądanie stron, ogółem wszystko jest wolniejsze w sieci I2P niż w normalnym internecie?
pt: O que torna os descarregamentos, os torrents, a navegação na Web e tudo o resto mais lento na I2P em comparação com a Internet normal?
tr: Neden I2P üzerinde indirme, torrent, sitelerde dolaşma gibi tüm işlemler normal internet bağlantısına göre daha yavaş?

source: I think I found a bug, where can I report it?
de: Ich glaube, ich habe eine Fehler gefunden. Wo kann ich diesen melden?
es_ar: Creo que he encontrado un error, ¿dónde puedo reportarlo?
fr: Je pense avoir trouvé un bogue, où puis-je le signaler ?
id: Saya rasa saya menemukan bug, ke mana saya dapat melaporkannya?
ja: バグを見つけたと思うのですが、どこで報告できますか？
pl: Znalazłem błąd, gdzie go mogę zgłosić?
pt: Eu acho que encontrei um erro, onde eu posso reportá-lo?
tr: Sanıyorum bir hata buldum. Nereye bildirebilirim?

source: I have a question!
de: Ich habe eine Frage!
es_ar: ¡Tengo una pregunta!
fr: J’ai une question !
id: Saya punya pertanyaan!
ja: 質問があります！
pl: Mam pytanie!
pt: Eu tenho uma pergunta!
tr: Bir sorum var!

source: I2P is written in the <a href="%(java)s">Java programming language</a>. It has been tested on Windows, Linux, FreeBSD and OSX. An <a href="%(android)s">Android port</a> is also available.
de: I2P ist in der <a href="%(java)s">Programmiersprache Java</a> geschrieben. Es wurde auf Windows, Linux, FreeBSD und OSX getestet. Eine <a href="%(android)s">Android-Portierung</a> ist ebenso verfügbar.
fr: I2P est écrit dans le <a href="%(java)s">langage de programmation Java</a>. Il a été testé sous Windows, Linux, FreeBSD et OS X. Une <a href="%(android)s">adaptation pour Android</a> est aussi proposée.
id: I2P ditulis dalam <a href="%(java)s"> bahasa pemrograman java </a>. I2p telah diuji pada Windows, Linux, FreeBSD, dan OSX. <a href="%(android)s">Port Android</a> juga tersedia.
ja: I2Pは<a href="%(java)s">プログラミング言語Java</a>で書かれています。 Windows、Linux、FreeBSD、OSXでの動作が確認されています。 <a href="%(android)s">Android移植</a>も利用可能です。
pl: I2P jest napisane w języku programowania <a href="%(java)s">Java</a>. Oprogramowanie zostało przetestowane na systemach Windows, Linux, FreeBSD i macOS. Dostępny jest również port na <a href="%(android)s">Androida</a>.
pt: O I2P está escrito na <a href="%(java)s">linguagem de programação Java </a>. Foi testado em Windows, Linux, FreeBSD e OSX. Está disponível também uma <a href="%(android)s">compilação para Android</a>.
tr: I2P <a href="%(java)s">Java programlama dilinde</a> yazılmıştır. Windows, Linux, FreeBSD ve OSX üzerinde denenmiştir. Ayrıca <a href="%(android)s">Android üzerine de taşınmıştır</a>.

source: In terms of memory usage, I2P is configured to use 128 MB of RAM by default. This is sufficient for browsing and IRC usage. However, other activities may require greater memory allocation. For example, if one wishes to run a high-bandwidth router, participate in I2P torrents or serve high-traffic hidden services, a higher amount of memory is required.
de: Hinsichtlich des Speicherverbrauchs ist I2P standardmäßig konfiguriert, 128 MB RAM zu benutzen. Das ist ausreichend zum Surfen und für den IRC-Chat. Allerdings können andere Anwendungen höherere Speicheranforderungen stellen. Zum Beispiel wenn man einen Router mit hoher Bandbreite starten, an BitTorrent-Filesharing teilnehmen oder versteckte Dienste mit viel Traffic anbieten möchte, wird mehr Arbeitsspeicher benötigt.
fr: Au niveau de l’utilisation de la mémoire, I2P est configuré pour utiliser 128 Mo de mémoire vive par défaut. Cela est suffisant pour la navigation et l’utilisation d’IRC. Cependant, d’autres activités pourraient exiger une plus grande attribution de mémoire. Si quelqu’un souhaite faire fonctionner un routeur à large bande passante, participer à des torrents I2P ou servir des services cachés à trafic élevé, une quantité de mémoire plus élevée est exigée.
id: Dalam hal penggunaan memori, I2P dikonfigurasi untuk menggunakan 128 MB RAM secara default. Ini cukup untuk browsing dan penggunaan IRC. Namun, kegiatan lain mungkin memerlukan alokasi memori yang lebih besar. Misalnya, jika seseorang ingin menjalankan router bandwidth tinggi, berpartisipasi dalam torrents I2P atau meng-hosting layanan tersembunyi dengan lalu lintas tinggi, diperlukan jumlah memori yang lebih tinggi.
ja: メモリ使用に関して、I2Pは128MBのRAMを使用するようにデフォルトでは設定されています。 これはブラウジングやIRC使用には十分です。しかし、他の活動ではさらに多くのメモリ割り当てが必要になるかもしれません。 例えば、高帯域幅のルーターを動かしたい人や、I2Pトレントへの参加、高トラフィックの秘匿サービスを提供したい人は、 より多くのメモリが必要です。
pl: Odnośnie użycia pamięci: I2P jest domyślnie skonfigurowane do korzystania z 128 MB pamięci RAM. Jest to wystarczająco do przeglądania stron i IRC, ale inne aktywności mogą wymagać większej ilości pamięci. Do trasowania większych ilości danych, korzystania z BitTorrenta i hostowania intensywnie wykorzystywanych ukrytych usług, niezbędna jest większa ilość pamięci.
pt: Em termos de utilização de memória, o I2P está configurado para utilizar 128 MB de RAM por defeito. Isso é suficiente para navegação e uso do IRC. No entanto, outras atividades podem exigir uma maior alocação de memória. Por exemplo, se alguém desejar executar um roteador de alta largura de banda, participar de torrents I2P ou servir serviços ocultos de alto tráfego, é necessária uma quantidade maior de memória.
tr: Bellek kullanımında, I2P varsayılan olarak 128 MB RAM kullanacak şekilde yapılandırılmıştır. Bu değer sitelerde dolaşmak ve sohbet işlemleri için yeterlidir. Ancak diğer işlemler için daha fazla bellek ayrılması gerekebilir. Örneğin, I2P torrentlerine ya da trafiği yüksek gizli hizmetlere erişmek için yüksek bant genişliğine sahip bir yöneltici gerekiyorsa daha fazla bellek ayrılmalıdır.

source: In terms of CPU usage, I2P has been tested to run on modest systems such as the <a href="%(rpi)s">Raspberry Pi</a> range of single-board computers. As I2P makes heavy use of cryptographic techniques, a stronger CPU will be better suited to handle the workload generated by I2P as well as tasks related to the rest of the system (i.e. Operating System, GUI, Other processes e.g. Web Browsing).
de: Hinsichtlich der CPU-Last wurde I2P auf schwächeren Systemen, wie z.B. den <a href="%(rpi)s">Raspberry Pi</a> Einplatinencomputern, getestet. Da I2P häufig Gebrauch von Krypographie macht, ist eine stärkere CPU besser geeignet, um genug Rechenleistung für I2P sowie für die Aufgaben des restlichen Systems (d.h. Betriebssystem, Benutzeroberfläche, andere Prozesse wie z.B. Browser) bereit zu stellen.
fr: Au niveau de l’utilisation de l’UCT, I2P a été testé pour tourner sur des systèmes modestes tels que la gamme d’ordinateurs <a href="%(rpi)s">Raspberry Pi</a> à une carte. Dans la mesure où I2P utilise largement des techniques cryptographiques, une UCT plus puissante conviendra mieux pour traiter la charge de travail générée par I2P ainsi que les tâches inhérentes au reste du système (c.-à-d. le système d’exploitation, l’IUG, d’autres processus comme la navigation sur le Toile par exemple).
id: Dalam hal penggunaan CPU, I2P telah diuji untuk berjalan pada sistem sederhana seperti komputer single-board <a href="%(rpi)s"> raspberry pi </a>. Karena I2P memanfaatkan teknik kriptografi, CPU yang lebih kuat akan lebih cocok untuk menangani beban kerja yang dihasilkan oleh I2P serta berbagai task yang terkait dengan sistem lainnya (misalnya, sistem operasi, GUI, proses lain, misalnya penelusuran web).
ja: CPU使用に関して、I2Pは<a href="%(rpi)s">Raspberry Pi </a>クラスのシングルボードコンピュータなどの控えめな環境でも動作することが確認されています。 I2Pは暗号技術を多用するので、I2Pで生ずる負荷とその他のシステム作業（i.e. OS、GUI、Webブラウジングのような他のプロセス）に対処するためには、より優秀なCPUが適しているでしょう。
pl: Odnośnie zużycia procesora: działanie I2P zostało sprawdzone na leciwych systemach, takich jak komputery jednopłytkowe <a href="%(rpi)s">Raspberry Pi</a>. Ponieważ I2P korzysta z zaawansowanej kryptografii, mocniejszy procesor byłby odpowiedniejszy do korzystania z systemu obciążonego I2P i reszty zadań (usługi systemu operacyjnego, powłoka, inne procesy, przeglądarka internetowa).
pt: Em termos de utilização da CPU, o I2P foi testado para funcionar em sistemas modestos, como a gama de computadores de placa única <a href="%(rpi)s">Raspberry Pi</a>. Como o I2P utiliza fortemente técnicas criptográficas, uma CPU mais potente será mais adequada para lidar com a carga de trabalho gerada pelo I2P, bem como com as tarefas relacionadas com o resto do sistema (ou seja, sistema operativo, GUI, outros processos, por exemplo, navegação na Web).
tr: İşlemci kullanımında, I2P <a href="%(rpi)s">Raspberry Pi</a> gibi basit tek parça bilgisayarlar üzerinde denenmiştir. I2P üzerinde ağır işlemci yükü oluşturan şifreleme teknikleri kullanıldığından, I2P ve diğer sistem görevlerinin (işletim sistemi, görsel arayüz, tarayıcı gibi) oluşturduğu iş yükünü taşıyabilecek daha güçlü bir işlemci kullanılması iyi olur.
