Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Browsers are highly complex and powerful engines for executing code and displaying information obtained mainly from strangers on the internet. By default, they tend to leak a great deal of information about the person using them to the servers they retrieve information from. Using this browser profile allows you to become part of a "common" set of very similar browser users, instead of appearing unique or revealing details of your hardware or software. Because this involves disabling some browser features, this also reduces the attack surface available to outsiders. This keeps you safer while browsing the Invisible Web.
fr: Les navigateurs sont des moteurs extrêmement complexes et puissants pour exécuter du code et afficher de l'information obtenu principalement d'inconnus sur internet. Par défaut, ils ont tendance à faire fuiter un grand taux d'information sur leurs utilisateur s vers des serveurs dont ils reçoivent l'information. Utiliser ce profile navigateur vous permet de devenir une partie d'un ensemble "commun" d'utilisateurs similaires, au lieu de paraître unique ou révéler des détails de votre équipement ou logiciel. Car cela implique de désactiver certaines fonctions du navigateur, cela réduit aussi la surface d'attaque disponible aux étrangers. Cela vous garde en sécurité quand vous naviguez l'internet invisible.
id: Browser adalah program yang sangat kompleks dan kuat untuk mengeksekusi kode dan menampilkan informasi yang diperoleh dari orang asing di internet. Secara default, mereka cenderung membocorkan banyak informasi tentang orang yang menggunakannya ke server mereka. Menggunakan profil browser ini memungkinkan Anda menjadi salah satu dari serangkaian pengguna browser yang sangat mirip, bukannya tampil unik atau mengungkapkan detail perangkat keras atau perangkat lunak Anda. Karena profile ini mematikan beberapa fitur browser, juga mengurangi surface attack. Ini membuat Anda lebih aman saat menjelajahi invisible web.
ja: ブラウザは、主にインターネット上の無関係な他者から取得した、コードの実行や情報の表示の ための非常に複雑かつ強力なエンジンです。標準設定では、情報を取得するサーバーに、使用している 人物に関する大量の情報が漏れがちです。このブラウザープロファイルを使用すると、特異性を 示したり、使用しているハードウェアやソフトウェアの詳細を明かしてしまわずに、非常によく 似たブラウザーの「普通の」ユーザー郡の一員になることができます。これには、ブラウザの 一部の機能を無効にすることが必要なため、外部からの攻撃対象が少なくなります。 これにより、 不可視なウェブを閲覧する際の安全性を確保することができます。
pt: Navegadores são motores altamente complexos e poderosos para executar código e exibir informação obtida, em geral, de estranhos na internet. Por padrão, eles tendem a vazar uma grande quantidade de informações sobre a pessoa os utilizando para os servidores dos quais eles obtêm informações. Usar esse perfil de navegador permite que você se torne parte de uma rede "comum" de usuários de navegador muito similares, ao invés de parecer único ou revelar detalhes sobre seu hardware ou software. Por isso envolver desabilitar algumas funcionalidades do navegador, isso também reduz a superfície de ataque disponível para pessoas de fora. Isso mantém você mais seguro enquanto navega na Web Invisível.
tr: Tarayıcılar, kod yürütmek ve çoğunlukla İnternet üzerindeki yabancılardan elde edilen bilgileri görüntülemek için hazırlanmış oldukça karmaşık ve güçlü yazılımlardır. Varsayılan olarak, bilgi aldıkları sunuculara kendilerini kullanan kişi hakkında çok fazla bilgi sızdırma eğilimindedirler. Bu tarayıcı profilini kullanmak, benzersiz görünmek veya donanımı ve yazılımınızın ayrıntılarını ortaya çıkarmak yerine, çok benzer tarayıcı kullanıcılarından oluşan "ortak" bir grubun parçası gibi görünmenizi sağlar. Bu nedenle, bazı tarayıcı özelliklerinin devre dışı bırakılmasını gerekir, ancak aynı zamanda yabancıların kullanabileceği saldırı yüzeyi de azaltılmış olur. Bu özellik, görünmez internet üzerinde gezinirken sizi daha güvende tutar.

source: Download that file and run it.
de: Lade die Datei herunter und führe sie aus.
es_ar: Descargue este archivo y ejecútelo.
fr: Télécharger ce fichier et l’exécuter.
id: Unduh lalu jalankan file tersebut
ja: ファイルをダウンロードして、起動する
pl: Pobierz ten plik i uruchom go.
pt: Transfira o ficheiro e execute-o.
tr: Bu dosyayı indirip çalıştırın.

source: Download
es_ar: Descargar
fr: Télécharger
id: Unduh
ja: ダウンロード
pl: Pobierz
pt: Transferir
tr: İndir

source: Source package
de: Quellpakete
es_ar: Paquete de código fuente
fr: Paquet source
id: Paket source code
ja: ソースパッケージ
pl: Kod źródłowy
pt: Pacote originário
tr: Kaynak paket

source: Automatic updates
de: automatische Updates
es_ar: Actualizaciones automáticas
fr: Mises à jour automatiques
id: Pembaruan otomatis
ja: 自動更新
pl: Automatyczne aktualizacje
pt: Atualizações Automáticas
tr: Otomatik güncellemeler

source: Manual updates
de: Manuelle Aktualisierungen
es_ar: Actualizationes manuales
fr: Mises à jour manuelles
id: Update manual
ja: 手動アップデート
pl: Ręczne aktualizacje
pt: Atualizações manuais
tr: El ile güncellemeler

source: If you would like to try the latest experimental I2P projects, visit the <a href = "%(lab)s">I2P Lab</a>
de: Die neuesten experimentellen I2P-Projekte können im <a href = "%(lab)s">I2P-Lab</a> ausprobiert werden
fr: Si vous souhaitez essayer les projets expérimentaux les plus récents d’I2P, visitez le <a href = "%(lab)s">Labo d’I2P</a>
id: Jika Anda ingin mencoba proyek I2P eksperimental terbaru, kunjungi <a href = "%(lab)s"> I2P Lab </a>
ja: 最新の実験的I2Pプロジェクトをトライしたいなら <a href = "%(lab)s">I2P ラボ</a>を開いてください
pl: Jeżeli chciał(a)byś wypróbować eksperymentalne projekty związane z I2P, zapraszamy do <a href = "%(lab)s">laboratorium I2P</a>
pt: Se você gostaria de testar os projetos experimentais da I2P mais recentes, visite o <a href = "%(lab)s">Laboratório da I2P</a>
tr: Son deneysel I2P projelerini denemek isterseniz <a href = "%(lab)s">I2P Lab</a> bölümüne bakabilirsiniz

source: Release Notes
de: Versionshinweise
es_ar: Notas de Versión
fr: Notes de mise à jour
id: Catatan Rilis
ja: リリースノート
pl: Informacje o wydaniu
pt: Notas de Lançamento
tr: Sürüm Notları

source: Change Log
de: Änderungsprotokoll
es_ar: Registro de cambios
fr: Journal des changements
id: Change Log/Catatan Perubahan
ja: 変更履歴
pl: Historia zmian
pt: Log de Mudanças
tr: Değişiklik Günlüğü

source: Debian Change Log
de: Debian-Änderungsprotokoll
es_ar: Registro de cambios para Debian
fr: Journal des changements pour Debian
ja: Debian変更履歴
pl: Historia zmian (Debian)
pt: Log de Mudanças no Debian
tr: Debian Değişiklik Günlüğü

source: Android Change Log
de: Android-Änderungsprotokoll
es_ar: Registro de cambios para Android
fr: Journal des changements pour Android
ja: Android変更履歴
pl: Historia zmian (Android)
pt: Log de Mudanças no Android
tr: Android Değişiklik Günlüğü

source: I2P for Windows
fr: I2P pour Windows
id: I2P untuk Windows
ja: Windows 用 I2P
pl: I2P dla systemu Windows
pt: I2P para Windows
tr: Windows için I2P

source: The default I2P installer requires Java to be installed. You can obtain it from <a href="%(java)s">Oracle</a> or from your choice of Java distribution. After installing Java, download the file and double-click to run it.
fr: L'installeur I2P par défaut requiert que Java soit installé. Vous pouvez l'obtenir par <a href="%(java)s">l'Oracle</a> ou de votre choix de distribution Java. Après avoir avoir installé Java, téléchargez le fichier et cliquez deux fois pour le démarrer.
id: Installer I2P default mengharuskan Java untuk diinstal. Anda dapat mengunduh Java dari <a href="%(java)s">Oracle</a> atau dari distribusi Java pilihan Anda. Setelah menginstal Java, unduh filenya lalu klik dua kali untuk menjalankannya.
ja: 標準のI2Pインストーラーを実行するには、Javaがインストールされている必要があります。これは、<a href="%(java)s">Oracle</a>、またはあなたが好むJavaディストリビューションから入手できます。Javaのインストール後、ファイルをダウンロードして二回クリックすると、実行します。
pl: Domyślny instalator I2P potrzebuje Javy do instalacji. Możesz ją pozyskać z <a href="%(java)s">Oracle</a> lub z dystrybucji Javy twojego wyboru. Po instalacji Javy, pobierz plik i dwukrotnie kliknij, aby go włączyć.
pt: O instalador padrão da I2P requer que o Java esteja instalado. Você pode obtê-lo da <a href="%(java)s">Oracle</a> ou de sua escolha de distribuição Java. Após instalar o Java, baixe o arquivo e dê dois cliques para executá-lo.
tr: Varsayılan I2P kurucu, için Java kurulması gerekir. <a href="%(java)s">Oracle</a> üzerinden ya da seçtiğiniz bir Java dağıtımından alabilirsiniz. Java kurulumundan sonra dosyayı indirin ve çalıştırmak için çift tıklayın.

source: Easy Install Bundle For Windows (Beta)
fr: Paquet Installation Facile pour Windows (bêta)
id: Bundel Instalasi Mudah untuk Windows (Beta)
pl: Łatwy Pakiet Instalacyjny dla Windowsa (Beta)
pt: Pacote de Instalação Fácil para Windows (Beta)
tr: Windows için kolay kurulum paketi (Beta)

source: It is now possible to install all I2P components using a single package (<strong>No Java required</strong>). To try out the new installer, click below. This bundle can also be used to configure a Firefox Profile. It will not interfere with an existing I2P installation if one exists.
fr: Il est désormais possible d'installer tout les composants I2P en un seul paquet (<strong>Java non requit</strong>). Pour essayer le nouveau programme d'installation, cliquez ci-dessous. Le paquet peut aussi être utilisé pour configurer un profil Firefox. Il n'interféra pas avec une installation I2P existante si il y en a une présente.
id: Kini semua komponen I2P dapat diinstal menggunakan satu paket (<strong>Java tidak diperlukan</strong>). Untuk mencoba installer baru, klik di bawah. Bundel ini juga dapat digunakan untuk mengkonfigurasi Profil Firefox. Bundel ini tidak akan mengganggu instalasi I2P yang sudah ada.
pt: Agora é possível instalar todos os componentes da I2P usando um único pacote (<strong>Sem Java necessário</strong>). Para experimentar o novo instalador, clique abaixo. Este pacote também pode ser usado para configurar um Perfil do Firefox. Ele não interferirá com uma instalação existente da I2P se houver uma.
tr: Artık tüm I2P bileşenleri tek bir paket kullanılarak (<strong>Java gerekmez</strong>) kurulabilir. Yeni kurucuyu denemek için aşağıya tıklayın. Bu paket, bir Firefox profili yapılandırmak için de kullanılabilir. Bu işlem varsa var olan bir I2P kurulumu üzerinde değişiklik yapmaz.

source: I2P Easy Install Bundle For Windows (Beta)
fr: Paquet Installation Facile I2P pour Windows (bêta)
id: Bundel Instalasi Mudah I2P untuk Windows (Beta)
pl: Łatwy Pakiet Instalacyjny I2P dla Windowsa (Beta)
pt: Pacote de Instalação Fácil da I2P para Windows (Beta)
tr: Windows için I2P kolay kurulum paketi (Beta)

source: Detailed Install Guide
fr: Guide d'installation détaillé
id: Panduan Detail Instalasi
ja: 詳細なインストールガイド
pl: Szczegółowy Przewodnik Instalacji
pt: Guia de Instalação Detalhado
tr: Ayrıntılı Kurulum Rehberi

source: Here is a helpful guide to installing I2P for Windows using a separate Java installation and the classic installer.
fr: Voilà un guide utile pour installer I2P pour Windows utilisant une installation séparée Java et le programme d'installation classique.
id: Berikut ini adalah panduan untuk menginstal I2P untuk Windows menggunakan instalasi Java terpisah dan installer klasik.
ja: 別の Java インストーラーとクラシックなインストーラーを使って Windows 用 I2P をインストールするのに役立つガイドはこちら。
pl: Tutaj jest pomocny poradnik dla instalacji I2P dla Windowsa używając oddzielnej instalacji Javy i klasycznego instalatora.
pt: Aqui está um guia útil para instalar a I2P para Windows usando uma instalação separada do Java e o instalador clássico.
tr: Ayrı bir Java kurulumu ve klasik kurucu ile Windows için I2P kurulumunu anlatan yararlı bir rehber.

source: I2P Easy Install Bundle for Mac OS X
fr: Paquet Installation Facile I2P pour Mac OS X
id: Bundel Instalasi Mudah I2P untuk Mac OS X
pl: Łatwy Pakiet Instalacyjny I2P dla Mac OS X
pt: Pacote de Instalação Fácil da I2P para Mac OS X
tr: macOS için I2P kolay kurulum paketi

source: The I2P Easy Install Bundle for Mac OS X is packaged using OSX's standard ".dmg" package type, which allows it to use Apple's built-in tools to securely, reliably, and easily install the package. It does not require Java to be installed.
fr: Le Paquet Installation Facile pour Mac OS X est empaqueté en utilisant le type de paquet standard à OSX ".dmg", qui lui permet d'utiliser les outils intégrés d'Apple pour installer le paquet facilement, de manière fiable et en toute sécurité. Il ne requiert pas Java pour être installé.
id: Bundel instalasi I2P Easy untuk Mac OS X dikemas menggunakan jenis paket standar ".dmg" OSX, yang memungkinkannya menggunakan alat bawaan Apple untuk dengan aman, andal, dan mudah untuk menginstal paket. Bundel ini tidak membutuhkan Java untuk diinstal.
pt: O Pacote de Instalação Fácil da I2P para Mac OS X é empacotado usando o tipo de pacote ".dmg" padrão do OSX, o que permite que ele use as ferramentas embutidas da Apple para instalar o pacote de forma segura, confiável e fácil. Ele não requer que o Java esteja instalado.
tr: macOS için I2P kolay kurulum paketi, standart macOS ".dmg" paket türü ile hazırlanmıştır. Böylece paketi güvenli, güvenilir ve kolay bir şekilde kurmak için yerleşik Apple araçları kullanılabilir. Java kurulması gerekmez.

source: I2P for Linux
fr: I2P pour Linux
id: I2P untuk Linux
ja: Linux 用 I2P
pl: I2P dla systemu Linux
pt: I2P para Linux
tr: Linux için I2P

source: The most reliable way to launch the installer is from a terminal like this: <code>java -jar i2pinstall_%(i2pversion)s.jar</code>. This will launch the GUI installer. Depending on how your computer is set up, you may be able to start the installer by double-clicking the &quot;i2pinstall_%(i2pversion)s.jar&quot; file or right-clicking the file and selecting &quot;Open with Java&quot;. Unfortunately, this behaviour is difficult to predict.
fr: La manière la plus fiable de lancer le programme d'installation est d'un terminal comme ceci : <code>java -jar i2pinstall_%(i2pversion)s.jar</code>. Ceci lancera le programme d'installation GUI. En fonction de comment votre ordinateur est configuré, vous pourrez lancer le programme d'installation en cliquant deux fois sur &quot;i2pinstall_%(i2pversion)s.jar&quot; file ou en faisant clique droit sur le fichier et sélectionner &quot;Open avec Java&quot;. Malheureusement, ce comportement est difficile à prédire.
id: Cara terbaik meluncurkan penginstal adalah dari terminal seperti ini: <code>java -jar i2pinstall_%(i2pversion)s.jar</code>. Ini akan meluncurkan installer GUI. Tergantung setting komputer Anda, Anda mungkin dapat memulai installer dengan mengklik dua kali file "i2pinstall_%(i2pversion)s.jar" atau klik kanan file tersebut dan pilih "Open with Java". Sayangnya, perilaku installer di Linux sulit diprediksi.
pt: A forma mais confiável de iniciar o instalador é a partir de um terminal desta forma: <code>java -jar i2pinstall_%(i2pversion)s.jar</code>. Isso abrirá o instalador com GUI (interface gráfica de usuário). Dependendo de como o seu computador está configurado, você pode conseguir iniciar o instalador dando dois cliques no arquivo &quot;i2pinstall_%(i2pversion)s.jar&quot; ou clicando com o botão direito no arquivo e selecionando &quot;Abrir com Java&quot;. Infelizmente, esse comportamento é difícil de prever.
tr: Kurucuyu bunun gibi bir uç birimden başlatmanın en güvenilir yolu: <code>java -jar i2pinstall_%(i2pversion)s.jar</code>. Bu komut, kurucuyu görsel kullanıcı arayüzünde başlatır. Bilgisayarınızın kurulumuna bağlı olarak, kurucuyu &quot;i2pinstall_%(i2pversion)s.jar&quot; dosyasına çift tıklayarak ya da dosyaya sağ tıklayıp &quot;Open with Java&quot; üzerine tıklayarak başlatabilirsiniz. Ne yazık ki bu davranışı öngörmek zor.

source: Command line (headless) install:
de: Kommandozeilen (Textbasierte) Installation
es_ar: Instalación desde línea de comandos (sistemas headless):
fr: Installation en ligne de commande (sans moniteur) :
id: Instalasi dengan command line (headless):
ja: コマンドライン (GUIなし) インストール:
pl: Instalacja z linii komend:
pt: Instalação pela linha de comando (headless):
tr: Komut satırından (başsız) kurulum:

source: I2P can also be installed in a terminal environment, which may be especially useful for servers, containers, or certain virtual machines. If you wish to use the installer without a GUI, you can use the command <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> to follow the install procedure in your terminal.
fr: I2P peut aussi être installé dans un environnement terminal, qui peut être particulièrement utile pour les serveurs, conteneur et certaines machines virtuelles. Si vous souhaitez utiliser ce programme d'installation sans un GUI, vous pouvez utiliser la commande <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> pour suivre la procédure d'installation dans votre terminal.
id: I2P juga dapat diinstal dengan terminal, yang mungkin berguna khususnya untuk server, container, atau mesin virtual tertentu. Jika Anda ingin menggunakan installer tanpa GUI, Anda dapat menggunakan perintah <code> java -jar i2pinstall _%(i2pversion) s.jar -console </code> lalu ikuti prosedur instal di terminal Anda.
pt: A I2P também pode ser instalada em um ambiente de terminal, o que pode ser especialmente útil para servidores, contêineres, ou certas máquinas virtuais. Se você deseja usar o instalador sem uma interface gráfica de usuário, você pode usar o comando <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> para seguir o procedimento de instalação em seu terminal.
tr: I2P terminal ortamından da kurulabilir. Bu yöntem özellikle sunucular, kapsayıcılar ya da belirli sanal makineler için kullanışlıdır. Görsel kullanıcı arayüzü olmadan kurulum yapmak isterseniz, <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> komutunu kullanarak kurulum sürecini terminal üzerinde tamamlayabilirsiniz.

source: I2P for Debian and Ubuntu
fr: I2P pour Debian et Ubuntu
id: I2P untuk Debian dan Ubuntu
ja: Debian および Ubuntu 用 I2P
pl: I2P dla dystrybucji Debian i Ubuntu
pt: I2P para Debian e Ubuntu
tr: Debian ve Ubuntu için I2P

source: Packages for Debian &amp; Ubuntu are available.
de: Pakete sind für Debian und Ubuntu verfügbar.
es_ar: Hay paquetes disponibles para Debian y Ubuntu.
fr: Des paquets sont proposés pour Debian et Ubuntu.
id: Paket untuk Debian & Ubuntu telah tersedia.
ja: Debian 及び Ubuntu 用パッケージが利用可能です。
pl: Paczki dla Debiana i Ubuntu są dostępne.
pt: Pacotes para Debian &amp; Ubuntu estão disponíveis.
tr: Debian ve Ubuntu için paketler hazırdır.

source: I2P is available in the official repositories for Ubuntu Bionic and later, and Debian Buster and Sid. However, Debian Buster and Ubuntu Bionic (LTS) distributions will have older I2P versions. If you are not running Debian Sid or the latest Ubuntu release, use our Debian repo or Launchpad PPA to ensure you're running the latest I2P version.
fr: I2P est disponible dans le dépôt officiel pour Ubuntu Bionic et plus tard, Debian Buster et Sid. Par contre, les distributions Debian Buster et Ubuntu Bionic (LTS) auront des version I2P plus vieilles. Si vous ne faites pas tourner Debian Sid ou la dernière sortie Ubuntu, utilisez notre dépôt Debian ou Launchpad PPA pour s'assurer que vous faites tourner la dernière version I2P.
id: I2P tersedia di repositori resmi untuk Ubuntu Bionic dan versi lebih baru, serta Debian Buster dan Sid. Namun, distribusi Debian Buster dan Ubuntu Bionic (LTS) akan memiliki versi I2P yang lebih tua. Jika Anda tidak menjalankan Debian Sid atau rilis Ubuntu terbaru, gunakan repo Debian atau PPA Launchpad kami untuk memastikan Anda menjalankan versi I2P terbaru.
ja: I2PはUbuntu Bionic以降、Debian BusterとSidの公式リポジトリで利用可能です。ただし、Debian BusterやUbuntu Bionic (LTS) ディストリビューションでは、古いバージョンの I2P が用意されています。Debian Sidや最新のUbuntuリリースを実行していない場合、 Debian のレポジトリや Launchpad PPA を使って、最新の I2P バージョンを実行していることを確認してください。
pt: A I2P está disponível nos repositórios oficiais para Ubuntu Bionic e posterior, e Debian Buster e Sid. Contudo, as distribuições Debian Buster e Ubuntu Bionic (LTS) terão versões mais antigas da I2P. Se você não está usando o Debian Sid ou o lançamento mais recente do Ubuntu, use nosso repositório Debian ou PPA Launchpad para garantir que você está executando a versão mais recente da I2P.
tr: I2P Ubuntu Bionic ve sonraki sürümler ile Debian Buster ve Sid resmi depolarında bulunuyor. Bununla birlikte, Debian Buster ve Ubuntu Bionic (LTS) dağıtımlarında daha eski I2P sürümleri bulunuyor. Debian Sid ya da son Ubuntu sürümünü kullanmıyorsanız, son I2P sürümünü kullandığınızdan emin olmak için Debian depomuzu ya da Launchpad PPA deposunu kullanın.

source: I2P for Android
fr: I2P pour Android
id: I2P untuk Android
ja: Android 用 I2P
pl: I2P dla systemu Android
pt: I2P para Android
tr: Android için I2P

source: Requires Android 4.0 (Ice Cream Sandwich) or higher. If you earlier installed I2P, unfortunately this release fixes some IPC issues which will force you to uninstall your current installation before installing this.
fr: Requiert Android 4.0 (Ice Cream Sandwich) ou plus. Si vous avez installé I2P plus tôt, malheureusement cette version corrige quelques problèmes qui vous forçait à désinstaller votre version d'installation actuelle avant d'installer celle-là.
id: Membutuhkan Android 4.0 (Ice Cream Sandwich) atau lebih baru. Jika Anda sebelumnya menginstal I2P, sayangnya rilis ini memperbaiki beberapa masalah IPC yang akan memaksa Anda untuk menghapus instalasi Anda saat ini sebelum menginstal ini.
ja: Android 4.0 (Ice Cream Sandwich)以上が必要です。以前に I2P をインストールしていた場合、残念ながらこのリリースでは IPC の問題が修正されているため、インストール前に現在のインストールをアンインストールする必要があります
pt: Requer Android 4.0 (Ice Cream Sandwich) ou superior. Se você anteriormente instalou a I2P, infelizmente este lançamento corrige alguns problemas de IPC que forçarão você a desinstalar sua instalação atual antes de instalar esta.
tr: Android 4.0 (Ice Cream Sandwich) ya da üzerindeki bir sürüm gereklidir. I2P uygulamasını daha önce kurduysanız, ne yazık ki bu sürümde bazı IPC sorunları çözüldüğünden, bu sürümü kurmadan önce kurulu sürümü kaldırmanız gerekir.

source: 512 MB RAM minimum; 1 GB recommended.
de: mindestens 512 MB RAM; 1 GB empfohlen.
es_ar: 512 MB de RAM mínimo, 1 GB recomendado
fr: Un minimum de 512 Mo de mémoire vive ; 1 Go recommandé.
id: 512 MB RAM minimal; 1 GB direkomendasikan.
ja: 512 MB RAM 最低限; 1 GB 推奨。
pl: Minimalnie 512 MB RAM; zalecane 1 GB.
pt: mínimo 512 MB RAM; Recomendado 1 GB.
tr: En az 512 MB RAM bellek; 1 GB önerilir.

source: The releases are not compatible with eachother, as they have different signatures. Uninstall them completely before installing any other version. The apk's from download.i2p2.de are signed by idk.
fr: Ces versions ne sont pas compatibles entre elle, comme elles ont des signatures différentes. Désinstallez les entièrement avant d'installer n'importe quelle version. Cette apk de download.i2p2.de sont signés par idk.
id: Rilis tersebut tidak kompatibel satu sama lain, karena memiliki signature yang berbeda. Copot pemasangannya sepenuhnya sebelum memasang versi lainnya. APK dari download.i2p2.de ditandatangani oleh idk.
ja: これらのリリースは署名が異なるため、お互いに互換性がありません。他のバージョンをインストールする前に、完全にアンインストールしてください。download.i2p2.deからのapkは idkによって署名されています。
pt: Os lançamentos não são compatíveis uns com os outros, já que eles têm assinaturas diferentes. Desinstale-os completamente antes de instalar qualquer outra versão. Os apk's em download.i2p2.de são assinados pelo idk.
tr: Sürümler farklı imzalara sahip olduğundan birbirleriyle uyumlu değildir. Başka bir sürümü kurmadan önce bunları tamamen kaldırın. Download.i2p2.de adresinden alınan apk paketleri idk tarafından imzalanmıştır.

source: I2P for Docker
fr: I2P pour Docker
id: I2P untuk Docker
ja: Docker 用 I2P
pl: I2P dla Dockera
pt: I2P para Docker
tr: Docker için I2P
