Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: <p><b>The I2P project itself does not run any proxies to the Internet.</b> The I2P software includes a default outproxy: exit.stormycloud.i2p. These are run by a volunteer. </p> <a href="https://stormycloud.org" target="_blank">https://stormycloud.org</a>
fr: <p><b>Le projet I2P en lui-même ne fait pas tourner de mandataires vers Internet.</b> Le logiciel I2P inclut un mandataire sortant par défaut : exit.stormycloud.i2p. Ils sont entretenus par un bénévole.</p> <a href="https://stormycloud.org" target="_blank">https://stormycloud.org</a>
id: <p><b>Proyek I2P itu sendiri tidak menjalankan proxy apa pun ke Internet.</b> Perangkat lunak I2P menyertakan outproxy default: exit.stormycloud.i2p. Ini dijalankan oleh sukarelawan. </p> <a href="https://stormycloud.org" target="_blank">https://stormycloud.org</a>
ja: <p><b>I2Pプロジェクトによるインターネットへのプロキシは、一つも稼働していません</b> I2Pソフトウェアは初期設定のアウトプロキシを内蔵します: exit.stormycloud.i2p これらは有志によって稼働されています</p> <a href="https://stormycloud.org" target="_blank">https://stormycloud.org</a>
pt: <p><b>O projeto I2P em si não executa quaisquer proxies para a Internet.</b> O software I2P inclui um proxy de saída padrão: exit.stormycloud.i2p. Esse é administrado por um voluntário. </p> <a href="https://stormycloud.org" target="_blank">https://stormycloud.org</a>
tr: <p><b>I2P projesi, internet bağlantısını sağlayan herhangi bir vekil sunucu çalıştırmaz.</b> I2P uygulamasında varsayılan bir çıkış vekil sunucusu bulunur: exit.stormycloud.i2p. Bunlar bir gönüllü tarafından işletilmektedir. </p> <a href="https://stormycloud.org" target="_blank">https://stormycloud.org</a>

source: By default, I2P comes with one outproxy configured: <code>%(http)s</code>.
es_ar: Por defecto, I2P viene con un outproxy configurado: <code>%(http)s</code>.
fr: Par défaut, I2P est inclut avec un mandataire sortant configuré : <code>%(http)s</code>.
id: Secara default, I2P hadir dengan satu outproxy yang dikonfigurasi: <code>%(http)s</code>.
ja: 初期設定では、I2Pは1個のアウトプロキシを設定します: <code>%(http)s</code>
pt: Por padrão, a I2P vem com um proxy de saída configurado: <code>%(http)s</code>.
tr: I2P varsayılan olarak bir çıkış vekil sunucusu yapılandırılmış olarak gelir: <code>%(http)s</code>.

source: I2P Sites that are accessible via .i2p addresses are also not allowed via the outproxies.
es_ar: Los sitios I2P accesibles a través de direcciones .i2p tampoco están no están permitidos a través de los outproxies.
fr: Les sites I2P qui sont accessibles sur les adresses .i2p ne sont pas autorisé par les mandataires sortants.
id: Situs I2P yang dapat diakses melalui alamat .i2p juga tidak diizinkan diakses melalui outproxies.
ja: .i2p アドレスを介してアクセス可能なI2Pサイトは、アウトプロキシを介してはアクセス不可能です。
pt: Sites I2P que são acessíveis via endereços .i2p também não são permitidos via proxies de saída.
tr: .i2p adresleri ile erişilebilen I2P sitelerine çıkış vekil sunucuları ile erişilemez.

source: <a href="https://www.torproject.org">Tor</a> provides a browser to use as an outproxy to the Internet.
es_ar: <a href="https://www.torproject.org">Tor</a> proporciona un navegador para utilizar como outproxy a Internet.
fr: <a href="https://www.torproject.org">Tor</a> fourni un navigateur à utiliser comme mandataire sortant vers Internet.
ja: <a href="https://www.torproject.org">Tor</a> はインターネットへのアウトプロキシとして使用するためのブラウザを提供します。
pl: <a href="https://www.torproject.org">Tor</a> dostarcza przeglądarkę do użytku jako outproxy do Internetu.
pt: O <a href="https://www.torproject.org">Tor</a> oferece um navegador para usar como um proxy de saída para a Internet.
tr: <a href="https://www.torproject.org">Tor</a> internete bağlantısı için bir çıkış vekil sunucusu olarak kullanılabilecek bir tarayıcı sağlar.

source: Configuration
de: Konfiguration
es_ar: Configuración
id: Konfigurasi
ja: 設定
pl: Konfiguracja
pt: Configuração
tr: Yapılandırma

source: Debian I2P Packages
de: I2P-Debianpakete
es_ar: Paquetes de I2P para Debian
fr: Paquets I2P pour Debian
id: Paket I2P Debian
ja: Debian用 I2P パッケージ
pl: Paczki I2P Debiana
pt: Pacotes do I2P para Debian
tr: Debian I2P Paketleri

source: Debian or Ubuntu, All Versions
de: Debian oder Ubuntu, Alle Versionen
es_ar: Debian o Ubuntu, todas las versiones
fr: Debian ou Ubuntu, toutes versions
id: Debian atau Ubuntu, Semua Versi
ja: すべてのバージョンのDebian または Ubuntu
pl: Debian lub Ubuntu, wszystkie wersje
pt: Debian ou Ubuntu, todas as versões
tr: Debian ya da Ubuntu, Tüm Sürümler

source: The Debian packages should work on most platforms running:
de: Die Debian-Pakete sollten auf den meisten Rechnern mit den folgenden Distributionen funktionieren:
es_ar: Los paquetes de Debian deberían funcionar en la mayoría de las plataformas en ejecución:
fr: Les paquets Debian devraient fonctionner sur la plupart des plateformes sous :
id: Paket Debian seharusnya dapat bekerja pada sebagian besar platform yang menjalankan:
ja: Debianのパッケージは下記のほとんどのプラットフォームで動作します:
pl: Paczki Debiana powinny działać na większości maszyn z systemami:
pt: Os pacotes Debian devem funcionar na maioria das plataformas em execução:
tr: Debian paketleri şunu çalıştıran çoğu platformda çalışmalıdır:

source: <a href="#ubuntu">Ubuntu</a> (Bionic <em>18.04</em> and newer)
fr: <a href="#ubuntu">Ubuntu</a> (Bionic <em>18.04</em>et plus récents)
id: <a href="#ubuntu">Ubuntu</a> (Bionic <em>18.04</em> dan versi lebih baru)
ja: <a href="#ubuntu">Ubuntu</a> (Bionic <em>18.04</em> 以降)
pl: <a href="#ubuntu">Ubuntu</a> (Bionic <em>18.04</em> i nowszy)
pt: <a href="#ubuntu">Ubuntu</a> (Bionic <em>18.04</em> e mais recente)
tr: <a href="#ubuntu">Ubuntu</a> (Bionic <em>18.04</em> ya da üzeri sürümler)

source: <a href="#ubuntu">Mint</a>(Tara<em>19</em>) or newer
fr: <a href="#ubuntu">Mint</a> (Tara<em>19</em>) ou plus récent
id: <a href="#ubuntu">Mint</a>(Tara<em>19</em>) atau lebih baru
ja: <a href="#ubuntu">Mint</a> (Tara <em>19</em>) 以降
pl: <a href="#ubuntu">Mint </a>(Tara<em>19</em>) lub nowszy
pt: <a href="#ubuntu">Mint</a>(Tara<em>19</em>) ou mais recente
tr: <a href="#ubuntu">Mint</a>(Tara<em>19</em>) ya da üzeri sürümler

source: <a href="#debian">Debian Linux</a> (Buster and newer)
fr: <a href="#debian">Debian Linux</a> (Buster et plus récent)
id: <a href="#debian">Debian Linux</a> (versi Buster dan lebih baru)
ja: <a href="#debian">Debian Linux</a> (Buster以降)
pl: <a href="#debian">Debian Linux</a> (Buster i nowszy)
pt: <a href="#debian">Debian Linux</a> (Buster e mais recente)
tr: <a href="#debian">Debian Linux</a> (Buster ve üzeri sürümler)

source: The I2P packages <em>may</em> work on systems not listed above. Please report any issues with these packages on <a href="%(gtitlab)s">Gitlab</a> at <a href="%(gtitlab)s">i2p.i2p</a>.
fr: Les paquets I2P <em>peuvent</em> marcher sur des systèmes pas listés au dessus. Veuillez signaler n'importe quel problème avec ces paquets sur <a href="%(gtitlab)s">GItLab</a> à <a href="%(gtitlab)s">i2p.i2p</a>.
id: Paket I2P <em>mungkin</em> bekerja pada sistem yang tidak didaftarkan diatas. Harap laporkan masalah apapun dengan paket-paket ini di <a href="%(gtitlab)s"> Gitlab </a> di <a href="%(gtitlab)s"> i2p.i2p </a>.
ja: I2P パッケージは、上記されていないシステムでも動作する<em>場合が</em>があります。<a href="%(gtitlab)s">i2p.i2p</a>の <a href="%(gtitlab)s">Gitlab</a>で、パッケージの問題を 報告してください。
pl: Paczki I2P <em>mogą</em> działać na systemach nie wymienionych poniżej. Proszę zgłoś wszelkie błędy z tymi paczkami do <a href="%(gtitlab)s">Gitlab</a> pod <a href="%(gtitlab)s">i2p.i2p</a>.
pt: Os pacotes da I2P <em>podem</em> funcionar em sistemas não listados acima. Por favor, relate quaisquer problemas com esses pacotes no <a href="%(gtitlab)s">Gitlab</a> em <a href="%(gtitlab)s">i2p.i2p</a>.
tr: I2P paketleri yukarıda gösterilmeyen sistemler üzerinde de <em>çalışabilir</em>. Lütfen bu paketler ile ilgili sorunları <a href="%(gtitlab)s">GitLab</a> sitesindeki <a href="%(gtitlab)s">i2p.i2p</a> üzerinden bildirin.

source: Option 1: <a href="#ubuntu">Recent versions</a> of Ubuntu and its derivatives (<em>Try this if you're not using Debian)</em>
de: Option 1: <a href="#ubuntu">Neuste Versionen</a> von Ubuntu und dessen Derivaten (<em>Versuche dies, wenn du kein Debian benutzt)</em>.
es_ar: Opción 1: <a href="#ubuntu">Versiones recientes</a> de Ubuntu y sus derivados (<em>Pruebe esto si no usa Debian)</em>
fr: Option 1 : <a href="#ubuntu">Versions récentes</a> d’Ubuntu et dérivés (<em>Essayer ceci si vous n’utilisez pas Debian)</em>
id: Pilihan 1: Ubuntu <a href="#ubuntu">versi baru-baru ini</a> dan turunannya (<em>Cobalah ini jika Anda tidak menggunakan Debian)</em>
ja: 選択肢 1: Ubuntu 及びその派生の<a href="#ubuntu">最新のバージョン</a> (<em>Debian を使っていなければこれを試してください)</em>
pl: Opcja 1: <a href="#ubuntu">aktualne wersje</a> Ubuntu i pochodne (<em>spróbuj tego jeśli nie używasz Debiana)</em>
pt: Opção 1: <a href="#ubuntu">Versões recentes</a> do Ubuntu e seus derivados (<em>Tente este se não estiver usando Debian)</em>
tr: 1. Seçenek: <a href="#ubuntu">Geçmiş</a> Ubuntu sürümleri ve türevleri (<em>Debian kullanmıyorsanız bunu deneyin)</em>

source: Option 2: <a href="#debian">Debian</a> (including Debian-derivatives)
de: Option 2: <a href="#debian">Debian</a> (inklusive Debian-Derivate)
es_ar: Opción 2: <a href="#debian">Debian</a> (Incluidos derivados de Debian)
fr: Option 2 : <a href="#debian">Debian</a> (y compris dérivés de Debian)
id: Pilihan 2: <a href="#debian">Debian</a> (termasuk turunannya)
ja: オプション 2: <a href="#debian">Debian</a> (Debian の派生含む)
pl: Opcja 2: <a href="#debian">Debian</a> (łącznie z pochodnymi Debiana)
pt: Opção 2: <a href="#debian">Debian</a> (incluindo derivados do Debian)
tr: 2. Seçenek : <a href="#debian">Debian</a> (Debian türevleri ile birlikte)

source: Instructions for Ubuntu and derivatives like Linux Mint &amp; Trisquel
de: Anleitung für Ubuntu und Derivate wie Linux Mint &amp; Trisquel
es_ar: Instrucciones para Ubuntu y derivados como Linux Mint &amp; Trisquel
fr: Instructions pour Ubuntu et versions dérivées telles que Linux Mint et Trisquel
id: Instruksi untuk Ubuntu dan turunannya seperti Linux Mint & Trisquel
ja: Ubuntu及び Linux Mint や Trisquel などの派生に向けての説明
pl: Instrukcje dla Ubuntu i pochodnych dystrybucji takich jak Linux Mint czy Trisquel
pt: Instruções para Ubuntu e derivados como Linux Mint &amp; Trisquel
tr: Ubuntu ve Linux Mint, Trisquel gibi türevleri için yönergeler

source: Adding the PPA via the command line and installing I2P
de: Das PPA per Terminal hinzufügen und I2P installieren
es_ar: Añadir el PPA desde la línea de comandos e instalar I2P
fr: Ajouter la PPA par la ligne de commande et installer I2P
id: Menambahkan PPA melalui baris perintah dan memasang I2P
ja: コマンドライン経由でPPAを追加して、I2Pをインストールする
pl: Dodawanie PPA z linii komend i instalacja I2P
pt: Adicionando o PPA por linha de comando e instalando I2P
tr: Komut satırından PPA eklemek ve I2P kurulumu

source: Open a terminal and enter:
de: Öffne eine Konsole und gib folgendes ein:
es_ar: Abra un terminal e introduzca:
fr: Ouvrir un terminal et saisir :
id: Buka terminal dan masukkan:
ja: ターミナルを開いて入力:
pl: Otwórz terminal i wpisz:
pt: Abra um terminal e digite:
tr: Bir terminal açarak şunu yazın:

source: This command will add the PPA to <code>/etc/apt/sources.list.d</code> and fetch the gpg key that the repository has been signed with. The GPG key ensures that the packages have not been tampered with since being built.
es_ar: Este comando añadirá el PPA a <code>/etc/apt/sources.list.d</code> y obtendrá la clave gpg con la que se ha firmado el repositorio. La clave GPG asegura que los paquetes no han sido manipulados desde su creación.
fr: Cette commande ajoutera le PPA à <code>/etc/apt/sources.list.d</code> et récupérera la clé gpg qui a signé le dépôt. La clé GPG garantie que les paquets n'ont pas été dérangés depuis leur construction.
id: Perintah ini akan menambahkan PPA ke <code>/etc/apt/sources.list.d</code> dan mengambil kunci gpg yang sudah tanda tangani oleh repositori. Kunci GPG memastikan bahwa paket tidak dirusak sejak dibangun.
ja: このコマンドは <code>/etc/apt/sources.list.d</code> にPPAを追加し、レポジトリが署名されたGPG鍵を取得します。 GPG鍵はパッケージがビルドされてから改竄されていないか確認します。
pt: Esse comando adicionará o PPA para <code>/etc/apt/sources.list.d</code> e obterá a chave gpg com a qual o repositório foi assinado. A chave GPG garante que os pacotes não foram adulterados desde sua construção.
tr: Bu komut <code>/etc/apt/sources.list.d</code> içine PPA ekleyerek deponun imzalandığı GPG anahtarını alır. GPG anahtarı paketin geliştirici tarafından hazırlandıktan sonra değiştirilmediğinden emin olunmasını sağlar.

source: Notify your package manager of the new PPA by entering:
de: Informiere deinen Paketmanager über das neue PPA, indem du folgendes eingibst:
es_ar: Notifique a su gestor de paquetes el nuevo PPA introduciendo:
fr: Signaler la nouvelle PPA à votre gestionnaire de paquets en saisissant :
id: Beritahukan pengelola paket Anda tentang PPA baru dengan memasukkan:
ja: 入力して、新しいPPAのパッケージマネージャーを通知:
pl: Poinformuj swojego menadżera paczek o nowym PPA poprzez wpisanie:
pt: Notifique seu gerenciador de pacotes sobre o novo PPA digitando:
tr: Şunu yazarak paket yöneticinizi yeni PPA hakkında bilgilendirin:

source: This command will retrieve the latest list of software from each repository that is enabled on your system, including the I2P PPA that was added with the earlier command.
de: Dieser Befehl fragt jede auf deinem System eingeschaltete Paketquelle nach der neuesten Softwareliste ab. Inklusive des I2P-PPA, welches mit dem vorherigen Befehl hinzugefügt wurde.
es_ar: Este comando obtendrá la última lista de aplicaciones de cada repositorio que esté habilitado en su sistema, incluyendo el PPA de I2P que hemos añadido anteriormente.
fr: Cette commande récupérera la liste la plus récente de logiciels de chaque dépôt activé sur votre système, y compris ceux de la PPA d’I2P ajoutée avec la commande précédente.
id: Perintah ini akan mencari keterangan daftar perangkat lunak terbaru dari setiap repositori yang diaktifkan pada sistem Anda, termasuk PPA I2P yang telah ditambahkan dengan perintah sebelumnya.
ja: このコマンドは、システムで有効になっている各レポジトリから、その前のコマンドで追加された I2P PPA を含む最新のソフトウェアの一覧を取得します。
pl: Komenda ta pobierze najnowszą listę oprogramowania z każdego repozytorium, które jest aktywne w systemie, łącznie z PPA I2P dodane poprzednim poleceniem.
pt: Esse comando vai ler a última lista de software de cada repositório ativado em seu sistema, incluindo o PPA do I2P que foi adicionado com o comando anterior.
tr: Bu komut, önceki komut ile eklenen I2P PPA paketi de katılacak şekilde sisteminizde etkin olan depolardaki son yazılım listesini alır.

source: You are now ready to install I2P!
de: Du kannst nun I2P installieren!
es_ar: ¡Ahora está listo para instalar I2P!
fr: I2P peut maintenant être installé !
id: Sekarang Anda sudah siap untuk memasang I2P!
ja: I2P をインストールする準備が出来ました！
pl: Teraz jesteś gotowy do instalacji I2P!
pt: Agora está pronto para instalar o I2P!
tr: Artık I2P kurmaya hazırsınız!

source: Adding the PPA Using the Software Center
es_ar: Añadir el PPA mediante el Centro de Software
fr: Ajoute le PPA en utilisant le Centre Logiciel
id: Menambahkan PPA Menggunakan Software Center
ja: ソフトウェアセンターを使いPPAで追加
pt: Adicionando o PPA Usando o Centro de Software
tr: Yazılım merkezini kullanarak PPA ekleme

source: Open "Software and Updates" via the applications menu.
es_ar: Abra "Software y actualizaciones" a través del menú de aplicaciones.
fr: Ouvrez "Logiciel et Mises à jour" par le menu d'application.
id: Buka "Software and Updates" melalui menu aplikasi.
ja: アプリケーションメニューを経由して「ソフトウェアとアップデート」を開きます。
pl: Otwórz "Oprogramowanie i Aktualizacje" przez menu aplikacji.
pt: Abra "Software e Atualizações" pelo menu de aplicações.
tr: Uygulamalar menüsünden "Yazılım ve güncellemeler" üzerine tıklayın.

source: Select the "Other Software" tab and click the "Add" button at the bottom to configure the PPA.
es_ar: Seleccione la pestaña "Otro software" y haga clic en el botón "Añadir" en la parte inferior para configurar el PPA. inferior para configurar el PPA.
fr: Sélectionnez l'onglet "Autre Logiciel" et cliquez sur le bouton "Ajouter" au bas pour configurer le PPA.
id: Pilih tab "Other Software" dan klik tombol "Add" di bawah untuk mengkonfigurasi PPA.
ja: 「他のソフトウェア」タブを選択して、PPA設定の最下部にある「追加」ボタンをクリックします。
pt: Selecione a aba "Outros Softwares" e clique no botão "Adicionar" na parte inferior para configurar o PPA.
tr: "Diğer yazılımlar" sekmesine tıklayın ve PPA yapılandırması için alttaki "Ekle" düğmesine tıklayın.

source: Add the PPA by pasting the URL: <code>ppa:i2p-maintainers/i2p</code> into the PPA dialog.
es_ar: Añade el PPA pegando la URL: <code>ppa:i2p-maintainers/i2p</code> en el diálogo PPA.
fr: Ajouter le PPA en copiant l'URL : <code>ppa:i2p-maintainers/i2p</code> dans le dialogue PPA.
id: Tambahkan PPA dengan memasukkan URL: <code> ppa:i2p-maintainers/i2p</code> ke dalam kolom PPA.
ja: PPAのダイアログ内に URL: <code>ppa:i2p-maintainers/i2p</code> を貼り付けて、PPAに追加してください。
pt: Adicione o PPA colando a URL: <code>ppa:i2p-maintainers/i2p</code> no diálogo do PPA.
tr: PPA eklemek için pencereye şu adresi yapıştırın: <code>ppa:i2p-maintainers/i2p</code>

source: Download the repository information with the "Reload" button.
es_ar: Descargue la información del repositorio con el botón "Recargar".
fr: Téléchargez l'information de dépôt avec le bouton "Actualiser".
id: Unduh informasi repositori dengan menekan tombol "Reload".
ja: 「再読込」ボタンでレポジトリ情報をダウンロードします。
pt: Baixe as informações do repositório com o botão "Recarregar".
tr: "Yeniden yükle" düğmesine tıklayarak depo bilgilerini indirin.

source: Install the I2P software using the "Software" tool from the applications menu.
es_ar: Instale el software I2P mediante la herramienta "Software" del menú menú de aplicaciones.
fr: Installez le logiciel I2P en utilisant l'outil "Logiciel" du menu d'application.
id: Instal perangkat lunak i2p menggunakan tool "Software" dari menu aplikasi.
ja: アプリケーションメニューから「ソフトウェア」ツールを使い、I2Pソフトウェアをインストールします。
pl: Zainstaluj oprogramowanie I2P używając narzędzia "Oprogramowanie" z menu aplikacji.
pt: Instale o software I2P usando a ferramenta "Software" do menu de aplicações.
tr: Uygulamalar menüsündeki "Yazılım" aracını kullanarak I2P yazılımını kurun.

source: After the installation process completes you can move on to the next part of <a href="#Post-install_work">starting I2P</a> and configuring it for your system.
de: Nach dem der Installationsprozess abgeschlossen ist, kannst du zu dem nächsten Teil von <a href="#Post-install_work">starting I2P</a> wechseln und es für dein System konfigurieren.
es_ar: Tras completar el proceso de instalación puede pasar a la siguiente parte de la <a href="#Post-install_work">inicialización de I2P</a>, y configurarlo para su sistema.
fr: Une fois le processus d’installation terminé, vous pouvez procéder au <a href="#Post-install_work">lancement d’I2P</a> et à sa configuration pour votre système.
id: Setelah proses pemasangan selesai Anda dapat melanjutkan ke bagian berikutnya <a href="#Post-install_work">memulai I2P</a> dan mengkonfigurasikannya untuk sistem Anda.
ja: インストールプロセスが完了した後、<a href="#Post-install_work">I2Pを始める</a>の 次のパートに移動して、システムの設定ができます。
pl: Gdy proces instalacji się zakończy, możesz przejść do następnej części <a href="#Post-install_work">uruchamianie I2P</a> i konfigurowanie go w systemie.
pt: Após completar o processo de instalação, você pode passar para a próxima parte da <a href="#Post-install_work">inicialização do I2P</a> e da configuração do I2P em seu sistema.
tr: Kurulum tamamlandığında <a href="#Post-install_work">I2P başlatma</a> adımına geçerek sisteminiz için gerekli ayarları yapabilirsiniz.

source: Instructions for Debian
de: Anleitung für Debian
es_ar: Instrucciones para Debian
fr: Instructions pour Debian
id: Instruksi untuk Debian
ja: Debian 用の説明
pl: Instrukcje dla Debiana
pt: Instruções para Debian
tr: Debian Üzerine Yükleme Yönergeleri

source: Currently supported architectures
de: Derzeit unterstützte Architekturen
es_ar: Arquitecturas actualmente soportadas
fr: Architectures actuellement prises en charge
id: Arsitektur yang didukung saat ini
ja: 現在サポートされているアーキテクチャ
pl: Obecnie wspierane architektury
pt: Arquiteturas atualmente suportadas
tr: Şu anda desteklenen mimariler

source: Note: The steps below should be performed with root access (i.e., switching user to root with <code>su</code> or by prefixing each command with <code>sudo</code>).
de: Hinweis: Die nachfolgenden Schritte sollten mit Root-Rechten ausgeführt werden (z.B. vorher mittels <code>su</code> zum Nutzer "root" wechseln oder jede Befehlszeile mit <code>sudo</code> beginnen).
fr: Note : les étapes ci-dessous devraient être exécutées avec l’accès superutilisateur (c.-à-d. en basculant vers l’utilisateur root avec <code>su</code> ou en précédant chaque commande par <code>sudo</code>).
id: Catatan: Langkah-langkah dibawah ini harus dilaksanakan dengan akses root (misalnya, pengguna beralih ke root dengan <code>su</code> atau dengan mengawali setiap perintah dengan <code>sudo</code>).
ja: 注意: 以下の手順は root アクセスで実行してください (すなわち、 <code>su</code> でユーザを root に切り替えるか、各コマンドの前に <code>sudo</code>を付けてください)。
pl: Uwaga: poniższe czynności powinny zostać uruchomione z uprawnieniami administratora (jednorazowo wpisując komendę <code>su</code> bądź też wpisując przed każdą komendą <code>sudo</code>).
pt: Note: Os passos abaixo devem ser realizados com acesso root (ou seja, mudando de usuário para root com <code>su</code> ou pondo <code>sudo</code> antes de cada comando).
tr: Not: Aşağıdaki adımlar root yetkileri ile yürütülmelidir (kullanıcı yetkilerini <code>su</code> ile yükselterek ya da her komutun başında <code>sudo</code> kullanarak).

source: Ensure that <code>apt-transport-https</code>, <code>curl</code>, <code>lsb-release</code> are installed.
fr: Assurez vous que <code>apt-transport-https</code>, <code>curl</code>, <code>lsb-release</code> sont installés.
id: Pastikan <code> apt-transport-https </code>, <code> curl </code>, <code> lsb-release </code> telah diinstal.
ja: <code>apt-transport-https</code> 、 <code>curl</code> と <code>lsb-release</code> がインストールされた状態であると、確実にしてください。
pt: Certifique-se de que <code>apt-transport-https</code>, <code>curl</code>, e <code>lsb-release</code> estão instalados.
tr: <code>apt-transport-https</code>, <code>curl</code> ve <code>lsb-release</code> kurulu olduğundan emin olun.
