Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: General I2P discussion - anything that doesn't fit in a different list goes here
de: Generelle I2P Diskussionen - Alles was nicht in eine andere Liste passt
es_ar: Discusión general sobre I2P - cualquier cosa que no encaje en el resto de las listas va aquí
fr: Discussions générales sur I2P - tout ce qui n’a pas de place dans une autre liste va ici.
id: Diskusi Umum I2P - apa pun yang tidak cocok dalam daftar
ja: 全般的な I2P の議論 - 他のリストに合わないものはすべてここで
pl: ogólne dyskusje o I2P – wszystko co nie pasuje w innych listach leci tutaj
pt: Discussão geral sobre a I2P - qualquer coisa que não se encaixa em uma lista diferente vem para cá
tr: Genel I2P tartışmaları. Diğer konular dışındaki herşey

source: Team
es_ar: Equipo
fr: Équipe
id: Tim
ja: チーム
pl: Zespół
pt: Equipa
tr: Ekip

source: Admin
es_ar: Administrador
fr: Administrateur
ja: 管理者
pl: Administracja
pt: Administração
tr: Yönetici

source: Project Manager
de: Projektmanager
es_ar: Director del proyecto
fr: Chef de projet
id: Manajer Proyek
ja: プロジェクトマネージャー
pl: Menadżer projektu
pt: Gestor de Projeto
tr: Proje yöneticisi

source: point of contact of last resort
de: Ansprechpartner wenn sonst niemand zuständig ist
es_ar: contacto como último recurso
fr: contact en dernier ressort
id: Cara kontak terakhir jika kontak lain tidak bisa dihubungi
ja: 最終手段の連絡先
pl: cel kontaktu (w przypadku nieuzyskania pomocy gdzie indziej)
pt: ponto de contacto de último recurso
tr: son aşamada görüşülecek kişi

source: Donations treasurer
de: Buchhalter für Spenden
es_ar: Tesorero de donaciones
fr: Trésorier des dons
id: Bendahara Donasi
ja: 寄付会計係
pl: Skarbnik
pt: Tesoureiro de donativos
tr: Bağış saymanı

source: manage donations
de: Spenden verwalten
es_ar: gestionar las donaciones
fr: gérer les dons
id: mengelola sumbangan
ja: 寄付を管理
pl: zarządzanie finansami
pt: gestão de doações
tr: bağış yönetimi

source: PR manager
es_ar: Administrador PR
fr: Responsable des relations publiques
id: Manajer Humas
ja: PRマネージャー
pl: Kierownik ds. relacji publicznych
pt: Gestor de PR
tr: Halkla ilişkiler yöneticisi

source: press contact, manages public relations and affairs
de: Pressekontakt, zuständig für PR und öffentliche Angelegenheiten
es_ar: contacto con la prensa, relaciones públicas y negocios
fr: contact presse, gère les relations publiques et les affaires
id: kontak untuk wartawan, mengelola humas
ja: プレスコンタクト、広報担当
pl: kontakt z prasą, pijar, wydarzenia
pt: contacto de imprensa, gere relações públicas e assuntos
tr: Basın ile ilişkiler, halkla ilişkiler yönetimi

source: Assistant PR manager
de: PR-Assistent
es_ar: Subdirector de relaciones públicas
fr: Assistant du gestionnaire de RP
id: Asisten Manajer Humas
ja: アシスタントPRマネージャー
pl: Pomocnik ds. relacji publicznych
pt: Assistente de gestor de PR
tr: Halkla ilişkiler sekreteri

source: Public speaking, public relations assistance
de: öffentliche Auftritte, Mitarbeit bei der PR
es_ar: Auxiliar de relaciones públicas y portavocía
fr: Prise de parole en public, aide aux relations publiques
id: Membantu manajer humas dalam public speaking
ja: 会見、広報補佐
pl: przemówienia publiczne, pomoc w relacjach publicznych
pt: Porta-voz, assistência com relações públicas
tr: Herkese açık konuşmalar, halkla ilişkiler desteği

source: <a href="http://%(forum)s/">Forum</a> admin
de: <a href="http://%(forum)s/">Forums</a>administrator
es_ar: Administrador del <a href="http://%(forum)s/">Foro</a>
fr: Admin du <a href="http://%(forum)s/">forum</a>
id: <a href="http://%(forum)s/">Forum</a> administrator
ja: <a href="http://%(forum)s/">フォーラム</a>管理人
pl: Administrator <a href="http://%(forum)s/">forum</a>
pt: Administração do <a href="http://%(forum)s/">Fórum</a>
tr: <a href="http://%(forum)s/">Forum</a> yöneticisi

source: manage the public user forum
de: verwaltet das öffentliche Nutzerforum
es_ar: administrador del foro público
fr: gère le forum utilisateurs public
id: mengelola forum pengguna umum
ja: 公開ユーザーフォーラムを管理
pl: zarządzanie forum użytkowników I2P
pt: gere o fórum público do utilizador
tr: herkese açık kullanıcı forumu yönetimi

source: Download mirrors admin
de: Admin der Download-Spiegelserver
es_ar: Administrador (admin) de servidores réplica de descargas
fr: Admin des miroirs de téléchargement
id: Administrator untuk Download Mirror
ja: ダウンロードミラー管理人
pl: Administrator serwerów lustrzanych plików
pt: Administrador dos espelhos de download
tr: İndirme yansıları yöneticisi

source: manage the mirrors for the download files
de: Verwaltung der Spiegel der Download Dateien
es_ar: administra los servidores réplica (mirrors) para los ficheros de descarga
fr: gère les miroirs des fichiers en téléchargement
id: mengelola mirror untuk file download
ja: ダウンロードファイル用ミラーを管理
pl: zarządzanie serwerami lustrzanymi plików
pt: gerencia os espelhos para os arquivos disponibilizados pra download
tr: indirme dosyaları yansıları yönetimi

source: Website mirrors admin
de: Admin der Website-Spiegelserver
es_ar: Administrador (admin) de sitios web réplica
fr: Admin des miroirs de site Web
id: Administrator untuk Website Mirror
ja: ウェブサイトミラー管理者
pl: Administrator serwerów lustrzanych strony
pt: Administrador dos espelhos do website
tr: Site yansıları yöneticisi

source: vacant
de: frei
es_ar: vacante
id: ada lowongan
ja: 空いている
pl: wakat
pt: livre
tr: açık

source: manage the mirrors for the website
de: Manages die Spiegel der Webseite
es_ar: administra los servidores réplica (mirrors) para este sitio web
fr: gère les miroirs du site Web
id: mengelola mirror untuk website
ja: ウェブサイト用ミラーを管理
pl: zarządzanie serwerami lustrzanymi strony internetowej
pt: gerencia os espelhos do website
tr: site yansıları yönetimi

source: <a href="%(monotone)s">Monotone</a> guru
es_ar: Gurú de <a href="%(monotone)s">Monotone</a>
id: Guru <a href="%(monotone)s">monoton</a>
ja: <a href="%(monotone)s">Monotone</a> グル
pl: Administrator <a href="%(monotone)s">Monotone</a>
pt: Guru do <a href="%(monotone)s">Monotone</a>
tr: <a href="%(monotone)s">Monotone</a> gururu

source: manage the public monotone repositories
de: Verwaltet die öffentlichen Monotone Repositories
es_ar: administrador de los repositorios públicos de monotone
fr: gére les référentiels monotones publics
id: mengelola repositori monotone publik
ja: 公開monotoneレポジトリを管理
pl: zarządzanie publicznymi repozytoriami Monotone
pt: gerencia os repositórios públicos do Monotone
tr: herkese açık monotone depoları yönetimi

source: Packager; Linux
de: Paketierer; Linux
es_ar: Empaquetador; Linux
fr: Intégrateur ; Linux
ja: パッケージャー; Linux
pl: Twórca paczek Linux
pt: Empacotador: Linux
tr: Paketleyici; Linux

source: Linux (Debian/Ubuntu) distribution packager
de: Linux (Debian/Ubuntu)-Distributionspaketierer
es_ar: Mantenimiento de paquetes para distribuciones Linux (Debian/Ubuntu)
fr: Intégrateur des versions de Linux (Debian/Ubuntu)
id: Packager untuk distribusi Linux (Debian/Ubuntu)
ja: Linux (Debian/Ubuntu) ディストリビューションパッケージャー
pl: wydawanie paczek dla dystrybucji (Debian/Ubuntu) Linux
pt: empacotador para as distribuições Linux (Debian, Ubuntu)
tr: Linux (Debian/Ubuntu) dağıtımı paketleyici

source: Packager; Windows
de: Paketierer; Windows
es_ar: Empaquetador; Windows
fr: Intégrateur ; Windows
ja: パッケージャー; Windows
pl: Twórca paczek Windows
pt: Empacotador: Windows
tr: Paketleyici; Windows

source: Windows installer packager
de: Windows-Installationsprogrammpaketierer
es_ar: Paquetes instaladores para Windows
fr: Intégrateur du programme d’installation pour Windows
id: Packager untuk Windows installer
ja: Windows インストーラーパッケージャー
pl: wydawanie paczki instalatora dla Windows
pt: empacotador do instalador para Windows
tr: Windows kurucusu paketleyici

source: Packager; OSX
de: Paketierer; OSX
es_ar: Empaquetador; OSX
fr: Intégrateur ; OS X
ja: パッケージャー; OSX
pl: Twórca paczek macOS
pt: Empacotador: OSX
tr: Paketleyici; OSX

source: OSX installer packager
de: Paketierer für OSX Installer
es_ar: Empaquetador de instaladores OSX
fr: Intégrateur du programme d’installation pour OS X
ja: OSX インストーラーパッケージャー
pl: wydawanie paczek instalatora macOS
pt: Empacotador do instalador OSX
tr: OSX kurucusu paketleyici

source: Release Manager
es_ar: Administrador de versiones
fr: Responsable des versions
ja: リリースマネージャー
pl: Menadżer ds. wydań
pt: Gestor de Lançamento
tr: Yayın yöneticisi

source: Builds and signs the releases
de: Baut und signiert die Freigabeversionen
es_ar: Compila y firma los paquetes
fr: Compile et signe les versions
id: Membangun dan menandatangani rilis
ja: リリースをビルドと署名
pl: kompilacja i podpisywanie wydań I2P
pt: Escreve e assina os comunicados de lançamento
tr: Yayınları hazırlama ve imzalama

source: Release Manager Alternates
de: Versionsmanager variiert
es_ar: Sustitutos del administrador de versiones
fr: Suppléants au gestionnaire de sortie
ja: リリースマネージャーの代わり
pl: Zastępcy menadżera ds. wydań
pt: Substitutos do Gerente de Lançamento
tr: Yedek yayın yöneticisi

source: Backup release managers
de: Versionsmanager für Backups
es_ar: Hacer copia de seguridad de los administradores de versiones
fr: Responsables de secours des sorties
ja: リリースマネージャーを補助
pl: zapasowi menadżerzy ds. wydań
pt: Gerentes de lançamento da cópia de recuperação
tr: Yedek yayınlama yöneticileri

source: CI admin
de: CI-Administrator
es_ar: Administrador de CI
fr: Admin CI
ja: Cl 管理人
pl: Administrator ciągłej integracji
pt: Administrador de CI
tr: Sürekli bütünleştirme yöneticisi

source: Maintain the Continuous Integration infrastructure
de: Betreuung der Infrastruktur zur Continuous Integration
es_ar: Mantiene la infraestructura de integración continua (Continuous Integration)
fr: Maintient l’infrastructure d’intégration continue
id: Maintain infrastruktur integrasi berkesinambungan
ja: 継続的インテグレーション基盤整備の維持
pl: zarządzanie infrastrukturą ciągłej integracji (CI)
pt: Mantém a infraestrutura de Integração Contínua
tr: Sürekli bütünleştirme altyapısı bakımı

source: Reseed admin
de: Reseed Administrator
es_ar: Administrador de la resiembra
fr: Administrateur en réensemencement
ja: 再シード管理人
pl: Administrator usług reseed
pt: Gerente de repropagação
tr: Yeniden tohumlama yöneticisi

source: Monitors, advises and recruits reseed hosts
de: Überwacht und rekrutiert Reseed Hosts, und gibt Tips und Hilfe an diese
es_ar: Supervisa, asesora y adquiere hosts de resiembra
fr: Surveille, conseille et recrute les hôtes de réensemencement
id: Monitor, memberikan nasihat dan merekrut reseed host
ja: 再シードの監視、助言、募集
pl: monitoring, kontrola i pozyskiwanie serwerów reseedowania
pt: Supervisiona, aconselha e recruta hospedeiros de repropagação
tr: Yeniden tohumlama sunucularının izlenmesi, önerilmesi ve devreye alınması

source: Security Researcher
de: Sicherheitsforscher
es_ar: Investigador de seguridad
fr: Chercheur de sécurité
id: Peneliti Keamanan
ja: セキュリティ研究者
pl: Ekspert ds. bezpieczeństwa
pt: Investigador de segurança
tr: Güvenlik araştırmacısı

source: threat model / crypto expert
de: Thread-model- und Krypto-Experte
es_ar: modelos de amenazas / experto en cifrados
fr: Modèle de menaces/expert en cryptographie
ja: 脅威モデル/暗号の玄人
pl: ekspert ds. bezpieczeństwa i kryptografii
pt: modelo de risco / perito em criptografia
tr: tehdit modelleme / şifreleme uzmanı

source: Manage the project gitlab
es_ar: Administrar el proyecto gitlab
fr: Gérer le projet gitlab
id: Mengelola proyek gitlab
ja: プロジェクトのgitlabを管理
pl: Zarządzaj projektem gitlab
pt: Gestão do projeto Gitlab
tr: Proje GitLab yönetimi

source: Manage the project bug tracker
de: Verwaltet den Projekt Fehlertracker
es_ar: Administrar el sistema de seguimiento de errores del proyecto
fr: Gérer le système de suivi des bogues
id: Mengelola bug tracker proyek
ja: プロジェクトのバグトラッカーを管理
pl: Administrator systemu śledzenia błędów
pt: gerencia o rastreador de falhas, <i>bug tracker</i>, do projeto
tr: Proje hata izleyici yönetimi

source: Translation admins
de: Übersetzungsadministratoren
es_ar: Admins (administradores) de traducción
fr: Administrateurs de traduction
ja: 翻訳管理者
pl: Koordynatorzy tłumaczeń
pt: Administradores de traduções
tr: Çeviri yöneticileri

source: User Advocate
de: Nutzerfürsprecher
es_ar: Defensor del usuario
fr: Avocat des utilisateurs
ja: ユーザーアドボケイト
pl: Rzecznik użytkowników
pt: Ombudsman do Usuário
tr: Kullanıcı Temsilcisi

source: gather, prioritize, advocate for user needs
de: sammelt, priorisiert und vertritt die Interessen der Nutzer
es_ar: recogida, priorización y enfocado en las necesidades de los usuarios
fr: Rassemble, priorise, défend les besoins exprimés
id: mengumpulkan, memprioritaskan, dan melakukan advokasi untuk kebutuhan pengguna
ja: ユーザーのニーズの集中・優先順位付け・アドボケイト
pl: zbieranie, priorytetyzacja i przedstawianie potrzeb użytkowników
pt: coleta, prioriza e foca nas necessidades dos usuários
tr: kullanıcı gereksinimlerini toplanması, önceliklendirilmesi ve korunması

source: Product Development
de: Produktentwicklung
es_ar: Desarrollo del producto
fr: Développement de produits
id: Pengembangan Produk
ja: 製品開発
pl: Menadżer rozwoju
pt: Desenvolvimento de produto
tr: Ürün Geliştirme

source: supervises projects from the early planning stages to project completion
es_ar: supervisa los proyectos desde las primeras etapas de planificación hasta la finalización del proyecto
fr: superviser des projets des premières étapes de préparation à l'achèvement du projet
id: mengawasi proyek dari tahap perencanaan awal hingga penyelesaian proyek
ja: 早期計画段階からプロジェクト完了までプロジェクトをスーパーバイズ
pl: nadzorowanie projektów od etapu wczesnego planu aż do ukończenia
pt: supervisiona os projetos desde as fases iniciais de planeamento até à sua conclusão
tr: projelerin planlamasından tamamlanmasına yönetimi

source: Website Maintainer
de: Web-Portalbetreuer
es_ar: Mantenedor del sitio web
fr: mainteneur de site web
id: Pengelola Situs Web
ja: ウェブサイト維持者
pl: Administrator strony
pt: Mantenedor do Site
tr: Site yöneticisi

source: manage the public project website content design
de: Verwaltet das Design der öffentlichen Projektwebseite
es_ar: administrar el diseño de la web del proyecto
fr: Gère le design du site Web public du projet
id: mengelola desain konten situs proyek publik
ja: 公開プロジェクトのウェブサイトコンテンツ設計を管理
pl: zarządzanie publiczną stroną internetową projektu: dizajn
pt: Gerencia o web design do site público do projeto
tr: herkese açık proje site sunucuları içerik ve tasarım yönetimi

source: <a href="%(website)s">Webserver</a> admin
de: <a href="%(website)s">Webserver</a>administrator
es_ar: Administración del <a href="%(website)s">Webserver</a>
fr: Admin du <a href="%(website)s">serveur Web</a>
id: Admin <a href="%(website)s">webserver</a>
ja: <a href="%(website)s">ウェブサーバー</a> 管理者
pl: Administrator <a href="%(website)s">serwera strony</a>
pt: Administrador do <a href="%(website)s">servidor da Web</a>
tr: <a href="%(website)s">Site sunucusu</a> yöneticisi

source: manage the public project webservers
de: Verwaltet den öffentlichen Projekt Webserver
es_ar: administrador de los servidores web públicos del proyecto
fr: Gère les serveurs Web publics du projet
id: mengelola webservers proyek publik
ja: 公開プロジェクトのウェブサーバーを管理
pl: administracja publicznymi serwerami stron
pt: gerencia os servidores web do projeto
tr: herkese açık proje site sunucuları yönetimi

source: <a href="%(website)s">Website</a> admin
de: <a href="%(website)s">Webseiten</a>administrator
es_ar: administración de la <a href="%(website)s">Website</a>
fr: Admin du <a href="%(website)s">site Web</a>
id: Admin <a href="%(website)s">situs web</a>
ja: <a href="%(website)s">ウェブサイト</a> 管理者
pl: Administrator <a href="%(website)s">strony</a>
pt: Administrador do <a href="%(website)s">site da Web</a>
tr: <a href="%(website)s">Site sunucusu</a> yöneticisi

source: manage the public project website content
de: Verwaltet den Inhalt der öffentlichen Projektwebseite
es_ar: administrador del contenido del la web del proyecto
fr: Gère le contenu du site Web public du projet
id: mengelola konten situs web proyek publik
ja: 公開プロジェクトのウェブサイトコンテンツを管理
pl: zarządzanie publiczną stroną internetową projektu: treść
pt: gere o conteúdo do site da Web do projeto público
tr: herkese açık proje site sunucuları içerik yönetimi

source: News Admin
de: News Administrator
es_ar: Administrador de noticias
fr: Admin actualités
ja: ニュース管理者
pl: Redaktor biuletynu
pt: Admin de notícias
tr: Haberler yöneticisi

source: manage router console news feed
de: Verwaltetet den Neuigkeiten Feed der Router Konsole
es_ar: administra la suscripción (feed) de noticias de la consola del router I2P
fr: Gérer le fil d’actualités de la console du routeur
id: mengelola news feed di router console
ja: ルーターコンソールのニュースフィードを管理
pl: zarządzanie aktualnościami konsoli węzła
pt: gerencia o feed de notícias do painel do roteador
tr: yöneltici panosu haberlerinin yönetimi

source: Backup News Admin
de: Ersatz News Administrator
es_ar: Administrador de respaldo de noticias
fr: Admin des nouvelles de secours
ja: バックアップニュース管理者
pl: Zastępca redaktora biuletynu
pt: Administração da cópia de segurança de notícias
tr: Yedek haberleri yöneticisi

source: manage the backup news feed
de: Verwaltet den Ersatz Neuigkeiten Feed der Router Konsole
es_ar: administra la suscripción (feed) de respaldo de noticias
fr: gère l’alimentation en nouvelles de secours
id: Mengelola backup news feed
ja: バックアップニュースフィードを管理
pl: zarządzanie zapasowym adresem aktualności konsoli węzła
pt: gerir o feed de cópia de segurança de notícias
tr: yedek haberlerinin yönetimi

source: Design and Usability
es_ar: Diseño y usabilidad
fr: design et convivialité
id: Desain dan Kegunaan
ja: 設計とユーザービリティ
pl: Specjalista ds. dizajnu i użyteczności
pt: Design e usabilidade
tr: Tasarım ve kullanışlılık

source: ongoing improvements to user experience for website and software
es_ar: mejoras continuas de la experiencia del usuario en el sitio web y los programas informáticos
fr: améliorations en cours de l'expérience utilisateur pour le site web et le logiciel
id: Perbaikan berkelanjutan untuk pengalaman pengguna situs web dan perangkat lunak
ja: 進行中のウェブサイトおよびソフトウェアのユーザーエクスペリエンスの改善
pl: ciągłe polepszanie doświadczenia użytkownika oprogramowania i strony internetowej
pt: melhorias contínuas da experiência do utilizador no sítio Web e no software
tr: site ve uygulama için kullanıcı deneyimini iyileştirme çalışmaları

source: Director of passion
de: Direktor of Passion
es_ar: Director de pasión
fr: Directeur de passion
ja: ディレクター・オブ・パッション
pl: Naczelny motywator
pt: Incentivador-chefe
tr: Bağlılık yöneticisi

source: community motivator
de: Motivator der Gemeinschaft
es_ar: Motivador de la comunidad
fr: motivateur de communauté
id: Motivator komunitas
ja: コミュニティモチベーター
pl: motywator społeczności
pt: incentivador da comunidade
tr: topluluk canlandırıcı

source: Dev
de: Entwicklung
es_ar: Desarrolladores
fr: Dév
id: Developer
ja: 開発者
pl: Programiści
pt: Desenvolvedor
tr: Geliştirme

source: Core Lead
de: Kern-Leitentwickler
es_ar: Encargado del núcleo
fr: Meneur principal
ja: 中核指揮
pl: Główny programista
pt: principal responsável pelo software-base
tr: Lider geliştirici

source: lead dev for the SDK and router
de: führender Entwickler für das SDK und den Router
es_ar: encargado del SDK y del router
fr: Dirige le développement du SDK et du routeur
id: memimpin pengembangan SDK dan router
ja: SDKとルーターのための開発者を指揮
pl: główny programista SDK i węzła
pt: desenv-chefe do SDK e do roteador
tr: SDK ve yöneltici lider geliştiricisi

source: <a href="http://%(postman)s/">I2P mail</a> lead
de: <a href="http://%(postman)s/">I2P mail</a> Vorstand
es_ar: Encargado de <a href="http://%(postman)s/">I2P mail</a>
fr: Responsable du <a href="http://%(postman)s/">courriel d’I2P</a>
id: lead <a href="http://%(postman)s/">I2P mail</a>
ja: <a href="http://%(postman)s/">I2P mail</a>指揮
pl: Administrator <a href="http://%(postman)s/">poczty I2P</a>
pt: encarregado pelo <a href="http://%(postman)s/">I2P mail</a>
tr: <a href="http://%(postman)s/">I2P mail</a> lideri

source: organize and develop the i2p mail system
de: organisiert und entwickelt das I2P Mailsystem
es_ar: organiza y desarrolla el sistema de mail de I2P
fr: organiser et développer le système de courriel d’I2P
id: Mengatur dan mengembangkan sistem email i2p
ja: i2pメールシステムの纏めと管理
pl: organizator systemu poczty elektronicznej w sieci I2P
pt: organiza e desenvolve o sistema de email da I2P
tr: I2P e-posta sistemi derleme ve geliştirme

source: <a href="http://%(bote)s/">I2P-Bote</a> lead
de: <a href="http://%(bote)s/">I2P-Bote</a>-Leitentwickler
es_ar: Encargado de <a href="http://%(bote)s/">I2P-Bote</a>
fr: Responsable de <a href="http://%(bote)s/">I2P-Bote</a>
id: lead <a href="http://%(bote)s/">I2P-Bote</a>
ja: <a href="http://%(bote)s/">I2P-Bote</a>指揮
pl: Główny programista <a href="http://%(bote)s/">I2P-Bote</a>
pt: principal responsável pelo <a href="http://%(bote)s/">I2P-Bote</a>
tr: <a href="http://%(bote)s/">I2P-Bote</a> lideri

source: I2P-Bote plugin
es_ar: Complemento de I2P-Bote
fr: Greffon I2P-Bote
id: Plugin I2P-Bote
ja: I2P-Boteプラグイン
pl: wtyczka I2P-Bote
pt: extensão I2P-Bote
tr: I2P-Bote uygulama eki

source: <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a> lead
de: <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a>-Leitentwickler
es_ar: dirección <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a>
fr: Responsable de <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a>
ja: <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a>指揮
pl: Główny programista <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a>
tr: <a href="http://%(forum)s/viewforum.php?f=12">I2PSnark</a> lideri

source: Maintains the integrated Bittorrent client
de: Betreut den integrierten Bittorrent-Client
es_ar: Mantiene el cliente Bittorrent integrado
fr: Maintient le client Bittorrent intégré
id: Mengelola klien Bittorrent terintegrasi
ja: 統合されたビットトレントクライアントを維持
pl: zarządza rozwojem zintegrowanego klienta BitTorrent
pt: Mantém o cliente Bittorrent integrado
tr: Bütünleşik Bittorrent istemcisi geliştirme

source: <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a> lead
de: <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a>-Leitentwickler
fr: Responsable de <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a>
ja: <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a>指揮
pl: Główny programista <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a>
tr: <a href="http://%(forum)s/viewforum.php?f=25">Syndie</a> lideri

source: Syndie development
de: Syndie-Entwicklung
es_ar: Desarrollo de Syndie
fr: Développement Syndie
id: Pengembangan Syndie
ja: Syndie開発
pl: rozwój programu Syndie
pt: Desenvolvimento do Syndie
tr: Syndie geliştirme

source: Susimail lead
de: Susimail-Leitentwickler
es_ar: Encargado de Susimail
fr: Responsable de Susimail
ja: Susimail指揮
pl: Główny programista SusiMail
pt: principal responsável pelo Susimail
tr: Susimail lideri

source: Susimail development
de: Susimail-Entwicklung
es_ar: Desarrollo de Susimail
fr: Développement de Susimail
id: Pengembangan Susimail
ja: Susimail開発
pl: rozwój SusiMail
pt: Desenvolvimento do Susimail
tr: Susimail geliştirme

source: Android lead
de: Android-Leitentwickler
es_ar: Encargado de Android
fr: Responsable Android
ja: Android指揮
pl: Główny programista Android
pt: principal responsável pelo Android
tr: Android lideri

source: Android development
de: Android-Entwicklung
es_ar: Desarrollo de Android
fr: Développement Android
id: Pengembangan Android
ja: Android開発
pl: rozwój aplikacji na Androida
pt: Desenvolvimento do Android
tr: Android geliştirme

source: Console
de: Konsole
es_ar: Consola
ja: コンソール
pl: Programista konsoli
pt: Consola
tr: Pano
