Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Check which version of Debian you are using on this page at the <a href="https://wiki.debian.org/LTS/" target="_blank">Debian wiki</a> and verify with <code>%(file2)s</code> on your system. Then, for Debian Bullseye or newer distributions run the following command to create <code>%(file)s</code>.
fr: Vérifiez quelle version de Debian vous utilisez sur cette page du <a href="https://wiki.debian.org/LTS/" target="_blank">wiki Debian</a> et vérifiez avec <code>%(file2)s</code>sur votre système. Ensuite, pour Debian Bullseye et nouvelles distributions, faites tourner la commande suivante pour créer <code>%(file)s</code>.
id: Periksa versi Debian yang Anda gunakan di halaman ini di <a href="https://wiki.debian.org/lts/" target="_blank"> Debian Wiki </a> dan verifikasi dengan <code>%(file2)s</code> di sistem Anda. Kemudian, untuk Debian Bullseye atau distribusi yang lebih baru menjalankan perintah berikut untuk membuat <code>%(file)s</code>.
ja: <a href="https://wiki.debian.org/LTS/" target="_blank">Debian wiki</a>のこのページ上で、使用するDebianのバージョンを確認して、 あなたのシステム上で <code>%(file2)s</code> を使って間違いがないかを確認してください。 そして、DebianのBullseyeか、これより新しいディストリビューションで、 <code>%(file)s</code> を作成する以下のコマンドを実行してください。
pt: Verifique qual versão do Debian você está usando nesta página na <a href="https://wiki.debian.org/LTS/" target="_blank">wiki do Debian</a> e verifique com <code>%(file2)s</code> no seu sistema. Então, para o Debian Bullseye, ou distribuições mais novas, execute o seguinte comando para criar <code>%(file)s</code>.
tr: <a href="https://wiki.debian.org/LTS/" target="_blank">Debian wiki</a> sayfasına bakarak kullandığınız Debian sürümünü kontrol edin ve sisteminizdeki <code>%(file2)s</code> ile doğrulayın. Ardından Debian Bullseye ya da daha yeni dağıtımlarda aşağıdaki komutu yürüterek <code>%(file)s</code> oluşturun.

source: Download <a href="%(repokey)s">the key used to sign the repository</a>:
de: Den <a href="%(repokey)s">Schlüssel mit dem das Repository signiert wurde</a> herunterladen:
es_ar: Descargue <a href="%(repokey)s">la clave utilizada para firmar el repositorio</a>:
fr: Téléchargez <a href="%(repokey)s">la clé utilisée pour signer le dépôt</a> :
id: Unduh <a href="%(repokey)s">kunci yang digunakan untuk menandatangani repositori</a>:
ja: <a href="%(repokey)s">リポジトリに署名するために使用する鍵</a>をダウンロードします:
pl: Pobierz <a href="%(repokey)s">klucz podpisujący repozytorium</a>:
pt: Baixe <a href="%(repokey)s">a chave usada para assinar o repositório</a>:
tr: <a href="%(repokey)s">Depoyu imzalamak için kullanılan anahtarı</a> indirin:

source: Display the key fingerprint.
fr: Affichez la clé à empreinte numérique.
id: Tampilkan key fingerprint.
ja: 鍵の指紋を表示します。
pt: Exiba a impressão digital da chave.
tr: Anahtar parmak izini görüntüleyin.

source: Verify that this key fingerprint matches the output:
fr: Vérifiez que la clé à empreint numérique corresponde au résultat:
id: Verifikasi bahwa key fingerprint ini cocok dengan output:
ja: 鍵の指紋が出力と一致するかどうか、検証してください:
pt: Verifique que essa impressão digital de chave condiz com a saída:
tr: Bu parmak izinin çıktı ile aynı olduğunu doğrulayın:

source: Copy the keyring to the keyrings directory:
fr: Copiez le trousseau au répertoire de trousseau:
id: Salin keyring ke direktori keyrings:
ja: 鍵束のディレクトリに鍵束をコピーします:
pt: Copie o chaveiro para o diretório de chaveiros:
tr: Anahtarlığı keyrings klasörüne kopyalayın:

source: Notify your package manager of the new repository by entering:
fr: Notifiez votre gestionnaire de paquets du nouveau dépôt en entrant:
id: Beritahukan pengelola paket Anda tentang repositori baru dengan memasukkan:
ja: 入力して、新規レポジトリのパッケージマネージャーを知らせます:
pt: Notifique o seu gerenciador de pacotes sobre o novo repositório inserindo:
tr: Şunu yazarak paket yöneticinize yeni depoyu ekleyin:

source: This command will retrieve the latest list of software from every repository enabled on your system, including the I2P repository added in step 1.
fr: Cette commande récupérera la dernière liste de logiciel de tout les dépôts actifs sur votre système, ce qui inclut le dépôt I2P ajouté à l'étape 1.
id: Perintah ini akan mengambil keterangan daftar perangkat lunak terbaru dari setiap repositori yang diaktifkan pada sistem Anda, termasuk repositori I2P yang ditambahkan pada langkah 1.
ja: このコマンドは、手順1で追加された I2P レポジトリ含む システム上で有効化されている全てのレポジトリから 最新のソフトウェアの一覧を取得します。
pt: Esse comando obterá a lista mais recente de software a partir de cada repositório habilitado no seu sistema, incluindo o repositório da I2P adicionado no passo 1.
tr: Bu komut, 1. adımda eklenmiş olan I2P deposu ile birlikte sisteminizde etkin olan tüm depolardaki güncel yazılım listesini alır.

source: You are now ready to install I2P! Installing the <code>i2p-keyring</code> package will ensure that you receive updates to the repository's GPG key.
fr: Vous êtes désormais prêt à installer I2P ! Installer le paquet <code>trousseau i2p</code> garantira que vous recevrez les mises à jour sur la clé GPG du dépôt.
id: Sekarang Anda sudah siap untuk memasang I2P! Memasang paket <code>i2p-keyring</code> akan memastikan bahwa Anda menerima pembaruan ke repositori kunci GPG.
ja: I2P をインストールする準備が出来ました！ <code>i2p-keyring</code> パッケージをインストールすると、確実にレポジトリの GPG 鍵への更新を受信します。
pt: Você agora está pronto para instalar a I2P! Instalar o pacote <code>i2p-keyring</code> garantirá que você receba atualizações à chave GPG do repositório.
tr: Artık I2P uygulamasını kurabilirsiniz! <code>i2P-keyring</code> paketini yükleyerek deponun GPG anahtarı güncellemelerini alacağınızdan emin olun.

source: After the installation process completes you can move on to the next part of <a href="#Post-install_work">starting I2P</a> and configuring it for your system.
de: Nach der Installation kannst du <a href="#Post-install_work">I2P starten</a> und es passend einrichten.
es_ar: Tras completar el proceso de instalación puede pasar a la siguiente parte de la <a href="#Post-install_work">inicialización de I2P</a>, y configurarlo para su sistema.
fr: Une fois le processus d’installation terminé, vous pouvez procéder au <a href="#Post-install_work">starting I2P</a> et à sa configuration pour votre système.
id: Setelah proses pemasangan selesai Anda dapat melanjutkan ke bagian berikutnya <a href="#Post-install_work">memulai I2P</a> dan mengkonfigurasikannya untuk sistem Anda.
ja: インストールプロセスが完了した後、<a href="#Post-install_work">I2Pを始める</a>の次のパートに移動して、システムの設定ができます。
pl: Gdy zakończy się proces instalacji, możesz przejść do następnej części <a href="#Post-install_work">uruchamiania</a> i konfigurowania I2P dla Twojego systemu.
pt: Após completar o processo de instalação, você pode passar para a próxima parte de <a href="#Post-install_work">inicialização</a> e configuração do I2P em seu sistema.
tr: Kurulum tamamlandığında <a href="#Post-install_work">I2P başlatma</a> adımına geçerek sisteminiz için gerekli ayarları yapabilirsiniz.

source: Post-install work
de: Arbeit nach der Installation
es_ar: Tareas post-instalación
fr: Travail postinstallation
id: Beritahukan pemasangan bekerja
ja: インストール後の作業
pl: Zadania poinstalacyjne
pt: Trabalho de pós-instalação
tr: Kurulum sonrası işlemleri

source: Using these I2P packages the I2P router can be started in the following three ways:
de: Unter Benutzung dieser I2P Pakete kann der I2P Router mit 3 verschiedenen Möglichkeiten gestartet werden:
es_ar: El router I2P se puede iniciar usando estos paquetes I2P de las tres maneras siguientes:
fr: En utilisant ces paquets I2P, le routeur I2P peut être démarré des trois façons suivantes :
id: Menggunakan paket I2P tersebut maka router I2P dapat dimulai dalam tiga cara berikut:
ja: これら I2P のパッケージを使用して、以下の3つのやり方で、I2P ルーターを始めることができます。
pl: Używając tych paczek I2P, węzeł I2P może zostać uruchomiony na trzy następujące sposoby:
pt: Usando estes pacotes do I2P, o roteador I2P pode ser iniciado das seguintes três formas:
tr: Bu I2P paketleri kullanıldığında I2P yönelticisi üç şekilden birinde başlatılabilir:

source: &quot;on demand&quot; using the i2prouter script. Simply run &quot;<code>i2prouter start</code>&quot; from a command prompt. (Note: Do <strong><u>not</u></strong> use sudo or run it as root!)
de: &quot;Bei Bedarf&quot; nutzen Sie das I2Prouter Script. Führen Sie einfach &quot;<code>i2prouter start</code>&quot; in einer Kommandozeile aus. (Hinweis: Nutzen Sie <strong><u>niemals</u></strong> sudo oder als root Benutzer starten)
es_ar: &quot;a petición&quot; usando el script i2prouter. Simplemente ejecute &quot;<code>i2prouter start</code>&quot; en una línea de comandos. (Nota: ¡<strong><u>No</u></strong> utilice sudo ni lo ejecute como root!)
fr: « à la demande » en utilisant le script i2prouter. Simplement exécuter « <code>i2prouter start</code> » dans une invite de commande. (Note : ne <strong><u>pas</u></strong> utiliser sudo ni l’exécuter en tant que root !)
id: &quot;on demand&quot; menggunakan script i2prouter. Jalankan saja &quot;<code>i2prouter start</code>&quot; dari command prompt. (Catatan: <strong><u>JANGAN</u></strong> gunakan sudo ataupun menjalankannya sebagai root!)
ja: &quot;要求に応じて&quot; i2prouter スクリプトを使用してください。コマンドラインから &quot;<code>i2prouter start</code>&quot; を走らせるだけで構いません。 (注: sudoを使用したり、rootで起動するのは<strong><u>やめて</u></strong>ください！)
pl: „na żądanie” korzystając ze skryptu „i2prouter'” – wpisz w terminal:<br> <code>i2prouter start</code><br> (Uwaga: <strong><u>nie</strong></u> używaj sudo ani nie uruchomiaj jako root!)
pt: &quot;sob demanda&quot; usando o script i2prouter. Basta rodar &quot;<code>i2prouter start</code>&quot; de um prompt de comando. (Atenção: <strong><u>Não</u></strong> use sudo nem rode como root!)
tr: &quot;isteğe bağlı&quot; i2prouter betiği kullanılarak. Komut satırından &quot; <code>i2prouter start</code>&quot; yazılması yeterlidir. (Not: sudo ya da root <strong><u>kullanmayın</u></strong>)

source: &quot;on demand&quot; without the <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (needed on non-Linux/non-x86 systems) by running "<code>i2prouter-nowrapper</code>". (Note: Do <strong><u>not</u></strong> use sudo or run it as root!)
de: &quot;Bei Bedarf&quot; ohne den <a href="http://wrapper.tanukisoftware.com/">Java Service Wrapper</a> (immer auf nicht-Linux/nicht-x86 Systemen) durch ausführen von"<code>i2prouter-nowrapper</code>". (Hinweis: Nutzen Sie <strong><u>nicht</u></strong> sudo oder als root starten)
es_ar: &quot;a petición&quot; sin el <a href="http://wrapper.tanukisoftware.com/doc/spanish/">java service wrapper</a> (encapsulador como servicio para java, necesario en sistemas no-Linux/no-x86) ejecutando "<code>i2prouter-nowrapper</code>". (Nota: ¡<strong><u>No</u></strong> utilice sudo ni lo ejecute como root!)
fr: « à la demande » sans l’<a href="http://wrapper.tanukisoftware.com/">enveloppeur de service Java</a> (requis sur les systèmes non Linux ou non x86) en exécutant « <code>i2prouter-nowrapper</code> ». (Note : ne <strong><u>pas</u></strong> utiliser sudo ni l’exécuter en tant que root !)
id: &quot;on demand&quot; tanpa <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a>(diperlukan untuk sistem operasi non-Linux/non-x86) dengan menjalankan "<code>i2prouter-nowrapper</code> (Catatan: <strong><u>Jangan</u></strong> gunakan sudo atau jalankan sebagai root!)
ja: &quot;要求に応じて&quot;"<code>i2prouter-nowrapper</code>"を走らせて、 <a href="http://wrapper.tanukisoftware.com/">java サービスラッパー</a>を無効にしてください(非Linux/非x86システムで必要)。 (注: sudoを使用したり、rootで起動するのは <strong><u>やめて</u></strong>ください！)
pl: „na żądanie” niekorzystając z <a href="http://wrapper.tanukisoftware.com/">wrappera usługi Javy</a> (potrzebne na nie-Linuksowych/nie-x86 systemach) wpisując w terminal:<br> <code>i2prouter-nowrapper</code><br> (Uwaga: <strong><u>nie</u></strong> używaj sudo ani nie uruchamiaj jako root!)
pt: &quot;Sob demanda&quot; sem o <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (necessário em sistemas não-Linux/não-x86) rodando "<code>i2prouter-nowrapper</code>". (Atenção: <strong><u>Não</u></strong> use sudo nem rode como root!)
tr: <a href="http://wrapper.tanukisoftware.com/">Java hizmeti kapsayıcısı</a> olmadan &quot;isteğe bağlı&quot; (Linux/x86 olmayan sistemler için) "<code>i2prouter-nowrapper</code>" çalıştırarak. (Not: sudo ya da root <strong><u>kullanmayın</u></strong>!)

source: as a service that automatically runs when your system boots, even before logging in. The service can be enabled with "<code>dpkg-reconfigure i2p</code>" as root or using sudo. This is the recommended means of operation.
de: als ein Service, der automatisch beim Systemstart startet, auch vor dem Einloggen. Der Service kann mit "<code>dkpg-reconfigure i2p</code>" als root oder mit sudo aufgerufen aktiviert werden. Dieses ist auch die empfohlene Art.
es_ar: como un servicio que se ejecuta automáticamente al arrancar el sistema, incluso antes de abrir sesión de usuario del sistema. Este servicio puede activarse ejecutando "<code>dpkg-reconfigure i2p</code>" como root, o usando sudo. Esta es la forma recomendada de hacerlo.
fr: en tant que service lancé automatiquement lors du démarrage de votre système, avant même d’avoir ouvert une session. Le service peut être activé avec « <code>dpkg-reconfigure i2p</code> » en tant que root ou en utilisant sudo. C’est la méthode recommandée.
id: sebagai service yang otomatis berjalan ketika sistem operasi dihidupkan, bahkan sebelum log in. Layanan ini dapat diaktifkan dengan " <code>dpkg-reconfigure i2p</code> " sebagai root atau menggunakan sudo. Ini adalah cara operasi yang direkomendasikan.
ja: システムをブートした際に、ログインする前の時点で自動的に起動するサービスとして。サービスは ルートとしてまたはsudoを使用して、"<code>dpkg-reconfigure i2p</code>"で有効にできます。
pl: jako usługa, która automatycznie uruchamia się podczas startu systemu, nawet przed zalogowaniem; usługę można aktywować poleceniem:<br> <code>dpkg-reconfigure i2p</code><br> jako root lub używając sudo. To jest zalecany tryb działania.
pt: Como um serviço que automaticamente roda durante o boot, antes mesmo do login. O serviço pode ser ativado com "<code>dpkg-reconfigure i2p</code>" como root ou usando sudo. Este é o modo de operação recomendado.
tr: önerilen çalışma şekli, sistem başlangıcında, oturum açılmadan önce otomatik olarak çalışan bir hizmet olarak. Hizmet sudo ya da root kullanılarak "<code>dpkg-reconfigure i2p</code>" komutuyla etkinleştirilebilir.

source: When installing for the first time, please remember to <b>adjust your NAT/firewall</b> if you can. The ports to forward can be found on the <a href="http://127.0.0.1:7657/confignet"> network configuration page</a> in the router console. If guidance with respect to forwarding ports is needed, you may find <a href="http://portforward.com">portforward.com</a> to be helpful.
de: Bei der ersten Installation bitte daran denken, die <b>NAT/Firewall-Einstellungen</b> wenn möglich anzupassen. Die Ports, die weitergeleitet werden müssen, können auf der <a href="http://127.0.0.1:7657/confignet"> Netzwerk-Konfigurationsseite</a> in der Router-Konsole gefunden werden. Hilfestellung zu Portweiterleitungen wird auf <a href="http://portforward.com">portforward.com</a> gegeben.
es_ar: Si puede, cuando instale por primera vez, recuerde <b>ajustar su NAT/cortafuegos</b>. Los puertos a abrir pueden verse en la<a href="http://127.0.0.1:7657/confignet"> web de configuración de la red</a> en la consola del ruter. Si necesita un guía para abrir sus puertos, la web <a href="http://portforward.com">portforward.com</a> puede serle de utilidad.
fr: Lors d’une première installation, veuillez si vous le pouvez vous rappeler <b>de paramétrer votre traduction d’adresses réseau ou votre pare-feu</b>. Vous trouverez les ports à réacheminer sur la <a href="http://127.0.0.1:7657/confignet">page de configuration du réseau</a> dans la console du routeur. Si vous avez besoin d’aide pour réacheminer des ports, <a href="http://portforward.com">portforward.com</a> pourrait vous être utile.
id: Ketika anda menginstal I2P untuk pertama kalinya, harap ingat untuk <b>menyesuaikan NAT/firewall anda</b> jika anda dapat melakukannya. Semua port yang dapat di-forward dapat dilihat pada <a href="http://127.0.0.1:7657/confignet"> network configuration page</a> di router console. Jika petunjuk untuk port forwarding diperlukan, silakan baca <a href="http://portforward.com">portforward.com</a>.
ja: 初回インストール時に、できれば忘れず<b>NAT/firewallを調整してください</b>。転送ポートは、ルーターコンソールの<a href="http://127.0.0.1:7657/confignet">ネットワーク設定ページe</a>にあります。転送ポートに関するアドバイスが必要であれば、 <a href="http://portforward.com">portforward.com</a> がお役に立つかもしれません。
pl: Podczas pierwszej instalacji, proszę pamiętać aby <b>skonfigurować swój NAT/zaporę sieciową</b> w razie możliwości. Porty które należy przekierować znajdziesz na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji sieci</a> w konsoli węzła. Jeżeli będziesz potrzebował pomocy z przekierowaniem portów, to zajrzyj na stronę <a href="http://portforward.com">portforward.com</a>.
pt: Quando estiveres instalando pela primeira vez, lembra-te de <b>ajustar teu NAT/parede de fogo</b> se puderes. As portas a serem redirecionadas podem ser encontradas na <a href="http://127.0.0.1:7657/confignet">página de configuração da rede</a> no painel do roteador. Se precisares de ajuda para entender como redirecionar portas, talvez <a href="http://portfoward.com">portfoward.com</a> pode ser útil.
tr: İlk kez kurarken, yapabiliyorsanız <b>NAT/Güvenlik Duvarı</b> ayarlarınızı yapmayı unutmayın. İletilecek bağlantı noktalarını yöneltici panosunda <a href="http://127.0.0.1:7657/confignet">ağ yapılandırması bölümünde</a> bulabilirsiniz. Bağlantı noktası yönlendirme hakkında bilgi almak için <a href="http://portforward.com">portforward.com</a> sitesinin yardımı dokunabilir.

source: Please review and <b>adjust the bandwidth settings</b> on the <a href="http://127.0.0.1:7657/config.jsp">configuration page</a>, as the default settings of 96 KB/s down / 40 KB/s up are fairly conservative.
de: Bitte kontrollieren und <b>passen Sie die Bandbreiteneinstellungen</b> auf der <a href="http://127.0.0.1:7657/config.jsp">Einstellungsseite</a> an,⏎ da die Standardeinstellungen von 96 KB/sec Download / 40 KB/sec Upload gering gesetzt sind.
es_ar: Por favor revise y <b>ajuste las configuraciones de ancho de banda</b> en la <a href="http://127.0.0.1:7657/config.jsp">página de configuración</a>, ya que los valores por defecto de 96 KB/s de bajada / 40 KB/s de subida son bastante conservadores.
fr: Veuillez vérifier et <b>ajustez les paramètres de bande passante</b> sur la <a href="http://127.0.0.1:7657/config.jsp">page de configuration</a>, car les paramètres par défaut de 96 ko/s en aval et 40 ko/s en amont sont plutôt conservateurs.
id: Harap meninjau dan <b>menyesuaikan pengaturan bandwidth</b> pada <a href="http://127.0.0.1:7657/config.jsp">halaman konfigurasi</a>, karena pengaturan default 96 KB/s unduh / 40 KB/s unggah adalah cukup konservatif."
ja: <a href="http://127.0.0.1:7657/config.jsp">設定ページ</a>で、 規定の設定である 96KB/s ダウン 40KB/s アップはかなり控えめであるので、 <b>帯域幅設定を確認・調整</b>してください。
pl: Prosimy także o sprawdzenie i <b>dostosowanie ustawień przepustowości</b> na <a href="http://127.0.0.1:7657/config.jsp">stronie konfiguracji</a>, ponieważ domyślne ustawienia 96 KB/s pobierania i 40 KB/s wysyłania są bardzo oszczędne.
pt: Favor revisar e <b>ajustar as configurações de banda</b> na<a href="http://127.0.0.1:7657/config.jsp">página de configuração</a>, tendo em vista que a configuração padrão de 96 KB/s para receber e 40 KB/s para enviar são bem conservadoras.
tr: Lütfen <a href="http://127.0.0.1:7657/config.jsp">yapılandırma bölümündeki</a>, <b>bant genişliği ayarlarını</b> gözden geçirin. Varsayılan ayarlar olan 96 KB/s indirme ve 40 KB/s yükleme değerleri oldukça yavaştır.

source: If you want to reach I2P Sites via your browser, have a look on the <a href="%(browserconfig)s">browser proxy setup</a> page for an easy howto.
fr: Si vous voulez atteindre les sites I2P par votre navigateur, allez voir la page <a href="%(browserconfig)s">mise en place du navigateur mandataire</a> pour une explication simple.
id: Jika anda ingin membuka situs I2P melalui browser anda, lihat halaman <a href="%(browserconfig)s">pengaturan proxy di browser</a> untuk petunjuk cara penggunaan yang mudah.
ja: ブラウザ経由でI2Pサイトに到達したい場合、簡単なやり方は<a href="%(browserconfig)s">ブラウザのプロキシ設定</a>ページで確認可能です。
pl: Jeżeli chcesz surfować po stronach .i2p, to zajrzyj na stronę <a href="%(browserconfig)s">ustawień proxy przeglądarki</a> aby dowiedzieć się co i jak.
pt: Se você quiser acessar Sites I2P através do seu navegador, dê uma olhada na página <a href="%(browserconfig)s">configuração de proxy do navegador</a> para um tutorial fácil.
tr: Tarayıcınız ile I2P sitelerini açmak istiyorsanız, kolay kurulum için <a href="%(browserconfig)s">tarayıcı vekil sunucu kurulumu</a> sayfasına bakabilirsiniz.

source: Installing I2P in Docker
fr: Installer I2P sur Docker
id: Menginstal I2P menggunakan Docker
ja: DockerにI2Pをインストール
pl: Instalacja w kontenerze Docker
pt: Instalando a I2P no Docker
tr: Docker üzerinde I2p kurulumu

source: Very quick start
fr: Démarrage très rapide
id: Cara memulai dengan sangat cepat
ja: 今すぐ始める
pl: Bardzo szybki start
pt: Início muito rápido
tr: Çok hızlı başlangıç

source: If you just want to give I2P a quick try or are using it in a home network, follow these steps
fr: Si vous voulez juste donner à I2P une petite chance ou vous l'utilisez dans un réseau domestique, suivez ces étapes.
id: Jika Anda hanya ingin mencoba I2P dengan cepat atau menggunakannya di jaringan rumah, ikuti langkah-langkah ini
ja: I2Pを簡単に試してみたいか家庭内ネットワークで使ってみたいならば、以下の手順に従ってください
pt: Se você só quer testar a I2P de forma rápida ou está usando-a em uma rede doméstica, siga estes passos
tr: Yalnızca hızlı bir şekilde I2P uygulamasını denemek istiyorsanız, şu adımları izleyin

source: Create two directories "i2pconfig" and "i2ptorrents"
fr: Créez deux répertoires "i2pconfig" et "i2ptorrents"
id: Buat dua direktori "i2pconfig" dan "i2ptorrents"
ja: "i2pconfig"と"i2ptorrents"の2個のディレクトリを作成してください
pt: Crie dois diretórios, "i2pconfig" e "i2ptorrents"
tr: "i2pconfig" ve "i2ptorrents" klasörlerini oluşturun

source: Copy the following text and save it in a file "docker-compose.yml".
fr: Copiez le texte suivant et enregistrez le dans un fichier "docker-compose.yml"
id: Salin teks berikut dan simpan dalam file "docker-compose.yml".
ja: 以下のテキストをコピーして、"docker-compose.yml"ファイルにそれを保存してください。
pt: Copie o texto seguinte e salve em um arquivo "docker-compose.yml"
tr: Aşağıdaki metni kopyalayın ve "docker-compose.yml" dosyasına kaydedin.

source: Execute "docker-compose up"
fr: Exécutez "docker-compose up"
id: Jalankan "docker-compose up"
ja: "docker-compose up"を実行してください。
tr: "docker-compose up" komutunu yürütün

source: Start a browser and go to http://127.0.0.1:7657 to complete the setup wizard.
fr: Démarrez un navigateur et allez à http://127.0.0.1:7657 pour finaliser le sorcier mise en place.
id: Buka browser lalu ketik http://127.0.0.1:7657 untuk menyelesaikan wizard pengaturan.
ja: ブラウザを起動し、セットアップウィザードを完了するために http://127.0.0.1:7657 を開いてください。
pt: Abra um navegador e vá até http://127.0.0.1:7657 para completar o assistente de instalação.
tr: Bir tarayıcı açın ve kurulum yardımcısını tamamlamak için http://127.0.0.1:7657 adresine gidin.
