Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: May be disabled in the <code>clients.config</code> file. May also be configured to be bound to a specific interface or all interfaces in the <code>jetty.xml</code> file.
de: Kann in der Datei <code>clients.config</code> deaktiviert werden. Kann auch zum Binden an ein spezielles, oder alle Interfaces konfiguriert werden in der Datei <code>jetty.xml</code>.
fr: Peut être désactivée dans le fichier <code>clients.config</code>. Peut également être configurée pour être liée à une interface particulière ou à toutes les interfaces dans le fichier <code>jetty.xml</code>.
id: Dapat dinonaktifkan dalam file <code> clients.config </code>. Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface di dalam file <code>jetty.xml</code>.
ja: <code>clients.config</code>ファイルで無効にできる。 また<code>jetty.xml</code>ファイルで、インターフェイスのバインドを特定のものに限るか全てにするか設定可
pl: Może zostać wyłączony w pliku <code>clients.config</code>. Może również zostać przypisany do określonego lub wszystkich interfejsów sieciowych w pliku <code>jetty.xml</code>.
pt: Pode ser desativado no ficheiro <code>clients.config</code>. Também pode ser configurado para ser vinculado a uma interface específica ou a todas as interfaces no ficheiro <code>jetty.xml</code>.
tr: <code>clients.config</code> dosyasından devre dışı bırakılabilir. <code>jetty.xml</code> dosyasından istenilen ya da tüm arayüzlere bağlanacak şekilde ayarlanabilir.

source: May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.
de: Kann auf der I2PTunnel Seite geändert oder deaktiviert werden. Kann auch geändert werden zur Bindung auf einem speziellen Interface oder allen Interfaces.
es_ar: Puede desactivarse o modificarse en la página i2ptunnel de la consola del router. También puede configurarse para que esté vinculado a una interfaz específica o a todas las interfaces.
fr: Peut être désactivée ou changée sur la page d’i2ptunnel de la console du routeur. Peut aussi être configurée pour être liée à une interface particulière ou à toutes les interfaces.
id: Dapat dinonaktifkan atau diubah pada halaman I2PTunnel di router console. Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
ja: ルーターコンソールのi2ptunnelページで無効化/変更可。 またインターフェイスのバインドを特定のものに限るか全てにするか設定可
pl: Może zostać wyłączony lub zmieniony na stronie „zarządzanie ukrytymi usługami” w konsoli węzła. Można również przypiąć do określonego lub wszystkich interfejsów sieciowych.
pt: Pode ser desativado ou alterado na página i2ptunnel da consola do roteador. Pode também ser configurado para estar ligado a uma interface específica ou a todas as interfaces.
tr: Yöneltici panosundaki i2ptunnel bölümünden devre dışı bırakılabilir ya da değiştirilebilir.. Belirli bir arabirime ya da tüm arabirimlere bağlanacak şekilde yapılandırılabilir.

source: Outbound to 32000 only, does not listen on this port. Starts at 31000 and will increment until 31999 looking for a free port. To change, see the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. For more information see <a href="#port32000">below</a>.
de: Ausgehend nur zu Port 32000, lauscht nicht an diesem Port. Startet bei Port 31000 und inkrementiert um 1 bis 31999 auf der Suche nach einem freien Port. Für Änderungen schauen Sie in die <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">Wrapper Dokumentation</a>. Für weitere Informationen, schauen sie weiter <a href="#port32000">unten</a>.
fr: Sortant sur 32000 seulement, n’écoute pas sur ce port. Commence à 31000 et incrémentera jusqu’à 31999 à la recherche d’un port libre. Pour le changer, voir la <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentation de l’enveloppeur</a>. Plus d’informations se trouvent <a href="#port32000">ci-dessous</a>.
id: Outbound ke port 32000 saja, tidak mendengarkan di port ini. Mulai dari port 31000 dan akan bertambah hingga port 31999 untuk mencari port yang tidak digunakan. Untuk mengubahnya, lihat <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html"> dokumentasi wrapper</a>. Untuk informasi lebih lanjut, lihat <a href="#port32000"> di bawah </a>.
ja: 32000番への発信のみ。受け入れは行わない。 31000番から始まり自由なポートを探して31999番まで番号を増やしていく。 変更には<a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">ラッパードキュメント</a>を参照。 詳しい情報は<a href="#port32000">後述</a>
pl: Wychodzący tylko na 32000, nie nasłuchuje na tym porcie. Rozpoczyna od 31000 i kolejno szuka wolnego portu aż do 31999. Aby zmienić, zajrzyj do <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">dokumentacji wrappera</a>. Więcej informacji <a href="#port32000">poniżej</a>.
pt: Saída apenas para 32000, não escuta nesta porta. Começa em 31000 e vai aumentando até 31999 à procura de uma porta livre. Para alterar, consulte a <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentação do wrapper.</a> Para mais informações, consultar <a href="#port32000">abaixo</a>.
tr: Gidiş bağlantısı için yalnızca 32000 kullanılır ve bu bağlantı noktası dinlenmez. 31000 değerinden başlayarak 31999 değerine kadar uygun bir bağlantı noktası arayarak artar. Değiştirmek için <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">kapsayıcı belgelerine</a> bakabilirsiniz. Ayrıntılı bilgi almak için <a href="#port32000">aşağıya bakabilirsiniz</a>.

source: To change, see the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. For more information see <a href="#port32000">below</a>.
de: Siehe <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">Dokumentation des Wrappers</a> wie man das ändert. Weitere Informationen siehe <a href="#port32000">unten</a>.
fr: Pour le changer, voir la <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentation de l’enveloppeur</a>. Plus informations se trouvent <a href="#port32000">ci-dessous</a>.
id: Untuk mengubahnya, lihat <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html"> dokumentasi wrapper</a>. Untuk informasi lebih lanjut, lihat <a href="#port32000"> di bawah </a>.
ja: 変更には<a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">ラッパー文書</a>を参照。 詳しい情報は<a href="#port32000">後述</a>
pl: Aby zmienić, zajrzyj do <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">dokumentacji wrappera</a>. Więcej informacji <a href="#port32000">poniżej</a>.
pt: Para alterar, consulte a <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentação do wrapper</a>. Para mais informações, consultar <a href="#port32000">abaixo</a>.
tr: Değiştirmek için <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">kapsayıcı belgelerine</a> bakabilirsiniz. Ayrıntılı bilgi almak için <a href="#port32000">aşağıya</a> bakabilirsiniz.

source: The local I2P ports and the I2PTunnel ports do not need to be reachable from remote machines, but *should* be reachable locally. You can also create additional ports for I2PTunnel instances via http://localhost:7657/i2ptunnel/ (and in turn, would need to get your firewall to allow you local access, but not remote access, unless desired).
de: Die lokalen I2P Ports und die I2P Tunnel Ports müssen nicht von extern erreichbar sein, *sollten* aber lokal erreichbar sein. Sie können auch weitere Ports für I2P Tunnel Instanzen via http://localhost:7657/i2ptunnel/ erstellen (und damit die Notwendigkeit, diese Ports in der Firewall lokal freizugeben, jedoch nicht von extern, ausser dieses ist so gewünscht).
es_ar: Los puertos locales de I2P y los puertos de I2PTunnel no necesitan ser accesibles desde máquinas remotas, pero *deberían* ser accesibles localmente. Además puede crear también puertos adicionales para instancias I2PTunnel vía http://localhost:7657/i2ptunnel/ (y a su vez, necesitará permitir en su cortafuegos el acceso local, pero no remoto, a no ser que lo desee así).
fr: Les ports locaux d’I2P et les ports d’i2ptunnel n’ont pas besoin d’être accessibles par des machines distantes, mais *devraient* être accessibles localement. Vous pouvez également créer des ports supplémentaires pour les instances d’i2ptunnel sur http://localhost:7657/i2ptunnel/ (et devrez aussi configurer votre pare-feu pour qu’il vous permette l’accès local, mais pas l’accès distant, à moins que vous ne le souhaitiez).
id: Port I2P lokal dan port I2PTunnel tidak perlu dapat dicapai dari remote machine, tetapi *harus* dapat dijangkau oleh komputer anda secara local. Anda juga dapat membuat tambahan port untuk I2PTunnel instances melalui http://localhost:7657/i2ptunnel / (dan pada gilirannya, akan perlu membuat firewall anda untuk memungkinkan anda akses lokal, tetapi menolak akses remote, kecuali jika diinginkan).
ja: ローカルの I2P ポートと I2PTunnel のポートはリモートマシンから到達できるようにする必要はありませんが、ローカルで到達できる*べき*です。 http://localhost:7657/i2ptunnel/ を通じて I2PTunnel のインスタンスへの追加ポートを作成することもできます(同じく、ファイアーウォールにローカルアクセスを許可させる必要はありますが、望まなければリモートアクセスまでは必要ありません)。
pl: Lokalne porty i porty tuneli ukrytych usług I2P nie muszą być osiągalne ze zdalnych maszyn, ale <u>powinny</u> być osiągalne lokalnie. Możesz także potrzebować dodatkowych portów dla utworzonych tuneli ukrytych usług I2P na stronie „<a href="http://localhost:7657/i2ptunnel/">zarządzanie ukrytymi usługami</a> ”(które też wymagałyby lokalnego dostępu, ale nie zdalnego, o ile tego nie potrzebujesz).
pt: As portas locais do I2P e as portas do I2PTunnel não precisam ser alcançáveis por computadores distantes, mas *devem* ser alcançáveis localmente. Também é possível criar novas portas para instâncias do I2PTunnel pelo http://localhost:7657/i2ptunnel/ (Em contrapartida, tua parede de fogo precisaria permitir o acesso local, mas não acesso remoto, a menos se desejado).
tr: Bilgisayarlardaki yerel I2P ve I2pTunnell bağlantı noktalarına uzaktan erişilmesi gerekmez ancak bu bağlantı noktalarına yerel olarak "erişilebilmelidir". Ayrıca http://localhost:7657/i2ptunnel/ ile I2PTunnel kopyaları için ek bağlantı noktaları oluşturabilirsiniz (güvenlik duvarının yerel erişime izin verecek ve gerekmedikçe uzak erişime izin vermeyecek şekilde ayarlanması gerekir).

source: So, to summarize, nothing needs to be reachable by unsolicited remote peers, but if you can configure your NAT/firewall to allow inbound UDP and TCP the <a href="http://localhost:7657/config">outbound facing port</a>, you'll get better performance. You will also need to be able to send outbound UDP packets to arbitrary remote peers (blocking IPs randomly with something like PeerGuardian only hurts you - don't do it).
de: Zusammengefasst muss kein Port von externen Peers erreichbar sein, falls Sie jedoch in ihrer NAT/Firewall eingehende TCP und UDP Verbindungen auf dem <a href="http://localhost:7657/config">externem I2P Port</a> freischalten, bekommen Sie eine bessere Performance. Auch sollten Sie ausgehende UDP Pakete an externe Peers erlauben (das Blockieren von verschiedenen IPs mit Tools wie PeerGuardian schadet ihrer Performance nur - machen Sie dieses nicht).
es_ar: Resumiendo, nada necesita ser accesible por pares remotos que no hayan sido solicitados, pero, si puede configurar su NAT/cortafuegos para permitir conexiones de entrada UDP y TCP hacia los <a href="http://localhost:7657/config">puertos de escucha de salida</a>, tendrá mejor rendimiento. También necesitará ser capaz de enviar paquetes UDP de salida a pares remotos arbitrarios ( bloqueando IPs aleatoriamente con cosas como PeerGuardian solo le perjudica a usted - no lo haga).
fr: Donc, pour résumer, rien n’a besoin d’être accessible par des pairs distants non sollicités, mais si vous pouvez configurer votre traduction d’adresses réseau ou votre pare-feu pour autoriser les UDP et TCP entrants pour le <a href="http://localhost:7657/config">port sortant</a>, vous obtiendrez de meilleures performances. Vous aurez aussi besoin d’être en mesure d’envoyer des paquets UDP sortants à des pairs distants arbitraires (bloquer des IP au hasard avec quelque chose comme PeerGuardian vous pénalise, ne le faites pas).
id: Jad kesimpulannya, tidak ada yang perlu dicapai oleh remote peer yang tidak dikenali, tetapi jika Anda dapat mengkonfigurasi NAT/firewall anda supaya inbound UDP dan TCP <a href="http://localhost:7657/config">outbound facing port </a>, Anda akan mendapatkan kinerja yang lebih baik. Anda juga perlu untuk dapat mengirimkan paket-paket UDP outbound kepada arbitrary remote peers (memblokir IP secara acak dengan aplikasi seperti PeerGuardian hanya menyulitkan anda - jangan melakukan hal ini).
ja: ですので、要約すると、何も要求されていないリモートピアが到達できるようにする必要はありませんが、受信 UDP と TCP 、<a href="http://localhost:7657/config">送信接続ポート</a> を許可するよう NAT/ファイアーウォールを設定できるなら、パフォーマンスが改善します。また、任意のリモートのピアに、送信 UDP パケットを送信できるようにする必要があります (PeerGuardian のようなものでランダムに IP をブロックするのは、害になるだけです ―やらないでくださいね)。
pl: Podsumowując, żadne porty nie muszą być dostępne z zewnątrz, ale jeżeli potrafisz skonfigurować swój NAT/zaporę sieciową, aby przekierować przychodzące połączenia UDP i TCP do <a href="http://localhost:7657/config">portu skonfigurowanego na tej stronie</a>, będziesz się cieszył(a) większą wydajnością. Musisz też zezwolić na wychodzące pakiety UDP do dowolnych zdalnych komputerów (blokowanie losowych IP narzędziami typu PeerGuardian tylko przynosi więcej szkody niż pożytku – nie rób tego).
pt: Então, resumindo, nada precisa ser alcançável por peers remotos não solicitados, mas se você puder configurar seu NAT/firewall para permitir entrada de UDP e TCP, <a href="http://localhost:7657/config">a porta exposta à Internet</a> terá melhor performance. Também será necessário enviar pacotes UDP pela saída para peers remotos indefinidos (bloquear IPs aleatoriamente com algo como PeerGuardian apenas te prejudicará - não faça isso).
tr: Özetle, hiç bir istenmeyen uzak eşin erişimi için bir şey yapılmasına gerek yoktur. Ancak yapabiliyorsanız NAT/Güvenlik Duvar üzerinde geliş UDP ve TCP bağlantısı <a href="http://localhost:7657/config">gidişe dönük bağlantı noktası</a> ayarlarını yaparak daha iyi başarım elde edebilirsiniz. Ayrıca isteğiniz uzak eşlere çıkış UDP paketleri gönderebilirsiniz (PeerGuardian gibi bir uygulama ile IP adreslerini rastgele engellemek yalnızca size zarar verir bunu yapmayın).

source: This question can be answered in 3 parts:
de: Diese Frage kann in drei Teilen beantwortet werden:
es_ar: Esta pregunta puede responderse en 3 partes:
fr: La réponse à cette question comporte trois volets :
id: Pertanyaan ini dapat dijawab dalam 3 bagian:
ja: この質問は3つに分けて回答しましょう：
pl: Odpowiedź na to pytanie składa się z 3 części:
pt: Essa questão pode ser respondida em 3 partes:
tr: Bu soru 3 bölümde yanıtlanabilir:

source: My router often displays a message saying "Website Not Found In Address Book", why do I see this message?
es_ar: Mi router muestra a menudo un mensaje que dice "Website Not Found In Address Book", ¿por qué veo este mensaje?
fr: Mon routeur montre souvent un message disant "Site web non trouvé dans le carnet d'adresse", pourquoi vois-je ce message ?
id: Router saya sering menampilkan pesan yang mengatakan "situs web tidak ditemukan di buku alamat", mengapa saya melihat pesan ini?
ja: 私のルーターではよく「アドレス帳にWebサイトが見つからない」というメッセージが表示されます。なぜでしょうか。
pl: Mój węzeł często wyświetla komunikat „nie znaleziono strony www w książce adresowej”, jaka jest tego przyczyna?
pt: O meu roteador mostra frequentemente uma mensagem a dizer “Website não encontrado no livro de endereços”, porque é que vejo esta mensagem?
tr: Yönelticimde sıklıkla "Site adres defterinde bulunamadı" iletisi görüyorum, neden?

source: Human-readable addresses such as <i>http://website.i2p</i> are references to a long, random string known as a <b>destination</b>. These references are registered and stored at address book services such as stats.i2p, which is run by zzz. You will often encounter a "b32" address. A "b32" is a hash (specifically, a <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a> hash) of the destination. This hash is appended with ".b32.i2p" and serves as a convenient way to link to your hidden service, without requiring any registration on an address book service.
de: Menschenlesbare Adressen wie z.B. <i>http://website.i2p</i> sind nur Referenzen auf lange, zufällige Zeichenfolgen, die als eine <b>Destination</b> bezeichnet wird. Diese Referenzen werden in Adressbuchservices wie z.B. stats.i2p (von zzz betrieben) registriert und gespeichert. Sie werden oft "b32" Adressen begegnen. Eine "b32" ist ein Hash (genauer ein <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a> Hashwert) der Destination. Diesem Hash wird die Endung ".b32.i2p" hinzugefügt und dienen so als bequemer Weg um Ihren Versteckten Service anzubieten, ohne die Notwendigkeit einer Registrierung beim Adressbuchservice.
fr: Les adresses interprétables par l’utilisateur telles que <i>http://website.i2p</i> sont des références à une longue chaîne aléatoire appelée <b>destination</b>. Ces différences sont enregistrées et stockées dans un service de carnet d’adresses tel que stats.i2p, qui est exploité par zzz. Vous rencontrerez souvent une adresse « b32 ». Une « b32 » est un hachage (plus particulièrement un hachage <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a>) de la destination. « .b32.i2p » est ajouté à ce hachage et sert de lien pratique vers votre service caché, sans avoir à vous inscrire à un service de carnet d’adresses.
id: Alamat yang dapat dibaca manusia seperti <i>http://website.i2p</i> adalah referensi ke string acak dan panjang yang dikenal sebagai <b>tujuan</b>. Referensi ini terdaftar dan disimpan di layanan buku alamat seperti stats.I2P, yang dijalankan oleh zzz. Anda akan sering menemukan alamat "b32". "b32" adalah hash (khususnya, hash <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a>) dari destinasi. Hash ini ditambahkan ke ".b32.i2p" dan berfungsi sebagai cara mudah untuk menautkan ke layanan tersembunyi Anda, tanpa memerlukan registrasi apa pun pada layanan buku alamat.
ja: <i>http://website.i2p</i>のような人間が読めるアドレスは、<b>宛先</b>である長いランダム文字列への参照です。 これら参照はアドレス帳サービスに登録され保管されています。例えば zzz が運営している stats.i2p 。 "b32"アドレスというものをよく見るでしょう。"b32" は宛先のハッシュ（特に<a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a>）です。このハッシュに ".b32.i2p" が付けられて、アドレス帳サービスへの登録なしでも、秘匿サービスにリンクする簡便な方法として機能します。
pl: Czytelne dla ludzi adresy, takie jak <i>http://website.i2p</i> są odnośnikami do długich ciągów znaków określanych jako <b>miejsca przeznaczenia</b>. Te odnośniki są rejestrowane i przetrzymywane w usługach książek adresowych takich jak np. stats.i2p (zarządzana przez użytkownika zzz). Często spotkasz się z adresami „b32”. Adres „b32” jest zahaszowanym (dokładnie przez funkcję <a href="https://pl.wikipedia.org/wiki/SHA-2">SHA256</a>) adresem miejsca przeznaczenia. Do tego haszu jest doklejony ciąg „.b32.i2p”, aby utworzyć klikalny odnośnik do ukrytej usługi, który nie wymaga rejestracji w książce adresowej.
pt: Os endereços legíveis por humanos, como <i>http://website.i2p</i>, são referências a uma cadeia longa e aleatória conhecida como <b>destino</b>. Estas referências são registadas e armazenadas em serviços de livros de endereços como o stats.i2P, que é gerido pelo zzz. É frequente encontrar um endereço “b32”. Um “b32” é um hash (especificamente, um hash <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a>) do destino. Este hash é anexado a “.b32.i2P” e serve como uma forma conveniente de ligar ao seu serviço oculto, sem exigir qualquer registo num serviço de livro de endereços.
tr: <i>http://website.i2p</i> gibi insanlar tarafından okunabilecek adresler <b>hedef</b> olarak bilinen uzun, rastgele dizgelerdir. Bu referanslar zzz tarafından işletilen stats.i2p gibi adres defteri hizmetleri tarafından kaydedilen ve saklanan referanslardır. Sıklıkla bir "b32" adresi ile karşılaşırsınız. "b32" hedefin bir karmasıdır (özellikle <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a> karması). Bu karmanın sonuna ".b32.i2p" eklenir ve başka bir kayıt işlemi ya da adres defteri hizmeti kullanılmasına gerek kalmadan gizli hizmetinize erişilmesini sağlar.

source: It is possible to add subscriptions to your router's configuration which may reduce the frequency of these messages.
de: Es ist möglich weitere Abos zur Routerkonfiguration hinzuzufügen, damit werden diese Nachrichten weniger aufscheinen.
fr: Il est possible d’ajouter des abonnements à la configuration de votre routeur, ce qui pourrait réduire la fréquence de ces messages.
id: Dimungkinkan untuk menambahkan langganan ke konfigurasi router Anda yang dapat mengurangi frekuensi pesan-pesan ini.
ja: ルーター設定に購読制の追加が可能です。それは件のメッセージの頻度を抑えるかもしれません。
pl: Można dodać zasubskrybować adresy do książki adresowej Twojego węzła, aby komunikat ten pojawiał się rzadziej.
pt: É possível adicionar subscrições à configuração do seu router, o que pode reduzir a frequência destas mensagens.
tr: Yönelticinizin yapılandırmasına bu iletilerin sıklığını azaltabilecek abonelikler eklenebilir.

source: What is an address book subscription?
fr: Qu'est ce qu'un abonnement au carnet d'adresse ?
id: Apa itu address book subscription?
ja: アドレス帳購読とはどんなものですか？
pl: Czym jest subskrypcja książki adresowej?
pt: O que é uma subscrição de livro de endereços?
tr: Adres defteri aboneliği nedir?

source: This is a list of files hosted on various I2P websites each of which contain a list of I2P hosts and their associated destinations.
de: Dieses ist eine Liste von Dateien, die auf verschiedenen I2P Webseiten angeboten wird. Sie enthalten eine Liste von I2P Services und ihre dazugehörigen Destinationen (I2P Adresse).
fr: C’est une liste de fichiers hébergés sur divers sites Web I2P, chaque fichier contenant une liste d’hôtes I2P ainsi que les destinations qui y sont associées.
id: Ini adalah daftar file yang dihosting di berbagai situs web I2P yang masing-masing berisi daftar host I2P dan tujuan terkaitnya.
ja: 様々なI2Pウェブサイト上にホストされているファイルのリストであり、そのそれぞれがI2Pホストとその接続先のリストを保持しています。
pl: Są to pliki hostowane na różnych witrynach w sieci I2P zawierające listy stron .i2p wraz z odpowiadającymi im przeznaczeniami.
pt: Esta é uma lista de ficheiros alojados em vários sites da I2P, cada um dos quais contém uma lista de anfitriões da I2P e os seus destinos associados.
tr: Bu listede çeşitli I2P sunucularında barındırılan ve içinde I2P sunucularının ve ilgili hedeflerinin kayıtlı olduğu dosyalar bulunur.

source: The address book is located at <a href="http://localhost:7657/dns">http://localhost:7657/dns</a> where further information can be found.
de: Sie finden das Adressbuch unter <a href="http://localhost:7657/dns">http://localhost:7657/dns</a>, dort gibt es auch weitere Informationen.
fr: Le carnet d’adresses est situé sur <a href="http://localhost:7657/dns">http://localhost:7657/dns</a>, où l’on trouvera de plus amples renseignements.
id: Buku alamat ini terletak di <a href="http://localhost:7657/dns">http://localhost:7657/dns</a> di mana informasi lebih lanjut dapat ditemukan.
ja: アドレス帳は<a href="http://localhost:7657/dns">http://localhost:7657/dns</a>にあり、詳しい情報が見られます。
pl: Książka adresowa znajduje się w konsoli węzła pod adresem <a href="http://localhost:7657/dns">http://localhost:7657/dns</a>, gdzie znajdują się dalsze informacje.
pt: O livro de endereços está localizado em <a href="http://localhost:7657/dns">http://localhost:7657/dns</a> onde podem ser encontradas mais informações.
tr: Ayrıntılı bilgi almak için <a href="http://localhost:7657/dns">http://localhost:7657/dns</a> adresindeki adres defterine bakabilirsiniz.
