Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Download the Firefox Profile Bundle from the I2P Web Site.
fr: Téléchargez de Paquet de Profil Firefox du site web I2P.
id: Unduh Paket Profil Firefox dari Situs Web I2P.
ja: FirefoxプロファイルバンドルをI2Pのウェブサイトからダウンロード。
pl: Pobierz „Profil I2P do przeglądarki Firefox” ze strony I2P.
pt: Descarregue o Firefox Profile Bundle a partir do site do I2P.
tr: Firefox Profil Paketini I2P İnternet Sitesinden indirin.

source: Select the language you want to use for the install process.
fr: Sélectionnez la langue que vous voulez utiliser pour le processus d'installation.
id: Pilih bahasa yang ingin Anda gunakan untuk proses instalasi.
ja: インストールプロセス中使用する言語を選択
pl: Wybierz język używany podczas instalacji.
pt: Selecione o idioma que deseja usar para o processo de instalação.
tr: Kurulum sırasında kullanmak istediğiniz dili seçin.

source: The Profile Bundle incorporates lots of external software, so it has a detailed license document. All of the external software is Free and Open Source, with the license included.
fr: Le Paquet Profil contient beaucoup de logiciels externes, il a donc un document de licence détaillé. Tout les logiciels externes sont libre et open source avec les licences incluses.
id: Bundel profil menggabungkan banyak perangkat lunak eksternal, sehingga memiliki dokumen lisensi terperinci . Semua perangkat lunak eksternal berlisensi gratis dan open source, dengan lisensi disertakan di dalam dokumen.
ja: プロファイルバンドルには様々な外部ソフトウェアが組み込まれているため 詳細なライセンス文書が添付されています。すべての外部ソフトウェアはフリーでオープンソースであり、ライセンスが含まれています。
pl: Przeglądarka I2P zawiera mnóstwo zewnętrznego oprogramowania, więc wyświetlana jest szczegółowa licencja. Całe zawarte oprogramowanie jest wolne i otwarte (WiOO).
pt: O pacote de perfis incorpora muito software externo, pelo que tem um documento de licença detalhado detalhada. Todo o software externo é gratuito e de código aberto, com a licença incluída.
tr: Profil paketinde birçok dış yazılım bulunur. Bu nedenle ayrıntılı bir lisans belgesi vardır. Tüm dış yazılımlar, Özgür ve Açık Kaynaklıdır ve lisansları eklenmiştir.

source: You now have a browser ready for I2P!
fr: Vous avez maintenant un navigateur prêt pour I2P !
id: Anda sekarang memiliki browser yang siap untuk I2P!
ja: I2P用のブラウザの準備ができました！
pl: Teraz masz przeglądarkę gotową do przeglądania zasobów sieci I2P!
pt: Você agora tem um navegador pronto I2P!
tr: Artık I2P için bir tarayıcınız var!

source: Part Four: Configure I2P Bandwidth
fr: Partie 4 : Configurer la bande passante I2P
id: Bagian Keempat: Konfigurasi Bandwidth I2P
ja: パート４：I2Pの帯域幅を設定
pl: Krok czwarty: konfiguracja przepustowości I2P
pt: Parte Quatro: Configure a banda larga do I2P
tr: Dördüncü Bölüm: I2P bant genişliğini ayarlama

source: When you visit the I2P router console for the first time, it will automatically direct you to the bandwidth configuration wizard.
fr: Quand vous visitez la console du routeur I2P pour la première fois, il vous dirigera automatiquement vers la configuration de la bande passante.
id: Saat Anda mengunjungi router console I2P untuk pertama kalinya, Anda akan secara otomatis diarahkan ke Wizard Konfigurasi bandwidth.
ja: I2Pのルーターコンソール初めて開く際、自動的に帯域幅設定ウィザード画面が表示されます。
pl: Podczas pierwszego otwarcia strony konsoli węzła, zostaniesz przekierowany/a do kreatora konfiguracji pasma.
pt: Quando visitar a consola do roteador I2P pela primeira vez, será automaticamente direcionado para o assistente de configuração de largura de banda.
tr: I2P yöneltici panosunu ilk kez açtığınızda, otomatik olarak bant genişliği yapılandırma yardımcısına yönlendirilirsiniz.

source: During the bandwidth test, we'll need to connect to the external M-Lab Service, which makes
fr: Pendant le test de la bande passante, nous devons nous connecter au service M-Lab externe, ce qui prendra
id: Selama pengujian bandwidth, kita perlu terhubung ke Layanan M-Lab eksternal, yang menghasilkan
ja: 帯域幅テスト中、外部のM-Labサービスに接続する必要があり、これにより
pl: Podczas testu przepustowości, zostaniesz połączony/a z zewnętrzną stroną M-Lab, która przeprowadzi
pt: Durante o teste de largura de banda, precisaremos nos conectar ao serviço externo do M-Lab, que faz com que
tr: Bant genişliği sınaması sırasında, şu işlemi yapacak dış M-Lab hizmeti ile bağlantı kurulması gerekecek

source: The bandwidth test takes about a minute to run completely.
fr: Le test de bande passante environ une minute pour s'exécuter entièrement.
id: Tes bandwidth sekitar satu menit untuk berjalan sepenuhnya.
ja: 帯域幅テストはすぐに完全に行われます。
pl: Test przepustowości potrwa około minutę.
pt: O teste de largura de banda leva cerca de um minuto para ser executado completamente.
tr: Bant genişliği sınamasının tamamlanması birkaç dakika sürebilir.

source: Here we have an overview of the applications.
fr: Ici nous avons un aperçu des applications.
id: Di sini kita dapat melihat ringkasan tentang aplikasi-aplikasi yang tersedia.
ja: ここにアプリケーションの概要があります。
pl: Tutaj przedstawione jest podsumowanie aplikacji I2P.
pt: Aqui temos uma visão geral das aplicações.
tr: Uygulamalara genel bakış.

source: Now you have your bandwidth configured to efficiently contribute to I2P.
fr: Maintenant vous avez votre bande passante configurée pour contribuer efficacement à I2P.
id: Sekarang bandwidth Anda telah dikonfigurasi untuk berkontribusi secara efisien kepada I2P.
ja: 帯域幅がI2Pに効率的に貢献できるよう構成されました！
pl: Teraz Twoje ustawienia przepustowości są skonfigurowane do wydajnego uczestnictwa w sieci I2P.
pt: Agora tem a sua largura de banda configurada para contribuir eficazmente para o I2P.
tr: Bant genişliğinizi I2P ağına etkili bir katkıda bulunacak şekilde yapılandırdınız.

source: If you want to re-run the welcome wizard after completing it, you can visit the page on
fr: Si vous voulez relancer le sorcier de bienvenu après l'avoir compléter, vous pouvez visiter la page sur
id: Jika Anda ingin menjalankan kembali welcome wizard setelah menyelesaikannya, Anda dapat mengunjungi halaman tersebut pada
ja: 初回設定ウィザードを再度実行する場合、下記ページを開いてください：
pl: Jeżeli chcesz ponownie uruchomić kreator konfiguracji, odwiedź stronę
pt: Se pretender voltar a executar o assistente de boas-vindas depois de o ter concluído, pode visitar a página em
tr: Karşılama yardımcısını tamamladıktan sonra yeniden çalıştırmak isterseniz, şuradaki sayfaya bakabilirsiniz

source: That's it! You're now ready to use I2P. You can browse I2P Sites, download files, host services, e-mail and chat anonymously. Visit the <a href="https://localhost:7657/home">router console homepage</a> to get started.
fr: Et voilà ! Vous êtes désormais prêt à utiliser I2P. Vous pouvez naviguer I2P des sites, télécharger des fichiers, héberger des services, courriels et parler anonymement. Visitez la <a href="https://localhost:7657/home">page d'accueil de la console du routeur</a> pour commencer.
id: Itu saja! Anda sekarang siap menggunakan I2P. Anda dapat menelusuri Situs I2P, mengunduh file, menyediakan layanan, email dan chat secara anonim. Kunjungi <a href="https://localhost:7657/home">beranda router console</a> untuk memulai.
ja: 完了です！I2Pを使用する準備ができました。I2Pサイトを閲覧したり、ファイルをダウンロードしたり、サービスをホストしたり、匿名にメールを送信したりチャットを送ったりすることができます。<a href="https://localhost:7657/home">ルーターコンソールのホームページ</a>を開き、始めましょう。
pl: Gotowe! Teraz jesteś gotowy/a do korzystania z I2P. Możesz przeglądać ukryte strony .i2p, pobierać pliki, zakładać własne usługi, korzystać z poczty elektronicznej i czatów, wszystko anonimowo. Odwiedź <a href="http://localhost:7657/home">stronę startową węzła</a>, aby rozpocząć.
pt: É isso mesmo! Agora está pronto para usar o I2P. Pode navegar nos sites I2P, descarregar ficheiros, alojar serviços, enviar e-mails e conversar anonimamente. Visite a <a href="https://localhost:7657/home">página inicial da consola do roteador</a> para começar.
tr: Bu kadar! Artık I2P kullanmaya hazırsınız. I2P Sitelerine göz atabilir, dosya indirebilir, hizmet sunabilir, e-posta gönderebilir ve anonim olarak sohbet edebilirsiniz. Başlamak için <a href="https://localhost:7657/home">yöneltici panosu sayfasına</a> gidin.

source: Not found
de: Nicht gefunden
es_ar: No encontrado
fr: Introuvable
id: Tidak ditemukan
ja: みつかりません
pl: Nie znaleziono
pt: Não encontrado
tr: Bulunamadı

source: Yep... the resource, you were searching for, is named differently, doesn't exist or was removed.
de: Yep... Die Seite, die Sie gesucht haben, nennt sich anders, existiert nicht oder wurde entfernt.
es_ar: Lo que estaba buscando... se llama de otra forma, no existe o ha sido borrado.
fr: Et oui… Soit la ressource que vous cherchiez porte un autre nom, soit elle n’existe pas, soit elle a été supprimée.
id: Betul... sumber daya yang sedang anda cari dinamai berbeda, tidak ada, atau dihapus.
ja: あなたが探していたリソースは異なる名前であるか、存在しないか、削除されました。
pl: Niestety, ale źródło którego szukasz ma inną nazwę, nie istnieje lub zostało usunięte.
pt: Sim... o recurso que está à procura tem outro nome, não existe ou foi removido.
tr: Evet... Aradığınız kaynak yok, adı değiştirilmiş ya da silinmiş.

source: Server error
de: Server Fehler
es_ar: Error del servidor
fr: Erreur serveur
ja: サーバーエラー
pl: Błąd serwera
pt: Erro do servidor
tr: Sunucu hatası

source: 500 Server error
de: 500 Server Fehler
es_ar: Error 500 del servidor
fr: 500 Erreur serveur
pl: Błąd serwera: 500
pt: 500 - Erro do servidor
tr: 500 Sunucu hatası

source: Umm... the server encountered some sort of error.
de: Upsi! Beim Server ist irgendwas explodiert.
es_ar: Humm... el servidor ha encontrado algún problema.
fr: Hum ! Une erreur de serveur est survenue.
id: Eh... server mengalami sebuah error.
ja: サーバーになんらかのエラーが発生しました。
pl: Hmm… serwer napotkał jakieś problemy.
pt: Hum... o servidor encontrou um tipo de erro.
tr: Sunucuda bir sorun çıktı.

source: Official Forums
es_ar: Foros oficiales
fr: forums officiel
ja: 公式フォーラム
pl: Oficjalne fora
pt: Fóruns oficiais
tr: Resmi Forumlar

source: Contact
de: Kontakt
es_ar: Contacto
id: Kontak kami
ja: 問い合わせ
pl: Kontakt
pt: Contacto
tr: İletişim

source: Impressum
es_ar: Aviso legal
fr: Mentions légales
ja: 奥付(Impressum)
pl: Stopka redakcyjna
tr: İzlenim

source: Documentation
de: Dokumentation
es_ar: Documentación
id: Dokumentasi
ja: 技術文書
pl: Dokumentacja
pt: Documentação
tr: Belgeler

source: Research
de: Forschung
es_ar: Investigación
fr: Recherche
id: Penelitian
ja: 研究
pl: Badania
pt: Investigação
tr: Araştırma

source: Get involved!
de: Mach mit!
es_ar: ¡Implíquese!
fr: Impliquez-vous !
id: Ikut serta!
ja: 参加しよう！
pl: Zaangażuj się!
pt: Participe!
tr: Katkıda bulunmak!

source: FAQ
de: Häufige Fragen
es_ar: PMF
ja: よくある質問
pl: Częste pytania
pt: FAQs
tr: SSS

source: Skip navigation
de: Navigation überspringen
es_ar: Saltar navegación
fr: Ignorer la navigation
id: Lewati navigasi
ja: 案内をスキップ
pl: Pomiń nawigację
pt: Ignorar navegação
tr: Gezinmeyi atla

source: I2P Logo
es_ar: Logo de I2P
fr: Logo d’I2P
id: Logo I2P
ja: I2P ロゴ
pl: Logo I2P
pt: Logótipo do I2P
tr: I2P Logosu

source: The Invisible Internet Project
de: Das Invisible Internet Projekt
es_ar: El Proyecto de Internet Invisible
fr: Le projet de l’Internet invisible
ja: 不可視なインターネットプロジェクト
pl: Projekt Niewidzialny Internet
pt: O Projeto da Internet Invisível
tr: Invisible Internet Project

source: This page was last updated in %(lastupdated)s and is accurate for router version %(accuratefor)s.
de: Diese Seite wurde zuletzt %(lastupdated)s aktualisiert und ist korrekt für Router Version %(accuratefor)s.
es_ar: Esta página fue actualizada por última vez el %(lastupdated)s y es precisa con la versión %(accuratefor)s del router I2P.
fr: La dernière mise à jour de cette page été effectuée en %(lastupdated)s et est exacte pour la version %(accuratefor)s du routeur.
id: Halaman ini terakhir diperbarui pada s%(lastupdated)s dan akurat untuk router versi %(accuratefor)s.
ja: このページは %(lastupdated)s に最終更新され、ルーターバージョン %(accuratefor)s について正確です。
pl: Ostatnia aktualizacja strony: %(lastupdated)s; zawarte informacje dotyczą węzła w wersji %(accuratefor)s.
pt: A última atualização desta página foi em %(lastupdated)s, e é a exata para a versão do roteador %(accuratefor)s.
tr: Bu sayfa son olarak %(lastupdated)s tarihinde güncellendi ve %(accuratefor)s yöneltici sürümü için geçerli.

source: This page was last updated in %(lastupdated)s.
de: Diese Seite wurde zuletzt %(lastupdated)s aktualisiert.
es_ar: Esta página fue actualizada por última vez el %(lastupdated)s.
fr: La dernière mise à jour de cette page été effectuée en %(lastupdated)s.
id: Halaman ini terakhir diperbarui pada s%(lastupdated)s.
ja: このページは %(lastupdated)s に最終更新されました。
pl: Ostatnia aktualizacja strony: %(lastupdated)s.
pt: A última atualização desta página foi em %(lastupdated)s.
tr: Bu sayfa son olarak %(lastupdated)s tarihinde güncellendi.

source: This page is accurate for router version %(accuratefor)s.
de: Diese Seite ist korrekt für Router Version %(accuratefor)s.
es_ar: Esta página es precisa con la versión %(accuratefor)s del router I2P.
fr: Cette page est exacte pour la version %(accuratefor)s du routeur.
id: Halaman ini akurat untuk router versi %(accuratefor)s.
ja: このページはルーターバージョン %(accuratefor)s に正確です。
pl: Informacje zawarte na tej stronie dotyczą wersji węzła %(accuratefor)s.
pt: Esta página é a exata para a versão do roteador %(accuratefor)s.
tr: Bu sayfa %(accuratefor)s yöneltici sürümü için geçerli.

source: Previous
de: vorheriger
es_ar: Anterior
fr: Précédente
id: Sebelumnya
ja: 前へ
pl: Poprzedni
pt: Anterior
tr: Önceki

source: Next
de: nächsten
es_ar: Siguiente
fr: Suivante
id: Berikutnya
ja: 次へ
pl: Następny
pt: Seguinte
tr: Sonraki

source: Posted in
de: Veröffentlicht in
es_ar: Publicado en
fr: Publié dans
id: Diposting di
ja: カテゴリ:
pl: Opublikowany w
pt: Publicado em
tr: Gönderilme

source: About
de: Über
es_ar: Acerca de
fr: À propos
id: Tentang
ja: アバウト
pl: O nas
pt: Sobre
tr: Hakkında

source: Introduction to I2P
de: Einführung zu I2P
es_ar: Introducción a I2P
fr: Présentation d’I2P
id: Pengantar I2P
ja: I2P入門
pl: Wprowadzenie do I2P
pt: Introdução ao I2P
tr: I2P nedir

source: Guide to I2P Software
es_ar: Guía del software I2P
fr: Guide pour le logiciel I2P
id: Panduan untuk Perangkat Lunak I2P
ja: I2P Softwareへのガイド
pl: Opis oprogramowania I2P
pt: Guia do software I2P
tr: I2P uygulama rehberi

source: What is Included
es_ar: Qué esta incluido
fr: Qu'est ce qui est inclut ?
id: Apa yang Diikutsertakan
ja: 何が内蔵されるのか
pl: Co jest zawarte
pt: O que está incluído
tr: İçinde neler var

source: How to browse I2P
de: Wie Sie das I2P Netz durchstöbern
es_ar: Como navegar en I2P
fr: Comment parcourir I2P
id: Cara browsing I2P
ja: I2Pを閲覧するには
pl: Jak przeglądać I2P
pt: Como explorar o I2P
tr: I2P ile internette gezinmek

source: Applications
de: Anwendungen
es_ar: Aplicaciones
id: Aplikasi
ja: アプリケーション
pl: Aplikacje
pt: Aplicações
tr: Uygulamalar

source: Git
tr: Git platformu

source: Help
de: Hilfe
es_ar: Ayuda
fr: Aide
id: Bantuan
ja: ヘルプ
pl: Pomoc
pt: Ajuda
tr: Yardım

source: Glossary
de: Glossar
es_ar: Glosario
fr: Glossaire
id: Glosarium
ja: 用語集
pl: Słowniczek pojęć
pt: Glossário
tr: Terimler

source: Performance
de: Performanz
es_ar: Rendimiento
fr: Performances
id: Kinerja
ja: パフォーマンス
pl: Wydajność
pt: Desempenho
tr: Başarım

source: Comparisons
de: Vergleiche
es_ar: Comparaciones
fr: Comparaisons
id: Perbandingan
ja: 対照
pl: Porównania
pt: Comparações
tr: Karşılaştırmalar

source: Other anonymous networks
de: Andere anonyme Netzwerke
es_ar: Otras redes anónimas
fr: Autres réseaux anonymes
id: Jaringan anonim lain
ja: その他の匿名ネットワーク
pl: Inne sieci anonimowe
pt: Outras redes anónimas
tr: Diğer anonimlik ağları

source: Verify I2P
de: I2P überprüfen
es_ar: Verificar I2P
fr: Confirmer I2P
id: Memverifikasi I2P
ja: I2Pを確認する
pl: Weryfikuj I2P
pt: Verificar o I2P
tr: I2P doğrulamaları

source: Release signing keys
de: Unterschriftschlüssel für die Releases
es_ar: Claves de firmado de versiones
fr: Clés de signature de parution
id: Signing key dari rilis
ja: 署名鍵のリリース
pl: Klucze podpisujące wydań
pt: Lançar chaves de assinatura
tr: Sürüm imzalama anahtarları

source: Signed keys
de: Unterschriebene Schlüssel
es_ar: Claves firmadas de desarrolladores
fr: Clés signées
id: Signed key
ja: 署名された鍵
pl: Podpisane klucze
pt: Chaves assinadas
tr: İmzalanmış anahtarlar

source: Developers keys
de: Die Schlüssel der Entwickler
es_ar: Claves de los desarrolladores
fr: Clés de développeurs
id: Developer key
ja: 開発者の鍵
pl: Klucze programistów
pt: Chaves de programadores
tr: Geliştirici anahtarları

source: Contact us
de: Kontakt
es_ar: Contáctenos
fr: Contactez-nous
id: Hubungi kami
ja: お問い合わせ
pl: Kontakt
pt: Contacte-nos
tr: Bize ulaşın

source: Contributor Guides
es_ar: Guías para colaboradores
fr: Guide des Donateurs
id: Panduan Kontributor
ja: 貢献者の案内
pl: Jak wesprzeć projekt
pt: Guias do colaborador
tr: Katılımcı rehberleri

source: Develop Software
de: Entwickle Software
es_ar: Desarrollar el Software
fr: Développer du logiciel
id: Mengembangkan Perangkat Lunak
ja: 開発ソフトウェア
pl: Programowanie
pt: Desenvolvimento de software
tr: Yazılım geliştirmek

source: New developers
de: Neue Entwickler
es_ar: Nuevos desarrolladores
fr: Nouveaux développeurs
id: Pengembang baru
ja: 新しい開発者
pl: Nowi programiści
pt: Novos programadores
tr: Yeni geliştiriciler

source: Using an IDE with I2P
de: Eine IDE für I2P verwenden
es_ar: Usar un IDE con I2P
fr: Utiliser un environnement de développement intégré avec I2P
id: Menggunakan IDE dengan I2P
ja: I2PでIDEを使用
pl: Używanie IDE z I2P
pt: Utilizando um IDE com o I2P
tr: I2P ile bir IDE kullanmak

source: Developer guidelines and coding style
de: Entwicklungsrichtlinien und Code-Richtlinien
es_ar: Directrices de desarrollo y estilo del código
fr: Directives générales pour développeurs et style de programmation
id: Panduan pengembang dan coding style
ja: 開発者ガイドラインとコーディングスタイル
pl: Wskazówki dla programistów i kultura kodowania
pt: Diretrizes de desenvolvimento e estilo de codificação
tr: Geliştirici rehberleri ve kodlama biçemi

source: Translate I2P into more Languages
es_ar: Traduce I2P a más idiomas
fr: Traduire I2P en plus de langues
id: Menerjemahkan i2p ke dalam lebih banyak bahasa
ja: I2Pを多くの言語に翻訳する
pl: Tłumaczenie
pt: Traduza I2P em mais Idiomas
tr: I2P dil çevirileri

source: Hosting Services
es_ar: Servicios de alojamiento
fr: Héberger des services
id: Menyediakan Layanan
ja: ホスティングサービス
pl: Hostowanie usług
pt: Serviços de alojamento
tr: Barındırma hizmetleri

source: Reseed
es_ar: Resembrar
fr: Réensemencer
ja: 再シード
pt: Ressemear
tr: Yeniden tohumlama

source: Contact and Team
es_ar: Contacto y Equipo
fr: Contact et équipe
id: Kontak dan Tim
ja: 連絡先とチーム
pl: Kontakt i zespół I2P
pt: Contacto e equipa
tr: İletişim ve ekip

source: Community
de: Gemeinschaft
es_ar: Comunidad
fr: Communauté
id: Komunitas
ja: コミュニティー
pl: Społeczność
pt: Comunidade
tr: Topluluk

source: Forums
de: Foren
es_ar: Foros
id: Forum
ja: フォーラム
pl: Forum
pt: Fóruns
tr: Forumlar

source: Academic research
de: Forschung
es_ar: Investigación académica
fr: Recherches universitaires
id: Penelitian akademik
ja: 学術研究
pl: Badania naukowe
pt: Pesquisa Académica
tr: Akademik araştırma

source: Open research questions
de: Offene Forschungsfragen
es_ar: Preguntas de investigación
fr: Questions de recherche
id: Pertanyaan penelitian terbuka
ja: オープンリサーチの質問
pl: Otwarte problemy
pt: Abrir perguntas de pesquisa
tr: Açık araştırma soruları

source: Vulnerability Response Process
de: Sicherheitslücken-Reaktionsteam
es_ar: Proceso de respuesta a la vulnerabilidad (VRP)
fr: Processus de réponse à la vulnérabilité
ja: 脆弱性への対応プロセス
pl: Zgłaszanie podatności
pt: Processo de Resposta de Vulnerabilidade
tr: Güvenlik açığı yanıt süreci

source: Academic papers and peer review
de: Akademische Artikel und Peer Review
es_ar: Documentos académicos y revisión por pares
fr: Documents universitaires et examen par les pairs
id: Makalah akademik dan peer review
ja: 学術論文とピアの精査
pl: Recenzowane prace naukowe
pt: Papéis académicos e revisão de ponto
tr: Akademik makaleler ve akran değerlendirmeleri

source: Presentations, tutorials and articles
de: Präsentationen, Tutorials und Artikel
es_ar: Presentaciones, tutoriales y artículos
fr: Présentations, tutoriels et articles
id: Presentasi, tutorial, dan artikel
ja: プレゼンテーションとチュートリアル、記事
pl: Prezentacje, poradniki i artykuły
pt: Apresentações, tutoriais e artigos
tr: Sunumlar, eğitimler ve makaleler

source: I2P Metrics
es_ar: Métricas de I2P
fr: Mesures d’I2P
id: Metrik I2P
ja: I2P メトリクス
pl: Statystyki I2P
pt: Métricas da I2P
tr: I2P istatistikleri

source: Develop
de: Entwickeln
es_ar: Desarrollo
fr: Développer
id: Mengembangkan
ja: 開発
pl: Dla programistów
pt: Desenvolver
tr: Geliştirme

source: Docs
de: Dokumentationen
es_ar: Documentación
fr: Doc.
id: Dokumen
ja: ドキュメント
pl: Dokumentacja
pt: Documentos
tr: Belgeler

source: Documentation index
de: Inhaltsverzeichnes der Dokumentation
es_ar: Índice de la documentación
fr: Index de la documentation
id: Indeks dokumentasi
ja: 文書目録
pl: Indeks dokumentacji
pt: Índex da Documentação
tr: Belge dizini

source: How does it work?
de: Wie funktioniert es ?
es_ar: ¿Cómo funciona?
fr: Comment cela fonctionne-t-il ?
id: Bagaiman cara kerjanya?
ja: どのように動作するのか？
pl: Jak to działa?
pt: Como é que funciona?
tr: Nasıl çalışır?

source: Gentle intro
de: Gutverständliche Einführung
es_ar: Introducción suave
fr: Présentation douce
id: Intro mudah
ja: やさしい入門
pl: Nietechniczne wprowadzenie
pt: Introdução Simples
tr: Kısa açıklama

source: Tech intro
de: Technische Einführung
es_ar: Introducción técnica
fr: Présentation technique
id: Intro teknis
ja: 技術的入門
pl: Techniczne wprowadzenie
pt: Introdução Técnica
tr: Teknik açıklama

source: Threat model
de: Gefahrenanalyse
es_ar: Modelo de amenazas
fr: Modèle de menace
ja: 脅威モデル
pl: Model zagrożenia
pt: Modelo da ameaça
tr: Tehdit modeli

source: Garlic routing
es_ar: Enrutamiento ajo ('garlic')
fr: Routage en ail
ja: ガーリックルーティング
pl: Trasowanie czosnkowe
pt: Encaminhamento de alho
tr: Garlic yöneltme

source: Network database
de: Netzwerk Datenbank
es_ar: Base de datos de red
fr: Base de données de réseau
id: Database jaringan
ja: ネットワークデータベース
pl: Baza danych sieci
pt: Base de dados da rede
tr: Ağ veri tabanı

source: Tunnel routing
de: Tunnelung
es_ar: Enrutamiento de túneles
fr: Routage par tunnel
ja: トンネルルーティング
pl: Trasowanie tuneli
pt: Encaminhamento de Túnel
tr: Tünel yöneltme

source: Peer selection
de: Teilnehmerauswahl
es_ar: Selección de Par (peer)
fr: Sélection de pairs
id: Pemilihan Peer
ja: ピア選択
pl: Wybór uczestników
pt: Seleção de ponto
tr: Eş seçimi

source: Cryptography
de: Kryptographie
es_ar: Cifrado
fr: Cryptographie
id: Kriptografi
ja: 暗号法
pl: Kryptografia
pt: Criptografia
tr: Şifreleme

source: Specifications
de: Spezifikationen
es_ar: Especificaciones
fr: Spécifications
id: Spesifikasi
ja: 仕様
pl: Specyfikacje
pt: Especificações
tr: Özellikler

source: Proposals
de: Vorschläge
es_ar: Propuestas
fr: Propositions
id: Proposal
ja: 提案
pl: Propozycje
pt: Propostas
tr: Öneriler

source: Streaming library
de: Streaming-Bibliothek
es_ar: Librería de streaming
fr: Bibliothèque « streaming » de diffusion en continu
ja: ストリーミングライブラリ
pl: Biblioteka strumieniowania
pt: Biblioteca de transmissão
tr: Akış kitaplığı

source: Datagrams
de: Datagramme
es_ar: Datagramas
fr: Datagrammes
id: Datagram
ja: データグラム
pl: Datagramy
pt: Datagramas
tr: Veri şemaları

source: Protocols
de: Protokolle
es_ar: Protocolos
fr: Protocoles
id: Protokol
ja: プロトコル
pl: Protokoły
pt: Protocolos
tr: İletişim kuralları

source: Protocol stack
de: Protokollstapel
es_ar: Pila del protocolo
fr: Pile de protocoles
id: Protokol stack
ja: プロトコルスタック
pl: Stos protokołu
pt: Pilha de protocolos
tr: İletişim kuralı yığını

source: Transports
es_ar: Transportes
id: Transport
ja: トランスポート
pl: Transporty
pt: Transportes
tr: Taşıyıcılar
