Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: If you would like more information on the socks proxy application anyway, there are some helpful hints on the <a href="%(socks)s">socks page</a>.
de: Wenn Sie dennoch mehr Informationen zu der SOCKS Proxy Anwendung haben möchten, gibt es einige hilfreiche Tips auf der <a href="%(socks)s">SOCKS Webseite</a>.
es_ar: Si aún así desea mas información sobre el proxy socks, hay algunas sugerencias útiles en la <a href="%(socks)s">web de socks</a>
fr: Si vous souhaitez malgré tout plus d’informations sur l’application de mandataire SOCKS, vous trouverez des conseils utiles sur la <a href="%(socks)s">page de SOCKS</a>.
id: Jika anda ingin informasi lebih lanjut tentang aplikasi proxy SOCKS, ada beberapa petunjuk di <a href="%(socks)s">SOCKS page</a>.
ja: とにかく socks プロキシアプリケーションに関する詳細な情報を求めるのであれば、 <a href="%(socks)s">socks ページ</a>にいくつか役立つヒントがあります。
pl: W każdym bądź razie, jeżeli chcesz więcej informacji o proxy SOCKS, kilka użytecznych wskazówek znajdziesz na <a href="%(socks)s">tej stronie</a>.
pt: Se quiser mais informação sobre a aplicação de proxy socks mesmo assim, há algumas dicas úteis na <a href="%(socks)s">página de socks</a>.
tr: SOCKS vekil sunucu uygulaması ile ilgili ayrıntılı bilgi almak için <a href="%(socks)s">socks sayfasına</a> bakabilirsiniz.

source: Unless an outproxy has been specifically set up for the service you want to connect to, this cannot be done. There are only three types of outproxies running right now: HTTP, HTTPS, and email. Note that there is no SOCKS outproxy. If this type of service is required, we recommend that you use Tor. Please be aware that the Tor project <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">recommends against using BitTorrent over Tor</a>, as there are serious anonymity-related issues associated with doing so.
de: Dieses funktioniert nur mit Services, für die explizit ein Outproxy existiert, sonst nicht. Es existieren zur Zeit 3 Arten von Outproxies: HTTP, HTTPS, und EMail. Beachten Sie, das es kein SOCKS Outproxy gibt. Falls Sie diese Funktionalität benötigen, empfehlen wir die Nutzung von Tor. Bitte beachten Sie, dass das Tor Projekt sich <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">gegen die Nutzung von BitTorent über Tor</a>ausgesprochen hat, da es erhebliche anonymitäts Probleme damit gibt.
fr: À moins qu’un mandataire sortant n’ait spécialement été mis en place pour le service auquel vous voulez vous connecter, ceci ne peut pas être fait. Il n’y a que trois types de mandataires sortants qui fonctionnent actuellement : HTTP, HTTPS et courriel. Notez qu’il n’y a pas de mandataire sortant SOCKS. Si ce type de service est exigé, nous vous recommandons d’utiliser Tor. Sachez que le projet Tor <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">recommande de ne pas utiliser BitTorrent sur Tor</a>, car cela poserait de graves problèmes en matière d’anonymat.
id: Kecuali jika outproxy telah diatur secara khusus untuk layanan yang ingin Anda sambungkan, hal ini tidak dapat dilakukan. Hanya ada tiga jenis outproxies yang sedang berjalan saat ini: HTTP, HTTPS, dan email. Perhatikan bahwa tidak ada outproxy SOCKS. Jika jenis layanan ini diperlukan, kami sarankan Anda menggunakan Tor. Perlu diketahui bahwa proyek Tor <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">merekomendasikan untuk tidak menggunakan bittorrent di atas tor </a>, Karena ada masalah terkait anonimitas yang serius yang terkait dengan melakukannya.
ja: 接続したいサービス用の特別なアウトプロキシが設置されていない限りは、不可能です。 現在アウトプロキシは3つのタイプのみが稼働しています：HTTP、HTTPS、メール。 SOCKS アウトプロキシはないことに注意。このタイプのサービスが必要であれば、Torの使用を推奨します。 Torプロジェクトは<a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">Tor経由でのBitTorrent使用を推奨していません</a>。 その行為に関連して重大な匿名性の問題があるためです。
pl: O ile została założona usługa proxy wyjściowego do usługi z którą się chcesz połączyć, nie jest to możliwe. Obecnie są tylko trzy typy proxy wyjściowego w sieci I2P: HTTP, HTTPS, e-poczta. Nie ma obecnie proxy wyjściowego SOCKS. Jeżeli potrzebujesz z tego typu usługi, zainteresuj się siecią Tor. Proszę mieć na uwadze fakt, że programiści projektu Tor <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">odradzają korzystanie z BitTorrenta poprzez Tor</a> z powodu poważnych problemów z bezpieczeństwem wynikających z takiego postępowania.
pt: A menos que um outproxy tenha sido configurado especificamente para o serviço ao qual se quer ligar, isto não pode ser feito. Existem apenas três tipos de outproxies em execução neste momento: HTTP, HTTPS e e-mail. Observe que não há outproxy SOCKS. Se este tipo de serviço for necessário, recomendamos a utilização do Tor. Tenha em atenção que o projeto Tor <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">recomenda a não utilização do BitTorrent através do Tor</a>, pois há sérios problemas de anonimato associados a isso.
tr: Bağlanmak istediğiniz hizmet için özel bir çıkış vekil sunucusu kurulmamış ise bu işlem yapılamaz. Şu anda çalışan üç tür çıkış vekil sunucusu bulunuyor: HTTP, HTTPS ve e-posta. SOCKS çıkış vekil sunucusu bulunmadığına dikkat edin. Bu tür bir hizmet kullanmanız gerekiyorsa, Tor kullanmanızı öneririz. Lütfen Tor projesinin anonimliği tehlikeye atan sorunlar nedeniyle <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">Tor üzerinden BitTorrent kullanılmamasını önerdiğini</a> unutmayın.

source: Is my router an "exit node" to the regular Internet? I don't want it to be.
de: Ist mein Router ein "Exit Node" ins reguläre Internet? Dieses möchte ich nicht.
es_ar: ¿Es mi router un "nodo de salida" a la Internet regular? No quiero que lo sea.
fr: Mon routeur est-il un « nœud de sortie » vers l’Internet ordinaire ? Je ne veux pas qu’il le soit.
id: Apakah router saya "exit node" ke Internet biasa? Saya tidak ingin hal itu terjadi.
ja: 私のルーターは通常のインターネットへの「出口ノード」ですか？そうしたくありません。
pl: Czy mój węzeł jest „węzłem wyjściowym” do normalnego Internetu? Nie chcę aby nim był.
pt: O meu roteador é um "nodo de saída" para a Internet regular? Eu não quero que este o seja.
tr: Yönelticim normal İnternet için bir "çıkış düğümü" olarak mı kullanılıyor? Bunu istemiyorum.

source: No. Unlike <a href="https://www.torproject.org/">Tor</a>, "exit nodes" - or "outproxies" as they are referred to on the I2P network - are not an inherent part of the network. Only volunteers who specifically set up and run separate applications will relay traffic to the regular Internet. There are very, very few of these. By default, I2P's HTTP Proxy (configured to run on port 4444) includes a single outproxy: false.i2p. This is run on a voluntary basis by Meeh. There is an <a href="%(outproxy)s">outproxy guide</a> available on our forums, if you would like to learn more about running an outproxy.
de: Nein. Im Gegensatz zu <a href="https://www.torproject.org/">Tor</a> sind "Exit Nodes" - oder "Outproxies", wie sie im I2P Netzwerk genannt werden - kein integraler Bestandteils des Netzwerkes. Nur Freiwillige, die dediziert eine seperate Anwendung einrichten und aktiv betreiben, leiten Daten ins reguläre Internet weiter. Es gibt nur sehr, sehr wenige davon. Standardmässig inkludiert I2Ps HTTP Proxy (auf Port 4444 laufend) einen einzigen Outrpoxy: false.i2p. Dieser wird auf einer freiwilligen Basis von Meeh administriert, Es gibt eine <a href="%(outproxy)s">Outproxy Anleitung</a> auf unserem Forum, falls Sie mehr zum Betrieb eines Outproxy wissen möpchten.
fr: Non. Contrairement à <a href="https://www.torproject.org/">Tor</a>, les « nœuds de sortie » ou « mandataires sortants », comme ils sont appelés sur le réseau, ne sont pas partie intégrante du réseau. Seuls les bénévoles qui mettent en place et exécutent des applications séparées relaieront du trafic vers l’Internet ordinaire. Il n’y en a que très, très peu. Par défaut, le mandataire HTTP d’I2P (configuré pour tourner sur le port 4444) inclut un seul mandataire sortant : false.i2p. Il est exploité bénévolement par Meeh. Un <a href="%(outproxy)s">guide sur les mandataires sortants</a> est proposé dans nos forums si vous souhaitez en apprendre davantage sur l’exécution d’un mandataire sortant.
id: Tidak. Berbeda dengan <a href="https://www.torproject.org/">Tor</a>, "exit node" - atau "outproxy" sebagaimana disebut di jaringan I2P - bukan merupakan bagian yang melekat pada jaringan. Hanya relawan yang mengatur dan menjalankan aplikasi terpisah akan me-relay lalu lintas Internet biasa. Jumlahnya sangat, sangat sedikit. Secara default, Proxy HTTP I2P (dikonfigurasi untuk berjalan pada port 4444) menyertakan satu outproxy: false.i2p. Ini dijalankan atas dasar sukarela oleh Meeh. Ada <a href="%(outproxy)s"> panduan outproxy </a> Tersedia di forum kami, jika Anda ingin mempelajari lebih lanjut tentang menjalankan outproxy.
ja: いいえ。<a href="https://www.torproject.org/">Tor</a>と違い、「出口ノード」 - I2Pネットワークでは「アウトプロキシ」と呼ばれる - はI2Pネットワークの基本的部位というわけではありません。 トラフィックを通常のインターネットへ中継するのは、特別に別アプリを設定し実行した有志のみです。 こういったノードは極めて少数です。 デフォルトで、I2PのHTTPプロキシ（4444番ポートで動作）はfalse.i2pという単一のアウトプロキシを持ちます。これはMeehにより自主的に運用されています。 アウトプロキシ運用についてよく知りたい場合は、フォーラムにある<a href="%(outproxy)s">アウトプロキシガイド</a>が利用可能。
pl: Nie. W przeciwieństwie do sieci <a href="https://www.torproject.org/">Tor</a> „węzły wyjściowe” (a dokładniej „outproxy” w terminologii I2P) nie są niezbędną częścią sieci. Tylko wolontariusze, którzy skonfigurowali specjalne oprogramowanie tworzą bramki do zwykłego internetu. Jest ich dosłownie kilku. Domyślnie proxy wyjściowe HTTP (skonfigurowane na porcie 4444) zawiera tylko jeden taki serwer: false.i2p. Jeżeli ciekawi Cię jak uruchomić własne proxy wyjściowe, na forum I2P znajduje się <a href="%(outproxy)s">poradnik (en)</a>.
pt: Não. Ao contrário do <a href="https://www.torproject.org/">Tor</a>, os “nós de saída” - ou “outproxies”, como são designados na rede I2P - não são uma parte inerente da rede. Apenas os voluntários que configuram e executam especificamente aplicações separadas podem retransmitir o tráfego para a Internet normal. Há muito, muito poucos destes. Por defeito, o Proxy HTTP da I2P (configurado para funcionar na porta 4444) inclui um único outproxy: false.i2p. Este é gerido numa base voluntária por Meeh. Há um <a href="%(outproxy)s">guia outproxy</a> disponível nos nossos fóruns, se quiser aprender mais sobre como executar um outproxy.
tr: Hayır. <a href="https://www.torproject.org/">Tor</a> uygulamasının aksine "çıkış durakları" ya da "çıkış vekil sunucuları" ağın ayrılmaz bir parçası değildir. Yalnızca gönüllülerin kurduğu farklı uygulamalar normal İnternet üzerine trafik aktarır. Bunların sayısı çok azdır. Varsayılan olarak I2P HTTP vekil sunucusu (4444 numaralı bağlantı noktası üzerinde çalışacak şekilde yapılandırılmıştır) tek bir çıkış vekil sunucusu içerir: false.i2p. Bu sunucu Meeh tarafından gönüllü olarak işletilmektedir. Bir çıkış vekil sunucusu işletmekle ilgileniyorsanız forumumuzdaki <a href="%(outproxy)s">çıkış vekil sunucusu rehberi</a> bölümüne bakabilirsiniz.

source: I2P strives to be safe in it's default configuration for all users.
fr: I2P s'efforce à être sécurisé dans sa configuration par défaut pour tout les utilisateurs.
id: I2P berusaha untuk aman dalam konfigurasi defaultnya untuk semua pengguna.
ja: I2Pは、すべてのユーザーにとって、デフォルトの設定で安全であるように努めています。
pl: I2P usiłuje być bezpieczne w domyślnej konfiguracji dla większości użytkowników.
pt: O I2P esforça-se por ser seguro na sua configuração padrão para todos os utilizadores.
tr: I2P, varsayılan yapılandırmasında tüm kullanıcılar için güvenli olmaya çalışır.

source: It may be dangerous to use I2P in what the project calls "Strict Countries" where the law may not be clear on anonymizing software and where risks are judged to be fairly high. Most I2P peers are not in those strict countries and the ones that are, are placed in "Hidden Mode" where they interact with the rest of the network in more limited ways, so that they are less visible to network observers.
fr: Il peut être dangereux d'utiliser I2P dans ce que le projet appelle des "pays stricts" où la loi n'est pas forcément claire sur les lois sur les sites anonymes et les risques sont jugés plus grands. La plupart des pairs I2P ne sont pas dans ces pays stricts et ceux qui y sont sont en "mode caché" où ils interagissent avec le reste du réseau de manière plus limitée pour qu'il soit moins visible pour les observateurs réseaux.
id: Mungkin berbahaya untuk menggunakan I2P di wilayah "Negara Ketat" karena undang-undang mengenai anonimisasi perangkat lunak mungkin tidak jelas dan risikonya dinilai cukup tinggi. Sebagian besar peers I2P tidak berada di negara-negara yang ketat tersebut dan negara-negara yang menerapkannya ditempatkan dalam "Hidden Mode" di mana mereka berinteraksi dengan seluruh jaringan dalam cara yang lebih terbatas, sehingga mereka kurang terlihat oleh pengamat jaringan.
ja: プロジェクトが「厳しい国」と呼ぶ、匿名化ソフトウェアに関する法律が明確でなく、リスクがかなり高いと判断される国では、I2Pを使用するのは危険かもしれません。ほとんどのI2Pピアはそのような厳しい国にはなく、厳しい国にあるピアは、ネットワークの観察者から見えにくくするために、より限定的な方法で他のネットワークと通信する「秘匿モード」に設定されています。
pl: Może być niebezpieczne korzystanie z sieci I2P w tak zwanych „opresyjnych państwach”, gdzie prawo może zabraniać korzystania z oprogramowania anonimizującego. Większość użytkowników I2P nie znajduje się w takich państwach, a węzły użytkowników w opresyjnych państwach przechodzą w „tryb ukryty”, w którym interakcje z resztą sieci są ograniczone, aby byli mniej widoczni dla obserwujących sieć.
pt: Pode ser perigoso utilizar o I2P naquilo a que o projeto chama “Países restritos”, onde a lei pode não ser clara quanto ao software de anonimização e onde os riscos são considerados bastante elevados. A maioria dos I2P não se encontra nesses países estritos e os que se encontram são colocados em “Modo oculto”, onde interagem com o resto da rede de forma mais limitada, de modo a serem menos visíveis para os observadores da rede.
tr: Anonimleştirme uygulamaları konusunda kanunun net olmadığı, risklerin oldukça yüksek olarak değerlendirildiği ve projenin "Kısıtlı Ülkeler" olarak adlandırdığı yerlerde I2P kullanmak tehlikeli olabilir. Çoğu I2P eşi bu kısıtlı ülkelerde değildir. Bu ülkelerde bulunanlar, ağın geri kalanıyla daha sınırlı şekillerde etkileşime girdikleri bir "Gizli Kip" kullanır. Böylece ağı gözleyenlere daha az görünürler.

source: Yes, and this is how a fully distributed peer-to-peer network works. Every node participates in routing packets for others, so your IP address must be known to establish connections.
de: Ja, so funktioniert ein komplett verteiltes Peer-zu-Peer Netzwerk. Jeder Knoten beteiligt sich an der Verteilung von Paketen für andere, damit muss Ihre IP Adresse zum Aufbau von Verbindungen bekannt sein
fr: Oui, et c’est ainsi qu’un réseau pair à pair entièrement distribué fonctionne. Chaque nœud participe à l’acheminement des paquets des autres, et votre adresse IP doit donc être connue pour établir des connexions.
id: Ya, dan inilah cara kerja jaringan peer-to-peer yang terdistribusi sepenuhnya. Setiap node berpartisipasi dalam merutekan paket ke node lain, sehingga alamat IP Anda harus diketahui untuk membuat koneksi.
ja: はい。それが完全分散型P2Pネットワークの動作です。全ての参加ノードは他の参加者へのパケット中継に参加します。従って、接続を確立するためにはあなたのIPが分かっている必要があります。
pl: Tak, w ten sposób działa w pełni rozproszona sieć P2P. Każdy uczestniczy w przesyłaniu pakietów innych użytkowników, więc Twój adres IP musi być znany innym, aby nawiązywać połączenia.
pt: Sim, e é assim que funciona uma rede ponto-a-ponto totalmente distribuída. Cada nó participa no encaminhamento de pacotes para outros, pelo que o seu endereço IP tem de ser conhecido para estabelecer conexões.
tr: Evet, ve bu tamamen dağıtılmış bir eşler arası ağın çalışma şeklidir. Her düğüm diğer düğümlerin paketlerini yönlendirme işlemine katılır. Bu bağlantıların kurulabilmesi için IP adresiniz bilinmelidir.

source: While the fact that your computer runs I2P is public, nobody can see your activities in it. You can't say if a user behind this IP address is sharing files, hosting a website, doing research or just running a node to contribute bandwidth to the project.
de: Während bekannt ist, das Sie I2P auf Ihrem Computer nutzen, kann keiner Ihre Aktivitäten innerhalb von I2P sehen. Es ist unbekannt, ob ein Benutzer hinter einer IP Adresse Dateien austauscht, eine Webseite betreibt, Forschung betreibt oder einfach nur einen Knoten zum teilen von Bandbreite mit dem Netzwerk betreibt.
fr: Bien que le fait qu’I2P tourne sur votre ordinateur soit public, personne ne peut y voir votre activité. Vous ne pouvez pas dire si l’utilisateur qui se trouve derrière une adresse IP donnée partage des fichiers, héberge un site Web, effectue de la recherche ou exploite simplement un nœud pour contribuer à la bande passante du projet.
id: Meskipun faktanya bahwa komputer Anda menjalankan I2P bersifat publik, tidak ada yang dapat melihat aktivitas Anda di dalamnya. Anda tidak dapat mengatakan bahwa pengguna di alamat IP ini berbagi file, menampung situs web, melakukan penelitian atau hanya menjalankan node untuk berkontribusi bandwidth ke proyek.
ja: あなたのコンピュータがI2P稼働中であることが公になっていても、その中であなたが何をやっているかを見ることは誰にもできません。あるIPのユーザがファイル共有をしているのか、Webサイトをホスティングしているのか、調査をしているのか、単に帯域幅提供のために動かしているのかは分かりません。
pl: Pomimo tego, że fakt korzystania przez Ciebie z sieci I2P jest jawny, inni nie mają wglądu co do tego co robisz w sieci I2P. Nie można stwierdzić, czy dany użytkownik sieci I2P dzieli się plikami, hostuje stronę, przegląda, czy tylko pośredniczy w ruchu innych użytkowników.
pt: Embora o facto de o seu computador executar a I2P seja público, ninguém pode ver as suas atividades nele. Não se pode dizer se um utilizador por detrás deste endereço IP está a partilhar ficheiros, a alojar um site, a fazer investigação ou apenas a executar um nó para contribuir com largura de banda para o projeto.
tr: Bilgisayarınızın I2P uygulamasını herkese açık olarak çalıştırsa da, yaptığınız işlemleri kimse göremez. Bu IP adresinin üzerinden bir kullanıcının dosya paylaştığı, site barındırdığı, araştırma yaptığı ya da proje bant genişliğine katkıda bulunmak için bir düğüm işlettiği söylenemez.

source: It can be deduced that somebody is using the I2P network with some reliability, but it is a little difficult to know for sure. The most reliable way to know for sure would be to have a computer with a fairly stable IP address that you suspect is an I2P user, and a bunch of computers you control on different networks all running I2P. When one of them connects to your suspected computer, you will be able to see their I2P router in the netDB. This might take time, and it might never happen. You could also try blocking all obfuscated traffic on a particular network until you're sure every I2P router on that network has lost all of it's peers. At that point, they'll reach out to reseed servers to get more peers, which a network administrator can probably observe.
fr: Il peut être déduit que quelqu'un utilise le réseau I2P avec un certain niveau de fiabilité, mais c'est dur d'être sûr. La manière la plus fiable d'être certain serait d'avoir un ordinateur avec une IP suffisamment stable que vous suspectez d'être un utilisateur I2P et un tas d'ordinateurs que vous contrôlez sur plusieurs réseaux en faisant tous tourner I2P. Quand l'un d'eux se connecte à votre ordinateur suspect, vous pourrez voir leur routeur I2P sur netDB. Cela peut prendre du temps, et peux ne pas arriver du tout. Vous pouvez aussi essayer de bloquer toute la circulation obscurcie sur un réseau particulier jusqu'à ce que vous êtes sûr que tout les routeurs I2P sur ce réseau ont perdu leurs pairs. À ce moment, ils iront réensemencer leurs serveurs pour avoir plus de pairs, ce qu'un administrateur peut probablement voir.
id: Dapat disimpulkan bahwa seseorang menggunakan jaringan I2P dengan keandalan tertentu, namun agak sulit untuk mengetahui secara pasti. Cara paling andal untuk mengetahui secara pasti adalah dengan memiliki komputer dengan alamat IP yang cukup stabil yang Anda curigai adalah pengguna I2P, dan sekelompok komputer yang Anda kendalikan di jaringan berbeda semuanya menjalankan I2P. Ketika salah satu dari mereka terhubung ke komputer yang Anda curigai, Anda akan bisa untuk melihat router I2P mereka di netDB. Ini mungkin memerlukan waktu, dan mungkin tidak akan pernah terjadi. Anda juga dapat mencoba memblokir semua lalu lintas yang obfuscated di jaringan tertentu hingga Anda yakin setiap router I2P di jaringan tersebut telah kehilangan semua peer-nya. Pada saat itu, mereka akan menghubungi reseed server untuk mendapatkan lebih banyak peer, yang mungkin bisa diamati oleh administrator jaringan.
ja: 誰かがI2Pネットワークを利用していることは、ある程度確実に推測できますが、確実に知ることは少し難しいです。 最も確実な方法は、I2Pユーザーと思われる、かなり安定したIPアドレスを持つコンピュータと、異なるネットワーク上であなたがコントロールする、 すべてがI2Pを実行しているコンピュータ群を用意することでしょう。そのうちの1台が疑わしいコンピュータに接続すると、netDBにそのI2Pルーターが 表示されます。これは時間がかかるかもしれませんし、実現しないかもしれません。また、特定のネットワーク上のすべてのI2Pルーターがすべての ピアを失ったことを確認するまで、そのネットワーク上のすべての難読化トラフィックをブロックしてみることもできます。その時点で、より多く のピアを得るために再シードサーバーに手を伸ばすでしょうし、ネットワーク管理者はおそらくそれを観察できるでしょう。
pl: Można z pewnym prawdopodobieństwem wywnioskować czy ktoś korzysta z sieci I2P, ale ciężko być tego pewnym. Najpewniejszym sposobem byłoby znajomość adresu IP (o ile jest stały) komputera podejrzanego, a następnie posiadanie kilku monitorowanych węzłów sieci I2P w różnych sieciach. Kiedy jeden z nich połączy się z podejrzanym komputerem, jego węzeł I2P pojawi się w bazie węzłów. Może to zająć trochę czasu, a może wcale nie nastąpić. Możesz również całkowicie blokować szyfrowany ruch w określonej sieci, aby każdy węzeł I2P z tej sieci stracił wszystkich użytkowników. W tym momencie węzły te połączą się z serwerami reseedowania, co administrator sieci powinien z łatwością zaobserwować.
pt: Pode deduzir-se que alguém está a utilizar a rede I2P com alguma fiabilidade, mas é um pouco difícil ter a certeza. A forma mais fiável de ter a certeza seria ter um computador com um endereço IP bastante estável que se suspeita ser um utilizador I2P, e um grupo de computadores que controla em redes diferentes, todos com I2P. Quando um deles se conecta ao computador suspeito, será possível ver o seu roteador I2P na netDB. Isto pode demorar algum tempo e pode nunca acontecer. Também pode tentar bloquear todo o tráfego ofuscado numa determinada rede até ter a certeza de que todos os roteadores I2P nessa rede perderam todos os seus pares. Nessa altura, eles irão contactar para os servidores de reseed para obter mais pares, o que um administrador de rede pode provavelmente observar.
tr: Bir miktar güvenilirlikle birinin I2P ağını kullandığı sonucuna ulaşılabilir. Ancak kesin olarak bilinmesi biraz zordur. Kesin olarak bilmenin en güvenilir yolu, bir I2P kullanıcısı olduğundan şüphelendiğiniz oldukça kararlı bir IP adresine sahip bir bilgisayara ve farklı ağlarda denetiminiz altında olan ve tümü I2P çalıştıran bir grup bilgisayara sahip olmaktır. Bunlardan biri şüpheli bilgisayara bağlandığında, "Ağ veri tabanı" (NetDB) içinde o I2P yöneltcisini görebilirsiniz. Bu işlem zaman alabilir ve asla gerçekleşmeyebilir. Ayrıca, o ağdaki her I2P yönelticisinin tüm eşlerini kaybettiğinden emin olana kadar, belirli bir ağdaki tüm karmaşık trafiği engellemeyi deneyebilirsiniz. Bu noktada, daha fazla eş elde etmek için, olası bir ağ yöneticisinin gözlemleyebileceği yeniden tohumlama sunucularına ulaşırlar.
