Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Blog Category
de: Blog wurde erstellt
es_ar: Categorías del Blog
fr: Catégorie de blogue
id: Kategori Blog
ja: ブログカテゴリ
pl: Kategoria bloga
pt: Categoria do Blogue
tr: Blog Kategorisi

source: I2P Blog ATOM Feed for Category: %(category)s
de: I2P Blog ATOM Feed für die Kategorie: %(category)s
es_ar: ATOM Feed del Blog de I2P para la Categoría: %(category)s
fr: Fil ATOM du blogue d’I2P pour la catégorie : %(category)s
id: I2P Blog ATOM Feed untuk Kategori: %(category)s
ja: カテゴリ: %(category)s の I2P ブログ ATOM フィード
pl: I2P blog ATOM kanał dla kategorii: %(category)s
pt: Feed ATOM do Blogue do I2P para a Categoria: %(category)s
tr: Kategorinin I2P Blog ATOM Akışı: %(category)s

source: I2P Blog ATOM Feed
de: I2P-Blog als ATOM-Feed
es_ar: ATOM feed del blog de I2P
fr: Fil ATOM du blogue d’I2P
ja: I2P ブログ ATOMフィード
pt: Feed ATOM do Blogue do I2P
tr: I2P Blog ATOM Akışı

source: Posted %(date)s by %(author)s
de: verfasst %(date)s von %(author)s
es_ar: Publicado el %(date)s por %(author)s
fr: Publié le %(date)s par %(author)s
id: Dikirimkan %(date)s oleh %(author)s
ja: 時間: %(date)s 著者: %(author)s
pl: Opublikowane %(date)s przez %(author)s
pt: Publicado em %(date)s por %(author)s
tr: %(date)s tarihinde %(author)s tarafından gönderildi

source: More blog posts&hellip;
de: Mehr Blogartikel&hellip;
es_ar: Mas entradas del blog&hellip;
fr: D’autres billets de blogue&hellip;
id: Lebih banyak kiriman&hellip;
ja: その他のブログ記事&hellip;
pl: Więcej postów…
pt: Mais artigos do blogue&hellip;
tr: Diğer blog yazıları&hellip;

source: Posted:
de: Geschrieben:
es_ar: Publicado:
fr: Publié :
id: Dikirimkan:
ja: 時間:
pl: Opublikowane:
pt: Publicado:
tr: Gönderilme:

source: Author:
de: Autor:
es_ar: Autor:
fr: Auteur :
id: Penulis:
ja: 著者:
pl: Autor:
pt: Autor:
tr: Yazar:

source: Your web browser will need to be configured in order to browse web sites on I2P and to utilize the outproxies available within I2P. Below are walkthroughs for some of the most popular browsers.
es_ar: Su navegador web deberá ser configurado para poder navegar por sitios web en I2P y para utilizar los outproxies disponibles en I2P. A continuación, se presentan guías para algunos de los navegadores más populares.
fr: Votre site web devra être configuré pour naviguer les sites web sur I2P et utiliser les mandataires sortants disponible dans I2P. En dessous ce trouve des procédures pour certains des navigateurs les plus populaires.
id: Browser Anda perlu dikonfigurasi untuk menelusuri situs web di I2P dan memanfaatkan outproxies yang tersedia dalam I2P. Berikut adalah panduan untuk beberapa browser terpopuler.
ja: I2P上でウェブサイトを閲覧し、またI2P内でアウトプロキシを利用するためには、ウェブブラウザを設定する必要があります。下記が主要なブラウザでの設定方法です。
pl: Twoja przeglądarka internetowa będzie musiała zostać skonfigurowana w celu przeglądania stron internetowych w I2P i wykorzystać outproxie dostępne w I2P. Poniżej znajdują się instrukcje dla kilku najpopularniejszych przeglądarek.
pt: O seu navegador da web terá de ser configurado para navegar em sites da web no I2P e para utilizar os proxies de saída disponíveis no I2P. Abaixo estão os passos para alguns dos navegadores mais populares.
tr: Tarayıcınızın I2P üzerindeki siteleri açabilmesi ve I2P içindeki çıkış vekil sunucularını kullanabilmesi için yapılandırılması gerekiyor. Sık kullanılan bazı tarayıcılar için yapılacak işlemleri aşağıda görebilirsiniz.

source: Firefox Profile for Windows
de: Firefox-Profil für Windows
es_ar: Perfil de Firefox para Windows
fr: Profil Firefox pour Windows
id: Profil Firefox untuk Windows
ja: Windows用Firefoxプロファイル
pl: Profil dla Firefoksa pod Windowsem
pt: Perfil do Firefox pré-configurado para o Windows
tr: Windows için Firefox profili

source: If you are using Windows, the recommended way of accessing I2P is using the <a href='%(profile)s'>Firefox profile</a>.
es_ar: Si utiliza Windows, la forma recomendada de acceder a I2P es utilizando el <a href='%(profile)s'>perfil de Firefox</a>.
fr: Si vous utiliser Windows, la manière recommandée d'accéder à I2P est d'utiliser le <a href='%(profile)s'>profil Firefox</a>.
id: Jika Anda menggunakan Windows, cara yang disarankan untuk mengakses I2P menggunakan <a href='%(profile)s'>Firefox profile</a>.
ja: Windowsを使用している場合、I2Pにアクセスする際のおすすめの方法は <a href='%(profile)s'>Firefox profile</a>を利用することです。
pl: Jeśli używasz Windowsa, zalecanym sposobem uzyskania dostępu do I2P jest użycie <a href='%(profile)s'>profilu Firefoxa</a>.
pt: Se estiver a utilizar o Windows, a forma recomendada de aceder ao I2P é utilizando o <a href='%(profile)s'>perfil do Firefox</a>.
tr: Windows kullanıyorsanız I2P erişimi sağlamak için <a href='%(profile)s'>Firefox profilini</a> kullanmanız önerilir.

source: If you do not wish to use that profile or are not on Windows, you need to configure your browser yourself. Read below on how to that.
es_ar: Si no desea utilizar ese perfil o no está en Windows, tiene que configurar su navegador usted mismo. Lea a continuación cómo hacerlo.
fr: Si vous ne souhaiter pas utiliser ce profil ou n'êtes pas sur Windows, vous devrez configurer votre navigateur vous-même. Lisez en dessous pour savoir comment faire.
id: Jika Anda tidak ingin menggunakan profil tersebut atau tidak menggunakan Windows, Anda perlu mengonfigurasi browser Anda sendiri. Baca petunjuk di bawah ini untuk cara melakukannya.
ja: プロファイルを使用したくないか、Windowsでない場合、自分でブラウザの設定を行う必要があります。やり方は下記を参照してください。
pt: Se não pretender utilizar esse perfil ou não estiver no Windows, terá de configurar o seu browser. Leia abaixo como fazer isso.
tr: Bu profili kullanmak istemiyorsanız ya da Windows kullanmıyorsanız, tarayıcınızı aşağıdaki bilgilere göre el ile yapılandırmanız gerekir.

source: How to configure your browser
de: So konfigurieren Sie Ihren Browser
es_ar: Como configurar su navegador
fr: Comment configurer votre navigateur
id: Bagaimana mengkonfigurasikan browser anda
ja: ブラウザの設定方法
pl: Jak skonfigurować przeglądarkę internetową
pt: Como configurar o seu navegador
tr: Tarayıcınızı nasıl yapılandırabilirsiniz

source: Outproxy Terms Of Service
de: Ausgangsproxy-Nutzungsbedingungen
es_ar: Términos de servido del Outproxy
fr: Conditions générales d’utilisation d’Outproxy
id: Ketentuan Layanan Outproxy
ja: アウトプロキシ 利用規約
pl: Warunki korzystania z proxy wyjściowego
pt: Outproxy - Termos do serviço
tr: Çıkış Vekil sunucusu Hizmet Koşulları

source: Extension-based Configuration: I2P in Private Browsing
es_ar: Configuración basada en extensiones: I2P en la navegación privada
fr: Configuration basé sur l'extension : I2P en Navigation Privée
id: Konfigurasi Berbasis Ekstensi: I2P di dalam Private Browsing
ja: 拡張機能を使った設定: I2P in Private Browsing
pt: Configuração baseada em extensão: I2P na navegação privada
tr: Uzantı temelli yapılandırma: Kişisel gizliliği koruyarak gezinmek için I2P

source: A new way of automatically configuring the I2P Browser is currently being tested. It uses the Firefox's "Container Tabs" to build private browsing tools for use with I2P and I2P applications.
es_ar: Actualmente se está probando una nueva forma de configurar automáticamente el navegador I2P. Utiliza las "pestañas contenedoras" de Firefox para construir herramientas de navegación privada para su uso con I2P y aplicaciones I2P.
fr: Un nouveau moyen de configurer automatiquement le navigateur I2P est actuellement en test. Il utilise les "Onglets Conteneur" de Firefox pour construire des outils de navigation privé utilisés dans I2P et les applications I2P.
id: Cara baru untuk mengkonfigurasi Browser I2P secara otomatis, saat ini sedang dalam tahap pengujian. Ini menggunakan "Container Tabs" di Firefox untuk membangun alat penelusuran pribadi untuk digunakan dengan aplikasi I2P dan I2P.
ja: I2Pブラウザーを自動的に設定する新しい方法が現在試験中です。Firefoxの「コンテナタブ」を利用して、I2PやI2Pアプリケーションで使用するプライベートブラウジングツールを構築します。
pt: Está atualmente a ser testada uma nova forma de configurar automaticamente o navegador I2P. Utiliza os "separadores de contentores" do Firefox para criar ferramentas de navegação privada para utilização com aplicações I2P e I2P.
tr: Şu sırada I2P Browser uygulamasını otomatik olarak yapılandırmanın yeni bir yolu deneniyor. Kişisel gizliliği koruyan gezinme araçları oluşturmak için I2P ve I2P uygulamaları ile kullanmak üzere Firefox "Container Tabs" özelliğinden yararlanılıyor.

source: It does pre-configuration of your browser by enabling some of the privacy Browser Settings like ResistFingerprinting, and enforces WebRTC proxy obedience. It also contains menus, shortcuts, and monitoring tools improving Firefox's integration with I2P. It should not substantially interfere with your non-I2P Firefox tabs.
es_ar: Realiza la preconfiguración de tu navegador habilitando algunos de los Ajustes de privacidad del navegador como ResistFingerprinting, e impone la obediencia al proxy WebRTC. También contiene menús, accesos directos y herramientas de supervisión que mejoran la integración de Firefox con I2P. con I2P. No debería interferir sustancialmente con tus pestañas Firefox no I2P.
fr: Il pré-configure votre navigateur en activant des paramètres de confidentialité du navigateur comme ResistFingerprinting et renforce l'obéissance de WebRTC au mandataire. Il contient aussi des menus, des raccourcis, et des outils de surveillances améliorant l'intégration de Firefox avec I2P. Il ne devrait pas substantiellement interférer avec vos onglets Firefox non-I2P.
id: Itu melakukan pra-konfigurasi browser Anda dengan mengaktifkan beberapa Pengaturan Browser privasi seperti ResistFingerprinting, dan menerapkan kepatuhan proxy WebRTC. Ini juga berisi menu, shorcut, dan alat pemantauan yang meningkatkan integrasi Firefox dengan I2P. Ini seharusnya tidak terlalu mengganggu tab Firefox non-I2P Anda.
ja: ResistFingerprintingのようないくつかのプライバシーブラウザ設定を有効にすることで、ブラウザの事前設定を行い、WebRTCプロキシの利用を強制します。FirefoxのI2Pとの統合を改善するメニュー、ショートカット、監視 ツールなども含みます。I2Pブラウザープロジェクトの副産物です。基本的に、非I2PのFirefoxのタブに干渉することはないはずです。
pt: Efetua a pré-configuração do seu navegador, ativando algumas das definições de privacidade do navegador, como o ResistFingerprinting, e impõe a obediência ao proxy WebRTC. Também contém menus, atalhos e ferramentas de monitorização que melhoram a integração do Firefox do Firefox com o I2P. Não deve interferir substancialmente com os separadores do Firefox que não sejam I2P.
tr: ResistFingerprinting gibi bazı kişisel gizlilik tarayıcı ayarlarını etkinleştirerek ön yapılandırmayı hazırlar ve WebRTC vekil sunucusuna uyulmaya zorlar. Ayrıca Firefox ile I2P bütünleştirmesini sağlayan menüler, kısayollar ve izleme araçlarını içerir. I2P Browser projesinin bir yan ürünüdür.

source: The extension, <a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P in Private Browsing</a>, can be obtained from the Mozilla addon store.
es_ar: La extensión, <a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P in Private Browsing</a>, puede obtenerse en la tienda de complementos de Mozilla.
fr: L'extension <a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P en Navigation Privée</a> peut être obtenue dans le marché add-on Mozilla.
id: Ekstensi, <a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P di Private Browsing</a>, dapat diperoleh dari Mozilla addon store.
ja: 拡張機能<a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P in Private Browsing</a>は、Mozilla拡張機能ストアから取得できます。
pl: Rozszerzenie <a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P in Private Browsing</a>, można pobrać ze sklepu z dodatkami Mozilli.
pt: A extensão, <a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P em navegação privada</a>, pode ser obtida da loja de extensões da Mozilla.
tr: <a href="https://addons.mozilla.org/en-US/firefox/addon/i2p-in-private-browsing/">I2P in Private Browsing</a> eklentisi, Mozilla eklenti mağazasından alınabilir.

source: The source code for the extension is available at <a href="https://i2pgit.org/idk/I2P-in-Private-Browsing-Mode-Firefox">i2pgit.org</a>.
es_ar: El código fuente de la extensión está disponible en <a href="https://i2pgit.org/idk/I2P-in-Private-Browsing-Mode-Firefox">i2pgit.org</a>.
fr: Le code source pour l'extension est disponible sur <a href="https://i2pgit.org/idk/I2P-in-Private-Browsing-Mode-Firefox">i2pgit.org</a>.
id: Source code untuk ekstensi ini tersedia di <a href="https://i2pgit.org/idk/I2P-in-Private-Browsing-Mode-Firefox">i2pgit.org</a>.
ja: 拡張機能のソースコードは <a href="https://i2pgit.org/idk/I2P-in-Private-Browsing-Mode-Firefox">i2pgit.org</a> で入手可能です。
pt: O código-fonte da extensão está disponível em <a href="https://i2pgit.org/idk/I2P-in-Private-Browsing-Mode-Firefox">i2pgit.org</a>.
tr: Uzantının kaynak kodunu <a href="https://i2pgit.org/idk/I2P-in-Private-Browsing-Mode-Firefox">i2pgit.org</a> adresinde bulabilirsiniz.

source: Instructions for Firefox 57 and above:
de: Anleitung für Firefox ab Version 57.
es_ar: Instrucciones para Firefox 57 y superiores:
fr: Instructions pour Firefox 57 et versions ultérieures :
id: Instruksi untuk Firefox 57 atau lebih baru:
ja: Firefox 57 以降の場合の説明:
pl: Instrukcja dla Firefoksa 57 i nowszych:
pt: Instruções para o Firefox 57 e versões mais recentes:
tr: Firefox 57 ve üzerindeki sürümler için yönergeler:

source: From the Menu button in the top right, select <em>Preferences</em>. Scroll down until you see the <em>Network Proxy</em> section, as shown in the screenshot below. Click on <em>Settings</em>
es_ar: En el botón Menú de la parte superior derecha, seleccione <em>Preferencias</em>. Desplácese hacia abajo hasta que vea la sección <em>Proxy de red</em>, como se muestra en la siguiente captura de pantalla. Haga clic en <em>Configuración</em>
fr: À partir du bouton Menu en haut à droite, sélectionnez <em>Préférences</em>. Faites défiler en bas jusqu'à ce que vous voyez la section <em>Mandataire Réseau</em> comme vu dans la capture d'écran en dessous. Cliquez sur <em>Paramètres</em>
id: Di tombol Menu di kanan atas, pilih <em>Preferences</em>. Scroll ke bawah sampai bagian <em>Network Proxy</em> terlihat, seperti ditunjukkan di screenshot di bawah ini. Klik <em>Settings</em>
ja: 右上のメニューボタンから<em>設定</em>を選択してください。下にスクロールして<em>ネットワークプロキシ</em> セクションを見つけてください。下記に例示されています。<em>設定</em>をクリックしてください。
pt: A partir do botão do Menu em cima à direita, selecione <em>Preferências</em>. Desloque-se para baixo até ver a secção <em>Proxy de rede</em>, como mostra a imagem de ecrã abaixo. Clique em <em>Definições</em>
tr: Sağ üstteki menü düğmesine ve <em>Seçenekler</em> üzerine tıklayın. Aşağıdaki ekran görüntüsündeki gibi <em>Ağ ayarları</em> bölümünü görene kadar aşağı inin. <em>Ayarlar</em> üzerine tıklayın

source: Firefox57 Network Options
de: Netzwerkoptionen in Firefox 57
es_ar: Opciones de red de Firefox57
fr: Paramètres réseau de Firefox 57
id: Opsi Jaringan Firefox57
ja: Firefox57 ネットワークオプション
pl: Firefox 57: opcje sieci
pt: Configurações de rede do Firefox 57
tr: Firefox 57 Ağ Ayarları

source: In the <em>Connection Settings</em> pop-up, select <em>Manual proxy configuration</em>. Set both the HTTP and SSL Proxy to address <code>127.0.0.1</code> with port <code>4444</code> as shown in the following screenshot.
es_ar: En la <em>ventana emergente</em> Configuración de la conexión <em>seleccione Configuración manual del proxy</em>. Establezca tanto el proxy HTTP como el SSL en la dirección <code>127.0.0.1</code> con el puerto<code>4444</code> como se muestra en la siguiente captura de pantalla.
fr: Dans le pop-up <em>Paramètres de Connexion</em>, sélectionnez <em>Configuration manuelle de mandataire</em>. Mettez les deux mandataires HTTP et SSL à l'adresse <code>127.0.01</code> avec le port <code>4444</code> comme vu dans la capture d'écran suivante.
id: Di pop-up <em>Connection Settings</em> pop-up, pilih <em>Manual proxy configuration</em>. Masukkan alamat proxy HTTP dan SSL Proxy menjadi <code>127.0.0.1</code> dengan port <code>4444</code> seperti di screenshot ini.
ja: <em>接続設定</em>のポップアップがでたら、<em>手動プロキシ 設定</em>を選んでください。HTTPとSSLプロキシ双方にアドレス <code>127.0.0.1</code>、ポート <code>4444</code>を下記のスクリーンショットの通り設定してください。
pt: No modal <em>Configuração de conexão</em> selecione <em>Configuração manual de proxy</em>. Defina tanto o proxy HTTP quanto o HTTPS para o endereço <code>127.0.0.1</code> com a porta <code>4444</code> como mostrado na captura de tela a seguir.
tr: <em>Bağlantı Ayarları</em> penceresinden, <em>Vekil sunucuyu elle ayarla</em> üzerine tıklayın. HTTP ve SSL vekil sunucu adreslerini aşağıdaki görseldeki gibi <code>127.0.0.1</code> ve bağlantı noktasını <code>4444</code> olarak ayarlayın.

source: Firefox57 Connection Settings
de: Firefox 57 Verbindungs-Einstellungen
es_ar: Firefox57 Configuración de la conexión
fr: Paramètres de connexion de Firefox 57
id: Firefox57 Pengaturan Koneksi
ja: Firefox57 接続設定
pl: Firefox 57: ustawienia połączenia
pt: Definições da Conexão do Firefox 57
tr: Firefox57 Bağlantı Ayarları

source: Firefox57 Connection Settings
de: Verbindungs-Einstellungen in Firefox 57
es_ar: Configuración de conexión de Firefox57
fr: Paramètres réseau de Firefox 57
id: Pengaturan Koneksi Firefox57
ja: Firefox57 接続設定
pl: Firefox 57: ustawienia połączenia
pt: Definições da Conexão do Firefox 57
tr: Firefox57 Bağlantı Ayarları

source: Finally, go to the address <em>about:config</em> and find the property media.peerConnection.ice.proxy_only. Ensure that this setting is True.
de: Rufen Sie abschließend die Adresse <em>about:config</em> auf und finden Sie die Eigenschaft media.peerConnection.ice.proxy_only. Stellen Sie sicher, dass der Wert auf True gesetzt ist.
es_ar: Por último, vaya a la dirección <em>about:config</em> y busque la propiedad media.peerConnection.ice.proxy_only. Asegúrese de que esta configuración es True.
fr: Enfin, allez à l'adresse <em>about:config</em> et trouvez la propriété media.peerConnection.ice.proxy_only. Assurez vous que ce paramètre est Vrai.
id: Akhirnya, buka alamat <em> about: config </em> dan cari properti media.peerconnection.ice.proxy_only. Pastikan pengaturan ini benar.
ja: 最後に、アドレス <em>about:config</em> にアクセスして、プロパティ media.peerConnection.ice.proxy_only を検索し、この設定をTrueにしてください。
pl: Następnie przejdź na stronę <em>about:config</em> i znajdź ustawienie „media.peerconnection.ice.proxy_only” i upewnij się, że ma przypisaną wartość „True”.
pt: Por fim, vá para o endereço <em>about:config</em> e encontre a propriedade media.peerConnection.ice.proxy_only. Garanta que essa configuração está definida como True.
tr: Son olarak <em>about:config</em> adresine gidip media.peerConnection.ice.proxy_only özelliğini bulun ve True olarak ayarlandığından emin olun..

source: Firefox57 PeerConnection Settings
de: Firefox57 PeerConnection-Einstellungen
es_ar: Firefox57 Configuración de PeerConnection
fr: Firefox57 Paramètres de Connexion pair
id: Firefox57 Pengaturan PeerConnection
ja: Firefox57 ピア接続設定
pl: Firefox 57: ustawienie PeerConnection
pt: Firefox57 Definições da ConexãoPar
tr: Firefox57 PeerConnection Ayarları

source: Firefox57 PeerConnection Settings
de: Firefox57 PeerConnection-Einstellungen
es_ar: Configuración de PeerConnection de Firefox57
fr: Firefox57 Paramètres de Connexion pair
id: Firefox57 Pengaturan PeerConnection
ja: Firefox57 ピア接続設定
pl: Firefox 57: ustawienie PeerConnection
pt: Firefox57 Definições da ConexãoPar
tr: Firefox57 PeerConnection Ayarları

source: Extension-based Configuration: I2PChrome.js(Experimental, additional configuration)
es_ar: Configuración basada en extensiones: I2PChrome.js(Experimental, configuración adicional)
fr: Configuration basé sur l'extension: I2PChrome.js(configuration additionnelle et expérimentale)
id: Konfigurasi Berbasis Ekstensi: I2PChrome.js (Eksperimental, konfigurasi tambahan)
ja: 拡張機能を用いた設定: I2PChrome.js (実験的、追加設定)
pt: Configuração Baseada em Extensão: I2PChrome.js (Experimental, configuração adicional)
tr: Uzantı temelli yapılandırma: I2PChrome.js(deneysel, ek yapılandırma)

source: An experimental, partially-automated configuration process for Chrome is available. In order to configure it, create a new <em>Profile</em> especially for your I2P browsing, separate from the default profile. Then install this <a href="https://chrome.google.com/webstore/detail/i2pchromejs/ikdjcmomgldfciocnpekfndklkfgglpe"><em>Extension</em></a> in your newly-created profile. This profile is now configured to use I2P. Highly detailed instructions are available at the <a href="https://eyedeekay.github.io/I2P-Configuration-For-Chromium">homepage.</a>
fr: Un processus de configuration expérimental et partiellement automatique pour Chrome est disponible. Pour le configurer, créez un nouveau <em>Profil</em> spécialement pour vos navigations I2P, séparé de votre profil par défaut. Puis installez cette <a href="https://chrome.google.com/webstore/detail/i2pchromejs/ikdjcmomgldfciocnpekfndklkfgglpe"><em>Extension</em></a>sur votre nouveau compte. Ce profil est maintenant configuré pour utiliser I2P. Des instructions plus détaillées sont disponibles sur la <a href="https://eyedeekay.github.io/I2P-Configuration-For-Chromium">page d'acceuil.</a>
id: Proses konfigurasi eksperimental, automasi parsial untuk Chrome sudah tersedia. Untuk mengkonfigurasinya, buat <em>Profil</em> baru yang khusus untuk menggunakan I2P, terpisah dari profil default. Kemudian instal ini <a href="https://chrome.google.com/webstore/detail/i2pchromejs/ikdjcmomgldfciocnpekfndklkfgglpe"> <em> Extension </em> </a> Dalam profil baru Anda. Profil ini sekarang telah dikonfigurasi untuk menggunakan I2P. Instruksi yang sangat terperinci tersedia di <a href="https://eyedeekay.github.io/I2P-Configuration-For-Chromium">homepage.</a>
ja: 実験的ですが、部分的に自動化されたChrome向け設定処理が利用可能です。設定するには、特にI2Pブラウジング用の新しい<em>プロファイル</em>をデフォルトのプロファイルとは別に作成してください。その後、この <a href="https://chrome.google.com/webstore/detail/i2pchromejs/ikdjcmomgldfciocnpekfndklkfgglpe"><em>拡張機能</em></a> を新しく作成したプロファイルで インストールしてください。それだけでこのプロファイルは設定が完了しており、I2Pが使用できます。詳細な説明については<a href="https://eyedeekay.github.io/I2P-Configuration-For-Chromium">ホームページ</a>を参照してください。
pt: Um processo de configuração experimental, parcialmente automatizado, para o Chrome é disponibilizado. Para configurar, crie um novo <em>Perfil</em> específico para sua navegação pela I2P, separado do seu perfil padrão. Então, instale esta <a href="https://chrome.google.com/webstore/detail/i2pchromejs/ikdjcmomgldfciocnpekfndklkfgglpe"><em>Extensão</em></a> no seu perfil recém criado. Esse perfil está agora configurado para usar a I2P. Instruções altamente detalhadas estão disponíveis na <a href="https://eyedeekay.github.io/I2P-Configuration-For-Chromium">página inicial.</a>
tr: Chrome için deneysel ve kısmen otomatikleştirilmiş bir yapılandırma süreci vardır. Yapılandırmak için özellikle I2P taramanız için varsayılan profilden ayrı olarak yeni bir <em>Profil</em> oluşturun. Ardından yeni oluşturduğunuz profile <a href="https://chrome.google.com/webstore/detail/i2pchromejs/ikdjcmomgldfciocnpekfndklkfgglpe"><em>bu eklentiyi</em></a> kurun. Böylece bu profil I2P kullanmak üzere yapılandırılmış olur. Oldukça ayrıntılı yönergeler için <a href="https://eyedeekay.github.io/I2P-Configuration-For-Chromium">site sayfasına</a> bakabilirsiniz.

source: All Chrome Versions
de: Alle Chrome-Versionen
fr: Toutes les Versions Chromes
id: Semua Versi Chrome
ja: すべてのChromeのバージョン
pl: Wszystkie wersje Chrome
pt: Todas as Versões do Chrome
tr: Tüm Chrome Sürümleri
