Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: I2P is now available as a Docker package from the Docker Hub. You may retrieve the image by running the 'docker pull' command.
fr: I2P est désormais disponible en tant que paquet Docker sur le centre Docker. Vous pouvez récupérer l'image en faisant tourner la commande 'docker pull'.
id: I2P sekarang tersedia sebagai paket Docker dari Docker Hub. Anda dapat mengambil image-nya dengan menjalankan perintah 'docker pull'.
ja: I2PはDocker HubからDockerパッケージとして入手できるようになりました。「docker pull」コマンドを実行することでイメージを取得することができます。
pt: A I2P agora está disponível como um pacote Docker no Hub do Docker. Você pode obter a imagem executando o comando 'docker pull'.
tr: I2P artık Docker Hub üzerinde bir Docker paketi olarak da bulunuyor. 'docker pull' komutunu kullanarak paketi alabilirsiniz.

source: Additional instructions for configuring your container can be found here.
fr: Vous trouverez des instructions supplémentaires pour configurer votre conteneur ici.
id: Petunjuk tambahan untuk mengonfigurasi container Anda dapat ditemukan di sini.
ja: コンテナ設定の追加説明はこちらにあります。
pl: Dodatkowe instrukcje dla konfiguracji twojego kontenera znajdują się tutaj.
pt: Instruções adicionais para configurar seu contêiner podem ser encontradas aqui.
tr: Kapsayıcınızı yapılandırmakla ilgili ek yönergeleri burada bulabilirsiniz.

source: Alternately, you can fetch the source via <a href="%(monotoneurl)s#getting-the-i2p-code">Git</a> from <a href="%(gitrepo)s">git.repo.i2p</a> or <a href="%(github)s">Github</a>. <br /> Run <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> then either run the GUI installer or headless install as above.
fr: Autrement, vous pouvez récupérer la source par <a href="%(monotoneurl)s#getting-the-i2p-code">Git</a> sur <a href="%(gitrepo)s">git.repo.i2p</a> ou <a href="%(github)s">Github</a>. <br />Exécutez<code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> puis exécutez soit le programme d'installation GUI ou l'installation sans tête comme ci-dessus.
id: Aternatifnya adalah, Anda dapat mengambil source code-nya melalui <a href="%(monotoneurl)s#getting-the-i2p-code"> git </a> dari <a href="%(gitrepo)s"> git.repo.i2p < /a> atau <a href="%(github)s"> github </a>. <br /> Jalankan <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> lalu jalankan installer GUI atau instalasi headless seperti di atas.
ja: 代わりに、 <a href="%(monotoneurl)s#getting-the-i2p-code">Git</a>から、または<a href="%(gitrepo)s">git.repo.i2p</a> あるいは <a href="%(github)s">Github</a>から Git 経由でソースを取得できます。 <br /> <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code>を実行してから、GUI インストーラーか上記のヘッドレスインストーラーを起動してください。
pt: Alternativamente, você pode obter o código-fonte via <a href="%(monotoneurl)s#getting-the-i2p-code">Git</a> a partir de <a href="%(gitrepo)s">git.repo.i2p</a> ou do <a href="%(github)s">Github</a>. <br /> Execute <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> então execute o instalador com interface gráfica ou a instalação sem interface gráfica como acima.
tr: Alternatif olarak, kaynak kodunu <a href="%(monotoneurl)s#getting-the-i2p-code">Git</a> kullanarak <a href="%(gitrepo)s">git.repo.i2p</a> ya da <a href="%(github)s">GitHub</a> üzerinden alabilirsiniz. <br />Yukarıdaki gibi görsel arayüz olmadan ya da olarak kurulumu başlatmak için <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> komutunu çalıştırın.

source: Android source is also in <a href="%(monotoneurl)s#getting-the-i2p-code">git</a> on <a href="%(android)s">Github</a>. Android builds require the I2P source. See the documentation in the Android source for additional build requirements and instructions.
fr: La source android est aussi dans <a href="%(monotoneurl)s#getting-the-i2p-code">git</a> sur <a href="%(android)s">Github</a>. Les builds Android requiert la source I2P. Veuillez voir la documentation dans la source Android pour des instructions et exigences de build supplémentaires.
id: Source code untuk Android juga tersedia di <a href="%(monotoneurl)s#getting-the-i2p-code"> git </a> di <a href="%(Android)s"> github </a>. Android membutuhkan source code I2P. Lihat dokumentasi di dalam Android source code untuk tambahan persyaratan build dan petunjuk penggunaan.
ja: Android のソースは <a href="%(monotoneurl)s#getting-the-i2p-code">git</a> と <a href="%(android)s">Github</a> にもあります。 Android のビルドには I2P のソースが必要です。詳細なビルド要件や説明については、Android のソースのドキュメンテーションをご覧ください。
pt: O código-fonte para Android também está em <a href="%(monotoneurl)s#getting-the-i2p-code">git</a> no <a href="%(android)s">Github</a>. Construções Android requerem o código-fonte da I2P. Veja a documentação no código-fonte para Android para requerimentos e instruções de construção adicionais.
tr: Android kaynak kodu <a href="%(monotoneurl)s#getting-the-i2p-code">Git</a> ya da <a href="%(android)s">GitHub</a> üzerinden alınabilir. Android yapımları için I2P kaynak kodu gereklidir. Android kaynağı ile ilgili ek derleme gereksinimleri ve yönergeleri için belgelere bakabilirsiniz.

source: The Windows installer is signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
de: Das Windows-Installationsprogramm ist signiert von %(signer)s, <a href="%(signingkey)s">dessen Schlüssel hier ist</a>.
fr: Le programme d’installation pour Windows est signé par %(signer)s, <a href="%(signingkey)s">dont la clé se trouve ici</a>.
id: Installer Windows ditandatangani oleh %(signer), <a href="%(signingkey)s">yang kuncinya ada di sini</a>.
ja: Windows用インストーラーは %(signer)sが署名しており、 <a href="%(signingkey)s">その鍵はこちらにあります</a>。
pl: Instalator na systemy Windows został podpisany przez programistę %(signer)s, <a href="%(signingkey)s">którego klucz znajduje się tutaj</a>.
pt: O instalador para Windows é assinado por %(signer)s, <a href="%(signingkey)s">cuja chave está aqui</a>.
tr: Windows kurucusu %(signer)s tarafından imzalanmıştır. <a href="%(signingkey)s">İmza anahtarını burada bulabilirsiniz</a>.

source: The Mac OS X native installer is signed by %(signer)s with his Apple Developer ID certificate, <a href="%(signingkey)s">whose key is here</a>.
de: Das native Installationsprogramm für MacOSX ist signiert von %(signer)s mit seinem Apple-Entwicklerzertifikat, <a href="%(signingkey)s">dessen Schlüssel hier liegt</a>.
fr: Le programme d’installation natif macOS est signé par %(signer)s avec le certificat de son ID de développeur Apple, <a href="%(signingkey)s">dont la clé se trouve ici</a>.
id: Installer untuk Mac OS X ditandatangani oleh %(signer) dengan sertifikat Apple Developer ID miliknya, <a href="%(signingkey)s"> kuncinya di sini </a>.
ja: Mac OS Xのネイティブインストーラーは %(signer)sが自身のApple Developer ID 証明書で署名しており、 <a href="%(signingkey)s">その鍵はこちらです。</a>。
pl: Natywny instalator dla systemu macOS został podpisany przez %(signer)s certyfikatem Apple Developer ID, <a href="%(signingkey)s">którego klucz znajduje się tutaj</a>.
pt: O instalador nativo para Mac OS X é assinado por %(signer)s com seu certificado de ID de Desenvolvedor Apple, <a href="%(signingkey)s">cuja chave está aqui</a>.
tr: Mac OS X doğal kurucu %(signer)s tarafından <a href="%(signingkey)s">anahtarını burada bulabileceğiniz</a> kendi Apple Developer Kodu sertifikası ile imzalanmıştır.

source: Updates from earlier releases:
de: Updates von früheren Versionen:
es_ar: Actualizaciones desde versiones anteriores:
fr: Mises à jour de versions antérieures :
id: Pembaruan dari rilis sebelumnya:
ja: 以前のリリースから更新:
pl: Aktualizacja z wcześniejszej wersji:
pt: Atualizações de lançamentos anteriores:
tr: Önceki sürümlerden güncelleme:

source: Both automatic and manual upgrades are available for the release.
de: Automatische und manuelle Updates sind für die Veröffentlichung verfügbar.
es_ar: Hay disponibles actualizaciones de cambio de versión manuales y automáticas.
fr: Des mises à jour automatiques et manuelles sont toutes deux proposées pour la version.
id: Upgrade otomatis dan manual sudah tersedia untuk rilis.
ja: 自動手動アップデート双方がこのリリースに利用できます。
pl: Zarówno automatyczna i ręczna aktualizacja jest dostępna dla tej wersji.
pt: As atualizações automáticas e manuais estão ambas disponíveis para lançamento.
tr: Bu sürüm hem otomatik hem el ile güncellenebilir.

source: If you are running 0.7.5 or later, your router should detect the new release. To upgrade simply click the 'Download Update' button on your router console when it appears.
fr: Si vous exécutez 0.7.5 ou plus tard, votre routeur devrait détecter la nouvelle version. Pour mettre à niveau, cliquez sur le bouton 'Télécharger mise à jour' sur votre console de routeur quand il apparaît.
id: Jika anda menjalankan versi 0.7.5 atau lebih baru, router Anda seharusnya mendeteksi rilis terbaru. Untuk meng-upgrade cukup klik tombol 'Download Update' pada router console Anda ketika tombol tersebut muncul.
ja: 0.7.5以降を起動している場合、ルーターが新リリースを検出するはずです。アップグレードするには、表示時にただルーターコンソールの「アップデートをダウンロード」ボタンをクリックするだけで構いません。
pt: Se você está executando a versão 0.7.5 ou superior, seu roteador deveria detectar o novo lançamento. Para atualizar, apenas clique no botão 'Baixar Atualização' no seu painel do roteador quando aparecer.
tr: 0.7.5 ya da üzerindeki bir sürümü kullanıyorsanız, yönelticiniz yeni sürümü algılayabilir. Güncellemek için görüntülendiği zaman yöneltici panonuzdaki "Güncellemeyi indir" düğmesine tıklayın.

source: Since 0.9.23, some releases are signed by str4d, whose signing key has been in the router since 0.9.9. Routers older than 0.9.9 will fail to verify update files signed by str4d, and will need to be manually updated using the process below.
de: Ab Version 0.9.23 sind einige Versionen von str4d signiert, wessen Schlüssel seit Version 0.9.9 im Router enthalten sind. Router älter als 0.9.9 geben einen Fehler beim Überprüfen der von str4d signierten Releases und benötigen eine manuelle Aktualisierung, die unten beschrieben wird.
es_ar: Desde la 0.9.23, algunas versiones están firmadas por str4d, cuya clave de firmado ha estado en el router I2P desde la 0.9.9. Los routers I2P anteriores a la 0.9.9 no podrán verificar los ficheros de actualización firmados por str4d, y precisarán ser actualizados manualmente usando el procedimiento a continuación.
fr: Depuis 0.9.23, certaines versions sont signées par str4d dont la clé de signature est dans le routeur depuis 0.9.9. Les routeurs plus anciens que 0.9.9 ne réussiront pas à vérifier les fichiers de mise à jour signés par str4d et devront être mis à jour manuellement en suivant les instructions ci-dessous.
id: Sejak versi 0.9.23, beberapa rilis ditandatangani oleh str4d, yang signing key-nya telah ada di router sejak versi 0.9.9. Router yang lebih tua dari 0.9.9 akan gagal untuk memverifikasi file update yang ditandatangani oleh str4d, dan akan perlu diupdate secara manual menggunakan proses di bawah ini.
ja: 0.9.23まではいくつかのリリースは署名がルーターの中に存在するstr4dによって署名されていました。 0.9.9からはそれ以前の古いルーターがstr4dによって署名されたアップデートの検証に失敗するでしょう。 そのため以下の手順を用いて手動でアップデートする必要があります。
pl: Od wersji 0.9.23 niektóre wydania są podpisane przez programistę str4d, którego klucz podpisujący dostarczany jest z oprogramowaniem od wersji 0.9.9. Węzły starsze niż 0.9.9 nie zaktualizują się z powodu błędu podczas weryfikacji plików podpisanych przez str4d, wymagana będzie ręczna aktualizacja opisana poniżej.
pt: Desde o lançamento 0.9.23, alguns lançamentos são assinados por str4d, cuja chave de assinatura está no roteador I2P desde 0.9.9. Os roteadores I2P antes do 0.9.9 não poderão verificar os arquivos de atualização assinado por str4d, e precisarão ser atualizados manualmente usando o procedimento abaixo.
tr: 0.9.23 sürümünden sonra bazı sürümler str4d tarafından imzalanmıştır. 0.9.9 sürümünden sonra imzası yönelticide bulunur. 0.9.9 sürümünden önceki yönelticilerde str4d tarafından imzalanmış dosyaların güncelleme doğrulaması yapılamadığından güncelleme işleminin el ile yapılması gerekir.

source: Download the file to your I2P installation directory and <b>rename as i2pupdate.zip</b>. (alternately, you can get the source as above and run "ant updater", then copy the resulting i2pupdate.zip to your I2P installation directory). You do NOT need to unzip the file.
fr: Téléchargez le fichier vers votre dépôt d'installation I2P et renommez le en i2pupdate.zip<b>. (autrement vous pouvez obtenir la source ci-dessus et exécutez "ant updater" puis copier le i2pupdate.zip résultant dans votre dépôt d'installation I2P). Vous n'avez PAS besoin d'extraire le fichier.
id: Unduh file ke direktori instalasi I2P Anda dan <b>ganti namanya menjadi i2pupdate.zip</b>. (atau, Anda bisa mendapatkan source code seperti di atas dan menjalankan "ant updater", kemudian salin i2pupdate.zip yang dihasilkan ke direktori instalasi I2P). And TIDAK PERLU untuk men-unzip file tersebut.
ja: ファイルをI2Pインストールディレクトリにダウンロードし、<b>i2pupdate.zipとしてリネームします</b>。(代わりに、上記のようにソースを取得して 「ant updater 」を実行し、結果として得られたi2pupdate.zipをI2Pインストールディレクトリにコピーすることもできます)。 このファイルを解凍する必要はありません！
pt: Baixe o arquivo para o seu diretório de instalação da I2P e <b>renomeie como i2pupdate.zip</b>. (alternativamente, você pode obter o código-fonte como acima e executar "ant updater", então copiar o i2pupdate.zip resultante no seu diretório de instalação da I2P). Você NÃO precisa descompactar o arquivo.
tr: Dosyayı I2P kurulum klasörüne indirip <b>i2pupdate.zip olarak yeniden adlandırın</b> (Alternatif olarak, kaynağı yukarıdaki gibi alarak "ant updater" komutunu yürütebilirsiniz. Ardından alınan i2pupdate.zip dosyasını I2P kurulum klasörünüze kopyalayın). Dosyayı ayıklamanız gerekmez.

source: Click <a href="http://localhost:7657/configservice.jsp">"Restart"</a>
de: Klicke <a href="http://localhost:7657/configservice.jsp">"Restart"</a>
es_ar: Pulse <a href="http://localhost:7657/configservice.jsp">"Reiniciar"</a>
fr: Cliquez sur <a href="http://localhost:7657/configservice.jsp">« Redémarrer »</a>
id: Klik <a href="http://localhost:7657/configservice.jsp">"Restart" </a>
ja: <a href="http://localhost:7657/configservice.jsp">「再起動」</a>をクリック
pl: Kliknij <a href="http://localhost:7657/configservice.jsp">„restart”</a>
pt: Clique em <a href="http://localhost:7657/configservice.jsp">"Reiniciar"</a>
tr: <a href="http://localhost:7657/configservice.jsp">"Yeniden Başlat"</a> üzerine tıklayın

source: Grab a cup of coffee and come back in 11 minutes
de: Holen Sie sich eine Tasse Kaffee und kommen Sie in 11 Minuten wieder
es_ar: Vaya a por una taza de horchata/café/cacao/mate y vuelva en 11 minutos.
fr: Buvez un verre d’eau et revenez dans 11 minutes
id: Ambil secangkir kopi dan kembali dalam 11 menit
ja: コーヒーでも飲んで、11分後戻ってきてください
pl: Teraz idź zaparzyć sobie kawusię i wróć za 11 minut
pt: Pegue numa chávena de café e volte em 11 minutos
tr: Bir fincan kahve alın ve 11 dakika sonra geri gelin

source: The file is signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
de: Dies Datei sind von %(signer)s signiert, wessen Schlüssel <a href="%(signingkey)s">hier sind</a>.
es_ar: El fichero está firmado por %(signer)s, <a href="%(signingkey)s">cuya clave está aquí</a>.
fr: Le fichier est signé par %(signer)s, <a href="%(signingkey)s">dont la clé est ici</a>.
id: File ini ditandatangani oleh %(signer)s, <a href="%(signingkey)s">yang kuncinya ada di sini</a>.
ja: ファイルは %(signer)s が署名しており、鍵は<a href="%(signingkey)s">こちら</a>にあります
pl: Ten plik jest podpisany przez programistę %(signer)s, <a href="%(signingkey)s">którego klucz znajduje się tutaj</a>.
pt: O arquivo é assinado por %(signer)s, <a href="%(signingkey)s">cuja chave está aqui</a>.
tr: %(signer)s tarafından imzalanmış dosyanın, <a href="%(signingkey)s">anahtarını buradan alabilirsiniz</a>.

source: Previous Releases
de: Frühere Versionen
es_ar: Versiones anteriores
fr: Versions antérieures
id: Rilis sebelumnya
ja: 以前のリリース
pl: Poprzednie wydania
pt: Lançamentos Anteriores
tr: Önceki Sürümler

source: Previous releases are available on <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> and <a href="https://launchpad.net/i2p/trunk">Launchpad</a> and within the I2P network on <a href="http://%(echelon)s/">%(echelon)s</a>.
de: Frühere Veröffentlichungen sind verfügbar auf <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a>⏎ und <a href="https://launchpad.net/i2p/trunk">Launchpad</a>⏎ und im I2P Netzwerk auf <a href="http://%(echelon)s/">%(echelon)s</a>.
es_ar: Las versiones anteriores están disponibles en <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> y <a href="https://launchpad.net/i2p/trunk">Launchpad</a>, y dentro de la red I2P en <a href="http://%(echelon)s/">%(echelon)s</a>.
fr: Les versions antérieures sont proposées sur <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a>, sur <a href="https://launchpad.net/i2p/trunk">Launchpad</a> et dans le réseau I2P à <a href="http://%(echelon)s/">%(echelon)s</a>.
id: Rilis sebelumnya tersedia pada <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> dan <a href="https://launchpad.net/i2p/trunk">Launchpad</a> dan dalam jaringan I2P <a href="http://%(echelon)s/">%(echelon)s</a>s.
ja: 以前のリリースは <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> や <a href="https://launchpad.net/i2p/trunk">Launchpad</a> 及び<a href="http://%(echelon)s/">%(echelon)s</a>の I2P ネットワーク内で入手できます。
pl: Poprzednie wersje są dostępne na <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> i <a href="https://launchpad.net/i2p/trunk">Launchpad</a> oraz wewnątrz sieci I2P na <a href="http://%(echelon)s/">%(echelon)s</a>.
pt: Versões anteriores estão disponíveis no <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> e no <a href="https://launchpad.net/i2p/trunk">Launchpad</a> bem como na rede I2P em <a href="http://%(echelon)s/">%(echelon)s</a>.
tr: Önceki sürümler <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> ve <a href="https://launchpad.net/i2p/trunk">Launchpad</a> ya da I2P ağındaki <a href="http://%(echelon)s/">%(echelon)s</a> üzerinden alınabilir.

source: Mac OS Easy Install Bundle
fr: Paquet Installation Facile Mac OS
pl: Łatwy Pakiet Instalacyjny Mac OS
pt: Pacote de Instalação Fácil para Mac OS
tr: macOS Kolay Kurulum Paketi

source: We are excited to offer you a DMG-based bundle for Mac OS. It installs and behaves the same way many other Mac OS applications do and does not require a Java Runtime Environment to be available.
fr: Nous sommes réjouis de vous offrir un paquet basé sur DMG pour Mac OS. Il exécute et se comporte de la même manière que beaucoup d'autres applications Mac OS et ne requiert pas un moteur d'exécution Java pour être disponible.
id: Kami sangat senang menawarkan bundel berbasis DMG untuk Mac OS. Itu menginstal dan berperilaku dengan cara yang sama seperti banyak aplikasi Mac OS lainnya dan tidak memerlukan Java Runtime Environment.
ja: macOS 用の DMG を基に同梱して提供できることに感激しています。インストールや動作は 他の多くの macOS 用アプリケーションと同じで、Java ランタイム環境を使えるようにする 必要はありません。
pt: Nós ficamos felizes em oferecer a você um pacote baseado em DMG para Mac OS. Ele instala e se comporta da mesma forma como muitas outras aplicações Mac OS e não requer que um Ambiente de Execução Java esteja disponível.
tr: macOS için bir DMG temelli bir paket sunmaktan heyecan duyuyoruz. Diğer birçok macOS uygulaması gibi kurulur ve davranır. Kullanılabilir olması için bir Java Runtime Environment gerekmez.

source: Double-Click on the .dmg file, which you may download from this page. When a window appears with the I2P application inside it, "drag" the application to the "Applications" side of the window to install it. Once you're finished, I2P is installed and can be launched from Finder. This procedure is the same as any other Mac application. When you launch I2P, the I2P icon will appear on the Dock and a few seconds later a browser will open with the I2P console page, inviting you to complete the bandwidth setup wizard.
fr: Cliquez deux fois sur le fichier .dmg que vous pouvez téléchargez à partir de cette page. Quand une fenêtre apparaît avec l'application I2P à l'intérieur, "glissez" l'application vers le côté "Applications" de la fenêtre pour l'installer. Une fois que vous avez fini, I2P sera installé et peut être démarré sur Finder. Cette procédure est la même que n'importe quelle autre application Mac. Quand vous lancez I2P, l'icône I2P apparaîtra sur le Dock et quelques secondes plus tard un navigateur s'ouvrira avec la page console de I2P, vous invitant à compléter la mise en place de la bande passante.
id: Klik dua kali pada file .dmg, yang dapat Anda unduh dari halaman ini. Ketika sebuah jendela muncul dengan aplikasi I2P di dalamnya, "seret" aplikasi tersebut ke sisi jendela "Applications" untuk menginstalnya. Setelah selesai, I2P telah diinstal dan dapat diluncurkan dari Finder. Prosedur ini sama dengan prosedur untuk aplikasi Mac lainnya. Saat Anda meluncurkan I2P, ikon I2P akan muncul di Dock dan beberapa detik kemudian sebuah browser akan terbuka dengan halaman console I2P, yang akan mengundang Anda untuk menyelesaikan wizard pengaturan bandwidth.
ja: .dmg ファイルをダブルクリックしてください。このページからダウンロードできます。I2P アプリケーション が内側にあるウィンドウが開いたら、アプリをウィンドウの「アプリケーション」側にドラッグして インストールしてください。完了したら、I2P はインストールされ、ファインダーから起動できます。 この手順は他の Mac アプリと共通です。I2P を起動したら、I2P のアイコンがドックに表示され、 数秒後に I2P コンソールページを開いたブラウザが起動し、帯域幅設定ウィザードを 完了するよう勧められます。
pt: Dê dois cliques no arquivo .dmg, o qual você pode baixar desta página. Quando uma janela aparecer com a aplicação I2P dentro dela, "arraste" a aplicação para o lado de "Aplicações" da janela para instalá-la. Uma vez finalizado, a I2P está instalada e pode ser iniciada a partir do Finder. Esse procedimento é o mesmo que qualquer outra aplicação Mac. Quando você inicia a I2P, o ícone da I2P aparecerá no Dock e alguns segundos depois um navegador abrirá com a página do painel da I2P, convidando você a completar o assistente de configuração de largura de banda.
tr: Bu sayfadan indirebileceğiniz .dmg dosyasına çift tıklayın. İçinde I2P uygulaması olan bir pencere göründüğünde, uygulamayı kurmak için I2P simgesini pencerenin "Uygulamalar" tarafına "sürükleyin". Bitirdiğinizde, I2P kurulur ve Finder ile başlatılabilir. Bu yöntem, diğer herhangi bir Mac uygulamasıyla aynıdır. I2P uygulamasını başlattığınızda, Dock üzerinde I2P simgesi görüntülenir ve birkaç saniye sonra I2P pano sayfasıyla birlikte bir tarayıcı açılarak sizden bant genişliği kurulum yardımcısını tamamlamanızı ister.
