Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: What are some good address book subscription links?
fr: Quels sont quelques bons liens d'abonnement au carnet d'adresse ?
id: Apa sajakah tautan address book subscription yang bagus?
ja: 何かいいアドレス帳購読リンクはありますか？
pl: Gdzie znajdę jakieś dobre subskrypcje książki adresowej?
pt: Quais são algumas boas ligações para a subscrição de livros de endereços?
tr: Kullanabileceğim iyi adres defteri abonelik bağlantıları nelerdir?

source: You may try the following:
de: Man kann Folgendes versuchen:
fr: Vous pouvez essayer les liens suivants :
id: Anda dapat mencoba berikut ini:
ja: 以下を試すとよいでしょう：
pl: Skorzystaj z następujących:
pt: Pode tentar o seguinte:
tr: Şunları deneyebilirsiniz:

source: For security purposes, the router's admin console by default only listens for connections on the local interface. There are two methods for accessing the console remotely:
de: Aus Sicherheitsgründen kann die routeradminkonsole per default nur über das lokale Interface erreicht werden. Es gibt 2 Methoden, diese Konsole von extern zu erreichen:
fr: Pour des fins de sécurité, la console d’administration du routeur n’écoute par défaut que les connexions sur l’interface locale. Il existe deux méthodes pour accéder à la console à distance :
id: Untuk tujuan keamanan, konsol admin router secara default hanya mendengarkan koneksi di interface lokal. Ada dua metode untuk mengakses console dari jarak jauh:
ja: セキュリティ確保のため、ルーターの管理コンソールはデフォルトではローカルインターフェイス上の接続のみを受け付けます。 リモートでコンソールにアクセスするには2つの方法があります：
pl: Ze względów bezpieczeństwa, konsola administracyjna węzła domyślnie nasłuchuje połączeń tylko na lokalnym interfejsie sieciowym. Są dwie metody na zdalny dostęp do konsoli węzła:
pt: Por motivos de segurança, a consola de administração do router, por predefinição, apenas escuta conexões na interface local. Existem dois métodos para aceder à consola remotamente:
tr: Güvenlik nedeniyle yönelticinin yönetim panosu varsayılan olarak yalnızca yerel ağdan gelen bağlantıları dinler. Bununla birlikte panoya uzaktan erişim için kullanılabilecek iki yöntem vardır:

source: SSH Tunnel
fr: Un tunnel SSH
ja: SSHトンネル
pl: Tunel SSH
pt: Túnel SSH
tr: SSH Tüneli

source: Configuring your console to be available on a Public IP address with a username &amp; password
de: Einrichten der Konsole zum Zugriff mit einem Benutzernamen und Passwort auf einer öffentlichen IP Adresse
fr: Configurer votre console pour qu’elle soit accessible sur une adresse IP publique avec un nom d’utilisateur et un mot de passe
id: Mengonfigurasi console Anda agar tersedia pada alamat IP publik dengan nama pengguna & kata sandi
ja: コンソールを公開IPアドレス上でユーザ名＆パスワードを付けて利用できるよう設定する
pl: Konfiguracja konsoli. aby była dostępna z zewnątrz z publicznego adresu IP i chroniona hasłem
pt: Configurar a consola para estar disponível num endereço IP público com um nome de utilizador e palavra-passe
tr: Panonuzu herkese açık bir IP adresi üzerinden kullanıcı adı ve parola ile kullanabilmek için yapılandırmak

source: These are detailed below:
de: Diese sind unten im Detail beschrieben:
fr: Voici comment faire :
id: Ini adalah penjelasan lebih rinci:
ja: 詳細は以下：
pl: Opisy poniżej:
pt: Estes são detalhados abaixo:
tr: Ayrıntıları aşağıda görebilirsiniz:

source: If you are running a Unix-like Operating System, this is the easiest method for remotely accessing your I2P console. (Note: SSH server software is available for systems running Windows, for example <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)
de: Falls Sie ein Unix-artiges Betriebssystem nutzen ist dieses die einfachste Methode um von extern ihre I2P Konsole zu erreichen. (Hinweis: SSH Serversoftware existiert auch für Windowssysteme, zum Beispiel unter <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)
fr: Si vous utilisez un système d’exploitation de type UNIX, cette méthode est la plus facile pour accéder à distance à votre console I2P. (Note : Des logiciels serveur SSH sont proposés pour les systèmes qui tournent sous Windows, par exemple <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)
id: Jika Anda menjalankan sistem operasi jenis Unix, ini adalah metode termudah untuk mengakses console I2P Anda dari jarak jauh. (Catatan: Perangkat lunak server SSH tersedia untuk sistem yang menjalankan Windows, misalnya <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)
ja: もしUnix系のOSを使用しているなら、I2Pコンソールへのリモートアクセス法としてはこれが最も簡単です。 （注：SSHサーバーソフトはWindowsシステムでも利用可能。例えば <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>）
pl: Na systemach uniksopodobnych, jest to najłatwiejszy sposób na zdalny dostęp do konsoli węzła I2P.<br> (Uwaga: serwer SSH jest również dostępny na system Windows, na przykład <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>.)
pt: Se estiver a utilizar um sistema operativo do tipo Unix, este é o método mais fácil de aceder remotamente à consola I2P. (Nota: o software do servidor SSH está disponível para sistemas que executam o Windows, por exemplo <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)
tr: Unix benzeri bir işletim sistemi kullanıyorsanız I2P panonuza uzaktan erişmenin en kolay yolu budur. (Not: Windows üzerinde de kullanılabilecek SSH sunucu uygulamaları bulabilirsiniz. Örnek: <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)

source: Once you have configured SSH access to your system, the '-L' flag is passed to SSH with appropriate arguments - for example:
de: Nachdem Sie den SSH Zugriff zu ihrem System eingerichtet haben, wird das `-L´ Flag mit den passenden Argumenten zur SSH Konfiguration hinzugefügt - zum Beispiel:
fr: Une fois que vous avez configuré l’accès SSH vers votre système, le drapeau '-L' est passée à SSH avec les arguments pertinents, par exemple :
id: Setelah Anda mengonfigurasi akses SSH ke sistem Anda, tanda '-L' diteruskan ke SSH dengan argumen yang sesuai - misalnya:
ja: SSHアクセスをシステムに設定すれば、'-L'フラグが適切な引数と共にSSHに渡されます。例えば：
pl: Po skonfigurowaniu dostępu do Twojego systemu przez SSH, użyj parametru „-L” z odpowiednimi argumentami, przykład:
pt: Depois de configurar o acesso SSH ao seu sistema, o sinalizador '-L' é passado para o SSH com argumentos apropriados - por exemplo:
tr: Sisteminiz üzerinde SSH erişimini yapılandırdığınız '-L' işareti uygun argümanlar ile SSH üzerine aktarılır. Örnek:

source: Open <code>~/.i2p/clients.config</code> and replace
de: Öffnen Sie <code>~/.i2p/clients.config</code> und ersetzen Sie
fr: Ouvrez <code>~/.i2p/clients.config</code> et remplacez
id: Buka <code>~/.i2p/clients.config</code> dan ganti
ja: <code>~/.i2p/clients.config</code>を開いて置換します
pl: Otwórz plik <code>~/.i2p/clients.config</code> i zastąp
pt: Abra <code>~/.i2p/clients.config</code> e substitua
tr: <code>~/.i2p/clients.config</code> dosyasını açın ve şu değişikliği yapın

source: Go to <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> and add a console username and password if desired - Adding a username &amp; password is highly recommended to secure your I2P console from tampering, which could lead to de-anonymization.
de: Öffnen Sie <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> und fügen Sie einen Konsolenbenutzernamen und Passwort ein, falls gewünscht - Das setzen eines Benutzernamens &amp; Passwortes ist sehr empfohlen um die I2P Konsole gegen fremden Zugriff abzusichern, welches zur De-Anonymisierung führen kann.
fr: Rendez-vous sur <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> et ajoutez un nom d’utilisateur et un mot de passe pour la console si vous le souhaitez. Il est fortement recommandé d’ajouter un nom d’utilisateur et un mot de passe pour protéger votre console contre toute modification malveillante qui pourraient entraîner une désanonymisation.
id: Kunjungi <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> dan tambahkan nama pengguna dan kata sandi console jika diinginkan. Menambahkan nama pengguna & kata sandi sangat disarankan untuk mengamankan console I2P Anda dari gangguan, yang dapat menyebabkan de-anonimisasi.
ja: <a href="http://localhost:7657/configui">http://localhost:7657/configui</a>に行き、必要であればユーザ名とパスワードを追加します - ユーザ名とパスワードの追加は強く推奨されます。匿名性を失わせるような改竄からI2Pコンソールを守るためです。
pl: Przejdź do <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> i opcjonalnie zabezpiecz swoją konsolę węzła I2P nazwą użytkownika i hasłem – jest to szczególnie zalecane, aby ktoś nie namieszał w Twojej konsoli narażając Cię na demaskację.
pt: Vá a <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> e adicionar um nome de utilizador e uma palavra-passe da consola, se pretendido - A adição de um nome de utilizador e de uma palavra-passe é altamente recomendada para proteger a consola I2P contra adulterações, que podem levar à desanonimização.
tr: <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> adresine giderek gerekiyorsa pano için bir kullanıcı adı ve parola yazın - I2P panonuzu anonimliğinizi kaldırarak kimliğinizi ortaya çıkarabilecek saldırılardan korumak için bir kullanıcı adı ve parola eklemeniz önemle önerilir.

source: Go to <a href="http://localhost:7657/index">http://localhost:7657/index</a> and hit "Graceful restart", which restarts the JVM and reloads the client applications
de: Gehen Sie auf <a href="http://localhost:7657/index">http://localhost:7657/index</a> und klicken Sie auf "sanft neustarten", dieses startet die JVM neu und lädt die Klientenprogramme neu.
fr: Rendez-vous sur <a href="http://localhost:7657/index">http://localhost:7657/index.jsp</a> et sélectionnez « Redémarrage respectueux », ce qui redémarre la MVJ et recharge les applications client.
id: Kunjungi <a href="http://localhost:7657/index.jsp">http://localhost:7657/index.jsp</a> dan tekan "Graceful restart", yang me-restart JVM dan memuat ulang aplikasi klien.
ja: <a href="http://localhost:7657/index">http://localhost:7657/index</a>に行き「Graceful restart」を押します。 JVMが再始動されクライアントアプリが再起動されます。
pl: Przejdź do <a href="http://localhost:7657/index">http://localhost:7657/index</a> i kliknij „restart”, aby zrestartować JVM i przeładować aplikacje klienckie.
pt: Vá a <a href="http://localhost:7657/index">http://localhost:7657/index</a> e selecione "Reinício gracioso / Graceful restart", que reinicia a JVM e recarrega as aplicações cliente
tr: Go to <a href="http://localhost:7657/index">http://localhost:7657/index</a> adresine giderek "Uygun şekilde yeniden başlat" üzerine tıklayın ve Java sanal makinesini yeniden başlatarak istemci uygulamalarını yeniden yükleyin

source: After that fires up, you should now be able to reach your console remotely. Load the router console at <code>http://(System_IP):7657</code> and you will be prompted for the username and password you specified in step 2 above if your browser supports the authentication popup.
de: Nach dessen Start sollten Sie ihre Console von extern erreichen können. Laden sie die Routerconsole unter <code>http://(System_IP):7657</code> und falls Ihr Browser as Authentifizierungs PopUp unterstützt werden Sie nach dem Benutzernamen und Passwort gefragt, welche Sie im oberen Teil 2 eingegeben haben.
fr: Une fois que cela est fait, vous devriez maintenant être en mesure d’atteindre votre console à distance. Chargez la console du routeur sur <code>http://(System_IP):7657</code> et l’on vous demandera le nom d’utilisateur et le mot de passe que vous avez indiqués à l’étape 2 ci-dessus si votre navigateur prend en charge les fenêtres d’authentification.
id: Setelah itu menyala, kini anda bisa mencapai console anda dari jarak jauh. Muat router console di <code>http://(System_IP):7657</code> dan Anda akan diminta memasukkan nama pengguna dan kata sandi yang Anda tentukan pada langkah 2 di atas jika browser Anda mendukung popup autentikasi.
ja: 起動が済めば、コンソールにリモートでアクセスできるはずです。 ルーターコンソールを<code>http://(System_IP):7657</code>で読み込んでください。ブラウザが認証ポップアップに対応していれば、上記ステップ2で設定したユーザ名とパスワードの入力が促されます。
pl: Po restarcie, konsola powinna być dostępna zdalnie. Wejdź na swoją konsolę pod <code>http://(publiczny adres IP):7657</code> i wpisz uprzednio zdefiniowaną nazwę użytkownika i hasło, jeżeli Twoja przeglądarka obsługuje okienko uwierzytelniania.
pt: Depois de o sistema ser ativado, deverá ser possível aceder à consola remotamente. Carregue a consola do roteador em <code>http://(System_IP):7657</code> e ser-lhe-á pedido o nome de utilizador e a palavra-passe que especificou no passo 2 acima, se o seu navegador suportar o popup de autenticação.
tr: Yeniden başlatıldıktan sonra, panoya uzaktan erişebilmeniz gerekir.. <code>http://(System_IP):7657</code> adresinden yöneltici panosunu yüklediğinizde, tarayıcınız kimlik doğrulama açılan penceresi özelliğini destekliyorsa, 2. adımda belirlediğiniz kullanıcı adı ve parolayı yazmanız istenir.

source: NOTE: You can specify 0.0.0.0 in the above configuration. This specifies an interface, not a network or netmask. 0.0.0.0 means "bind to all interfaces", so it can be reachable on 127.0.0.1:7657 as well as any LAN/WAN IP. Be careful when using this option as the console will be available on ALL addresses configured on your system.
de: HINWEIS: Sie können in der obigen Konfiguration 0.0.0.0 eingeben, dieses spezifiziert ein Interface, kein Netzwerk oder Netzmaske. 0.0.0.0 bedeutet: "ann alle Interfaces binden", damit ist es auf 127.0.0.1:7657 als auch unter jeglicher LAN/WAN IP erreichbar. Lassen Sie Vorsicht walten beim Nutzen dieser Option, da die Konsole damit auf ALLEN auf dem System eingerichteten IP Adressen erreichbar ist.
fr: NOTE : Vous pouvez indiquer 0.0.0.0 dans la configuration ci-dessus, pour une interface, pas pour un réseau ou un masque réseau. 0.0.0.0 signifie « lier à toutes les interfaces », de sorte qu’elle peut être accessible sur 127.0.0.1:7657 ainsi que toute autre IP de réseau local ou étendu. Soyez prudent en utilisant cette adresse, car la console sera proposée pour TOUTES les adresses configurées sur votre système.
id: CATATAN: Anda dapat memasukkan 0.0.0.0 pada konfigurasi di atas. Ini menentukan interface, bukan jaringan atau netmask. 0.0.0.0 berarti "bind to all interface", sehingga dapat diakses di 127.0.0.1:7657 serta di LAN/WAN IP mana saja. Berhati-hatilah saat menggunakan opsi ini karena console Anda akan tersedia di SEMUA alamat yang dikonfigurasi di sistem Anda.
ja: 注：上記の設定で0.0.0.0を指定することができます。 これはネットワークやネットマスクではなく、あるインターフェイスを設定します。 0.0.0.0は「全てのインターフェイスにバインドする」ことを意味します。だから 127.0.0.1:7657 だけでなく、あらゆるLAN/WAN IPでアクセス可能になります。 この設定を使う場合は注意が必要です。なぜならシステム上で設定される**全ての**アドレス上でコンソールが利用可能になるからです。
pl: Uwaga: możesz wpisać w powyższej konfiguracji 0.0.0.0. Jest to określenie interfejsu sieciowego, nie sieci lub maski podsieci. 0.0.0.0 oznacza podpięcie się pod wszystkie interfejsy sieciowe, więc będzie osiągalne zarówno z 127.0.0.1:7657, z sieci lokalnej (LAN) i z internetu (WAN). Bądź ostrożny/a korzystając z tej opcji, ponieważ konsola będzie wtedy dostępna ze WSZYSTKICH adresów skonfigurowanych w systemie.
pt: NOTA: pode especificar 0.0.0.0 na configuração acima. Isto especifica uma interface, não uma rede ou máscara de rede. 0.0.0.0 significa “ligar-se a todas as interfaces”, pelo que pode ser contactável em 127.0.0.1:7657, bem como em qualquer IP LAN/WAN. Tenha cuidado ao utilizar esta opção, pois a consola estará disponível em TODOS os endereços configurados no seu sistema.
tr: NOT: Yukarıdaki yapılandırmada 0.0.0.0 olarak belirtebilirsiniz. Bu değer bir ağı ya da ağ maskesini değil bir arabirimi belirtir. 0.0.0.0 değeri "tüm arabirimlere bağlanılabilsin" anlamına gelir. Tüm yerel ya da geniş alan ağlarından 127.0.0.1:7657 adresine bağlanılabilir. Sisteminizin kullandığı TÜM adreslerden pano bağlantısı kurulabilmesine yol açacağı için bu seçeneği kullanırken dikkatli olun.

source: Please see the previous answer for instructions on using SSH Port Forwarding, and also see this page in your console: <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a>
de: Siehe Anleitung für SSH-Port-Weiterleitungen in der vorherigen Antwort sowie folgende Seite in der Konsole: <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a>
fr: Pour des instructions sur l’utilisation du réacheminement de port SSH, consultez la réponse précédente et cette page de votre console : <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a>
id: Silakan lihat jawaban sebelumnya untuk instruksi tentang menggunakan SSH Port Forwarding, dan juga lihat halaman ini di console Anda: <a href="http://localhost:7657/configi2cp"> http://localhost:7657/configi2cp</a>
ja: 1つ前の回答を参照し、SSHポートフォワーディングについての手順を確認してください。またコンソールの <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a> を参照してください。
pl: Przeczytaj odpowiedź na poprzednie pytanie odnośnie instrukcji przekierowania portów przez SSH, zajrzyj również na stronę w konsoli węzła: <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a>.
pt: Consulte a resposta anterior para obter instruções sobre a utilização do reencaminhamento de portas SSH e veja também esta página na sua consola: <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a>
tr: SSH Bağlantı Noktası Yönlendirmesini kullanmak ile ilgili bilgi almak için önceki yanıta ve panonuzdaki şu sayfaya bakabilirsiniz: <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a>

source: The SOCKS proxy has been functional since release 0.7.1. SOCKS 4/4a/5 are supported. I2P does not have a SOCKS outproxy so it is limited to use within I2P only.
de: Der SOCKS Proxy ist seit Version 0.7.1 funktional, es werden SOCKS 4/4a/5 unterstützt. I2P hat keinen SOCKS outproxy, somit ist die Nutzung auf I2P interne Services begrenzt.
fr: Le mandataire SOCKS est fonctionnel depuis la version 0.7.1. SOCKS 4/4a/5 sont pris en charge. I2P n’a pas de mandataire sortant SOCKS, son utilité est donc limitée à I2P seulement.
id: Proxy SOCKS sudah berfungsi sejak pada rilis 0.7.1. SOCKS 4/4a/5 sudah didukung. I2P tidak memiliki outproxy SOCKS sehingga terbatas untuk digunakan dalam I2P saja.
ja: バージョン0.7.1以降SOCKS 4/4a/5がサポートされており、SOCKSプロキシは使用可能です。 I2PはSOCKS アウトプロキシを持たないので、I2P内の利用に限定されます。
pl: Proxy SOCKS działa od wydania 0.7.1. Wspierane są SOCKS 4/4a/5. I2P nie ma proxy wyjściowego SOCKS, więc będzie to użyteczne tylko do przeglądania domen .i2p.
pt: O proxy SOCKS está funcional desde a versão 0.7.1. SOCKS 4/4a/5 são suportados. A I2P não tem um outproxy SOCKS, pelo que a sua utilização está limitada apenas à I2P.
tr: SOCKS vekil sunucusu 0.7.1 sürümüyle eklendi. SOCKS 4/4a/5 sürümleri destekleniyor. I2P ağı için bir SOCKS çıkış vekil sunucusu bulunmadığından bu yalnızca I2P içinde kullanılabilir.

source: Many applications leak sensitive information that could identify you on the Internet and this is a risk that one should be aware of when using the I2P SOCKS proxy. I2P only filters connection data, but if the program you intend to run sends this information as content, I2P has no way to protect your anonymity. For example, some mail applications will send the IP address of the machine they are running on to a mail server. There is no way for I2P to filter this, thus using I2P to 'socksify' existing applications is possible, but extremely dangerous.
de: Viele Programme geben viele sensitive Informationen preis, anhand derer Sie im Internet indentifiziert werden können. Dieses ist ein Risiko bei der Nutzung des I2P SOCKS Proxies. I2P filtert nur die Verbindungsdaten aus, aber das von Ihnen genutzte Programm sendet diese Informationen als Inhalt, I2P hat so keine Möglichkeit, diese zu filtern und Ihre Anonymität zu schützen. Z.B. senden manche Email Programme ihre IP Adresse zum Email Server. Es gibt keine Möglichkeit von I2P dieses auszufiltern, somit ist I2P zum Nutzen von `SOCKS´ mit den Programmen möglich, aber sehr gefährlich.
fr: De nombreuses applications divulguent des renseignements délicats qui pourraient vous identifier sur Internet, et il faut en être conscient si vous utilisez le mandataire SOCKS d’I2P. I2P ne filtre que les données de connexion, mais si le programme que vous avez l’intention d’exécuter envoie ces informations comme contenu, I2P ne peut pas protéger votre anonymat. Par exemple, certaines applications de courriel enverront à un serveur de courriel l’adresse IP de la machine sur laquelle elles tournent. I2P ne peut juste pas le filtrer. Il est donc possible d’utiliser I2P pour « socksifier » des applications existantes, mais cela est extrêmement dangereux.
id: Banyak aplikasi membocorkan informasi sensitif yang dapat mengidentifikasi Anda di internet dan ini adalah risiko yang harus diperhatikan ketika menggunakan proxy SOCKS I2P. I2P hanya menyaring data koneksi, tetapi jika program yang ingin Anda jalankan mengirimkan informasi ini sebagai konten, I2P tidak memiliki cara untuk melindungi anonimitas Anda. Misalnya, beberapa aplikasi email akan mengirimkan alamat IP mesin yang dijalankannya ke server email. Tidak ada cara bagi I2P untuk menyaring hal ini, sehingga menggunakan I2P untuk 'socksify' aplikasi yang ada adalah mungkin dilakukan, namun ini sangat berbahaya.
ja: ネット上の個人特定につながる機密情報を漏洩するアプリケーションは多いです。これはI2P SOCKSプロキシを使用する際に注意しておかなければならないリスクです。 I2Pは接続データのフィルタリングしかしませんが、あなたが立ちあげたいプログラムが機密情報を内容として送っていたら、I2Pにあなたの匿名性を保護する術はありません。 例えば、一部のメーラーは動作しているマシンのIPアドレスをメールサーバーへ送信します。 これを取り除く術をI2Pは持っていません。よって既存のアプリケーションを'sock化'するためにI2Pを使うことはできますが、極めて危険です。
pl: Wiele aplikacji może powodować wyciek wrażliwych danych, które mogą Cię zdemaskować, więc zaleca się ostrożność podczas korzystania przez I2P z proxy SOCKS. I2P anonimizuje tylko informacje o połączeniu, ale jeżeli jakaś aplikacja przesyła te informacje w zawartości, oprogramowanie I2P nie ma możliwości chronić Twojej prywatności. Przykład: niektóre klienty pocztowe przesyłają adres IP systemu na którym pracują na serwera pocztowego. I2P nie ma możliwości odfiltrować tych informacji, więc używanie I2P jako proxy SOCKS dla aplikacji jest możliwe, ale niezwykle niebezpieczne.
pt: Muitas aplicações divulgam informações sensíveis que podem identificar o utilizador na Internet e este é um risco que deve ser tido em conta quando se utiliza o proxy SOCKS I2P. O I2P apenas filtra os dados das conexões, mas se o programa que pretende executar enviar estas informações como conteúdo, o I2P não tem forma de proteger o seu anonimato. Por exemplo, algumas aplicações de correio enviarão o endereço IP da máquina em que estão a ser executadas para um servidor de correio. Não há forma de a I2P filtrar este facto, pelo que a utilização da I2P para “socksificar” aplicações existentes é possível, mas extremamente perigosa.
tr: Birçok uygulama İnternet üzerinde kimliğinizin açığa çıkmasına neden olabilecek hassas bilgileri sızdırıyor ve I2P SOCKS vekil sunucusunu kullanırken bunu unutmamalısınız. I2P yalnızca bağlantı verilerini süzer, ancak çalıştırmayı düşündüğünüz uygulama bu bilgileri içerik olarak gönderiyorsa, I2P hiç bir şekilde anonim kalmanızı sağlayamaz. Örneğin, bazı e-posta uygulamaları, çalıştıkları bilgisayarın IP adresini bir e-posta sunucusuna gönderir. Bu bilginin I2P tarafından süzülmesinin bir yolu yoktur. Bu nedenle var olan uygulamaları 'socks' üzerinden geçirmek için I2P kullanılabilir ancak bu durum çok tehlikelidir.
