Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Note that this quick-start approach is not recommended for production deployments on remote servers. Please read the rest of this document for more information.
fr: Prenez note que cette approche de démarrage rapide n'est pas recommandée pour les déploiements de production sur des serveurs à distance. Veuillez lire le reste de ce document pour plus d'information.
id: Perhatikan bahwa pendekatan cepat ini tidak disarankan untuk server produksi di remote server. Silakan baca dokumen ini untuk informasi lebih lanjut.
pt: Note que esse método de início rápido não é recomendado para implantação de produção em servidores remotos. Por favor, leia o resto deste documento para mais informações.
tr: Bu hızlı başlangıç yaklaşımının uzak sunuculardaki üretim dağıtımları için önerilmediğini unutmayın. Ayrıntılı bilgi almak için lütfen bu belgenin geri kalanını okuyun.

source: Building an image
fr: Construire une image
id: Membangun image I2P
ja: イメージをビルドする
pt: Construindo uma imagem
tr: Bir kalıp oluşturmak

source: There is an i2P image available over at <a href="https://hub.docker.com">DockerHub</a>. If you do not want to use that one, you can build one yourself:
fr: Il y a une image I2P proposée sur <a href="https://hub.docker.com">DockerHub</a>. Si vous ne voulez pas utiliser celle-là, vous pouvez en construire une vous-même :
id: Ada image I2P yang tersedia di <a href="https://hub.docker.com"> DockerHub </a>. Jika Anda tidak ingin menggunakan image tersebut, Anda dapat membangunnya image sendiri:
ja: <a href="https://hub.docker.com">DockerHub</a>でI2Pのイメージが利用可能です。これを使用したくない場合は、自分でビルドできます:
pt: Existe uma imagem I2P disponível no <a href="https://hub.docker.com">DockerHub</a>. Se você não quiser usar essa, você próprio pode construir uma:
tr: <a href="https://hub.docker.com">DockerHub</a> üzerinde var olan bir i2P kalıbı var. Bunu kullanmak istemiyorsanız, kendiniz de oluşturabilirsiniz:

source: Running a container
fr: Exécutez un conteneur
id: Menjalankan container
ja: コンテナを実行
pt: Executando um contêiner
tr: Bir kapsayıcı çalıştırmak

source: Volumes
ja: ボリューム
tr: Birimler

source: The container requires a volume for the configuration data to be mounted. Optionally, you can mount a separate volume for torrent (“i2psnark”) downloads. See the example below.
fr: Le conteneur requiert un volume pour les données de configuration pour qu'il soit monté. Autrement, vous pouvez monter un volume séparé pour les téléchargements torrent ("i2psnark"). Voir les exemples ci-dessous.
id: Container membutuhkan volume untuk data konfigurasi yang akan dipasang. Secara opsional, Anda dapat memasang volume terpisah untuk unduhan torrent ("i2psnark"). Lihat contoh di bawah ini.
ja: コンテナには、設定データがマウントされるボリュームが必要です。任意で、トレント（"i2psnark"）ダウンロード用に別のボリュームをマウントすることができます。以下の例を参照してください。
pt: O contêiner requer um volume para os dados de configuração serem montados. Opcionalmente, você pode montar um volume separado para downloads de torrent ("i2psnark"). Veja o exemplo abaixo.
tr: Kapsayıcı, takılacak yapılandırma verileri için bir birim ister. İsteğe bağlı olarak, torrent ("i2psnark") indirmeleri için ayrı bir birim takabilirsiniz. Aşağıdaki örneğe bakın.

source: Memory usage
de: Arbeitsspeicher-Benutzung
es_ar: Uso de memoria
fr: Utilisation de la mémoire
id: Penggunaan memori
ja: メモリ使用量
pl: Zużycie pamięci
pt: Uso da memória
tr: Bellek kullanımı

source: By the default the image limits the memory available to the Java heap to 512MB. You can override that with the <code>JVM_XMX</code> environment variable.
fr: Par défaut, l'image limite la mémoire disponible à l'amas Java à 512MB. Vous pouvez outrepasser cela avec la variable environnementale <code>JVM_XMX</code>.
id: Secara default, sebuah image membatasi memori yang tersedia untuk Java heap hingga 512MB. Anda dapat mengubahnya dengan variabel lingkungan <code> JVM_XMX </code>.
ja: デフォルトで、イメージは Java ヒープが利用可能なメモリを512MBに制限しています。その数値は<code>JVM_XMX</code>環境変数で上書き可能です。
pt: Por padrão a imagem limita a memória disponível para a heap do Java a 512MB. Você pode sobrescrever isso com a variável de ambiente <code>JVM_XMX</code>.
tr: Varsayılan olarak kalıp, Java yığınının kullanabileceği belleği 512 MB ile sınırlar. Bunu <code>JVM_XMX</code> ortam değişkeniyle geçersiz kılabilirsiniz.

source: Ports
de: Anschlüsse
es_ar: puertos
ja: ポート
pl: Porty
pt: Portas
tr: Bağlantı noktaları

source: There are several ports which are exposed by the image. You can choose which ones to publish depending on your specific needs.
fr: Il y a plusieurs ports qui sont exposés par l'image. Vous pouvez choisir lesquels à publier en fonction de vos besoins.
id: Ada beberapa port yang diekspos oleh image. Anda dapat memilih mana yang akan dibuka tergantung pada kebutuhan spesifik Anda.
ja: イメージが外部に晒すポートがいくつかあります。ユーザー自身のニーズに合わせて、どれを公開するか選択することができます。
pt: Há várias portas que são expostas pela imagem. Você pode escolher quais publicar dependendo das suas necessidades específicas.
tr: Kalıp tarafından açılan birkaç bağlantı noktası vardır. Gereksinimlerinize göre hangilerini yayınlayacağınızı seçebilirsiniz.

source: Port
de: Anschluss
es_ar: Puerto
ja: ポート
pt: Porta
tr: Bağlantı noktası

source: Interface
de: Oberfläche
es_ar: Interfaz
ja: インターフェース
pl: Interfejs
tr: Arabirim

source: Description
de: Beschreibung
es_ar: Descripción
id: Uraian
ja: 説明
pl: Opis
pt: Descrição
tr: Açıklama

source: HTTP Proxy
es_ar: Proxy HTTP
fr: Mandataire HTTP
id: Proxy HTTP
ja: HTTP プロキシ
tr: HTTP vekil sunucusu

source: HTTPS Proxy
fr: HTTPS Mandataire
id: Proxy HTTPS
ja: HTTPS プロキシ
pt: Proxy HTTPS
tr: HTTPS vekil sunucusu

source: IRC Proxy
fr: IRC Mandataire
id: Proxy IRC
ja: IRC プロキシ
pt: Proxy IRC
tr: IRC vekil sunucusu

source: I2CP Protocol
fr: Protocole I2CP
id: Protokol I2CP
ja: I2CP プロトコル
pt: Protocolo I2CP
tr: I2CP iletişim kuralı

source: SAM Bridge TCP
fr: Pont SAM TCP
ja: SAM ブリッジ TCP
pt: TCP da Ponte SAM
tr: SAM köprü TCP

source: Router console
fr: Console du routeur
ja: ルーターコンソール
pl: konsola Routera
pt: Console do roteador
tr: Yöneltici panosu

source: I2P Site
de: I2P-Portal
fr: Site I2P
id: Situs I2P
ja: I2P サイト
pl: Strona I2P
pt: Site I2P
tr: I2P sitesi

source: SMTP Proxy
fr: SMTP Mandataire
ja: SMTP プロキシ
pt: Proxy SMTP
tr: SMTP vekil sunucusu

source: POP3 Proxy
fr: POP3 Mandataire
id: Proxy POP3
ja: POP3 プロキシ
pt: Proxy POP3
tr: POP3 vekil sunucusu

source: LAN interface
fr: interface LAN
ja: LANインターフェース
pt: Interface LAN
tr: Yerel ağ arayüzü

source: I2NP Protocol
fr: Protocole I2NP
id: Protokol I2NP
ja: I2NP プロトコル
pl: Protokół I2NP
pt: Protocolo I2NP
tr: I2NP iletişim kuralı

source: TCP and UDP
fr: TCP et UDP
id: TCP dan UDP
ja: TCP と UDP
pl: TCP i UDP
pt: TCP e UDP
tr: TCP ve UDP

source: You probably want at least the Router Console (7657) and the HTTP Proxy (4444). If you want I2P to be able to receive incoming connections from the internet, and hence not think it’s firewalled, publish the I2NP Protocol port (12345) - but make sure you publish to a different random port, otherwise others may be able to guess you’re running I2P in a Docker image.
fr: Vous avez probablement envie d'avoir au moins la console du routeur (7657) et le mandataire HTTP (4444). Si vous voulez que I2P puisse recevoir les connexions entrantes d'internet et ne pense plus que c'est derrière un pare-feu, publiez le port de Protocole I2NP (12345)- mais faites bien attention à le publier à un port différent aléatoire, autrement les autres pourront distinguer que vous faites tourner I2P dans un image Docker.
id: Anda mungkin setidaknya menggunakan Router Console (7657) dan HTTP Proxy (4444). Jika Anda ingin I2P dapat menerima koneksi dari internet, dan karenanya tidak ada firewall, buka port Protokol I2NP (12345) - tetapi pastikan Anda mempublikasikan ke port acak yang berbeda, jika tidak, orang lain mungkin dapat menebak Anda sedang menjalankan I2P dalam image Docker.
ja: 少なくともルーターコンソール(7657)とHTTPプロキシ(4444)は必要でしょう。もしI2Pがインターネットからの接続を受信でき、ファイアーウォールに遮断されていないようにする場合は、I2NPプロトコルポート(12345)を公開します。ただし、必ず別の無作為なポートに公開してください。そうしなければ、Docker イメージでI2Pを実行していると他者が推測可能である可能性があります。
pt: Você provavelmente quer pelo menos o Console do Roteador (7657) e o Proxy HTTP (4444). Se você quiser que a I2P possa receber conexões de entrada da internet, e portanto não achar que está sob firewall, publique a porta do protocolo I2NP Protocol port (12345) - mas certifique-se de publicar para uma porta aleatória diferente, senão outros podem adivinhar que você está executando a I2P em uma imagem Docker.
tr: Büyük olasılıkla en azından yöneltici panosu (7657) ve HTTP vekil sunucusunu (4444) isteyeceksiniz. I2P uygulamasının İnternet üzerinden gelen bağlantıları alabilmesini istiyorsanız ve bu nedenle güvenlik duvarı arkasında olduğunu düşünmüyorsanız, I2NP iletişim kuralı bağlantı noktasını (12345) yayınlayın. Ancak farklı bir rastgele bağlantı noktasına yayınladığınızdan emin olun. Yoksa başkaları Docker kalıbında I2P çalıştırdığınızı anlayabilir.

source: Networking
de: Netzwerk
es_ar: Red
fr: Mise en réseau
id: Jaringan
pt: Rede
tr: Ağ yapılandırması

source: A best-practices guide for cloud deployments is beyond the scope of this document, but in general you should try to minimize the number of published ports, while exposing only the I2NP ports to the internet. That means that the services in the list above which are bound to 127.0.0.1 (which include the router console) will need to be accessed via other methods like ssh tunneling or be manually configured to bind to a different interface.
fr: Un guide des bonnes pratiques pour les déploiements est au-delà de la portée de ce document, mais en général vous devrez essayer de minimiser le nombre de ports publiés tout en exposant seulement les ports I2NP à internet. Cela veut dire que les services sur la liste ci-dessus qui sont liés 127.0.0.1 (ce qui inclut la console du routeur) devront être accéder par d'autres moyens comme creuser un tunnel ssh ou être configuré manuellement pour être lié à une nouvelle interface.
id: Panduan praktik terbaik untuk penerapan cloud berada di luar cakupan dokumen ini, namun secara umum Anda harus mencoba meminimalkan jumlah port yang dibuka, sambil hanya mengekspos port I2NP ke internet. Itu berarti bahwa layanan dalam daftar di atas yang terikat pada 127.0.0.1 (yang termasuk router console) perlu diakses melalui metode lain seperti tunneling SSH atau dikonfigurasi secara manual untuk binding ke interface yang berbeda.
pt: Um guia de boas práticas para implantações em nuvem está além do escopo deste documento, mas em geral você deve tentar minimizar o número de portas publicadas, enquanto expõe apenas as portas I2NP à internet. Isso significa que os serviços na lista acima que são vinculados a 127.0.0.1 (o que inclui o console do roteador) precisarão ser acessados através de outros métodos, como tunelamento ssh, ou ser manualmente configurados para se vincularem a uma interface diferente.
tr: Bulut dağıtımları için en iyi uygulamalar rehberi bu belgenin kapsamı dışındadır. Ancak genel olarak yalnızca I2NP bağlantı noktalarını internete açmalı ve yayınlanan bağlantı noktası sayısını en aza indirmeye çalışmalısınız. Bu durumda, yukarıdaki listede yer alan ve 127.0.0.1 adresine bağlı (yöneltici panosunun bulunduğu) hizmetlere SSH tünelleme gibi diğer yöntemlerle erişilmesi ya da farklı bir arabirime bağlanacak şekilde el ile yapılandırılması gerekir.

source: Example
de: Beispiele
es_ar: de ejemplo
fr: Exemple
id: Contohnya:
ja: 例
pl: Przykład
pt: Exemplo
tr: Örnek

source: Here is an example container that mounts <code>i2phome</code> as home directory, <code>i2ptorrents</code> for torrents, and opens HTTP Proxy, IRC, Router Console and I2NP Protocols. It also limits the memory available to the JVM to 256MB.
fr: Voilà un exemple de conteneur qui qui monte <code>i2phome</code> en répertoire domestique, <code>i2ptorrents</code> pour les torrents et ouvre les protocoles mandataire HTTP, IRC, console du routeur et I2NP. Il limite aussi la mémoire disponible du JVM à 256MB.
id: Berikut adalah contoh container yang memasang <code>i2phome</code> sebagai direktori home, <code>i2ptorrents</code> untuk torrent, dan membuka HTTP Proxy, IRC, Router Console, dan Protokol I2NP. Ini juga membatasi memori yang tersedia untuk JVM hingga 256MB.
ja: ここでは、 <code>i2phome</code> をホームディレクトリとしてマウントし、トレント用に <code>i2ptorrents</code> をマウントし、HTTP プロキシ、IRC、ルーターコンソール、I2NP プロトコル を開放するコンテナの例を示します。また、JVM が利用できるメモリは 256MB に制限されています。
pt: Aqui está um exemplo que monta <code>i2phome</code> como o diretório home, <code>i2ptorrents</code> para torrents, e abre o Proxy HTTP, IRC, Painel do Roteador e Protocolos I2NP. Ele também limita a memória disponível à JVM a 256MB.
tr: Ana klasör olarak <code>i2phome</code> , torrentler için <code>i2ptorrents</code> kullanan ve HTTP vekil sunucusu, IRC, yöneltici panosu ve I2NP iletişim kurallarını açan örnek bir kapsayıcı. Ayrıca JVM tarafından kullanabilecek belleği 256 MB ile sınırlar.

source: I2P Easy Install Bundle (Beta) for Windows
fr: Paquet I2P Facile à Installer (Beta) pour Windows
id: I2P Easy Install Bundle (Beta) untuk Windows
ja: Windows用 I2P イージーインストールバンドル（ベータ版）
pl: Łatwy Pakiet Instalacyjny I2P (Beta) dla Windowsa
pt: Pacote de Instalação Fácil da I2P (Beta) para Windows
tr: Windows için kolay I2P kurulum paketi (beta)

source: This is an "All-in-One" installer for Windows 10 which includes the complete I2P desktop software and all of its dependencies in a single, easy-to-install package. It is built on the premise that I2P should be easy, and that we should help our users get their initial configuration in place instead of requiring an elaborate install process. To learn more about the Firefox profile that comes bundled with this installer, visit <a href="%(firefox)s">The Firefox Profile Page</a>.
fr: C'est un programme d'installation "tout-en-un" pour Windows 10 qui inclut le navigateur de bureau complet I2P et toute ces dépendances dans un seul paquet facile à installer. Il est construit sur le principe que I2P doit être facile et que nous devons aider nos utilisateurs à avoir leur configuration initiale en place au lieu d'avoir besoin d'un processus d'installation élaboré. Pour en apprendre plus sur le profil qui est inclut avec le paquet de ce programme d'installation, veuillez visiter <a href="%(firefox)s">La page de profil Firefox</a>.
id: Ini adalah penginstal "All-in-One" untuk Windows 10 yang mencakup perangkat lunak desktop I2P lengkap dan semua dependensinya dalam satu kemasan yang mudah diinstal. Itu dibangun di atas premis bahwa I2P seharusnya mudah digunakan, dan bahwa kita harus membantu pengguna kami langsung mendapatkan konfigurasi awal tanpa proses instalasi yang rumit. Untuk mempelajari lebih lanjut tentang profil firefox yang dilengkapi dengan installer ini, kunjungi <a href="%(firefox)s"> Halaman profil Firefox /a>.
ja: これは、完全な I2P デスクトップソフトウェアと依存関係のすべてを一つの簡単に インストールできるパッケージにまとめた Windows 10用の「オールインワン」 インストーラーです。I2Pは簡単であるべきであり、我々は込み入ったインストールプロセス を要求するのでなく、ユーザーが初期設定を適切に行う助けとなるべきであるという 前提の下に作られました。インストーラーにバンドルされているFirefox のプロファイル の詳細については<a href="%(firefox)s">Firefox のプロファイルページ</a>をご覧ください。
pt: Este é um instalador "tudo-em-um" para Windows 10 que inclui o software de desktop I2P completo e todas suas dependências em um pacote único e fácil de instalar. Ele é construído sobre a premissa de que a I2P deveria ser fácil, e que nós deveríamos ajudar nossos usuários a fazer sua configuração inicial ao invés de exigir um processo de instalação elaborado. Para saber mais sobre o perfil do Firefox que vem empacotado com este instalador, visite <a href="%(firefox)s">A Página do Perfil do Firefox</a>.
tr: Windows 10 için I2P masaüstü yazılımı ve tüm bağımlılıkları için, eksiksiz, kurulumu kolay bir "Tümü bir arada" kurucu paketi. I2P kurulumunun kolay olması gerektiği ve ayrıntılı bir kurulum süreci yerine kullanıcıların ilk yapılandırmalarını kolayca yapabilmesine yardımcı olmamız gerektiği fikri üzerine hazırlandı. Bu kurucuyla birlikte gelen Firefox profili hakkında ayrıntılı bilgi almak için <a href="%(firefox)s">Firefox profil sayfasına</a> bakabilirsiniz.

source: What do I need to use it?
fr: De quoi ai-je besoin pour l'utiliser ?
id: Apa yang saya perlukan untuk menggunakannya?
ja: 使うのに何が必要ですか？
pl: Czego potrzebuję, żeby tego używać?
pt: Do que eu preciso para usá-lo?
tr: Kullanmak için ne gerekiyor?

source: Just Firefox (Or Tor Browser).
fr: Simplement Firefox (ou le navigateur Tor).
id: Hanya Firefox (atau Tor Browser).
ja: Firefox （か Tor ブラウザ）だけです。
pl: Tylko Firefox (lub Przeglądarka Tor).
pt: Apenas do Firefox (Ou do Navegador Tor).
tr: Yalnızca Firefox (ya da Tor Browser).

source: This installer still requires Firefox to be installed on the system, it does not bundle a Firefox installer of its own. Please obtain Firefox from Mozilla, or Tor Browser from the Tor Project or one of their mirrors. If you would like to discuss supporting other browsers, please join the discussionon the <a href="%(issueurl)s">Gitlab Issue</a>. This is a Windows-only product.
fr: Ce programme d'installation requiert toujours que Firefox soit installé sur ce système, il ne regroupe pas un programme d'installation Firefox de lui-même. Veuillez vous procurer Firefox de Mozilla ou le navigateur Tor du Projet Tor ou un de ces miroirs. Si vous voulez discuter la prise en charge d'autres navigateurs, veuillez rejoindre la discussion sur le <a href="%(issueurl)s">Problème Gitlab</a>. C'est un produit uniquement sur Windows.
id: Penginstal ini masih membutuhkan Firefox, installer firefox tidak dimasukkan ke dalam installer. Silakan unduh Firefox dari Mozilla, atau Tor Browser dari Proyek Tor atau salah satu mirrornya. Jika Anda mau mendukung browser lain, silakan bergabung dalam diskusi di <a href="%(issueurl)s">Gitlab Issue</a>. Produk ini hanya untuk Windows.
ja: このインストーラーはシステムに Firefox がインストールされていることを要求しますが、 それ自身に Firefox のインストーラーをバンドルしていません。Firefox を Mozilla から または Tor ブラウザを Tor Project かそのミラーの一つから入手してください。 他のブラウザのサポートについて議論したい場合は、<a href="%(issueurl)s">Gitlab Issue</a>の議論に参加してください。 これは Windows限定のプロダクトです。
pt: Este instalador ainda requer que o Firefox esteja instalado no sistema. Ele não tem empacotado um próprio instalador do Firefox. Por favor, obtenha o Firefox da Mozilla, ou o Navegador Tor do projeto Tor ou um dos seus mirrors. Se você gostaria de discutir suportar outros navegadores, por favor, entre na discussão na <a href="%(issueurl)s">Issue do Gitlab</a>. Este é um produto apenas para Windows.
tr: Bu kurucu için, sistemde hala Firefox uygulamasının kurulu olması gerekir. Pakette Firefox kurucusu bulunmaz. Lütfen Mozilla sitesinden Firefox ya da Tor Projesi sitesinden Tor Browser uygulamalarını alın. Diğer tarayıcıların desteklenmesini tartışmak isterseniz, <a href="%(issueurl)s">GitLab konusuna</a> katılabilirsiniz. Bu ürün yalnızca Windows içindir.

source: Why should I use it?
fr: Pourquoi devrais-je l'utiliser ?
id: Mengapa saya harus menggunakannya?
ja: なぜそれを使わなければいけないのですか？
pl: Dlaczego powinienem tego używać?
pt: Por que eu deveria usá-lo?
tr: Neden kullanmalıyım?

source: This installer package reduces the number of steps required to install an I2P router on Windows from about 30 to a matter of completing a single, familiar installer process, combining the I2P installation and Browser configuration into the same steps. Besides that, it launches the user directly into the automatically configured I2P browser with their applications ready-to-use, with no need to refer to potentially unhelpful system-wide Windows settings. The I2P it uses is otherwise identical to the "regular" I2P.
fr: Ce paquet de programme d'installation réduit le nombre d'étapes requises pour installer un routeur I2P sur Windows de à peu près 30 à compléter un seul processus d'installation familier, combinant l'installation de I2P et la configuration du navigateur en une seule étape. Par ailleurs, il dirige directement l'utilisateur dans le navigateur I2P automatiquement configuré avec ces applications prêtes à l'utilisation sans avoir besoin de paramètres de système Windows potentiellement peu serviables. L'I2P qu'il utilise est autrement identique au I2P "habituel".
id: Paket penginstal ini mengurangi jumlah langkah yang diperlukan untuk menginstal I2P router di Windows dari sekitar 30 langkah hingga hanya satu langkah, dengan proses penginstal yang familiar, yang menggabungkan instalasi I2P dan konfigurasi Browser menjadi langkah yang sama. Selain itu, installer mengarahkan pengguna langsung ke Browser I2P yang dikonfigurasi secara otomatis dengan aplikasi mereka siap digunakan, tidak perlu merujuk pada pengaturan umum di Windows yang berpotensi tidak memberikan efek apa pun. I2P Penggunaannya identik dengan I2P "biasa".
ja: このインストーラーパッケージは I2P ルーターを Windows 上にインストールするのに 必要なたくさんのプロセスを、約30個からたった1つの慣れ親しんだインストール プロセスに減らしており、I2P のインストールとブラウザ設定を同一のステップに 合体させています。その他にも、もしかすると役に立たないシステム全体の Windows 設定を 参照する必要もなく、使用準備がととのったアプリケーションと共に設定がなされた I2P ブラウザへと自動的にユーザーを送り出します。使用する I2P は それ以外の点では「通常」の I2P とまったく同じです。
pt: Esse pacote instalador reduz o número de passos necessários para instalar um roteador I2P no Windows de cerca de 30 para uma questão de completar um processo de instalação único e familiar, combinando a instalação da I2P e a configuração do Navegador no mesmo passo. Além disso, ele leva o usuário diretamente ao navegador I2P configurado automaticamente com suas aplicações prontas para uso, sem necessidade de recorrer a configurações, potencialmente inúteis, do Windows a nível de sistema. A I2P que ele usa é, fora isso, idêntica à I2P "normal".
tr: Bu kurulum paketi, Windows üzerinde bir I2P yöneltici kurmak için gereken 30 adım yerine, I2P kurulumu ve tarayıcı yapılandırmasını aynı adımlarda birleştirerek tek bir tanıdık kurulum sürecine indirger. Bunun yanında, kullanıcıyı pek yardımı olmayan sistem geneli Windows ayarlarına yönlendirmeden, doğrudan uygulamaları kullanıma hazır olan otomatik olarak yapılandırılmış I2P tarayıcısına yönlendirir. Bunun dışında kullandığı I2P, "normal" I2P ile aynıdır.

source: How do I use it?
de: Wie verwende ich es?
es_ar: ¿Cómo lo uso?
fr: Comment faire pour l’utiliser ?
id: Bagaimana cara menggunakannya?
ja: 使い方はどうすればいいのですか？
pl: Jak się z tego korzysta?
pt: Como eu o uso?
tr: Nasıl kullanırım?

source: First, download and install <a href="%(firefox)s">Firefox</a>, then, just download and install this installer(below). To start an installer, "double-click" the downloaded .exe file.
fr: Premièrement, téléchargez et installez <a href="%(firefox)s">Firefox</a> puis simplement téléchargez et installez ce programme d'installation (ci-dessous). Pour démarrer un programme d'installation, "cliquez deux fois" sur le fichier .exe téléchargé.
id: Pertama, unduh dan instal <a href="%(firefox)s"> Firefox </a> lalu cukup unduh dan instal installer ini (lihat di bawah). Untuk memulai instal, "klik dua kali" file .exe yang diunduh.
ja: まず、<a href="%(firefox)s">Firefox</a>をダウンロードしてインストールしてから、 この(以下の)インストーラーをダウンロードしてインストールするだけです。 インストーラーを起動するには、ダウンロードした .exe ファイルをダブルクリックしてください。
pt: Primeiro, baixe e instale o <a href="%(firefox)s">Firefox</a>, então, simplesmente baixe e instale este instalador (abaixo). Para iniciar o instalador, dê um "clique duplo" no arquivo .exe baixado.
tr: Önce <a href="%(firefox)s">Firefox</a> indirip kurun, ardından aşağıdaki kurucuyu indirip çalıştırmanız yeterlidir. Bir kurulum başlatmak için, indirilen .exe dosyasına "çift tıklayın".
