Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: I2P does not encrypt the Internet, neither does Tor - for example, through <a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">Transport Layer Security (TLS)</a>. I2P and Tor both aim to transport your traffic as-is securely and anonymously over the corresponding network, to its destination. Any unencrypted traffic generated at your system will arrive at the outproxy (on I2P) or the exit node (on Tor) as unencrypted traffic. This means that you are vulnerable to snooping by the outproxy operators. One way to protect your outproxy traffic against this is to ensure that any traffic that will be handled by the outproxy is encrypted with TLS.
de: I2P verschlüsselt nicht das Internet, Tor aber auch nicht - wie z.B. mittels der <a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">Transport Layer Securtiy (TLS)</a>. I2Ps und Tors Zielsetzung ist der sichere und anonyme Transport der unmodifizierten Daten über das jeweilige Netzwerk zum Ziel. Jede nicht verschlüsselte, auf Ihrem System erzeugte Daten werden am Outproxy (in I2P) oder am Exit Node (in Tor) als unverschlüsselte Daten ankommen. Dieses bedeuted, dass Sie für das abhorchen der Daten vom Outproxy Betreiber verwundbar sind. Eine Art ihre Outproxy Daten gegen diesen Angriff zu sichern ist, sicherzustellen, das jegliche Art von Daten, die über den Outproxy gehen, mittel TLS verschlüsselt sind.
fr: I2P ne chiffre pas Internet et Tor ne le fait pas non plus, par exemple grâce à la <a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">sécurité de la couche de transport (protocole TLS)</a>. I2P et Tor visent tous deux à acheminer votre trafic tel quel vers sa destination, de manière sécurisé et anonyme sur le réseau correspondant. Tout trafic non chiffré généré par votre système arrivera au mandataire sortant (sur I2P) ou nœud de sortie (sur Tor) comme trafic non chiffré. Cela signifie que vous êtes vulnérable à la surveillance du trafic par les exploitants du mandataire sortant. Une façon de protéger votre trafic destiné à un mandataire sortant est de vous assurer qu’il est chiffré avec le protocole TLS.
id: I2P tidak mengenkripsi internet, juga tidak Tor - misalnya, melalui <a href="https://en.wikipedia.org/wiki/transport_layer_security"> Transport Layer Security (TLS) </a>. I2P dan Tor bertujuan untuk transport lalu lintas Anda apa adanya dengan aman dan anonim melalui jaringan yang sesuai, ke tujuannya. Lalu lintas tidak terenkripsi apa pun yang dihasilkan di sistem Anda akan tiba di outproxy (di I2P) atau exit node (di Tor) sebagai lalu lintas tidak terenkripsi. Ini berarti bahwa Anda rentan terhadap pengintaian oleh operator outproxy. Salah satu cara untuk melindungi lalu lintas outproxy Anda adalah dengan memastikan bahwa setiap lalu lintas ditangani oleh outproxy yang dienkripsi dengan TLS.
ja: I2Pはインターネットを暗号化しませんし、それはTorもしていないことです - 例えば<a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">Transport Layer Security (TLS)</a>を使うといったこと。 I2PとTorはどちらも、対応するネットワークを介してあなたのトラフィックを安全に匿名で接続先に運ぶことを目標としています。 あなたのシステムで生じた未暗号化トラフィックは、アウトプロキシ(I2P)や出口ノード(Tor)に未暗号化トラフィックとして届きます。 これはアウトプロキシ運営者による詮索には脆弱であるということを意味します。 アウトプロキシトラフィックを守る1つの方法は、アウトプロキシによって扱われるだろうあらゆるトラフィックをTLSで暗号化しておくことです。
pl: I2P nie szyfruje transferu w internecie, sieć Tor także nie, np. korzystając z <a href="https://pl.wikipedia.org/wiki/Transport_Layer_Security">protokołu TLS</a>. Celem obydwu sieci jest przesłanie danych w postaci niezmienionej i anonimowo przez sieć do odbiorcy. Każdy nieszyfrowany ruch sieciowy generowany na Twoim systemie trafi w końcu do proxy/węzła wyjściowego jako nieszyfrowany. Oznacza to, że Twój ruch sieciowy może być przechwycony przez operatorów proxy/węzłów wyjściowych. Sposobem na ochronę ruchu przed tym zagrożeniem jest upewnienie się, że cały ruch do proxy wyjściowego będzie szyfrowany przez TLS.
pt: O I2P não encripta a Internet, nem o Tor - por exemplo, através do <a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">Transport Layer Security (TLS)</a>. Tanto o I2P como o Tor têm como objetivo transportar o seu tráfego de forma segura e anónima através da rede correspondente, até ao seu destino. Qualquer tráfego não encriptado gerado no seu sistema chegará ao outproxy (no I2P) ou ao nó de saída (no Tor) como tráfego não encriptado. Isso significa que você está vulnerável à espionagem pelos operadores do outproxy. Uma maneira de proteger seu tráfego outproxy contra isso é garantir que qualquer tráfego que será tratado pelo outproxy seja criptografado com TLS.
tr: I2P uygulaması da Tor uygulaması da <a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">Taşıyıcı Katmanı Güvenliği (TLS)</a> gibi İnternet trafiğini şifrelemez. I2P ve Tor trafiğinizi var olduğu güvenlik düzeyinde anonim olarak ilgili ağ üzerinden hedefe aktarır. Sisteminizden çıkan şifrelenmemiş trafik, çıkış vekil sunucusundan (I2P için) ya da çıkış durağından (Tor için) şifrelenmemiş olarak çıkar. Bunun anlamı verilerinizin çıkış vekil sunucusu işletmecilerine karşı savunmasız olmasıdır. Çıkış vekil sunucusundaki trafiği korumanın bir yolu çıkış sunucusu tarafından işlenen tüm verilerin TLS ile şifrelenmiş olduğundan emin olmaktır.

source: For more information, you may read the Tor FAQ's answer to this question: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>
de: Für weitere Informationen sei auf diesen Eintrag im Tor-FAQ verwiesen: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>
fr: Pour plus de renseignements, vous pouvez consulter la réponse de la FAQ de Tor à cette question : <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>
id: Untuk informasi lebih lanjut, Anda dapat membaca jawaban Tor FAQ untuk pertanyaan ini: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>
ja: より詳しい情報は、<a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">この疑問に対するTor FAQの回答</a>を読むといいでしょう。
pl: Więcej informacji znajdziesz na stronie projektu Tor: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a> (w j. angielskim).
pt: Para mais informação, pode ler a resposta do Tor FAQ a esta questão: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>
tr: Ayrıntılı bilgi almak için Tor SSS bölümüne bakabilirsiniz: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>

source: In addition, you may be vulnerable to collusion between the outproxy operator and operators of other I2P services, if you use the same tunnels ("shared clients"). There is additional discussion about this on <a href="http://%(zzz)s/topics/217">%(zzz)s</a>. This discussion has been <a href="%(i2pforum)s">mirrored on our forums</a> as well.
de: Hinzu kommt, dass Sie möglicherweise für eine ID Kollision zwischen den Outproxy Betreiber und den Betreibern von I2P Services verwundbar sind beim Nutzen der selben Tunnel ("geteilte Kliententunnel"). Hierzu gibt es eine weitere Diskussion im Forum von <a href="http://%(zzz)s/topics/217">%(zzz)s</a>. Diese Diskussion wurde auch in unseren <a href="%(i2pforum)s">I2PForum</a> kopiert.
fr: De plus, vous pourriez être la victime d’une collusion entre l’opérateur du mandataire sortant et les opérateurs d’autres services I2P si vous utilisez les mêmes tunnels (« clients partagés »). Une discussion à ce propos se trouve sur <a href="http://%(zzz)s/topics/217">%(zzz)s</a>. Cette discussion est aussi <a href="%(i2pforum)s">reproduite sur nos forums</a>.
id: Selain itu, Anda mungkin rentan terhadap kolusi antara operator outproxy dan operator layanan I2P lainnya, jika anda menggunakan tunnel yang sama ("shared clients"). Ada diskusi tambahan tentang topik ini di <a href="http://%(zzz)s/topics/217">%(zzz)s</a> Diskusi ini juga telah <a href="%(i2pforum)s">di-mirror di forum kami</a>.
ja: さらに、アウトプロキシ運営者と他のI2Pサービスの運営者との結託があると、 それと同じトンネル（"共有クライアント"）を使っている場合に脆弱になります。 これについては <a href="http://%(zzz)s/topics/217">%(zzz)s</a>でさらなる議論がなされています。 この議論は我々の<a href="%(i2pforum)s">フォーラムでもミラー</a>されています。
pl: Ponadto, możesz być zagrożony na skutek zmowy pomiędzy operatorem proxy wyjściowego i innych usług w I2P, jeśli używasz tych samych tuneli (opcja „klient współdzielony)”. Dyskusja na ten temat została przeprowadzona na <a href="http://%(zzz)s/topics/217">%(zzz)s</a>. Wykonano również kopię tej dyskusji na <a href="%(i2pforum)s>innym forums</a>.
pt: Além disso, o utilizador pode estar vulnerável a conluios entre o operador outproxy e operadores de outros serviços I2P, se utilizar os mesmos túneis (“clientes partilhados”). Existe uma discussão adicional sobre este assunto em <a href="http://%(zzz)s/topics/217">%(zzz)s</a>. Esta discussão também já foi <a href="%(i2pforum)s">feita nos nossos fóruns</a>.
tr: Ek olarak, aynı tünelleri ("paylaşılmış istemciler") kullanıyorsanız, çıkış vekil sunucusu işletmecisi ile diğer I2P hizmetleri sunanlar arasında olabilecek gizli bir anlaşmaya karşı da savunmanız yoktur. Bu konu üzerine yapılan ayrı bir tartışmayı <a href="http://%(zzz)s/topics/217">%(zzz)s</a> üzerinde görebilirsiniz. Tartışma <a href="%(i2pforum)s">forumumuza da kopyalanmıştır</a>.

source: Ultimately, this is a question that only you can answer because the correct answer depends on your browsing behaviour, your <a href="%(threatmodel)s">threat model</a>, and how much you choose to trust the outproxy operator.
de: Letztlich kann diese Frage nur von einem selbst beantwortet werden, da die Antwort vom eigenen Surf-Verhalten und <a href="%(threatmodel)s">Bedrohungsmodell</a> abhängt sowie davon wie weit man dem Betreiber des Outproxies vertrauen will.
fr: C’est une question à laquelle vous seul pouvez répondre, car la bonne réponse dépend de vos comportements de navigation, de votre <a href="%(threatmodel)s">modèle de menace</a> et de votre niveau confiance envers l’opérateur du mandataire sortant.
id: Pada akhirnya, ini adalah pertanyaan yang hanya dapat dijawab oleh Anda karena jawaban yang benar bergantung pada perilaku penelusuran Anda, <a href="%(threatmodel)s">model ancaman</a> Anda, dan seberapa besar Anda mempercayai operator outproxy.
ja: 結局、これはあなたにしか答えられない問いなのです。なぜなら正しい解答は、あなたのブラウジングの振る舞い、<a href="%(threatmodel)s">脅威モデル</a>、アウトプロキシ運営者をどこまで信頼するかによるからです。
pl: Podsumowując, na to pytanie możesz sobie odpowiedzieć tylko Ty sam, ponieważ odpowiedź zależy od Twoich nawyków przeglądania, przyjętego <a href="%(threatmodel)s">modelu zagrożenia</a> i zaufania do operatora proxy wyjściowego.
pt: Em última análise, esta é uma pergunta a que só o utilizador pode responder, porque a resposta correta depende do seu comportamento de navegação, do seu <a href="%(threatmodel)s">modelo de ameaças</a> e da confiança que deposita no operador outproxy.
tr: Eninde sonunda, doğru yanıt sizin davranışlarınıza, <a href="%(threatmodel)s">tehdit modelinize</a> ve çıkış vekil sunucusu işleticinize ne kadar güvendiğinize bağlı olduğundan, bu sorunun yanıtını ancak siz verebilirsiniz.

source: Reducing anonymity is typically done by A) identifying characteristics that are consistent across anonymous identities or B) identifying ephemeral characteristics of repeated connections. We say "reducing" anonymity because many of these characteristics are shared by many of our users, making these anonymity "sets," the smaller the anonymity set and the more small sets you belong to, the more brittle your anonymity.
fr: Réduire l'anonymat est souvent fait en A) identifiant des caractéristiques consistantes entre plusieurs identités anonymes our B) identifiant des caractéristiques éphémères de connections répétées. Nous parlons de "réduire" l'anonymat car la plupart de ces caractéristiques sont partagés par beaucoup de nos utilisateurs, créant ces "ensembles" anonymes, plus l'ensemble anonyme est petit et plus vous faites partie d'un ensemble, plus vous vous fragilisez votre anonymat.
id: Mengurangi anonimitas biasanya dilakukan dengan a) mengidentifikasi karakteristik yang konsisten di seluruh identitas anonim atau B) Mengidentifikasi karakteristik sesaat dari koneksi berulang. Kami mengatakan "mengurangi" anonimitas karena banyak dari karakteristik ini dibagikan oleh banyak pengguna kami, membuat anonimitas ini sebagai sebuah "set," semakin kecil set anonimitas dan semakin banyak set kecil yang Anda miliki, Semakin rapuh anonimitas Anda.
ja: 匿名性の削減は、通常、A）匿名な識別子間で一貫性のある特性を特定するか、あるいは B）繰り返し接続される瞬間的な特性を特定することによって行われます。匿名性を「減らす」 と言ったのは、これらの特性の多くがユーザーうちの多くに共有されており、これらは匿名の「集合」となるからです。 匿名の集合が小さくなり、また自分が小さな集合に属するほど、匿名性はもろくなります。
pl: Zmniejszenie anonimowości może nastąpić na skutek:<br> A) identyfikacji cech spójnych anonimowych tożsamości<br> B) identyfikacji cech ulotnych powtarzanych połączeń.<br> Mówimy tylko o zmniejszeniu anonimowości, ponieważ wiele z tych cech jest wspólnych dla wielu użytkowników tworzących „zbiór”. W im mniejszym zbiorze się znajdujesz i w jak wielu małych zbiorach się znajdujesz, tym mniejsza jest Twoja anonimowość.
pt: A redução do anonimato é normalmente feita através da A) identificação de caraterísticas que são consistentes entre identidades anónimas ou B) identificando caraterísticas efémeras de conexões repetidas. Dizemos “reduzir” o anonimato porque muitas destas caraterísticas são partilhadas por muitos dos nossos utilizadores, o que faz com que estes “conjuntos” de anonimato, quanto mais pequeno for o conjunto de anonimato e quantos mais conjuntos pequenos pertencer, mais frágil será o seu anonimato.
tr: Anonimliğin azaltılması tipik olarak A) anonim kimlikler arasında tutarlı olan özelliklerin belirlenmesi ya da B) yinelenen bağlantıların geçici özelliklerinin belirlenmesi ile yapılır. Anonimliğin "azaltılması" diyoruz çünkü bu özelliklerin çoğu pek çok kullanıcımız tarafından paylaşılıyor. Böylece anonimlik "kümeleri" oluşturuluyor. Anonimlik kümesi küçüldükçe ve daha küçük kümeler kullandıkça, anonimliğiniz o kadar kırılgan hale gelir.

source: Attacks on I2P in the past have relied on correlating NetDB storage and verification, by randomizing the delay between storage and verification, we reduce the consistency with which that verification can be linked to I2P activity, thereby limiting the utility of that data point.
fr: Les attaques passées sur I2P se sont reposées sur le stockage et vérification lié à BDréseau en calculant aléatoirement le délai entre le stockage et la vérification nous réduisons la consistance avec laquelle nos vérifications peuvent être liées à l'activité I2P, ainsi limitant l'usage de ce point de donnée.
id: Serangan terhadap I2P di masa lalu mengandalkan korelasi penyimpanan dan verifikasi NetDB, dengan cara mengacak penundaan antara penyimpanan dan verifikasi, kami mengurangi konsistensi dengan cara menghubungkan verifikasi tersebut dengan aktivitas I2P, sehingga membatasi kegunaan titik data tersebut.
ja: 過去のI2Pへの攻撃は、NetDBの保存と検証の相関に依存するものでした。保存と検証の間の遅延 時間をランダムにすることで、その検証がI2Pの活動に紐づけられうる一貫性を低下させ、 それにより、そのデータポイントの有用性を制限しています。
pl: W przeszłości ataki na sieć I2P polegały na korelacji bazy dany sieci i weryfikacji. Dodając element losowości pomiędzy bazą danych i weryfikacją zmniejszono prawdopodobieństwo powiązania z aktywnością w sieci I2P, zmniejszając tym samym skuteczność tego ataku.
pt: No passado, os ataques ao I2P baseavam-se na correlação entre o armazenamento e a verificação da NetDB. o atraso entre o armazenamento e a verificação, reduzimos a consistência com que essa verificação pode ser ligada à atividade do I2P, limitando assim a utilidade desse ponto de dados.
tr: Geçmişte I2P ağına yapılan saldırılar, depolama ve doğrulama arasındaki gecikmeyi rastgele hale getirerek "Ağ veri tabanı" (NetDB) depolama ve doğrulamasını ilişkilendirmeye dayanıyordu. Bu veri noktasının yararlılığını sınırlayarak bu doğrulamanın I2P etkinliğiyle ilişkilendirilebilme olasılığını azaltıyoruz.

source: Attacks on software configured to work with I2P are out of scope for I2P to solve. When browsing I2P or hosting I2P services, it's is the responsibility of the user to consider their threat model. Browsers are particularly problematic due to fingerprinting attacks, and the wide variety of information that can be gleaned from them. Using a standardized browsing profile is thought to help mitigate the impact of fingerprinting.
fr: Les attaques sur les logiciels configurés pour marcher avec I2P sont hors de la portée d'I2P de résoudre. En naviguant sur I2P ou en hébergeant des services I2P, c'est la responsabilité de l'utilisateur d'envisager leurs risques. Les navigateurs sont spécialement problématiques à cause des attaques sur les empreintes numériques et une grande partie des informations peuvent être découverte à partir d'elles. En utilisant un profil de navigation standardisé apparemment aide à mitiger l'impact de la prise d'empreintes digitales.
id: Serangan terhadap perangkat lunak yang dikonfigurasi untuk bekerja dengan I2P berada di luar ruang lingkup untuk dipecahkan I2P. Saat menjelajahi I2P atau hosting layanan I2P, pengguna bertanggung jawab untuk mempertimbangkan model ancamannya. Browser biasanya bermasalah karena serangan fingerprinting, dan beragamnya informasi yang dapat diperoleh darinya. Menggunakan profil penjelajahan standar dianggap membantu mengurangi dampak fingerprinting.
ja: I2P で動作するように設定されたソフトウェアに対する攻撃は、I2P が解決すべき範囲を超えています。 I2P を閲覧したり、I2P サービスをホストする場合、その脅威モデルを考慮するのはユーザーの責任です。 ブラウザは、指紋採取攻撃や、そこから得られる様々な情報のために、特に問題が起こりやすいです。 標準化されたブラウジングプロファイルを使用することで、指紋採取の影響を軽減することができると考えられています。
pl: Ataki na oprogramowanie skonfigurowane do pracy z siecią I2P są poza zakresem możliwości zespołu I2P. Użytkownik przeglądający strony .i2p bądź hostujący własną stronę w sieci I2P musi samodzielnie przemyśleć model zagrożenia. Przeglądarki internetowe są szczególnie problematyczne, ponieważ zostawiają „odcisk palca przeglądarki”. Korzystanie ze zestandaryzowanego profilu przeglądarki pozwala zmniejszyć to ryzyko.
pt: Os ataques a software configurado para funcionar com a I2P estão fora do âmbito da solução da I2P. Ao navegar na I2P ou ao alojar serviços I2P, é da responsabilidade do utilizador considerar o seu modelo de ameaças. Os navegadores são particularmente problemáticos devido a ataques de fingerprinting e à grande variedade de informações que podem ser obtidas a partir deles. A utilização de um perfil de navegação padronizado ajuda a mitigar o impacto da impressão digital.
tr: I2P ile çalışacak şekilde yapılandırılmış uygulamalara yönelik saldırılar, I2P tarafından çözümlenebilecek kapsamın dışındadır. I2P ağında gezerken veya I2P hizmetleri barındırırken, tehdit modelini değerlendirmek kullanıcının sorumluluğundadır. Tarayıcılar, parmak izi saldırıları ve bunlardan toplanabilecek çok çeşitli bilgiler nedeniyle özellikle sorunlu uygulamalardır. Standartlaştırılmış bir tarama profili kullanmanın parmak izinin etkisini azaltmaya yardımcı olduğu düşünülmektedir.

source: New installations of I2P carry out the reseeding process automatically, as well as when the number of known peers falls to a drastically low value. If you need to carry out a reseed of your router, please see the <a href="#manual_reseed">reseed instructions</a>.
de: Neue I2P Installationen durchlaufen den Reseed Prozess automatisch, ebenso wird dieser Prozess automatisch absolviert, sobald die Zahl der bekannten Teilnehmer sehr gering ist. Falls Sie den Prozess auf Ihrem Router manuell ausführen wollen, schauen Sie in die <a href="#manual_reseed">Reseed Instruktionen</a>.
fr: Les nouvelles installations d’I2P entreprennent automatiquement le processus de réensemencement, ce qui est aussi le cas si le nombre de pairs connus chute de manière radicale. Si vous devez effectuer un réensemencement de votre routeur, veuillez consulter les <a href="#manual_reseed">instructions sur le réensemencement</a>.
id: Instalasi baru I2P melaksanakan proses reseeding secara otomatis, juga ketika jumlah peer yang diketahui jatuh ke nilai rendah secara drastis. Jika Anda perlu melakukan reseed terhadap router Anda, silakan lihat <a href="#manual_reseed"> instruksi reseed </a>.
ja: I2Pの新規インストールは再シード手順を自動的に実行し、既知のピア数は劇的に小さい値になります。 ルーターの再シード実行が必要な場合は、<a href="#manual_reseed">再シードの説明</a>を参照してください。
pl: Nowe instalacje I2P przeprowadzają proces reseedowania automatycznie kiedy liczba znanych uczestników spadnie do bardzo niskiej wartości. Jeżeli potrzebujesz ręcznie przeprowadzić reseedowanie swojego węzła, zajrzyj do <a href="#manual_reseed">instrukcji reseedowania</a>.
pt: As novas instalações do I2P efetuam o processo de reseeding automaticamente, bem como quando o número de pares conhecidos cai para um valor drasticamente baixo. Se precisar de efetuar um reseed do seu roteador, consulte a secção <a href="#manual_reseed">instruções de reseed</a>.
tr: Yeni I2P kurulumlarında, bilinen eşlerin sayısı çok az olmadıkça, yeniden tohumlama işlemi otomatik olarak yapılır. Yönelticinizde yeniden tohumlama işlemi yapmanız gerekiyorsa <a href="#manual_reseed">yeniden tohumlama bilgileri</a> bölümüne bakabilirsiniz.

source: An I2P router only needs to be seeded once, to join the network for the first time. Reseeding involves fetching multiple "RouterInfo" files (bundled into a signed zip-file) from at least two predefined server URLs picked from a volunteer-run group of non-private internet HTTPS servers.
fr: Un routeur I2P a simplement besoin d'être réensemencé une seule fois, pour rejoindre le réseau pour la première fois. Réensemencer implique de récupérer plusieurs fichiers "RouteurInfo" (empaqueté dans un fichier signé zip) par au moins deux serveurs URL prédéfinis choisis d'un groupe géré par des bénévoles de serveurs au HTTPS non-privé.
id: Router I2P hanya perlu mendapat seed satu kali untuk bergabung dengan jaringan pertama kalinya. Reseeding melibatkan pengambilan beberapa file "RouterInfo" (dibundel menjadi file zip bertanda tangan) dari setidaknya dua URL server yang telah ditentukan yang diambil dari kelompok server clearnet HTTPS yang dikelola secara sukarela.
ja: I2Pルーターがシード生成を必要とするのは一度だけで、初回のI2Pネットワーク参加の際です。 再シードを行うには、有志運営の非プライベートインターネットのHTTPSサーバ群から選ばれた少なくとも2つの事前定義済みサーバーURLから、 複数の"ルーター情報"ファイル（署名されたzipファイルに圧縮されている）を取得しなければなりません。
pl: Węzeł I2P musi zostać reseedowany podczas pierwszego połączenia z siecią. Reseedowanie polega na pobraniu kilku plików zawierających informacje o węzłach (zapakowanych w cyfrowo podpisany plik .zip) po HTTPS z co najmniej dwóch predefiniowanych serwerów prowadzonych przez wolontariuszy w zwykłym internecie.
pt: Um roteador I2P só precisa de ser semeado uma vez, para se juntar à rede pela primeira vez. A propagação envolve a obtenção de vários ficheiros “RouterInfo” (agrupados num ficheiro zip assinado) de pelo menos dois URLs de servidor predefinidos, selecionados de um grupo voluntário de servidores HTTPS não privados da Internet.
tr: Bir I2P yönelticinin ağa ilk kez katılması için yalnızca bir kez tohumlanması gerekir. Yeniden tohumlama işlemi sırasında gönüllüler tarafından çalıştırılan normal İnternet HTTPS sunucularından alınan en az iki hazır sunucu adresi kullanılarak birden çok "Yöneltici bilgileri" (RouterInfo) dosyası alınır (imzalanmış bir zip dosyası içinde).
