Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Running the installer will create a shortcut to start browsing I2P in your start menu and on your desktop. Clicking this shortcut will start I2P if necessary, then start an I2P Browser. On the first run, you will also be promted with the bandwidth wizard in your browser window. You will also see a "Toopie" icon in your taskbar to indicate that I2P is working when the browser window is closed.
fr: Faire tourner le programme d'installation créera un raccourci pour naviguer sur I2P dans votre menu d'accueil et sur votre bureau. Cliquer sur ce raccourci démarrera I2P si nécessaire, puis démarrera un navigateur I2P. Pendant le premier lancement, vous serez aussi invité par le sorcier bande passante dans votre fenêtre de navigateur. Vous verrez aussi un icône "Toopie" dans votre barre de tâche qui indique que I2P marche quand la fenêtre de navigateur est fermée.
id: Menjalankan installer akan membuat shortcut untuk mulai menjelajahi I2P di start menu dan di desktop. Mengklik shortcut ini akan memulai I2P. Jika perlu, buka browser untuk I2P. Saat pertama kali dijalankan, Anda juga akan ditawari wizard bandwidth di jendela browser Anda. Anda juga akan melihat ikon "Toopie" di taskbar untuk menunjukkan bahwa I2P berfungsi ketika jendela browser ditutup.
ja: インストーラーを実行すると、スタートメニューとデスクトップ上に I2P のブラウジングを 開始するショートカットが作成されます。ショートカットをクリックすると、必要であれば I2P が起動し その後 I2P ブラウザが立ち上がります。初回起動時、ブラウザウィンドウで帯域幅ウィザード の設定も要求されます。ブラウザウィンドウを閉じる際には、タスクバーに、 I2P が起動中であることを示す「Toopie」のアイコンも表示されます。
pt: Executar o instalador criará um atalho para iniciar a navegação na I2P em seu menu iniciar e na sua área de trabalho. Clicar nesse atalho iniciará a I2P se necessário, então abrirá um Navegador I2P. Na primeira execução, também será exibido a você o assistente de lagura de banda na sua janela do navegador. Você também verá um ícone do "Toopie" em sua barra de tarefas para indicar que a I2P está funcionando quando o a janela do navegador estiver fechada.
tr: Kurucuyu çalıştırmak, başlat menünüzde ve masaüstünüzde I2P ile gezinmeye başlayabileceğiniz bir kısayol oluşturur. Bu kısayola tıklamak I2P uygulamasını ve ardından I2P tarayıcısını başlatır. İlk çalıştırmada, tarayıcı pencerenizdeki bant genişliği yardımcısı sizi yönlendirir. Ayrıca, tarayıcı penceresi kapatıldığında görev çubuğunda I2P uygulamasının çalıştığını belirten bir "Toopie" simgesi görüntülenir.

source: I2P Browsing uses a separate, I2P-Only Firefox profile, so it won't interfere with your regular Firefox use or require any special configuration. You don't even need to close existing Firefox windows.
fr: Naviguer sur I2P utilise un profil Firefox séparé, seulement sur I2P pour qu'il n'interfère pas avec vos utilisations habituelles de Firefox et ne demande pas de configuration particulière. Vous n'avez même pas besoin de fermer les fenêtres Firefox présentes.
id: Browser I2P menggunakan profil firefox terpisah yang khusus untuk I2P, jadi tidak akan mengganggu penggunaan firefox biasa atau memerlukan konfigurasi khusus. Anda bahkan tidak perlu menutup jendela Firefox yang ada.
ja: I2P のブラウジングでは、分けられた、I2P専用の Firefox プロファイルが 使用されるので、通常の FIrefox の使用に干渉せず、また特別の設定が必要 であるということもありません。既存の Firefox のウィンドウを閉じる必要もありません。
pt: A Navegação I2P usa um perfil do Firefox separado que é apenas para a I2P, para que ela não interfira com o seu uso normal do Firefox ou exija qualquer configuração especial. Você nem precisa fechar janelas existentes do Firefox.
tr: I2P tarama, yalnızca I2P için hazırlanmış ayrı bir Firefox profili kullanır. Bu nedenle normal Firefox kullanımınızı etkilemez veya herhangi özel bir yapılandırma gerektirmez. Açık Firefox pencerelerini kapatmanız bile gerekmez.

source: Mirror:
de: Spiegelserver:
es_ar: Servidor réplica (mirror):
fr: Miroir :
ja: ミラー:
pl: serwer lustrzany:
pt: Espelho:
tr: Yansı:

source: select alternate mirror
de: Alternativen Spiegelserver auswählen
es_ar: elija un servidor réplica (mirror) alternativo
fr: sélectionner un miroir de remplacement
id: pilih mirror alternatif
ja: 代替用ミラーを選択
pl: wybierz alternatywny serwer
pt: Selecionar espelho alternativo
tr: alternatif yansıyı seçin

source: Download that file and complete the steps it shows.
fr: Téléchargez ce fichier et complétez les étapes montrées.
id: Unduh file tersebut dan ikuti langkah-langkahnya.
ja: ファイルをダウンロードして、記載されたステップを完了してください。
pt: Baixe esse arquivo e complete os passos que forem mostrados.
tr: Bu dosyayı indirin ve görüntülenen adımları tamamlayın.

source: The files are signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
de: Diese Dateien sind von %(signer)s signiert, wessen Schlüssel <a href="%(signingkey)s">hier sind</a>.
es_ar: Los ficheros están firmados por %(signer)s, <a href="%(signingkey)s">cuya clave está aquí</a>.
fr: Les fichiers sont signés par %(signer)s, <a href="%(signingkey)s">dont la clé est ici</a>.
id: File ditandatangani oleh %(signer)s <a href="%(signingkey)s"> yang kuncinya ada di sini</a>.
ja: ファイルは %(signer)s が署名しており、鍵は<a href="%(signingkey)s">こちら</a>にあります
pl: Pliki są podpisane przez programistę %(signer)s, <a href="%(signingkey)s">którego klucz znajdziesz tutaj</a>.
pt: Os arquivos são assinados por %(signer)s, <a href="%(signingkey)s">cuja chave está aqui</a>.
tr: %(signer)s tarafından imzalanmış dosyaların <a href="%(signingkey)s">anahtarını buradan alabilirsiniz</a>.

source: What is in it?
fr: Qu'y a t'il dedans ?
id: Ada apa di dalamnya?
ja: 何が含まれていますか？
pl: Co jest w tym?
pt: O que há dentro dele?
tr: İçinde ne var?

source: A Jpackaged I2P Router:
fr: Un routeur Jpackaged :
id: I2P Router yang Berisi Jpackaged:
ja: Jpackageされた I2P ルーター：
pt: Um Roteador I2P Jempacotado:
tr: JPackage biçimindeki bir I2P yöneltici:

source: The I2P router is "jpackaged" which means that it includes all the required Java components it needs to run successfully. It does not require a separate Java installation, because it bundles a Java 16 Runtime which is only used for I2P.
fr: Le routeur I2P est "jpackaged" ce qui veut dire qu'il inclut tout les composants requit par Java pour qu'il s'exécute sans problème. Il ne requiert pas d'installation Java séparée car elle contient un moteur d'exécution Java 16 qui est uniquement utilisé pour I2P.
id: Router I2P mengandung "JPakage" yang berarti mengandung semua komponen Java yang diperlukan untuk berjalan dengan sukses. Itu tidak membutuhkan instalasi Java terpisah, karena mengandung runtime Java 16 yang hanya digunakan untuk I2P.
ja: I2P ルーターは「jpackeage」されており、つまり正常に起動するために必要な Java コンポーネントをすべて含んでいます。I2P で使用されている Java 16ランタイムを バンドルしているので別に Java のインストールをする必要はありません。
pt: O roteador I2P é "jempacotado", o que significa que ele inclui todos os componentes Java necessários para ser executado com sucesso. Ele não requer uma instalação Java separada, porque ele empacota um Runtime do Java 16 que só é usado para a I2P.
tr: I2P yönelticisi "JPackage" şeklinde hazırlanmıştır. Yani sorunsuz çalışması için gereken tüm Java bileşenlerini içerir. Ayrı bir Java kurulumu gerektirmez, çünkü yalnızca I2P için kullanılan bir Java 16 Runtime paketi içerir.

source: Browser Extensions:
fr: Extensions de Navigateur :
ja: ブラウザ拡張機能：
pl: Rozszerzenia Przeglądarki:
pt: Extensões de Navegador:
tr: Tarayıcı eklentileri:

source: The browser profile also includes both the NoScript and HTTPSEverywhere plugin for better protection Javascript based attacks and HTTPS support where available. It also keeps your I2P search activity separate from your visible internet search activity. The profile configures the I2P Proxy for all sites and browser features. I2P In Private Browsing is used to provide I2P-Specific browser integrations.
fr: Le profil de navigateur inclut aussi les deux greffons NoScript et HTTPSEverywhere pour une meilleure protection pour des attaques basés sur Javascript et la prise en charge HTTPS quand elle est disponible. Il garde aussi vos recherches I2P séparées de vos recherches internet visibles Le profil configure le mandataire I2P pour tout les sites et les fonctionnalités du navigateur. I2P dans la navigation privée est utilisée pour apporter des intégrations spécifiques au navigateur I2P.
id: Profil browser juga mencakup plugin NoScript dan HTTPSEverywhere untuk dukungan lebih baik terhadap serangan berbasis JavaScript dan dukungan HTTPS jika tersedia. Ini juga memisahkan aktivitas pencarian I2P Anda dari pencarian internet. Profil ini mengkonfigurasi proxy I2P untuk semua situs dan fitur browser. I2P dalam Private Browsing digunakan untuk menyediakan integrasi browser khusus untuk I2P.
ja: ブラウザのプロファイルには、Javascript ベースの攻撃からの保護の強化と、 利用できる場合はHTTPSをサポートするため、NoScriptとHTTPSEverywhere の プラグインが含まれています。また、I2P の検索活動を通常の可視のインターネットでの 検索活動とを分離します。プロファイルは全ての際ととブラウザの機能に対して I2P プロキシを 設定します。I2P In Private Browsing は I2P 特有のブラウザ統合を提供するのに使われています。
pt: O perfil do navegador também inclui tanto o plugin NoScript quanto o HTTPS Everywhere para melhor proteção contra ataques baseados em Javascript e suporte a HTTPS onde disponível. Ele também mantém sua atividade de pesquisa da I2P separada da sua atividade de pesquisa da internet visível. O perfil configura o Proxy I2P para todas as funcionalidades de sites e navegador. A I2P Em Navegação Privativa é usada para fornecer integrações com navegador específicas da I2P.
tr: Tarayıcı profilinde ayrıca JavaScript tabanlı saldırılar ve varsa HTTPS desteği için daha iyi koruma sağlayan NoScript ve HTTPSEverywhere eklentileri bulunur. Ayrıca, I2P arama işlemlerinizi görünür İnternet arama işlemlerinizden ayrı tutar. Profil, tüm siteler ve tarayıcı özellikleri için I2P vekil sunucusunu yapılandırır. Gizli taramada I2P, özel I2P tarayıcı bütünleştirmeleri sağlamak için kullanılır.

source: Source Code and Issue Tracking
fr: Code source et Traqueur de problème
id: Source Code dan Issue Tracking
ja: ソースコードとイシューのトラッキング
pt: Código Fonte e Rastreamento de Problemas
tr: Kaynak kodu ve sorun izleme

source: If you would like to examine the source code for individual components, you may find it on i2pgit.org or github.com. The license for each respective component can be found in the license directory of the <code>i2p.firefox</code> project.
fr: Si vous voulez inspecter le code source des composants individuels, vous pouvez le trouver sur i2pgit.org ou github.com. La licence pour chaque composant respectif peut être trouvé dans le répertoire de licences du projet <code>i2p.firefox</code>.
id: Jika Anda ingin memeriksa kode sumber untuk masing-masing komponen, Anda dapat mendapatkannya di i2pgit.org atau github.com. Lisensi untuk masing-masing komponen dapat ditemukan di direktori lisensi proyek <code>i2p.firefox</code>.
ja: 個々のコンポーネントのソースコードを吟味したい場合、i2pgit.org か github.com で見つけられます。各コンポーネントのライセンスは、<code>i2p.firefox</code> プロジェクトのライセンスディレクトリで見つかります。
pt: Se você gostaria de examinar o código fonte para componentes individuais, você pode encontrá-lo em i2pgit.org ou em github.com. A licença para cada componente respectivo pode ser encontrada na pasta de licença do projeto <code>i2p.firefox</code>.
tr: Ayrı ayrı bileşenlerin kaynak kodunu incelemek isterseniz, i2pgit.org veya github.com üzerinde bulabilirsiniz. İlgili her bir bileşenin lisansı, <code>i2p.firefox</code> projesinin lisans klasöründe bulunabilir.

source: Gitlab Repository
fr: Dépôt Gitlab
ja: Gitlab レポジトリー
pl: Repozytorium Gitlab
pt: Repositório do Gitlab
tr: GitLab deposu

source: Github Repository
fr: Dépôt Github
ja: Github レポジトリー
pl: Repozytorium Github
pt: Repositório do Github
tr: GitHub deposu

source: Gitlab Repository for Profile Manager
fr: Dépôt Gitlab pour gestionnaire de profil
id: Gitlab Repository untuk Profile Manager
ja: プロファイルマネージャー用 Gitlab レポジトリー
pt: Repositório do Github para o Gerenciador de Perfil
tr: Profil yöneticisi için GitLab deposu

source: Github Repository Profile Manager
fr: Dépôt Gitlab gestionnaire de profil
ja: プロファイルマネージャー Github レポジトリー
pt: Repositório do Github para o Gerenciador de Perfil
tr: Profil yöneticisi GitHub deposu

source: If you wish to file an issue about the Firefox profile, please use Gitlab to contact us. For security-sensitive issues, please remember to check the "This issue is confidential and should only be visible to team members with at least Reporter access" option when filing the issue.
fr: Si vous souhaitez déposer un problème sur le profil Firefox, veuillez utiliser GitLab pour nous contacter. En raison de problèmes liés à la sécurité, veuillez vous rappeler de vérifier l'option "Ce problème est confidentiel et ne devrait être visible que par les membres de l'équipe avec au moins un accès Signaleur" en déposant le problème.
id: Jika Anda ingin melaporkan masalah tentang profil Firefox, silakan gunakan Gitlab untuk menghubungi kami. Untuk masalah keamanan, mohon untuk mencentang "Masalah ini rahasia dan hanya boleh terlihat oleh anggota tim dengan setidaknya akses reporter" opsi saat melaporkan masalah.
ja: Firefox のプロファイルに関して問題を報告したい場合、Gitlabを使って、 連絡してください。セキュリティに影響する問題については、問題を報告する際 「この問題は機密であり、少なくとも報告者アクセスを持つチームメンバーにのみ 閲覧可能であるべきです」というオプションを確認することを忘れないでください。
pt: Se você desejar preencher uma "issue" sobre o perfil do Firefox, por favor, use o Gitlab para nos contatar. Para problemas de segurança sensíveis, por favor, lembre-se de marcar a opção "This issue is confidential and should only be visible to team members with at least Reporter access" ao preencher a "issue".
tr: Firefox profili hakkında bir sorun bildirmek isterseniz, bizimle GitLab üzerinden iletişim kurun. Güvenlik açısından hassas konularda, sorunu bildirirken "This issue is confidential and should only be visible to team members with at least Reporter access" seçeneğini işaretlemeyi unutmayın.

source: How is it different from Tor Browser?
fr: En quoi est-t-il différent du navigateur Tor ?
id: Apa bedanya dengan browser Tor?
ja: Tor ブラウザとは何が違うのですか？
pl: Czym się to różni od Przeglądarki Tor?
pt: De que forma ele é diferente do Navegador Tor?
tr: Tor Browser uygulamasından farkı nedir?

source: This is not a fork of Firefox. Instead, it is a browser profile with pre-configured settings, combined with an I2P router and some launcher scripts. That means that it requires Firefox(Or Tor Browser) to be installed before you can use it. This is for security reasons, it is important that you are able to recieve reliable updates from a trustworthy vendor.
fr: Ce n'est pas une fourche de Firefox. Au lieu de ça, c'est un profil de navigateur avec des paramètres pré-configurés, combiné avec un routeur I2P et quelques scriptes de lanceurs. Ce qui veut dire qu'il a besoin de Firefox (ou le navigateur Tor) pour être installé avant de l'utiliser. C'est pour des raisons de sécurité, il est important que vous pourrez recevoir des mises à jour fiables d'un vendeur de confiance.
id: Ini bukan fork dari Firefox. Sebaliknya, ini adalah profil browser yang telah dikonfigurasi sebelumnya, dikombinasikan dengan router I2P dan beberapa skrip peluncur. Itu artinya membutuhkan Firefox (atau Tor Browser) untuk diinstal sebelum Anda dapat menggunakannya. Ini karena alasan keamanan, penting bagi Anda untuk dapat menerima pembaruan andal dari vendor terpercaya.
ja: これは Firefox のフォークではありません。むしろ、 I2P ルーターといくつかの ロンチャースクリプトを同梱した、事前設定済みのブラウザプロファイルです。つまり、 Firefox (か Tor ブラウザ)が使用する前にインストールされている必要があります。 セキュリティ上の理由のため、信頼のおけるベンダーから信頼できるアップデートを 受け取れることは重要なことです。
pt: Este não é um fork do Firefox. Ao invés disso, ele é um perfil de navegador com configurações pré-configuradas, combinado com um roteador I2P e alguns scripts de inicialização. Isso significa que ele requer que o Firefox (ou o Navegador Tor) esteja instalado antes de você poder usá-lo. Isso é por motivos de segurança. É importante que você possa receber atualizações estáveis de uma fonte confiável.
tr: Bu bir Firefox dalı değil. Bir I2P yöneltici ve bazı başlatıcı komut dosyalarıyla bir araya getirilmiş, hazır ayarlara sahip bir tarayıcı profilidir. Bu nedenle, kullanmadan önce Firefox (veya Tor Browser) kurulmalıdır. Güvenlik nedeniyle, güvenilir bir sağlayıcıdan güvenilir güncellemeler alabilmeniz için önemlidir.

source: I2P routers are designed to have long uptimes, and so unlike Tor Browser, the lifetime of your I2P Router is not tied to the lifetime of your I2P browsing session. The browser profile will manage your history, your browser's local storage and cache, and your browsing context but it will never stop your I2P router on its own. You may stop the router using the web interface on the router console homepage.
fr: Les routeurs I2P sont conçus pour avoir de longues durées d'activité et donc contrairement au navigateur Tor, la durée de vie de votre routeur I2P n'est pas liée à la durée de vie de vos sessions de navigation I2P. Le profil navigateur gérera votre historique, votre stockage et caches de navigateur locales et votre contexte de navigateur mais n'arrêtera jamais votre routeur I2P de lui-même. Vous pourrez arrêter le routeur en utilisant l'interface internet sur la page d'accueil de la console du routeur.
id: Router I2P dirancang untuk memiliki waktu operasi yang lama, dan sangat tidak seperti Tor Browser, umur Router I2P Anda tidak terikat pada umur total sesi penelusuran I2P Anda. Profil browser akan mengelola riwayat Anda, penyimpanan dan cache lokal browser Anda, dan konteks penelusuran, Anda tetapi tidak akan pernah menghentikan Router I2P. Anda dapat menghentikan router menggunakan antarmuka web di beranda router console.
ja: I2P ルーターは長期間起動するように設計されているので、Tor ブラウザとは異なり、 I2P ルーターの総使用時間は I2P ブラウジングセッションの総使用時間とは異なります。 ブラウザプロファイルは、ユーザーの履歴、ブラウザのローカルストレージ・キャッシュ、 ブラウジングコンテキストを管理しますが、I2P ルーターを自分で停止させることはありません。 ルーターコンソールのホームページ上でウェブインターフェースを使ってルーターを停止させることができます。
pt: Roteadores I2P são projetados para terem tempos de atividade longos, e então diferente do Navegador Tor, o tempo de vida do seu Roteador I2P não está atrelado ao tempo de vida da sua sessão de navegação da I2P. O perfil de navegador gerenciará seu histórico, seu armazenamento local e cache do navegador e seu contexto de navegação, mas ele nunca parará o seu roteador I2P sozinho. Você pode parar o roteador usando a interface web na página inicial do painel do roteador.
tr: I2P yönelticileri uzun süreler çalışacak şekilde tasarlanmıştır ve bu nedenle Tor Browser uygulamasının aksine I2P yönelticinizin ömrü, I2P tarama oturumunuzun ömrüne bağlı değildir. Tarayıcı profili, geçmişi, tarayıcınızın yerel depolaması ve ön belleği ile tarama bağlamınızı yönetir, ancak asla I2P yönelticinizi kendi başına durdurmaz. Yönelticiyi durdurmak için yöneltici panosu ana sayfasındaki internet arayüzünü kullanmalısınız.

source: The I2P Firefox Browser Profile has been expanded into the new I2P Easy Install Bundle, which is in Beta. If you already have an I2P Router installed, it is still safe to use this installer to configure your I2P Browser. Your existing I2P Settings will be left untouched. If you do not have an I2P router installed, then you do not need to install I2P. This package will install I2P at the same time it installs the browser profile. This page has been kept to document the motivations and design of the included Firefox profile. To learn more about the new bundle, visit <a href="%(nsis)s">The Easy Install Bundle Page</a>.
fr: Le profil I2P pour le navigateur Firefox a été étendu dans le paquet Installation Facile I2P qui était en bêta. Si vous avez déjà un routeur I2P installé, il est toujours sûr d'utiliser cet installateur pour configurer votre navigateur I2P. Vos paramètres I2P existants resteront intact. Si vous n'avez pas de routeurs I2P installé alors vous n'aurez pas besoin d'installer I2P. Ce paquet l'installera en même temps qu'il installe le profil navigateur. Cette page a été gardée pour documenter les motivations et designs du profil Firefox inclut. Pour en apprendre plus sur le nouveau paquet, allez voir la <a href="%(nsis)s">page du Paquet Installation Facile</a>.
id: Profil Browser Firefox I2P telah diperluas menjadi I2P Easy Install Bundle, yang masih dalam versi Beta. Jika Anda sudah menginstal Router I2P, masih aman menggunakan installer ini untuk mengkonfigurasi Browser I2P Anda. Pengaturan I2P Anda sekarang tidak akan berubah. Jika Anda belum menginstal router I2P, maka Anda tidak perlu menginstal I2P. Paket ini akan menginstal I2P pada saat yang sama waktu menginstal profil browser. Halaman ini telah disimpan untuk mendokumentasikan motivasi dan desain profil Firefox yang disertakan. Untuk mempelajari lebih lanjut tentang bundle baru ini, kunjungi <a href="%(nsis)s">The Easy Install Bundle Page</a>.
ja: I2P Firefox ブラウザ用プロファイルは、新たな I2P イージーインストールバンドル（ベータ版） に拡張されました。I2P ルーターをインストール済みの場合でも、子のインストーラー を使って I2P ブラウザを設定して問題ありません。既存の I2P の設定はそのまま 残ります。I2P ルーターをインストールしていない場合は、I2P をインストールする必要はありません。 このパッケージは、ブラウザのプロファイルをインストールするのと同時に I2P をインストールします。このページは、同梱された Firefox プロファイル の動機と設計の記録のため残されました。新しいバンドルの詳細については <a href="%(nsis)s">イージーインストールバンドルのページ</a>をご覧ください。
pt: O Perfil de Navegador para o Firefox da I2P foi estendido ao novo Pacote de Instalação Fácil da I2P, o qual está em Beta. Se você já tem um Roteador I2P instalado, ainda é seguro usar este instalador para configurar seu Navegador I2P. Suas Configurações da I2P existentes permanecerão intactas. Se você você não tem um roteador I2P instalado, então você não precisa instalar a I2P. Este pacote instalará a I2P ao mesmo tempo em que instala o perfil do navegador. Esta página foi mantida para documentar as motivações e o design do perfil do Firefox incluído. Para saber mais sobre o novo pacote, visite <a href="%(nsis)s">A Página do Pacote de Instalação Fácil</a>.
tr: Beta aşamasında olan I2P Firefox tarayıcı profili, yeni I2P kolay kurulum paketine eklendi. Zaten kurulu bir I2P yönelticiniz olsa bile, yine de I2P tarayıcınızı yapılandırmak için bu kurucuyu kullanmak güvenlidir. Var olan I2P ayarlarınıza dokunulmaz. Kurulu bir I2P yönelticiniz yoksa, I2P kurmanız gerekmez. Bu paket, tarayıcı profilini kurarken I2P kurulumunu da yapar. Bu sayfa, eklenen Firefox profilinin amaçlarını ve tasarımını belgelemek için konulmuştur. Yeni paket hakkında ayrıntılı bilgi edinmek için <a href="%(nsis)s">kolay kurulum paketi sayfasına</a> bakabilirsiniz.

source: I2P Firefox Browser Profile
de: I2P Firefox Browser Profil
es_ar: Perfiles del navegador I2P Firefox
fr: Profil I2P pour le navigateur Firefox
id: Profil Browser Firefox I2P
ja: I2P Firefox ブラウザープロファイル
pl: Profil I2P do przeglądarki Firefox
pt: Perfil I2P do Navegador Firefox
tr: I2P Firefox Tarayıcı Profili

source: Now that you have joined the I2P network, you will want to see I2P Sites and and other content that is hosted on the network. The Firefox browser profile is pre-configured to allow you to access the content available on the network.
fr: Maintenant que vous avez rejoins le réseau I2P, vous voudrez voir des sites I2P et d'autres contenu hébergé sur le réseau. Le profil pour le navigateur Firefox est pré-configuré pour vous permettre d'accéder au contenu disponible sur le réseau.
id: Sekarang Anda telah bergabung dengan jaringan I2P. Anda dapat melihat situs I2P dan dan dan konten lain yang tersedia di jaringan I2P. Profil browser Firefox telah dikonfigurasi sebelumnya untuk memungkinkan Anda mengakses konten yang tersedia di jaringan.
ja: I2P ネットワークに参加した今、I2Pサイトやネットワーク上でホストされている他のコンテンツ を見たいと思うことでしょう。Firefox ブラウザ用プロファイルは、ネットワーク上で利用可能な コンテンツにアクセスできるように事前設定されています。
pt: Agora que você se juntou à rede I2P, você vai querer ver Sites I2P e outros conteúdos que são hospedados na rede. O perfil de navegador do Firefox está pré-configurado para permitir que você acesse o conteúdo disponível na rede.
tr: Artık I2P ağına katıldığınıza göre, I2P Sitelerini ve ağda barındırılan diğer içerikleri görmek isteyeceksiniz. Firefox tarayıcı profili, ağda bulunan içeriğe erişmenizi sağlayacak şekilde önceden yapılandırılmıştır.
