Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Transport layer overview
de: Übersicht über die Übertragungsschichten
es_ar: Introducción a la capa de transporte
fr: Vue d’ensemble de la couche de transport
id: Ikhtisar tentang transport layer
ja: トランスポート層概観
pl: Warstwy przeglądowe: przegląd
pt: Resumo da camada de transporte
tr: Taşıyıcı katmanı özeti

source: Tunnels
es_ar: Túneles
id: Saluran
ja: トンネル
pl: Tunele
pt: Túneis
tr: Tüneller

source: Tunnel implementation
de: Tunnelimplementierung
es_ar: Implementación de túneles
fr: Mise en œuvre des tunnels
id: Implementasi tunnel
ja: トンネル実装
pl: Implementacje tuneli
pt: Implementação de túnel
tr: Tünel uygulaması

source: Unidirectional tunnels
de: Einbahn-Tunnels
es_ar: Túneles unidireccionales
fr: Tunnels unidirectionels
id: Saluran searah
ja: 単方向トンネル
pl: Tunele jednokierunkowe
pt: Túneis unidirecionais
tr: Çift yönlü tüneller

source: Old implementation
de: Alte Implementierung
es_ar: Implementación antigua
fr: Ancienne mise en œuvre
id: Implementasi lama
ja: 旧実装
pl: Stare implementacje
pt: Implementação antiga
tr: Eski uygulama

source: Naming and Address Book
de: Benennung und Adressbuch
es_ar: Libreta de nombres y direcciones
fr: Nommer et carnet d'adresse
id: Penamaan dan Buku Alamat
ja: 名前付けとアドレス帳
pl: Nazewnictwo i książka adresowa
pt: Nomenclatura e catálogo de endereços
tr: Adlandırma ve adres defteri

source: Plugins
es_ar: Complementos
fr: Greffons
id: Plugin
ja: プラグイン
pl: Wtyczki
tr: Uygulama ekleri

source: Strict Countries
es_ar: Países estrictos
fr: Pays stricts
id: Negara-Negara yang Mempunyai Aturan Ketat
ja: 厳しい国
pt: Países rigorosos
tr: Kısıtlanan ülkeler

source: License
de: Lizenz
es_ar: Licencia
fr: Licence
id: Lisensi
ja: ライセンス
pl: Licencja
pt: Licença
tr: Lisans

source: Licenses
de: Lizenzen
es_ar: Licencias
fr: Licences
id: Lisensi
ja: ライセンス
pl: Licencje
pt: Licenças
tr: Lisanslar

source: Meetings, Roadmap
de: Treffen, In welche Richtung geht es
es_ar: Reuniones, hoja de ruta
fr: Réunions, feuille de route
id: Pertemuan, Roadmap
ja: ミーティング、ロードマップ
pl: Narady i plan na przyszłość
pt: Reuniões, roteiro
tr: Toplantılar, yol haritası

source: Meeting Logs
de: Aufzeichnung der Meetings
es_ar: Registros de reuniones
fr: Minutes des réunions
id: Catatan Pertemuan
ja: 会合のログ
pl: Dzienniki narad
pt: Atas dos encontros
tr: Toplantı kayıtları

source: Project Roadmap
de: Roadmap des Projektes
es_ar: Hoja de ruta del proyecto
fr: Feuille de route du projet
id: Roadmap Proyek
ja: プロジェクトのロードマップ
pl: Plan na przyszłość I2P
pt: Roteiro do projeto
tr: Proje yol haritası

source: Task list
de: Aufgabenliste
es_ar: Lista de tareas
fr: Liste des tâches
id: Daftar tugas
ja: タスクリスト
pl: Lista zadań
pt: Lista de Tarefas
tr: Görev listesi

source: Bug tracker
es_ar: Monitor de errores
fr: Système de suivi des bogues
ja: バグトラッカー
pl: System śledzenia błędów
pt: Rastreador de Erros
tr: Hata izleyici

source: People
de: Personen
es_ar: Integrantes
fr: Collaborateurs
id: Orang-orang
ja: 人々
pl: Ludzie
pt: Pessoas
tr: Kişiler

source: Language
de: Sprache
es_ar: Idioma
fr: Langue
id: Bahasa
ja: 言語
pl: Język
pt: Idioma
tr: Dil

source: Logs of past I2P meetings
de: Logdateien vergangener I2P Treffen
es_ar: Registros ('logs') de anteriores reuniones de I2P
fr: Minutes des réunions I2P passées
id: Log pertemuan-pertemuan I2P terdahulu
ja: 過去の I2P 会合の記録
pl: Protokoły z odbytych spotkań I2P
pt: Registos das reuniões anteriores do I2P
tr: Geçmiş I2P toplantı günlükleri

source: I2P Meetings ATOM Feed
de: I2P Treffen ATOM Quelle
es_ar: ATOM feed de las reuniones de I2P
fr: Flux ATOM des réunions I2P
id: Pertemuan I2p ATOM Feed
ja: I2P会合 ATOMフィード
pl: Spotkania I2P – subskrypcja ATOM
pt: Feed ATOM das Reuniões do I2P
tr: I2P Toplantıları ATOM Akışı

source: Regularly scheduled project meetings are held on the first Tuesday of every month at 8 PM UTC. Anyone can schedule and run a meeting, by posting the agenda in <a href="%(mtgforum)s">the meetings forum</a>.
de: Jeden ersten Dienstag im Monat um 20 Uhr UTC werden regelmässige Projekttreffen abgehalten. Jeder kann ein Treffen organisieren und abhalten, in dem die Agenda im <a href="%(mtgforum)s">Meetings Forum</a> publiziert wird.
es_ar: Las reuniones del proyecto programadas regularmente se efectúan el primer martes de cada mes a las 8 PM UTC. Cualquiera puede programar y convocar una reunión, publicando el orden del día en <a href="%(mtgforum)s">el foro de reuniones</a>.
fr: Régulièrement, des réunions de projet planifiées ont lieu le premier mardi de chaque mois à 20:00 TUC. N’importe qui peut planifier et tenir une réunion en publiant l’ordre du jour dans <a href="%(mtgforum)s">le forum des réunions</a>.
id: Pertemuan proyek yang dijadwalkan secara rutin diadakan pada hari Selasa pertama setiap bulan pukul 8 PM UTC. Siapa pun dapat menjadwalkan dan menjalankan pertemuan, dengan membuat agenda di <a href="%(mtgforum)s">forum pertemuan</a>.
ja: 普段はプロジェクトミーティングが毎月第一火曜日のUTC 8PMに行われます。 <a href="%(mtgforum)s">会議フォーラム</a>に議題を投稿することで、誰でも会議を予定し、実行することができます。
pl: Narady projektu odbywają się regularnie w każdy pierwszy wtorek miesiąca o 20:00 UTC (21:00 CET). Każdy może zaplanować i poprowadzić naradę poprzez ustalenie porządku obrad na <a href="%(mtgforum)s">forum obrad</a>.
pt: As reuniões regulares do projeto são realizadas na primeira terça-feira de cada mês às 8 PM UTC. Qualquer pessoa pode agendar e realizar uma reunião, publicando a agenda em <a href="%(mtgforum)s">o fórum de reuniões</a>.
tr: Proje toplantıları her ayın ilk Salı günü UTC saat dilimine göre akşam 8 saatinde yapılır. İsteyen herkes bir toplantı <a href="%(mtgforum)s">toplantılar forumunda</a> bir toplantı planlayıp yapabilir.

source: If you have something to discuss, please find the developers on IRC in #i2p-dev. <a href="%(blogindex)s">Status updates</a> from developers are also available.
de: Wenn Sie etwas diskutieren möchten, finden Sie die Entwickler im IRC Kanal #i2p-dev. <a href="%(blogindex)s">Status Aktualisierungen</a> der Entwickler sind ebenfalls verfügbar.
es_ar: Si tiene algo que discutir por favor busque a los desarrolladores en #i2p-dev en el IRC. Las <a href="%(blogindex)s">actualizaciones del estado</a> de los desarrolladores también están disponibles.
fr: Si vous souhaitez discuter de quelque chose, veuillez vous adresser aux développeurs sur IRC dans #I2P-dev. <a href="%(blogindex)s">Les mises à jour d’état</a> des développeurs sont également à disposition.
id: Jika Anda ingin mendiskusikan sesuatu, silakan cari para pengembang di IRC di #i2p-dev. <a href="%(blogindex)s">Status update</a> dari pengembang juga tersedia.
ja: 議論したいことがあれば、IRC上の #i2p-dev にて開発者が見つかります。 開発者からの<a href="%(blogindex)s">状況更新</a>も利用できます。
pl: Jeżeli masz coś do przedyskutowania, możesz znaleźć programistów I2P na kanale IRC #i2p-dev. Dostępne są także <a href="%(blogindex)s">wieści</a> od twórców.
pt: Se tem algo para discutir, por favor, encontre os programadores no IRC em #i2p-dev. <a href="%(blogindex)s">estado das atualizações</a> dos programadores que também estão disponíveis.
tr: Tartışmak istediğiniz konular için geliştiriciler ile #i2p-dev IRC kanalında görüşebilirsiniz. Ayrıca geliştiricilerden <a href="%(blogindex)s">durum güncellemeleri</a> alınabilir.

source: I2P Development Meeting %(id)s
de: I2P Entwickler Meetings %(id)s
es_ar: Reuniones %(id)s de desarrollo de I2P
fr: Réunion de développement d’I2P %(id)s
id: Pertemuan Pengembangan i2p %(id)s
ja: I2P 開発会議 %(id)s
pl: %(id)s narada programistów I2P
pt: Reunião de Desenvolvimento do I2P %(id)s
tr: I2P Geliştirme Toplantısı %(id)s

source: Full IRC Log
de: Volles IRC Log
es_ar: Registro completo del IRC
fr: Journal IRC complet
id: Log IRC yang lengkap
ja: 完全な IRC ログ
pl: Pełny protokół IRC
pt: Registo Completo do IRC
tr: Tam IRC Günlüğü

source: By topic
de: Nach Thema
es_ar: Por asunto
fr: Par sujet
id: Berdasarkan topik
ja: トピック別
pl: Wg tematu
pt: Por tópico
tr: Konuya göre

source: By date
de: Nach Datum
es_ar: Por fecha
fr: Par date
id: Berdasarkan tanggal
ja: 日付別
pl: Wg daty
pt: Por data
tr: Tarihe göre

source: By author
de: Nach Autor
es_ar: Por autor
fr: Par auteur
id: Berdasarkan penulis
ja: 著者別
pl: Wg autora
pt: Por autor
tr: Yazara göre

source: Please send new or corrected entries to <a name="contact"><span class="email">%(email)s</span></a>.<br /> If you can, please format them as BibTeX; see our <a href="%(bibtex)s">BibTeX source page</a> for examples.<br /> Remember to include URLs if possible: <a href="%(citeseer)s">offline papers are less useful</a>.
de: Bitte senden Sie neue und korrigierte Einträge an <a name="contact"><span class="email">%(email)s</span></a>.<br /> Soweit möglich, bitte im BibTeX Format; schauen Sie auf unsere <a href="%(bibtex)s">BibTeX Source Seite</a> nach Beispielen.<br /> Vergessen Sie nach Möglichkeit nicht die URLs: <a href="%(citeseer)s">Offline Papers sind weniger nützlich</a>.
es_ar: Por favor, envíe las entradas nuevas o corregidas a <a name="contact"><span class="email">%(email)s</span></a>.<br /> Si puede, use el formato BibTeX; vea our <a href="%(bibtex)s">BibTeX source page</a> for examples.<br /> Recuerde incluir las URLs si es posible: <a href="%(citeseer)s">offline papers are less useful</a>.
fr: Veuillez envoyer les entrées nouvelles ou corrigées à <a name="contact"><span class="email">%(email)s</span></a>.<br /> Si vous le pouvez, veuillez les envoyer au format BibTeX ; des exemples se trouvent sur notre <a href="%(bibtex)s">page source BibTeX</a>.<br /> N’oubliez pas d’inclure les URL si possible : <a href="%(citeseer)s">les articles hors ligne sont moins utiles</a>.
id: Silakan kirim entri baru atau koreksi kepada <a name="contact"><span class="email">%(email)s</span></a>.<br>Jika anda bisa, silahkan gunakan format BibTeX; Lihat <a href="%(bibtex)s">halaman sumber BibTeX</a> untuk contoh.<br>Jangan lupa untuk menyertakan URL jika memungkinkan: <a href="%(citeseer)s">makalah offline kurang berguna</a>.
ja: <a name="contact"><span class="email">%(email)s</span></a> に新しいまたは訂正されたエントリを送信してください。<br /> できれば、BibTeXとしてフォーマットしてください。例として<a href="%(bibtex)s">BibTeX のソースページ</a>をご覧ください。<br /> 可能であれば URL を含めることも覚えておいてください。<a href="%(citeseer)s">オフラインの文書は有用性が低いです</a>。
pl: Prosimy przesłać nowe lub poprawione wpisy na <a name="contact"><span class="email">%(email)s</span></a>.<br /> Jeśli mógłbyś, zapisz je w formacie BibTeX, zobacz przykłady na <a href="%(bibtex)s">stronie BibTeX-a</a>.<br /> Pamiętaj aby umieścić odnośniki: <a href="%(citeseer)s">dokumenty offline są mniej przydatne</a>.
pt: Por favor, envie novas entradas ou corrigidas para <a name="contact"><span class="email">%(email)s</span></a>.<br /> Se possível, por favor, formate-as como BibTeX; consulte a nossa <a href="%(bibtex)s">página de código fonte BibTeX</a> para exemplos.<br /> Lembre-se de incluir os URLs, se possível: <a href="%(citeseer)s">papéis off-line são menos úteis</a>.
tr: Lütfen yeni ya da düzeltilmiş kayıtları <a name="contact"><span class="email">%(email)s</span></a> adresine gönderin.<br /> Yapabiliyorsanız BibTex biçimini kullanın örnekler için <a href="%(bibtex)s">BibTeX kaynak sayfasına</a> bakabilirsiniz.<br /> Yapabiliyorsanız adresleri eklemeyi unutmayın: <a href="%(citeseer)s">çevrimdışı makaleler daha az yararlıdır</a>.

source: The source code for this page was adapted from <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.
de: Der Sourcecode dieser Seite wurde adaptiert von der <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.
es_ar: El código fuente para esta página fue adaptado desde la <a href="%(anonbib)s">bibliografía de anonimato del proyecto Free Haven</a>.
fr: Le code source de cette page a été adapté de la <a href="%(anonbib)s">bibliographie sur l’anonymat de « Free Haven »</a>.
id: Source code untuk halaman ini diadaptasi dari <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.
ja: このページのソースコードの出典は、<a href="%(anonbib)s">Free Haven's anonymity bibliography</a>によるものです。
pl: Kod źródłowy tej strony został zaadoptowany z <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.
pt: O código-fonte para essa página foi adaptado da <a href="%(anonbib)s">Bibliografia sobre anonimato do Free Heaven</a>.
tr: Bu sayfanın kaynak kodu şuradan uyarlanmıştır: <a href="%(anonbib)s">Free Haven anonymity bibliography</a>.

source: Email
fr: Courriel
ja: Eメール
pl: E-poczta
tr: E-posta

source: Please do not use these email addresses for support requests. For contact specific to research, outreach and security please use:
es_ar: No utilice estas direcciones de correo electrónico para solicitudes de soporte. Para contactos específicos de investigación, divulgación y seguridad, utilice:
fr: S'il vous plaît, n'utilisez pas ces adresses courriels pour des demandes de soutiens. Pour un contact spécifique à la recherche, sensibilisation et sécurité, veuillez utiliser :
id: Mohon Jangan gunakan alamat email ini untuk permintaan support. Untuk kontak khusus untuk penelitian, penjangkauan, dan keamanan, silakan gunakan:
ja: これらのメールアドレスを支援要求に使用しないでください。 研究、アウトリーチ、セキュリティに関するお問い合わせはこちらをご利用ください:
pl: Prosimy nie używać poniższych adresów e‑poczty w celu uzyskania pomocy. Aby uzyskać informacje odnośnie badań naukowych, współpracy bądź luk bezpieczeństwa, prosimy o kontakt:
pt: Não utilize estes endereços de e-mail para pedidos de apoio. Para contactos específicos sobre investigação, divulgação e segurança, utilize:
tr: Lütfen destek istekleri için bu e-posta adreslerini kullanmayın. Araştırma, sosyal yardım ve güvenlik için lütfen şu adresleri kullanın:

source: Please visit our I2P user forum -
es_ar: Visite nuestro foro de usuarios de I2P -
fr: Veuillez visiter notre forum utilisateur I2P -
id: Silakan kunjungi forum pengguna I2P kami -
ja: I2Pユーザーフォーラムをご覧ください -
pl: Prosimy odwiedzić forum użytkowników I2P –
pt: Por favor, visite nosso fórum de usuários I2P -
tr: Lütfen I2P kullanıcı forumumuza bakın -

source: available on non-private internet at https://i2pforum.net and on I2P at http://i2pforum.i2p
es_ar: disponible en Internet no privada en https://i2pforum.net y en I2P en http://i2pforum.i2p
fr: disponible sur l'internet non-privé à https://i2pforum.net et sur I2P à http://i2pforum.i2p
id: tersedia di https://i2pforum.net dan di I2P di http://i2pforum.i2p
ja: 非プライベートネットワークでは https://i2pforum.net で、I2P上ではhttp://i2pforum.i2pで利用できます。
pl: dostępne w nieanonimowym internecie: https://i2pforum.net i w sieci I2P: http://i2pforum.i2p
pt: disponível na internet, não-privado, em https://i2pforum.net e no I2P em http://i2pforum.i2p
tr: normal İnternet üzerinde https://i2pforum.net ve I2P üzerinde http://i2pforum.i2p adreslerinde

source: Most of the discussion about I2P's development happens on the <a href="http://%(zzz)s">I2P developer forum</a> (only reachable from within I2P network). This is usually the best place to start with inquiries, if the dev IRC channel is inactive.
de: Der meiste Austausch zur I2P-Entwicklung findet im <a href="http://%(zzz)s">I2P-Entwicklerforum</a> statt (nur aus dem I2P-Netzwerk erreichbar). Dies ist für gewöhnlich der beste Ort für Nachfragen wenn der IRC-Kanal der Entwickler inaktiv ist.
fr: La majorité de la discussion sur le développement d’I2P a lieu sur le <a href="http://%(zzz)s">forum des développeurs d’I2P</a> (accessible seulement dans le réseau I2P). C’est habituellement le meilleur endroit où poser des questions si le canal IRC dev est inactif.
id: Sebagian besar diskusi tentang pengembangan I2P dapat dilihat di <a href="http://%(zzz)s">forum pengembang I2P</a> (hanya dapat dijangkau dari dalam jaringan I2P). Ini biasanya tempat terbaik untuk memulai pertanyaan jika saluran IRC dev tidak aktif.
ja: <a href="http://%(zzz)s">I2P デベロッパーフォーラム</a> (I2P ネットワーク内からでしか到達できません)ではI2Pの開発事項に関する議論の大半が行われています。開発者のIRCチャンネルが活発でなければ、ここは質問をするには通常最高の場所です。
pl: Większość dyskusji o rozwoju sieci I2P odbywa się na <a href="http://%(zzz)s">forum dewelopera zzz</a> (dostępne tylko poprzez sieć I2P). Jest to najlepsze miejsce do zadawania pytań, gdy kanał IRC „i2p-dev” jest nieaktywny.
pt: A maior parte da discussão sobre o desenvolvimento do I2P acontece no <a href="http://%(zzz)s">fórum de desenvolvimento I2P</a> (apenas acessível a partir da rede I2P). Este é normalmente o melhor lugar para começar com perguntas, se o canal IRC de desenvolvimento estiver inativo.
tr: I2P geliştiricilerinin tartıştığı konuların çoğu <a href="http://%(zzz)s">I2P geliştirici forumu</a> üzerinde bulunur (yalnızca I2P ağından erişilebilir). Geliştirici IRC kanalı etkin değil ise genellikle bu forum başlamak için en uygun yerdir.

source: Social Media
de: Soziale Medien
es_ar: Redes sociales
fr: Les médias sociaux
id: Media Sosial
ja: ソーシャルメディア
pl: Media społecznościowe
pt: As redes sociais
tr: Sosyal Ağlar

source: Our primary IRC network is the Irc2P network within I2P; a default tunnel to this network is set up with new router installs. We are also present on multiple standard networks like <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> and <a href="http://freenode.net/">Freenode</a>. All I2P-related channels on all these network are linked to the main channels on Irc2P via relay bots.
de: Unser primäres IRC Netzwerk ist das Irc2P Netzwerk innerhalb von I2P, ein Standardtunnel zu diesem Netzwerk ist bei einer neuen Installation des Routers aktiv. Wir sind ebenfalls in Standardnetzwerken wie <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> und <a href="http://freenode.net/">Freenode</a> vertreten. Alle I2P relevanten Channels auf diesen Netzwerken sind mit den Hauptchanneln im Irc2P via Relay-Bots verbunden.
es_ar: Nuestra red IRC principal es la red Irc2P dentro de I2P; tras la instalación inicial de I2P ya hay creado por defecto un túnel a esta red. Estamos presentes también en múltiples redes como <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> y <a href="http://freenode.net/">Freenode</a>. Todos los canales relacionados con I2P en esas redes están unidos a los canales principales de Irc2P a través de 'relay bots'.
fr: Notre réseau IRC principal est le réseau Irc2P dans I2P : un tunnel par défaut vers ce réseau est mis en place pour les nouvelles installations de routeurs. Nous sommes également présents sur plusieurs réseaux normaux tels qu’<a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> et <a href="http://freenode.net/">Freenode</a>. Sur tous ces réseaux, tous les canaux relatifs à I2P sont reliés aux canaux principaux d’Irc2P par des robots de relais.
id: Jaringan IRC utama kami adalah jaringan Irc2P di dalam I2P; sebuah tunnel default ke jaringan ini diatur dengan menginstall router baru. Kami juga hadir pada beberapa jaringan standar seperti <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> dan <a href="http://freenode.net/">Freenode</a>. Semua saluran terkait I2P pada semua jaringan terhubung ke saluran utama pada Irc2P melalui bot relay.
ja: 私たちの主要な IRC ネットワークは、 I2P 内にある Irc2P ネットワークです。このネットワークへのデフォルトのトンネルは新規ルーターインストールでセットアップされています。 また、<a href="http://www.oftc.net/oftc/OFTC">OFTC</a>や、<a href="http://www.einirc.de/">EIN</a>、 <a href="http://freenode.net/">Freenode</a>などの複数の標準的なネットワークにもあります。 これらのネットワークのすべての I2P に関連するチャンネルは、すべてリレーボットを経由して Irc2P のメインチャンネルにリンクしています。
pl: Naszą główną siecią IRC jest sieć Irc2P wewnątrz I2P; domyślny tunel do tej sieci jest skonfigurowany w każdej nowej instalacji węzła. Jesteśmy też obecni na kilku standardowych sieciach jak <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> i <a href="http://freenode.net/">Freenode</a>. Wszystkie kanały o I2P na tych sieciach są powiązane z głównymi kanałami na Irc2P poprzez boty przekaźnikowe.
pt: A nossa rede de IRC primária é a rede Irc2P dentro do I2P; um túnel predefinido para esta rede está configurado com as novas instalações do roteador. Nós também estamos presentes em múltiplas redes padrão, tal como <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> e <a href="http://freenode.net/">Freenode</a>. Todos os canais relacionados com o I2P em todas essas redes estão interligados aos principais canais de Irc2P via bots de retransmissão.
tr: Asıl kullandığımız IRC ağı I2P içindeki Irc2P ağıdır ve yeni yöneltici kurulumlarında varsayılan olarak bu ağ için bir tünel hazırlanır. Ayrıca <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> ve <a href="http://freenode.net/">Freenode</a> gibi birden çok standart ağ üzerinde de bulunuyoruz. Bu ağlar üzerinde bulunun I2P ile ilgili tüm kanallar aktarıcı botları aracılığı ile Irc2P üzerindeki ana kanallara bağlanmıştır.

source: Channel list:
de: Kanalliste:
es_ar: Lista de canales:
fr: Liste des canaux :
id: Daftar channel
ja: チャンネルリスト:
pl: Lista kanałów:
pt: Lista de canais:
tr: Kanal listesi:

source: General i2p discussion and help channel
de: Allgemeiner I2P Diskussions- und Hilfekanal
es_ar: Discusión general sobre I2P y canal de ayuda
fr: Discussions générales sur I2P et chaîne d’aide
ja: 全般的な I2P の議論とヘルプチャンネル
pl: ogólna dyskusja o I2P i kanał pomocy
pt: Discussão geral do I2P e canal de ajuda
tr: Genel i2p konuları ve yardım kanalı

source: Offtopic
es_ar: Temas aparte
fr: Hors sujet
ja: 主題から外れた話
pl: pogawędki bez tematu
tr: Diğer konular

source: Development talk
de: Entwickler Gespräche
es_ar: Charla sobre el desarrollo
fr: Discussion de développement
ja: 開発話
pl: czat programistów
pt: Conversa sobre o desenvolvimento
tr: Geliştirici konuları

source: Mailing lists
de: Mailing Listen
es_ar: Listas de correo
fr: Listes de diffusion
id: Milis
ja: メーリングリスト
pl: Listy dyskusyjne
pt: Listas de Discussão
tr: E-posta Listeleri

source: I2P has no active mailing lists, however archives can be accessed.
es_ar: I2P no tiene listas de correo activas, pero se puede acceder a los archivos.
fr: I2P n'a pas de liste courriel active, cependant, les archives sont accessibles.
id: I2P tidak memiliki milis aktif, namun arsipnya dapat diakses.
ja: I2P にはアクティブなメーリングリストはありませんが、アーカイブにアクセス可能です。
pl: Obecnie nie ma aktywnych list dyskusyjnych o I2P, jednakże dostępne są archiwa.
pt: O I2P não tem listas de correio ativas, mas é possível aceder aos arquivos.
tr: I2P için etkin bir e-posta listesi yok. Ancak eski arşivler erişilebilir durumda.

source: Lists
de: Listen
es_ar: Listas
fr: Listes
id: Daftar
ja: リスト
pl: Listy
pt: Listas
tr: Listeler

source: Archive
es_ar: Archivo
id: Arsip
ja: アーカイブ
pl: archiwum
pt: Arquivo
tr: Arşiv

source: I2P developer discussions - anything related to development of I2P
de: I2P Entwickler Diskussionen - alles rund um die Entwicklung von I2P
es_ar: Discusiones de desarrolladores de I2P - cualquier cosa relacionada con el desarrollo de I2P
fr: Discussions pour développeurs d’I2P - tout ce qui est lié au développement d’I2P
id: Diskusi pengembang I2P - apapun yang berhubungan dengan pengembangan I2P
ja: I2P 開発者議論 - I2P の開発に関するすべてのこと
pl: dyskusje deweloperów I2P – wszystko związane z rozwojem I2P
pt: Discussão entre desenvolvedores do I2p - Qualquer coisa relacionada ao desenvolvimento do I2p
tr: I2P geliştirici tartışmaları. I2P geliştirmesi ile ilgili tüm konular
