Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: We also recommend setting a sufficient amount of shared bandwidth - this allows for participating tunnels to be routed through your I2P router. Allowing participating traffic keeps your router well-integrated in the network and improves your transfer speeds.
de: Wir empfehlen ausserdem das Setzen einer ausreichenden Größe an geteilter Bandbreite - dieses erlaubt das Weiterleiten von teilnehmenden Tunneln durch Ihren I2P router. Diese Art von Datenverkehr sorgt für eine gute Integration Ihres Routers im Netzwerk und verbessert auch ihre Transferraten.
es_ar: También recomendamos establecer una cantidad suficiente de ancho de banda compartido - esto permite que los túneles participantes sean enrutados a través de su router I2P. Permitir el tráfico participante mantiene su router bien integrado en la red y mejora sus velocidades de transferencia.
fr: Nous recommandons aussi de définir un montant de bande passante partagée suffisant. Cela permet aux tunnels participants d’être acheminés par votre routeur I2P. En autorisant le trafic participant, votre routeur reste bien intégré au réseau et vos vitesses de transfert sont améliorées.
id: Kami juga merekomendasikan pengaturan jumlah shared bandwidth yang cukup - ini memungkinkan participating tunnel untuk dialihkan melalui router I2P Anda. Mengizinkan lalu lintas participating tunnel membuat router Anda terintegrasi dengan baik di jaringan dan meningkatkan kecepatan transfer Anda.
ja: 我々はまた共有帯域幅を十分にとった設定を推奨します - これによりあなたのI2Pルーターで中継される参加トンネルへの余裕ができます。 参加トラフィックを割り当てることはあなたのルーターをネットワークによく統合されたものにし、転送速度を向上させます。
pl: Również zalecamy ustawienie wystarczającej ilości udostępnianego pasma – pozwala to na uczestnictwo w tunelowaniu ruchu innych uczestników przez Twój węzeł I2P. Tunelowanie ruchu innych sprawia, że Twój węzeł jest dobrze zintegrowany z siecią i zwiększa szybkości Twoich transferów.
pt: Recomendamos também que defina uma quantidade suficiente de largura de banda partilhada - isto permite que os túneis participantes sejam encaminhados através do seu router I2P. Permitir o tráfego participante mantém o seu router bem integrado na rede e melhora as suas velocidades de transferência.
tr: Ayrıca bant genişliğini yeterli oranda paylaşmanız önerilir. Böylece I2P yönelticiniz üzerinden yöneltilen tünellere katkıda bulunabilirsiniz. Trafiğe katkıda bulunduğunuzda yönelticiniz ağ ile daha iyi bütünleşir ve aktarım hızınızı arttırır.

source: I2P is a work in progress. Lots of improvements and fixes are being implemented, and, generally speaking, running the latest release will help your performance. If you haven't, <a href="%(downloadslist)s">install the latest release</a>.
de: I2P ist Work-In-Progress. Viele Verbesserungen und Korrekturen werden konstant hinzugefügt. Üblicherweise hilft das Einspielen und Nutzen der jeweils aktuellen Version, bessere Datentransferwerte zu erhalten. Falls noch nicht geschehen, <a href="%(downloadslist)s">installierne Sie bitte die aktuelle Version</a>.
es_ar: I2P es un trabajo en curso. Muchas mejoras y arreglos están siendo implementadas, y generalmente usando la última versión mejorará el rendimiento. Si no la tiene, <a href="%(downloadslist)s">instale la última versión</a>.
fr: I2P est un travail de longue haleine. De nombreuses améliorations et correctifs sont mis en place et, de manière générale, vous obtiendrez de meilleures performances en utilisant la dernière version. Si ce n’est pas le cas, <a href="%(downloadslist)s">installez la dernière version</a>.
id: I2P adalah proyek yang sedang berjalan. Banyak peningkatan dan perbaikan sedang diterapkan, dan secara umum, menjalankan rilis terbaru akan membantu kinerja anda. Jika belum, <a href="%(downloadslist)s">instal rilis terbaru</a>.
ja: I2P 開発中のものです。数多くの改善や修正が実装されており、一般的に言って、最新のリリースを使用するとパフォーマンスが改善します。 そうでなければ、<a href="%(downloadslist)s">最新のリリースをインストールしてください</a>。
pl: I2P jest wciąż w fazie rozwoju. Jest wprowadzane mnóstwo ulepszeń i poprawek, i ogólnie mówiąc, korzystanie z najnowszej wersji ma pozytywny wpływ na wydajność. Jeżeli tego nie zrobiłeś, to <a href="%(downloadslist)s">zainstaluj najnowszą wersję</a>.
pt: I2P é um trabalho em progresso. Muitas melhorias e correções estão sendo implementadas, e, de maneira geral, usar o último lançamento vai auxiliar no seu desempenho. Se você não tem, <a href="%(downloadslist)s">instale o último lançamento</a>.
tr: I2P sürekli üzerinde çalışılan bir yapıdır. Pek çok geliştirme ve düzeltme yapıldığından genel olarak en son sürümü kullanmanız en iyi deneyimi elde etmenizi sağlar. Eski bir sürüm kullanıyorsanız <a href="%(downloadslist)s">son sürümü kurun</a>.

source: You may report any bugs/issues that you encounter on our bugtracker, which is available over both non-private internet and I2P. We have a discussion forum, also available on I2P and non-private internet. You can join our IRC channel as well: either through our IRC network, IRC2P, or on Freenode.
es_ar: Puedes informar de cualquier error/problema que encuentres en nuestro bugtracker, que está disponible tanto en Internet no privado como en I2P. Tenemos un foro de debate, también disponible en I2P y en Internet no privado. También puedes unirte a nuestro canal de IRC: ya sea a través de nuestra red IRC, IRC2P, o en Freenode.
fr: Vous pouvez signaler n'importe quel bogue/problème que vous rencontrez sur notre traqueur de bogue qui est disponible sur l'internet non-privé et I2P. Nous avons un forum de discussion aussi disponible sur I2P et l'internet non-privé. Vous pouvez aussi rejoindre notre canal IRC : soit à travers notre réseau IRC, IRC2P ou sur Freenode.
id: Anda dapat melaporkan bug/masalah apa pun yang Anda temui di pelacak bug kami, yang tersedia melalui internet dan I2P. Kami memiliki forum diskusi, juga tersedia di I2P dan internet. Anda juga dapat bergabung dengan saluran IRC kami: baik melalui jaringan IRC kami, IRC2P, atau di Freenode.
ja: 出くわしたバグや問題は我々のバグトラッカーに報告してください。クリアネットでもI2Pでも利用可能です。 ディスカッションフォーラムを持っており、これもクリアネットとI2Pで利用可能。 IRCチャンネルにも参加できます： 我々のIRCネットワーク、IRC2P、Freenodeなどで。
pl: Napotkane błędy/problemy można zgłaszać na naszym systemie śledzenia błędów, dostępnym zarówno z normalnego internetu jak i z I2P. Mamy również forum – dostępne z I2P i z normalnego internetu. Mamy również kanał IRC – dostępny poprzez I2P (Irc2P) lub poprzez Freenode.
pt: Pode reportar quaisquer erros/problemas que encontre no nosso bugtracker, que está disponível tanto na Internet não privada como no I2P. Temos um fórum de discussão, também disponível no I2P e na Internet não privada. Também pode juntar-se ao nosso canal de IRC: ou através da nossa rede IRC, IRC2P ou no Freenode.
tr: Karşılaştığınız hata ve sorunları normal İnternet ya da I2P ağı üzerindeki hata izleyicimizi kullanarak bildirebilirsiniz. Ayrıca gene normal İnternet ve I2P ağı üzerinden ulaşabileceğiniz bir tartışma forumumuz bulnuyor. IRC kanalımıza ise: IRC ağımız, IRC2P ya da Freenode üzerinden katılabilirsiniz.

source: Our Bugtracker:
de: Unser Bugtracker:
fr: Notre système de suivi de bogues :
id: Bugtracker kami:
ja: バグトラッカー
pl: System śledzenia błędów:
pt: Nosso Rastreador De Falhas:
tr: Hata İzleyicimiz:

source: Non-private internet:
es_ar: Internet no privado:
fr: Internet non-privé :
id: Internet non-pribadi:
ja: 非プライベートインターネット：
pl: zwykły internet:
pt: Internet não privada:
tr: Normal İnternet:

source: On I2P:
de: Über I2P:
es_ar: En I2P:
fr: Sur I2P :
id: Di i2p:
ja: I2P上:
pl: sieć I2P:
pt: Sobre I2P:
tr: I2P üzerinde:

source: Our forums:
de: Unsere Foren:
es_ar: Nuestros foros:
fr: Nos forums :
id: Forum kami:
ja: フォーラム:
pl: Forum:
pt: Nossos fóruns:
tr: Forumlarımız:

source: You may paste any interesting logs to a paste service such as the non-private internet services listed on the <a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Directory">PrivateBin Wiki</a>, or an I2P paste service such as this <a href="http://paste.crypthost.i2p">PrivateBin instance</a> or this <a href="http://pasta-nojs.i2p">Javascript-free paste service</a> and follow up on IRC in #i2p<
fr: Vous pouviez coller n'importe quel journaux intéressants sur un service colle comme les services d'internet non-privé listé sur le <a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Directory">Wiki PrivateBin</a> ou un service colle comme celui-i <a href="http://paste.crypthost.i2p">instance PrivateBin</a> ou celui-là <a href="http://pasta-nojs.i2p">service colle Javascript-free</a> et suivre sur IRC dans #i2p<
id: Anda dapat mengirimkan log menarik ke paste service seperti layanan internet non-pribadi yang terdaftar di <a href="https://github.com/privatebin/privatebin/wiki/privatebin-directory"> PrivateBin Wiki </a>, atau paste service I2P seperti ini <a href="http://paste.crypthost.i2p">PrivateBin instance</a> or this <a href="http://pasta-nojs.i2p">paste service bebas Javascript</a> dan tindak lanjuti di IRC di #i2p<
ja: 興味深いログをPasteサービスに貼り付けるのもいいでしょう。<a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Directory">PrivateBin Wiki</a>に載っているクリアネットサービスや、I2PのPasteサービス、例えば<a href="http://paste.crypthost.i2p">このPriveteBinインスタンス</a>や<a href="http://pasta-nojs.i2p">このJavaScript不要のPasteサービス</a>が利用できる。そして#i2pのIRCを追うとよいでしょう。
pl: Możesz wkleić powiązany dziennik zdarzeń do wklejarki (pastebin), listę wklejarek w zwykłym internecie znajdziesz na <a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Instances-Directory">PrivateBin Wiki</a>; w sieci I2P dostępny jest <a href="http://paste.crypthost.i2p">ten serwer PrivateBin</a> bądź <a href="http://pasta-nojs.i2p">ten serwer niewymagający JavaScriptu</a>, a następnie wejdź na kanał #i2p na naszym IRC.
pt: Pode colar quaisquer registos interessantes num serviço de colagem, como os serviços de Internet não privados listados na <a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Directory">wiki PrivateBin</a>ou um serviço de paste I2P como esta <a href="http://paste.crypthost.i2p">instância do PrivateBin</a> ou este <a href="http://pasta-nojs.i2p">Serviço de colar sem Javascript</a> e acompanhar no IRC em #i2p<
tr: İlginç günlükleri şuralarda bulabileceğiniz normal İnternet hizmetleri üzerine yapıştırabilirsiniz: <a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Directory">PrivateBin Wiki</a> üzerinde bulabileceğiniz ya da <a href="http://paste.crypthost.i2p">PrivateBin kopyası</a> bir I2P yapıştırma hizmeti ya da <a href="http://pasta-nojs.i2p">JavaScript ücretsiz yapıştırma hizmeti</a>. IRC üzerindeki #i2p< kanalından izleyebilirsiniz

source: Join #i2p-dev Discuss with the developers on IRC
de: Betreten Sie den Kanal #i2p-dev und diskuteiren Sie mit den Entwicklern im IRC
es_ar: Únete a #i2p-dev Discute con los desarrolladores en IRC
fr: Joignez-vous à #i2p-dev Discutez avec les développeurs sur IRC
id: Bergabunglah dengan #i2p-dev Diskusikan dengan para pengembang di IRC
ja: IRCの#i2p-devに参加し開発者と議論しましょう
pl: Porozmawiaj z programistami na IRC-u na kanale #i2p-dev
pt: Junte-se ao #i2p-dev Discuta com os desenvolvedores no IRC
tr: IRC üzerinde geliştiriciler ile görüşmek için #i2p-dev kanalına katılın

source: Please include relevant information from the router logs page which is available at: <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. We request that you share all of the text under the 'I2P Version and Running Environment' section as well as any errors or warnings displayed in the various logs displayed on the page.
de: Bitte fügen Sie alle relevanten Informationen aus der Router Statusberichts Seite an: <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. Wir erwarten den gesamten Text unterhalb von 'I2P-Version & Laufzeitumgebung'
fr: Veuillez inclure toutes les informations pertinentes de la page des journaux du routeur accessible sur <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. Nous vous demandons de partager tout le texte qui se trouve sous le paragraphe 'Version d’I2P et environnement d’exécution', ainsi que toute erreur ou tout avertissement qui apparaîtrait dans les divers journaux affichés sur la page.
id: Harap sertakan informasi yang relevan dari halaman log router yang tersedia di: <a href="http://127.0.0.1:7657/logs"> http://127.0.0.1:7657/logs </a>. Kami meminta Anda membagikan semua teks di bawah bagian 'Versi I2P dan Running Environment' serta kesalahan atau peringatan apa pun yang ditampilkan di berbagai log yang ditampilkan di halaman tersebut.
ja: ルーターログのページ <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a> から関連情報を含めてください。 当該ページに表示される様々なログの中のエラーや警告と共に、「I2Pバージョンと実行環境」セクション下の記述全てを晒してください。
pl: Prosimy zawrzeć powiązane informacje z dziennika zdarzeń węzła, który jest dostępny pod adresem <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. Prosimy o udostępnienie całego tekstu z sekcji „wersja I2P i środowisko uruchomieniowe” wraz z błędami/ostrzeżeniami wyświetlanymi w dzienniku na stronie konsoli.
pt: Inclua informações relevantes da página de registos do router, disponível em: <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. Solicitamos que partilhe todo o texto na secção 'Versão I2P e ambiente de execução' bem como quaisquer erros ou avisos apresentados nos vários registos apresentados na página.
tr: Lütfen şu adresteki yöneltici günlükleri bölümünden erişebileceğiniz ilgili günlükleri de ekleyin: <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. 'I2P Version and Running Environment' bölümünün altındaki tüm metni ve buradaki diğer günlüklerde görebileceğiniz tüm hata ve uyarıları paylaşmanızı rica ederiz.

source: Great! Find us on IRC: <ul> <li>on <code>irc.freenode.net</code> channel <code>#i2p</code></li> <li>on <code>IRC2P</code> channel <code>#i2p</code></li> </ul> or post to <a href="http://%(forum)s/">the forum</a> and we'll post it here (with the answer, hopefully).
de: Großartig! Finden Sie uns im IRC: <ul> <li>im<code>irc.freenode.net</code> Kanal <code>#i2p</code></li> <li>im <code>IRC2P</code> Kanal <code>#i2p</code></li> </ul> oder schreiben Sie ins <a href="http://%(forum)s/">Forum</a> und wir notieren es hier (mit einer passenden Antwort, hoffentlich).
fr: Très bien ! Retrouvez-nous sur IRC : <ul> <li>sur le canal <code>#i2p</code> d’<code>irc.freenode.net</code></li> <li>sur le canal <code>#i2p</code> d’<code>IRC2P</code></li> </ul> ou publiez-la dans le <a href="http://%(forum)s/">forum</a> et nous la publierons ici (avec la réponse, espérons).
id: Bagus! Temukan kami di IRC: <ul> <li>on <code>irc.freenode.net</code> channel <code>#i2p</code></li> <li>di saluran <code>IRC2P</code> <code>#i2p</code></li> </ul> atau posting ke <a href="http://%(forum)s/">forum</a> dan kami akan mempostingnya di sini (dengan jawabannya, semoga).
ja: いいですね！IRCで我々を見つけましょう： <ul> <li> <code>irc.freenode.net</code> 上のチャンネル <code>#i2p</code></li> <li> <code>IRC2P</code> 上のチャンネル <code>#i2p</code></li> </ul> あるいは<a href="http://%(forum)s/">フォーラム</a>に投稿してください。我々が投稿を付けます（できれば回答付きで）。
pl: Świetnie! Znajdziesz nasz na IRC: <ul> <li>na kanale <code>#i2p</code> na <code>irc.freenode.net</code></li> <li>na kanale <code>#i2p</code> na <code>IRC2P</code></li> </ul> lub napisz na <a href="http://%(forum)s/">forum I2P</a>, a my Ci odpiszemy.
pt: Fantástico! Encontre-nos no IRC: <ul> <li>no <code>irc.freenode.net</code> canal <code>#i2p</code></li> <li>no <code>IRC2P</code> canal <code>#i2p</code></li> </ul> ou publique no <a href="http://%(forum)s/">fórum</a> e nós iremos publicar aqui (com a respostas, com boas perspetivas).
tr: Harika! Bize IRC üzerinde katılın: <ul> <li><code>irc.freenode.net</code> sunucusundaki <code>#i2p</code> kanalını</li> <li><code>IRC2P</code> sunucusundaki <code>#i2p</code> kanalını </li> </ul> kullanabilir ya da <a href="http://%(forum)s/">foruma</a> yazabilirsiniz. Biz de size (umuyoruz ki çözüm ile) yanıt veririz.

source: German laws
de: Deutsche Gesetze
es_ar: Leyes alemanas
fr: Lois allemandes
id: Hukum di Jerman
ja: ドイツ法
pl: Niemieckie prawo
pt: Leis alemãs.
tr: Alman yasaları

source: I2P Anonymous Network
de: I2P Anonymes Netzwerk
es_ar: Red anónima I2P
fr: Réseau anonyme I2P
id: Jaringan Anonim i2p
ja: I2P 匿名ネットワーク
pl: Sieć Anonimowa I2P
pt: I2P Rede Anônima
tr: I2P Anonim Ağı

source: Anonymous peer-to-peer distributed communication layer built with open source tools and designed to run any traditional Internet service such as email, IRC or web hosting.
de: Eine anonyme Peer-to-Peer-Netzwerkschicht, die mit quelloffenen Werkzeugen erstellt wurde und traditionelle Internetdienste wie Email, IRC oder das Betreiben von Websites ermöglicht
es_ar: Capa anónima de comunicación distribuida par-a-par construida con herramientas de código libre y diseñada para usar cualquier servicio de internet tradicional como email, IRC, foros o páginas webs.
fr: Couche de communication distribuée, anonyme, pair à pair, construite avec des outils à code source ouvert et conçue pour faire tourner n’importe quel service Internet traditionnel tel que le courriel, l’IRC ou l’hébergement Web.
id: Anonymous peer-to-peer distributed communication layer dibangun dengan alat open source dan dirancang untuk menjalankan layanan Internet tradisional seperti email, IRC atau web hosting.
ja: 匿名 P2P 分散型コミュニケーションレイヤーは、オープンソースのツールで作られ、電子メールや IRC 、ウェブホスティングなどの伝統的なインターネットサービスを動かせるよう設計されました。
pl: Anonimowa rozproszona i bezpośrednia (peer-to-peer) warstwa komunikacji stworzona za pomocą otwartoźródłowego oprogramowania i przeznaczona do uruchamiania tradycyjnych usług internetowych jak e-mail, IRC i stron internetowych.
pt: Interface para comunicação anónima baseada em mensagens distribuídas ponto-a-ponto, construída com ferramentas de código aberto, feita para funcionar com serviços tradicionais da Internet, como e-mail, IRC ou hospedagem de sites.
tr: Açık kaynak araçları ile e-posta, IRC, site yayınlama gibi geleneksel İnternet hizmetlerini çalıştırmak için tasarlanmış, anonimlik sağlayan uçtan uca dağıtılmış iletişim katmanı.

source: Welcome to the Invisible Internet
es_ar: Bienvenido a Internet invisible
fr: Bienvenue dans l'internet Invisible
id: Selamat datang di Invisible Internet
ja: 不可視なインターネットへようこそ!
pl: Witamy w niewidzialnym internecie
pt: Boas-vindas à Internet Invisível
tr: Merhaba Invisible Internet

source: The Invisible Internet is a privacy by design, people-powered network. It is a truly free and anonymizing Internet alternative. Get I2P.
es_ar: Internet Invisible es una red de privacidad por diseño, impulsada por las personas. Es una alternativa a Internet verdaderamente libre y anónima. Consigue I2P.
fr: L'internet Invisible est un réseau alimentée par le peuple conçu pour l'intimité. C'est un internet alternatif réellement libre et anonyme. Obtenez I2P.
id: Invisible Internet adalah jaringan yang dirancang khusus untuk privasi dan dijalankan oleh komunitas. Ini adalah alternatif Internet yang benar-benar gratis dan menganonimkan. Dapatkan I2P.
ja: 不可視のインターネットはプライバシー・バイ・デザインかつ人々の力で機能するネットワークです。完全に無料で匿名のインターネットの代替物です。I2Pを入手しよう。
pl: Projekt Niewidzialny Internet jest siecią tworzoną przez wolontariuszy zaprojektowaną z myślą o prywatności. Jest to wolna i anonimowa alternatywa dla zwykłego internetu.
pt: A Internet Invisível é uma rede de privacidade do esboço, alimentada por pessoas. Um alternativo de Internet verdadeiramente livre e anônima. Adquira I2P.
tr: Invisible Internet Project, tasarımı gereği gizlilik gücünü insanların katkılarından alan bir ağdır. Gerçekten özgür ve anonim kalmayı sağlayan bir İnternet alternatifidir. I2P uygulamasını indirin.

source: Get I2P %(version)s
de: Download I2P %(version)s
es_ar: Descarga I2P %(version)s
fr: Obtenir I2P %(version)s
id: Dapatkan I2P %(version)s
ja: I2P %(version)s を入手
pl: Pobierz I2P %(version)s
pt: Obter o I2P %(version)s
tr: I2P %(version)s sürümünü alın

source: What is I2P?
de: Was ist I2P ?
es_ar: ¿Qué es I2P?
fr: Qu’est-ce qu’I2P ?
id: Apa itu I2P?
ja: I2P とは
pl: Czym jest I2P?
pt: O que é o I2P?
tr: I2P nedir?

source: The Invisible Internet Project (I2P) is a fully encrypted private network layer. It protects your activity and location. Every day people use the network to connect with people without worry of being tracked or their data being collected. In some cases people rely on the network when they need to be discrete or are doing sensitive work.
es_ar: El Proyecto Internet Invisible (I2P) es una capa de red privada totalmente encriptada. Protege su actividad y localización. Cada día la gente utiliza la red para conectarse con otras personas sin preocuparse de que las rastreen o recopilen sus datos. En algunos En algunos casos, la gente confía en la red cuando necesita ser discreta o está realizando un trabajo delicado.
fr: Le Projet Internet Invisible (I2P) est une couche réseau privée et entièrement chiffrée. Il protège votre votre activité et emplacement. Les gens de tout les jours utilisent le réseau pour se connecter avec des gens sans l'inquiétude d'être surveillé et d'avoir ses données collectées. Dans quelques cas, des gens se reposent sur le réseau quand ils ont besoin d'être discret et de faire du travail sensible.
id: Invisible Internet Project (I2P) adalah lapisan jaringan pribadi yang sepenuhnya terenkripsi. Ini melindungi aktivitas dan lokasi Anda. Setiap hari orang menggunakan jaringan untuk terhubung dengan orang-orang tanpa khawatir dilacak atau datanya dikumpulkan. Dalam beberapa kasus, orang mengandalkan jaringan ketika mereka perlu melakukan pekerjaan yang terpisah atau melakukan pekerjaan sensitif.
ja: 不可視のインターネットプロジェクト (I2P)は完全に暗号化されたプライベートネットワーク層です。 あなたの活動や位置を保護します。毎日、人々はこのネットワークを使用して、 追跡されたり、データを収集されたりする恐れもなく他者と繋がっています。 他にも、分離する必要があったりセンシティブな作業をする場合に本ネットワークを使用している事例もあります。
pl: Projekt Niewidzialny Internet (|I2P) jest całkowicie szyfrowaną prywatną warstwą sieci. Zapewnia zarówno prywatność jak i anonimowość. Każdego dnia ludzie korzystają z niej, aby łączyć się z innymi ludźmi bez obaw o bycie śledzonymi. Niekiedy ludzie polegają na sieci I2P, kiedy potrzebują dyskrecji lub podczas wykonywania poufnych zadań.
pt: O Projeto Internet Invisível (I2P) é uma camada de rede totalmente privado e criptografado. Ele protege sua atividade e sua localização. Todos os dias as pessoas usam a rede para se conectar com pessoas sem preocupação de serem rasteados ou seus dados serem coletados. Em alguns casos as pessoas confiam na rede quando precisam ser discretas ou estão fazendo um trabalho sensível.
tr: Invisible Internet Project (I2P), tamamen şifrelenmiş bir özel ağ katmanıdır. İşlemlerinizi ve konumunuzu korur. İnsanlar her gün, izlenme veya verilerinin toplanma endişesi duymadan bağlantı kurmak için bu ağı kullanıyor. İnsanlar özel ve gizli kalmasını istedikleri çeşitli durumlar için bu ağa güveniyor.

source: I2P Cares About Privacy
de: I2P ist Ihre Privatsphäre wichtig
fr: I2P se soucie de votre vie privée
id: I2P Peduli dengan Privasi
ja: I2Pはプライバシーを大切にします
pl: I2P troszczy się o prywatność
pt: I2P Se Preocupa Sobre Privacidade
tr: I2P kişisel gizliliğe önem verir
