Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: In this diagram, the path that some I2P traffic takes as it travels through the network is traced. A user's I2P router is denoted by the box labeled 'A' and an I2P Hidden Service (for example, the http://stats.i2p website) is labelled as 'B'. Both the client and the server are using 3-hop tunnels, these hops are represented by the boxes labelled 'P', 'Q', 'R', 'X', 'Y', 'Z', 'P_1', 'Q_1', 'R'_1, 'X_1', 'Y_1' and 'Z_1'.
de: In diesem Diagramm ist der der Weg von wenigen Daten durch das I2P Netz aufgezeichnet. Der I2P Router eines Nutzers ist die Box mit dem 'A' Label, und ein I2P Versteckter Service (z.B. die http://stats.i2p Webseite) ist mit 'B' gekennzeichnet. Sowohl Klient als auch Server nutzen Tunnels mit 3 Hops, diese Hops werden mit den Boxen mit den Labeln 'P', 'Q', 'R', 'X', 'Y', 'Z', 'P_1', 'Q_1', 'R'_1, 'X_1', 'Y_1' und 'Z_1' dargestellt.
es_ar: En este diagrama se muestra la ruta que sigue el tráfico I2P en su viaje por la red. El enrutador I2P de un usuario está representado por la casilla "A" y un servicio oculto I2P (por ejemplo, el sitio web http://stats.i2p) por la casilla "B". Tanto el cliente como el servidor utilizan túneles de 3 saltos, representados por las casillas "P", "Q", "R", "X", "Y", "Z", "P_1", "Q_1", "R'_1, "X_1", "Y_1" y "Z_1".
fr: Dans ce diagramme est tracé le chemin qu’un trafic I2P quelconque prend alors qu’il voyage dans le réseau. La boîte A représente le routeur I2P d’un utilisateur et la boîte B représente un service caché d’I2P (par exemple le site Web http://stats.i2p). Le client et le serveur utilisent tous les deux des tunnels à trois sauts. Ces sauts sont représentés par les boîtes 'P', 'Q', 'R', 'X', 'Y', 'Z', 'P_1', 'Q_1', 'R'_1, 'X_1', 'Y_1' et 'Z_1'.
id: Dalam diagram ini, jalur yang diambil oleh beberapa lalu lintas I2P saat melewati jaringan dapat dilacak. Router I2P pengguna dilambangkan dengan kotak berlabel 'A' dan Hidden Service I2P (misalnya, situs web http://stats.i2p) diberi label sebagai 'B'. Baik klien dan server menggunakan tunnel 3-hop, hop-hop ini diwakili oleh kotak berlabel 'p', 'q', 'r', 'x', 'y', 'z', 'p_1', ' Q_1 ',' r'_1, 'x_1', 'y_1' dan 'z_1'.
ja: 図では、I2Pトラフィックがネットワークを渡っていくように通る経路が描かれています。 ユーザのI2Pルーターは A と書かれた箱、I2P秘匿サービス（例えばhttp://stats.i2p のサイト）は B で示されています。 クライアントとサーバーは両方3ホップのトンネルを使用していて、それらは P、Q、R、X、Y、Z、P_1、Q_1、R_1、X_1、Y_1、Z_1 と書かれた箱で表示されています。
pl: Na tym rysunku jest prześledzona droga wiadomości w sieci I2P. Węzeł użytkownika I2P jest oznaczony jako „A”, a ukryta usługa (przykładowo strona http://stats.i2p) jest oznaczony jako „B”. Zarówno klient jak i serwer korzystają z 3-skokowych tuneli, te skoki są reprezentowane jako: „P”, „Q”, „R”, „X”, „Y”, „Z”, „P₁”, „Q₁”, „R₁”, „X₁”, „Y₁” i „Z₁”.
pt: Neste diagrama, é traçado o caminho que algum tráfego da I2P percorre ao viajar pela rede. O router I2P de um utilizador é representado pela caixa 'A' e um serviço oculto I2P (por exemplo, o sítio Web http://stats.i2p) é identificado como 'B'. Tanto o cliente como o servidor estão a utilizar túneis de 3 saltos, sendo estes saltos representados pelas caixas identificadas como 'P', 'Q', 'R', 'X', 'Y', 'Z', 'P_1', 'Q_1', 'R'_1, 'X_1', 'Y_1' e 'Z_1'.
tr: Bu çizimde, bir I2P trafiğinin ağ üzerinde nasıl dolaştığını görebilirsiniz. Bir kullanıcının I2P yönelticisi 'A' kutusu ile, bir gizli hizmet (http://stats.i2p sitesi gibi) 'B' kutusu ile gösterilmiştir. Hem istemci hem de sunucu 3 duraklı tüneller kullanmaktadır ve bu duraklar 'P', 'Q', 'R', 'X', 'Y', 'Z', 'P_1', 'Q_1', 'R'_1, 'X_1', 'Y_1' ve 'Z_1' olarak işaretlenmiş kutular ile gösterilmiştir.

source: The boxes labelled 'P', 'Q' and 'R' represent an outbound tunnel for A while the boxes labelled 'X_1', 'Y_1', 'Z_1' represent an outbound tunnel for 'B'. Similarly, the boxes labelled 'X', 'Y' and 'Z' represent and inbound tunnel for 'B' while the boxes labelled 'P_1', 'Q_1' and 'R_1' represent an inbound tunnel for 'A'. The arrows in between the boxes show the direction of traffic. The text above and below the arrows detail some example bandwidth between a pair of hops as well as example latencies.
de: Die Boxen mit den Labeln 'P', 'Q' und 'R' stellen einen ausgehenden Tunnel für 'A' dar, während die Boxen mit den Labeln 'X_1', 'Y_1', 'Z_1' einen Ausgehenden Tunnel für 'B' darstellen. Kongruent stellen die Boxen mit den Labeln 'X', 'Y' und 'Z' einen eingehenden Tunnel für 'B' dar und die Boxen mit den Labeln 'P_1', 'Q_1' und 'R_1' einen eingehenden Tunnel für 'A'. Die Pfeile zwischen den Boxen zeigen die Richtung des Datenstroms. Der Text über und unter den Pfeilen zeigen exemplarisch die Bandbreite und Latenz zwischen den einzelnen Stationen.
es_ar: Las casillas "P", "Q" y "R" representan un túnel de salida para A, mientras que las casillas "X_1", "Y_1" y "Z_1" representan un túnel de salida para "B". Del mismo modo, las casillas "X", "Y" y "Z" representan un túnel de entrada para "B", mientras que las casillas "P_1", "Q_1" y "R_1" representan un túnel de entrada para "A". Las flechas entre las casillas indican el sentido del tráfico. El texto encima y debajo de las flechas muestra ejemplos de ancho de banda entre un par de saltos y ejemplos de latencia.
fr: Les boîtes 'P', 'Q' et 'R' représentent un tunnel sortant pour 'A', alors que les boîtes 'X_1', 'Y_1', 'Z_1' représentent un tunnel sortant pour 'B'. De la même façon, les boîtes 'X', 'Y' et 'Z' représentent un tunnel entrant pour 'B', alors que les boîtes 'P_1', 'Q_1' et 'R_1' représentent un tunnel entrant pour 'A'. Les flèches entre les boîtes indiquent la direction du trafic. Les textes au-dessus et en dessous des flèches expliquent un exemple de bande passante entre une paire de sauts, ainsi que des exemples de latence.
id: Kotak berlabel 'P', 'Q' dan 'R' mewakili outbound tunnel untuk A sedangkan kotak berlabel 'X_1', 'Y_1', 'Z_1' mewakili outbound tunnel untuk 'B'. Demikian pula, kotak berlabel 'X', 'Y' dan 'Z' mewakili inbound tunnel untuk 'B' sedangkan kotak berlabel 'P_1', 'Q_1' dan 'R_1' mewakili inbound tunnel untuk 'A'. Panah di antara kotak menunjukkan arah lalu lintas. Teks di atas dan di bawah panah merinci beberapa contoh bandwidth antara sepasang hop serta contoh latensi.
ja: P・Q・Rの箱は A の発信トンネル、X_1・Y_1・Z_1の箱は B の発信トンネルです。 同様に、X・Y・Zの箱は B の着信トンネル、P_1・Q_1・R_1は A の着信トンネルです。 箱の間の矢印はトラフィックの方向を表しています。 矢印上下の文字はホップ間の帯域幅と遅延の例を詳述しています。
pl: „P”, „Q” i „R” reprezentują tunel wychodzący dla „A”; „X₁”, „Y₁” i „Z₁” reprezentują tunel wychodzący dla „B”. Analogicznie „X”, „Y” i „Z” reprezentują tunel przychodzący dla „B”, oraz „P₁”, „Q₁” i „R₁” oznaczają tunel przychodzący dla „A”. Strzałki symbolizują kierunek ruchu pakietów. Teksty nad i pod strzałkami symbolizują przepustowość i opóźnienie pomiędzy parami skoków.
pt: As caixas identificadas por 'P', 'Q' e 'R' representam um túnel de saída para A, enquanto as caixas identificadas por 'X_1', 'Y_1' e 'Z_1' representam um túnel de saída para “B”. Do mesmo modo, as caixas com as letras 'X', 'Y' e 'Z' representam um túnel de entrada para “B”, enquanto as caixas com as letras 'P_1', 'Q_1' e 'R_1' representam um túnel de entrada para 'A'. As setas entre as caixas indicam o sentido do tráfego. O texto acima e abaixo das setas detalha alguns exemplos de largura de banda entre um par de saltos, bem como exemplos de latências.
tr: 'P', 'Q' ve 'R' ile gösterilen kutular A için gidiş bağlantısı tüneli, 'X_1', 'Y_1' ve 'Z_1' kutuları da 'B' için gidiş bağlantısı tünelidir. Benzer şekilde 'X', 'Y' ve 'Z' kutuları 'B' için geliş bağlantısı tüneli, 'P_1', 'Q_1' ve 'R_1' kutuları da 'A' için geliş bağlantısı tünelidir. Kutular arasındaki oklar trafiğin akış yönünü gösterir. Okların üzerindeki ya da altındaki metinlerde bir durak çifti arasındaki bant genişliği ile örnek gecikme değerleri bulunur.<

source: When both client and server are using 3-hop tunnels throughout, a total of 12 other I2P routers are involved in relaying traffic. 6 peers relay traffic from the client to the server which is split into a 3-hop outbound tunnel from 'A' ('P', 'Q', 'R') and a 3-hop inbound tunnel to 'B' ('X', 'Y', 'Z'). Similarly, 6 peers relay traffic from the server to back to the client.
de: Wenn sowohl Klient als auch Server 3 Hops Tunnels nutzen, sind insgesamt 12 andere I2P Router im Weiterleiten des Datenverkehrs beteiligt. 6 Teilnehmer leiten den Verkehr vom Klienten zum Server, aufgeteilt in einen 3 Hops Ausgangstunnel von 'A' ('P', 'Q', 'R') und einen 3 Hops Eingangstunnel zu 'B' ('X', 'Y', 'Z'). Kongruent dazu leiten 6 Teilnehmer den Verkehr vom Server zum Klienten zurück.
es_ar: Cuando tanto el cliente como el servidor utilizan túneles de 3 saltos, un total de otros 12 enrutadores I2P participan en la retransmisión del tráfico. 6 peers retransmiten el tráfico del cliente al servidor, que se divide en un túnel de salida de 3 saltos desde "A" ("P", "Q", "R") y un túnel de entrada de 3 saltos hacia "B" ("X", "Y", "Z"). Del mismo modo, 6 pares retransmiten el tráfico desde el servidor hasta el cliente.
fr: Si le client et le serveur utilisent toujours tous les deux des tunnels à trois sauts, un total de 12 autres routeurs I2P sont impliqués dans le relais du trafic. 6 paires relaient le trafic du client vers le serveur, trafic qui est scindé en un tunnel sortant à 3 sauts provenant de 'A' ('P', 'Q', 'R') et un tunnel entrant à 3 sauts vers 'B' ('X', 'Y', 'Z'). De la même façon, 6 paires relaient le trafic du serveur pour le retourner au client.
id: Ketika klien dan server menggunakan terowongan 3-hop, total 12 router I2P lainnya terlibat dalam menyampaikan lalu lintas. 6 peer meneruskan lalu lintas dari klien ke server yang dibagi menjadi outbound tunnel 3-hop dari 'A' ('P', 'Q', 'R') dan inbound tunnel 3-hop ke 'B' (' X', 'Y', 'Z'). Demikian pula, 6 peer menyampaikan lalu lintas dari server kembali ke klien.
ja: クライアントとサーバーの両方が3ホップのトンネルを使うと、合計12の他ルーターがトラフィック中継に関わることになります。 6ピアがクライアントからサーバーへのトラフィックを中継します。それは A からの3ホップの発信トンネル（P・Q・R）と B への3ホップの着信トンネル（X・Y・Z）から成ります。 同様にして、6ピアがサーバーからクライアントに戻るトラフィックを中継します。
pl: Kiedy zarówno klient jak i serwer korzystają z 3‑skokowych tuneli, sumarycznie 12 innych węzłów sieci I2P tuneluje ruch. 6 uczestników pośredniczy w transferze od klienta do serwera, na transfer ten składa się 3‑skokowy tunel wychodzący z „A” („P”, „Q”, „R”) i 3‑skokowy tunel przychodzący do „B” („X”, „Y”, „Z”). W podobny sposób 6 uczestników pośredniczy w transferze od serwera do klienta.
pt: Quando tanto o cliente como o servidor estão a utilizar túneis de 3 saltos, um total de 12 outros routers I2P estão envolvidos na retransmissão de tráfego. 6 pares retransmitem o tráfego do cliente para o servidor, que é dividido num túnel de saída de 3 saltos de 'A' ('P', 'Q', 'R') e num túnel de entrada de 3 saltos para 'B' ('X', 'Y', 'Z'). Do mesmo modo, 6 pares retransmitem o tráfego do servidor para o cliente.
tr: Hem istemci hem de sunucunun 3 duraklı tüneller kullandığı varsayıldığında, trafiğin yöneltilmesi için toplam 12 farklı I2P yönelticisi kullanılır. Trafiğin istemciden sunucuya aktarılması için, gidiş bağlantısı tüneli olarak 'A' kutusundan 3 durak ('P', 'Q', 'R'), geliş bağlantısı tüneli olarak 'B' kutusundan 3 durak ('X', 'Y', 'Z') yapan 6 eş kullanılır. Benzer şekilde sunucudan istemciye aktarılan trafik için de başka 6 eş kullanılır.

source: First, we can consider latency - the time that it takes for a request from a client to traverse the I2P network, reach the the server and traverse back to the client. Adding up all latencies we see that:
de: Zuerst betrachten wir die Latenz - die Zeit, die vom eigentlichen Request des Klienten vergeht, bis die Anfrage durch das Netzwek beim Server ankommt und die Antwort zurück zum Klienten kommt. Alle Latenzen aufsummiert erkennen wir:
es_ar: En primer lugar, podemos considerar la latencia: el tiempo que tarda una solicitud de un cliente en atravesar la red I2P, llegar al servidor y volver al cliente. Sumando todas las latencias vemos que:
fr: En premier lieu, nous pouvons prendre en considération la latence, le temps nécessaire pour que la requête d’un client traverse le réseau, atteigne le serveur et retourne au client. En additionnant toutes les attentes, nous voyons que :
id: Pertama, kita dapat mempertimbangkan latensi - waktu yang diperlukan permintaan dari klien untuk melintasi jaringan I2P, mencapai server, dan melintasi kembali ke klien. Menambahkan semua latensi, kita dapat melihat:
ja: 第1に遅延を考えてみましょう - クライアントからのリクエストがI2Pネットワークを渡り、サーバーに到着、クライアントまで戻ってくるのにかかる時間です。 全ての遅延を足し合わせると次のようになります：
pl: Na początek rozważmy opóźnienie – czas potrzebny na wysłanie zapytania od klienta przez sieć I2P do serwera i wysłanie odpowiedzi z powrotem do klienta. Dodając opóźnienia otrzymujemy:
pt: Em primeiro lugar, podemos considerar a latência - o tempo que demora um pedido de um cliente a atravessar a rede I2P, a chegar ao servidor e a regressar ao cliente. Somando todas as latências, vemos que:
tr: İlk olarak gecikmeyi ele alalım - Gecikme, bir istemci isteğinin I2P ağını geçmesi, sunucuya ulaşması ve istemciye geri dönmesi için geçen süredir. Tüm gecikmeleri eklediğimizde şunu görürüz:

source: The total round-trip time in our example adds up to 740 ms - certainly much higher than what one would normally see while browsing regular internet websites.
de: Die totale Roundtrip Zeit in unserem Beispiel summiert sich auf 740 ms - eindeutig viel höher als die Zeiten, die beim Besuchen von Websiten im regulären Internet auftreten.
es_ar: En nuestro ejemplo, el tiempo total de ida y vuelta asciende a 740 ms, mucho más de lo que se tarda normalmente en navegar por sitios web normales.
fr: Dans notre exemple, le temps d’aller-retour est de 740 ms, ce qui est beaucoup plus que ce que l’on pourrait espérer normalement en parcourant des sites Web de l’Internet ordinaire.
id: Total waktu pulang-pergi dalam contoh total hingga 740 ms - tentu saja jauh lebih tinggi dari yang biasanya dialami saat menjelajahi situs web internet biasa.
ja: この例における往復の合計時間は 740 ms です - 確かに通常のインターネットサイトを閲覧するときに通常観察される時間よりずっと大きいです。
pl: W naszym przykładzie jest to 740 ms – zdecydowanie więcej niż podczas normalnego przeglądania internetu.
pt: O tempo total de ida e volta no nosso exemplo ascende a 740 ms - certamente muito mais elevado do que o que se veria normalmente ao navegar em sítios Internet normais.
tr: Örneğimizdeki toplam gidiş dönüş süresi 740 ms olur. Bu süre normal internet sitelerinde alışık olduğumuzun çok üzerindedir.

source: Second, we can consider available bandwidth. This is determined through the slowest link between hops from the client and server as well as when traffic is being transmitted by the server to the client. For traffic going from the client to the server, we see that the available bandwidth in our example between hops 'R' &amp; 'X' as well as hops 'X' &amp; 'Y' is 32 KB/s. Despite higher available bandwidth between the other hops, these hops will act as a bottleneck and will limit the maximum available bandwidth for traffic from 'A' to 'B' at 32 KB/s. Similarly, tracing the path from server to client shows that there is maximum bandwidth of 64 KB/s - between hops 'Z_1' &amp; 'Y_1, 'Y_1' &amp; 'X_1' and 'Q_1' &amp; 'P_1'.
de: Zweitens betrachten wir die verfügbare Bandbreite. Diese wird von langsamten Verbindung zwischen den Hops bestimmt, sowohl auf dem Weg von Klienten zum Server als auch am Weg zurück. Für den Verkehr vom Klienten zum Server sehen wir in unserem Beispiel die verfügbare Bandbreite zwischen Hops 'R' &amp; 'X' als auch zwischen den Hops 'X' &amp; 'Y' ist 32 KB/s. Unabhängig von der höheren verfügbaren Bandbreite zwischen den anderen Hops begrenzen diese Hops die maximal nutzbare Bandbreite für Datenverkehr von 'A' nach 'B' auf 32 KB/s. Kongruent zeigt der Pfad vom Server zum Klienten eine maximal verfügbare Bandbreite von 64 KB/s - zwischen Hops 'Z_1' &amp; 'Y_1, 'Y_1' &amp; 'X_1' und 'Q_1' &amp; 'P_1'.
fr: En second lieu, nous pouvons prendre en considération la bande passante disponible. Elle est déterminée par le lien le plus lent entre les sauts du client et du serveur, mais aussi par le trafic transmis du serveur vers le client. Pour le trafic du client vers le serveur, nous pouvons voir dans notre exemple que la bande passante disponible entre les sauts 'R' et 'X' et les sauts 'X' et 'Y' est de 32 ko/s. Bien qu’une bande passante plus élevée soit disponible entre les autres sauts, ces sauts seront un goulot d’étranglement et limiteront la bande passante maximale disponible pour le trafic de 'A' vers 'B' à 32 ko/s. De la même façon, en remontant le chemin du serveur vers le client, nous voyons une bande passante maximale de 64 ko/s entre les sauts 'Z_1' et 'Y_1, 'Y_1' et 'X_1', et 'Q_1' et 'P_1'.
id: Kedua, kita dapat mempertimbangkan bandwidth yang tersedia. Hal ini ditentukan melalui link paling lambat antara hop dari klien dan server serta ketika lalu lintas sedang dikirimkan oleh server ke klien. Untuk lalu lintas yang beralih dari klien ke server, kita lihat bahwa bandwidth yang tersedia dalam contoh tersebut adalah antara hop 'r' & 'x' serta hop 'x' & 'y' adalah 32 kb/s. Meskipun ketersediaan bandwidth lebih tinggi di antara hop lainnya, hop ini akan bertindak sebagai penghambat dan akan membatasi bandwidth maksimum yang tersedia untuk lalu lintas dari 'A' ke 'B' sebesar 32 KB/s. Demikian pula, jalur dari server ke klien menunjukkan bahwa ada bandwidth maksimum sebesar 64 KB/s - antara hop 'Z_1' & 'Y_1, 'Y_1' & 'X_1' dan 'Q_1' & 'P_1'.
ja: 第2に、利用できる帯域幅について考えましょう。 これはクライアントからサーバーに、またサーバーからクライアントにトラフィックが渡る際のホップ間のうち、最も遅い接続によって規定されます。 クライアントからサーバーへ行くトラフィックでは、この例で利用可能な帯域幅はホップ R-X間とX-Y間の32KB/sです。 他のホップではより大きな帯域幅が利用できるにも関わらず、これらのホップがボトルネックとなり、A-B間の最大利用可能帯域幅を32KB/sに制限してしまいます。 同様に、サーバーからクライアントの経路をたどれば、最大帯域幅は64KB/s - Z_1-Y_1間、Y_1-X_1間、Q_1-P_1間です。
pl: Teraz prześledźmy dostępną przepustowość. Jest ona zależna od najwolniejszego połączenia pomiędzy skokami od klienta do serwera, oraz także od serwera do klienta. Dostępna przepustowość dla ruchu wychodzącego od klienta do serwera w naszym przykładzie pomiędzy uczestnikami „R” i „X” oraz pomiędzy „X” i „Y” wynosi 32 KB/s. Pomimo większej dostępnej przepustowości pomiędzy innymi skokami, te skoki są wąskim gardłem i limitują maksymalną dostępną przepustowość od „A” do „B” na 32 KB/s. W podobny sposób można prześledzić trasę od serwera do klienta i wykazać, że dostępna przepustowość wynosi 64 KB/s – pomiędzy skokami „Z₁” i „Y₁” oraz „Y₁” i „X₁” oraz „Q₁” i „P₁”.
pt: Em segundo lugar, podemos considerar a largura de banda disponível. Esta é determinada através da ligação mais lenta entre os saltos do cliente e do servidor, bem como quando o tráfego está a ser transmitido pelo servidor para o cliente. Para o tráfego que vai do cliente para o servidor, vemos que a largura de banda disponível no nosso exemplo entre os saltos 'R' e 'X', bem como entre os saltos 'X' e 'Y' é de 32 KB/s. Apesar da maior largura de banda disponível entre os outros nós, estes funcionarão como um estrangulamento e limitarão a largura de banda máxima disponível para o tráfego de 'A' para 'B' a 32 KB/s. Do mesmo modo, o traçado do trajeto do servidor para o cliente mostra que existe uma largura de banda máxima de 64 KB/s - entre os saltos 'Z_1' e 'Y_1, 'Y_1' e 'X_1' e 'Q_1' e 'P_1'.
tr: İkinci olarak kullanılabilecek bant genişliğini ele alabiliriz. Bu değer istemciden sunucuya gidiş ve sunucudan istemciye geliş durakları içindeki en yavaş bağlantı hızı ile sınırlıdır. Örneğimizde, istemciden sunucuya gidiş trafiği için, 'R' - 'X' ve 'X' - 'Y' durakları arasında kullanılabilecek bant genişliğinin 32 KB/s olduğunu görüyoruz. Diğer duraklar arasındaki bant genişliği daha yüksek olsa da, bu duraklar 'A' ile 'B' arasındaki en yüksek hızı 32 KB/s ile sınırlayan bir dar boğaz oluşturur. Benzer şekilde sunucudan istemciye gelen trafik için, 'Z_1' - 'Y_1, 'Y_1' - 'X_1' ve 'Q_1' - 'P_1' durakları arasında kullanılabilecek bant genişliği 64 KB/s hızındadır.

source: We recommend increasing your bandwidth limits. This helps the network by increasing the amount of available bandwidth which will in turn improve your I2P experience. Bandwidth settings are located on the <a href="http://localhost:7657/config">http://localhost:7657/config</a> page. Please be aware of your internet connection's limits as determined by your ISP, and adjust your settings accordingly.
de: Wir empfehlen das Erhöhen Ihrer Bandbreitenlimits. Dieses hilft dem Netzwerk durch die größere, verfügbare Bandbreite, als auch Ihrer I2P Erfahrung. Bandbreiten Einstellungen sind auf der <a href="http://localhost:7657/config">http://localhost:7657/config</a> Seite zu finden. Achten Sie bitte auf die Limits Ihrer Internetanbindung, vorgegeben durch den ISP, und passen Sie die Einstellungen entsprechend an.
fr: Nous vous recommandons d’augmenter vos limites de bande passante. Cela aide le réseau en augmentant la quantité de bande passable disponible, ce qui à son tour améliore votre expérience sur I2P. Les paramètres de bande passante se trouvent sur la page <a href="http://localhost:7657/config">http://localhost:7657/config.</a> Veuillez garder à l’esprit les limites de votre connexion à Internet telles que déterminées par votre FAI et ajuster vos paramètres en conséquence.
id: Kami menyarankan untuk meningkatkan batas bandwidth Anda. Hal ini membantu jaringan dengan meningkatkan jumlah bandwidth yang tersedia yang pada gilirannya akan meningkatkan pengalaman I2P Anda. Setelan bandwidth terdapat di halaman <a href="http://localhost:7657/config">http://localhost:7657/config</a>. Harap perhatikan batas koneksi internet Anda sebagaimana ditentukan oleh ISP Anda, dan sesuaikan pengaturan Anda.
ja: 我々は帯域幅設定を大きくとることを推奨します。 これにより利用可能帯域幅が増えるので、ネットワークが援助されます。それはあなたのI2P体験を改善することになります。 帯域幅の設定は <a href="http://localhost:7657/config">http://localhost:7657/config</a> ページにあります。 プロバイダが決めたネット接続の制限に気をつけて、それに応じ設定を調整しましょう。
pl: Zalecamy, abyś zwiększył(a) swoje limity przepustowości. Pomoże to sieci zwiększając dostępną przepustowość, co podniesie Twój komfort korzystania z sieci I2P. Ustawienia przepustowości są konfigurowalne na stronie <a href="http://localhost:7657/config">http://localhost:7657/config</a>. Proszę mieć na uwadze fakt, że limity połączenia internetowego zależą od dostawcy łącza internetowego.
pt: Recomendamos que aumente os seus limites de largura de banda. Isto ajuda a rede ao aumentar a quantidade de largura de banda disponível, o que, por sua vez, melhora a sua experiência I2P. As definições de largura de banda estão localizadas na página <a href="http://localhost:7657/config">http://localhost:7657/config</a>. Tenha em atenção os limites da sua ligação à Internet, conforme determinado pelo seu ISP, e ajuste as suas definições em conformidade.
tr: Bu nedenle bant genişliği sınırlarınızı arttırmanız önerilir. Böylece tüm ağın kullanabileceği bant genişliğini arttırarak daha iyi bir I2P deneyimi elde edebilirsiniz. Bant genişliği ayarları <a href="http://localhost:7657/config">http://localhost:7657/config</a> bölümünde bulunabilir. Bu ayarları yaparken İnternet hizmeti sağlayıcınız tarafından size sunulan bağlantı hızlarını göz önüne alın.
