Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: I2P is primarily not intended, nor designed, to be used as a proxy to the regular internet. With that said, there are services which are provided by volunteers that act as proxies to non-private internet based content - these are referred to as "outproxies" on the I2P network. There is an outproxy configured by default in I2P's HTTP client tunnel - false.i2p. While this service does currently exist, there is no guarantee that it will always be there as it is not an official service provided by the I2P project. If your main requirement from an anonymous network is the ability to access non-private internet resources, we would recommend using <a href="https://www.torproject.org/">Tor</a>.
fr: I2P n'est pas principalement prévu où conçu pour être utilisé en tant que mandataire pour l'internet normal. Ceci dit, il y a des services qui sont fournis par des bénévoles qui agissent comme des mandataires pour du contenu sur l'internet non-privé - ceci est connu comme un "mandataire sortant" sur le réseau I2P. Il y a un mandataire sortant configuré par défaut dans le tunnel client HTTP de I2P - false.i2p. Même si ce service existe actuellement, ce n'est pas garanti qu'il sera toujours là vu que ce n'est pas un service officiel fourni par le projet I2P. Si votre besoin principal d'un réseau anonyme est la capacité d'accéder à des ressources internet non-privé, nous recommandons que vous utilisiez <a href="https://www.torproject.org/">Tor</a>.
id: I2P terutama tidak dimaksudkan, atau dirancang, untuk digunakan sebagai proxy ke internet biasa. Meskipun demikian, ada layanan yang disediakan oleh sukarelawan yang bertindak sebagai proxy terhadap konten berbasis internet non-pribadi - layanan ini disebut sebagai "outproxy" pada jaringan I2P. Ada outproxy yang dikonfigurasi secara default di client tunnel HTTP I2P - false.i2p. Meskipun layanan ini ada sekarang, tidak ada jaminan bahwa layanan ini akan selalu ada karena ini bukan layanan resmi yang disediakan oleh proyek I2P. Jika persyaratan utama Anda dari jaringan anonim adalah kemampuan mengakses sumber daya internet non-pribadi, sebaiknya gunakan <a href="https://www.torproject.org/">Tor</a>.
ja: I2Pは通常のインターネットへのプロキシとしての使用を本来は意図・想定していませんでした。 そういうわけで、クリアネットのコンテンツへのプロキシとして動作するサービスは有志によりいくらか提供されています - I2Pネットワークでは「アウトプロキシ」と呼ばれています。 I2PのHTTPクライアントトンネルにはデフォルトでfalse.i2pというアウトプロキシが設定されています。 このサービスは今のところ存在していますが、ずっとあるという保証はありません。I2Pプロジェクトによる公式サービスではないためです。 もし匿名ネットワークからクリアネットの資源にアクセスできることを主に求めているのであれば、<a href="https://www.torproject.org/">Tor</a>の使用を勧めます。
pl: Sieć I2P nie została zaprojektowana do bycia bramką do zwykłego internetu. Jak już wspomniano, istnieją usługi – uruchamiane przez wolontariuszy – umożliwiające dostęp do zwykłego internetu, tak zwane „outproxy”. Jest jedno proxy wyjściowe domyślnie skonfigurowane w tunelu klienckim HTTP: false.i2p. Usługa ta obecnie działa, ale nie gwarantujemy, że będzie zawsze działała, ponieważ nie jest to oficjalna usługa dostarczana przez projekt I2P. Jeżeli Twoim głównym celem jest dostęp do treści w zwykłym nieanonimowym internecie, zalecamy skorzystanie z projektu <a href="https://www.torproject.org/">Tor</a>.
pt: A I2P não se destina, nem foi concebida, para ser utilizada como proxy para a Internet normal. Dito isto, existem serviços que são fornecidos por voluntários que atuam como proxies para conteúdos não privados baseados na Internet - estes são referidos como “outproxies” na rede I2P. Existe um outproxy configurado por defeito no túnel de cliente HTTP da I2P - false.i2p. Embora este serviço exista atualmente, não há garantia de que estará sempre presente, uma vez que não é um serviço oficial fornecido pelo projeto I2P. Se o seu principal requisito de uma rede anónima é a capacidade de aceder a recursos não privados da Internet, recomendamos a utilização do <a href="https://www.torproject.org/">Tor</a>.
tr: I2P öncelikli olarak normal İnternet için bir vekil sunucu olarak kullanılmak için tasarlanmamış ya da geliştirilmemiştir. Bununla birlikte, gönüllüler tarafından normal İnternet içeriklerine erişmek için vekil sunucu olarak çalışan ve I2P ağında "çıkış vekil sunucuları" denilen hizmetler vardır. I2P HTTP istemci tüneli için varsayılan olarak yapılandırılmış bir çıkış vekil sunucusu bulunur - false.i2p. Bu hizmet şu anda bulunduğu halde, resmi bir I2P projesi olmadığından her zaman sunulacağının bir garantisi yoktur. Temel gereksiniminiz normal İnternet kaynaklarına anonim olarak erişebileceğiniz bir ağ ise <a href="https://www.torproject.org/">Tor</a> kullanmanızı öneririz.

source: Within I2P, there is no requirement to use HTTPS. All traffic is encrypted end-to-end, any further encryption, e.g. with the use of HTTPS, doesn't create any further anonymity-related benefits. However, if one would like to use HTTPS or has a requirement to do so, the existing default I2P HTTP Proxy has support for HTTPS traffic. Any hidden service operator would have to specifically set up and enable HTTPS access.
de: Innerhalb von I2P gibt es keine Notwendigkeit zur Nutzung von HTTPS. Sämtlicher Datenverkehr ist Ende-zu-Ende verschlüsselt und eine weitere Verschlüsselung, z.b. durch HTTPS, erzeugt keine weiteren Vorteile in Belangen der Anonymität. Falls Sie jedoch HTTPS nutzen möchten, oder müssen, unterstützt der eingerichtete Standard I2P HTTP Proxy auch HTTPS Datenverkehr. Jeder Betreiber eines Versteckten Services muss bei Bedarf selber den Zugriff via HTTPS konfigurieren und aktivieren.
fr: Il n’y a aucune exigence d’utiliser HTTPS dans I2P. Tout le trafic est chiffré de bout en bout et tout chiffrement supplémentaire, par exemple en utilisant HTTPS, n’apporte rien de plus en matière d’anonymat. Cependant, si quelqu’un souhaitait utiliser HTTPS ou devait le faire, par défaut, le mandataire HTTP d’I2P existant prend en charge le trafic HTTPS. Les exploitants de services cachés devraient spécifiquement mettre en place et activer l’accès HTTPS.
id: Dalam I2P, tidak ada persyaratan untuk menggunakan HTTPS. Semua lalu lintas dienkripsi end-to-end, enkripsi lebih lanjut, misalnya dengan menggunakan HTTPS, tidak memberikan tambahan anonimitas. Namun, jika seseorang ingin menggunakan HTTPS atau memiliki persyaratan untuk melakukannya, proxy HTTP I2P default yang ada memiliki dukungan untuk lalu lintas HTTPS. Setiap operator layanan tersembunyi harus secara khusus mengatur dan mengaktifkan akses HTTPS.
ja: I2P内ではHTTPSを使う必要がありません。 全てのトラフィックはエンドツーエンドで暗号化されており、それ以上の暗号化、例えばHTTPSの使用は、匿名性に関するメリットを何ら生まないからです。 しかし、HTTPSを使いたい人や使う必要がある人は、既存のデフォルトI2P HTTPプロキシがHTTPSトラフィックをサポートしています。 秘匿サービス運営者は特別な設定やHTTPSアクセスの有効化が必要になるでしょう。
pl: Wewnątrz sieci I2P nie ma potrzeby korzystania z HTTPS. Wszystkie transfery są szyfrowane od-końca-do-końca, każda dodatkowa warstwa szyfrowania (np. HTTPS) nie zwiększa anonimowości. Jednakże jeżeli ktoś chciałby/musi skorzystać z HTTPS, domyślne proxy HTTP wspiera ruch HTTPS. Operator ukrytej usługi musiałby specjalnie skonfigurować i aktywować dostęp po HTTPS.
pt: No I2P, não é necessário utilizar HTTPS. Todo o tráfego é encriptado de ponta a ponta, qualquer encriptação adicional, por exemplo, com a utilização de HTTPS, não cria quaisquer benefícios adicionais relacionados com o anonimato. No entanto, se alguém quiser usar HTTPS ou tiver um requisito para o fazer, o proxy HTTP I2P padrão existente tem suporte para tráfego HTTPS. Qualquer operador de serviços ocultos teria de configurar e ativar especificamente o acesso HTTPS.
tr: I2P içinde HTTPS kullanma zorunluluğu yoktur. Tüm trafik zaten uçtan uca şifrelenir. Bunun üzerine yapılacak HTTPS kullanmak gibi şifrelemeler anonimliği arttırmak açısından ek bir yarar sağlamaz. Bununla birlikte HTTPS kullanılması isteniyor ya da gerekiyorsa, var olan varsayılan I2P HTTP vekil sunucusu HTTPS trafiğini de destekler. Herhangi bir gizli hizmet işletmecisi özel olarak HTTPS erişimi kurup kullanabilir.

source: FTP is not supported for technical reasons. There are no FTP "outproxies" to the Internet—it may not even be possible to set up one. Any other kind of outproxy may work if it's set up with a standard tunnel. If you would like to set up some type of outproxy, carefully research the potential risks. The I2P community may or may not be able to help with the technical aspects, feel free to ask. As explained several times above, any existing outproxy isn't a core part of the network. They are services run by individuals and they may or may not be operational at any given time.
de: FTP wird aus technischen Gründen nicht unterstützt. Es existieren keine FTP "Outproxies" ins reguläre Internet - möglicherweise ist dieses auch nicht möglich. Jede andere Art von Outproxy sollte mit dem Setup des Standard Tunnels funktionieren. Falls Sie einen Outproxy aufsetzen möchten, erforschen Sie sorgfältig die möglichen Risiken. Die I2P Gemeinschaft kann möglicherweise bei den technischen Aspekten Hilfestellung geben, fragen Sie ruhig. Wie weiter oben schon mehrfach erklärt, jeder existierende Outproxy ist kein integraler Bestandteil des Netzwerkes. Sie sind von Individuellen Personen betriebene Services und können jederzeit funktionieren, oder auch nicht.
es_ar: El FTP no es compatible por razones técnicas. No existen "outproxies" FTP a Internet, ni siquiera es posible instalarlos. Cualquier otro tipo de outproxy puede funcionar si se configura con un túnel estándar. Si desea configurar algún tipo de outproxy, investigue cuidadosamente los riesgos potenciales. La comunidad I2P puede o no ayudarle con los aspectos técnicos, no dude en preguntar. Como ya se ha explicado en varias ocasiones, cualquier outproxy existente no es una parte central de la red. Son servicios gestionados por particulares y pueden estar operativos o no en un momento dado.
fr: FTP n’est pas pris en charge pour des raisons techniques Il n’y a pas de mandataires FTP sortants vers Internet. Il est peut-être même impossible d’en mettre un en place. Tout autre type de mandataire sortant pourrait fonctionner s’il est mis en place avec un tunnel standard. Si vous souhaitez mettre en place quelque mandataire sortant, étudiez soigneusement les risques potentiels. La communauté d’I2P pourrait ou non être en mesure de vous aider sur les aspects techniques, n’hésitez pas à demander. Comme expliqué à maintes reprises ci-dessus, il n’existe pas de mandataire sortant intégré au réseau. Ce sont des services exploités par des utilisateurs et ces services pourraient ou non être opérationnels à tout moment donné.
id: FTP tidak didukung karena alasan teknis. Tidak ada FTP "outproxies" ke Internet - bahkan tidak memungkinkan untuk membuatnya. Jenis outproxy lainnya dapat berfungsi jika dipasang dengan tunnel standar. Jika anda ingin membuat beberapa jenis outproxy, teliti dengan seksama tentang potensi risiko. Komunitas I2P mungkin dapat atau mungkin tidak dapat membantu dalam aspek teknis, tapi mohon jangan ragu untuk bertanya. Seperti yang telah dijelaskan beberapa kali di atas, setiap outproxy yang ada bukanlah bagian inti dari jaringan. Mereka adalah layanan yang dijalankan oleh orang lain dan mereka mungkin atau mungkin tidak beroperasi pada waktu tertentu.
ja: FTPは技術的な理由によりサポートされていません。 インターネットへのFTP "アウトプロキシ"は存在しません - 設置も不可能かもしれません。 その他のタイプのアウトプロキシなら、標準的トンネルを使って設置すれば動くかもしれません。 あるタイプのアウトプロキシを設置したいなら、潜在的リスクを慎重に調査してください。 I2Pコミュニティが技術的側面で助けられるかは分からないが、気軽に相談してください。 上でたびたび説明したように、どの既存のアウトプロキシもI2Pネットワークの中核部位ではありません。 それらは個人で運営されるサービスであり、いつも稼働しているとは限りません。
pl: FTP nie jest wspierane z powodów technicznych. Obecnie nie ma proxy wyjściowych FTP, być może nawet nie dałoby się utworzyć takiej usługi. Każdy inny rodzaj proxy wyjściowego powinno się dać utworzyć wybierając opcję tunelu „standardowy”. Jeżeli chciał(a)byś założyć własne outproxy, ostrożnie zapoznaj się z potencjalnymi zagrożeniami. Społeczność I2P być może będzie w stanie udzielić Ci porad technicznych, nie bój się pytać. Jak już wcześniej wspomniano, każda usługa proxy wyjściowego nie jest podstawową usługą sieci I2P. Są to usługi uruchamiane przez wolontariuszy, mogą one zniknąć w każdej chwili.
pt: O FTP não é suportado por razões técnicas. Não existem “outproxies” FTP para a Internet - pode nem sequer ser possível criar um. Qualquer outro tipo de outproxy pode funcionar se for configurado com um túnel padrão. Se pretender criar algum tipo de outproxy, deve analisar cuidadosamente os riscos potenciais. A comunidade I2P pode ou não ser capaz de ajudar com os aspetos técnicos, não hesite em perguntar. Como explicado várias vezes acima, qualquer outproxy existente não é uma parte essencial da rede. São serviços geridos por particulares e podem ou não estar operacionais num determinado momento.
tr: FTP, teknik nedenlerle desteklenmez. İnternet üzerine FTP bağlantısı sağlayan "çıkış vekil sunucuları" yoktur ve kurulması da mümkün olmayabilir. Standart tünel olarak kurulursa, diğer çıkış vekil sunucuları çalışabilir. Bir çıkış vekil sunucusu kurmak isterseniz potansiyel riskleri iyi araştırın. Teknik konularda I2P topluluğunun yardımı dokunabilir. Sorularınızı sormaktan çekinmeyin. Daha önce de bir kaç kez açıklandığı gibi, var olan çıkış vekil sunucuları ağın temel bir parçası değildir. Bu sunucular farklı kişiler tarafından çalıştırılan hizmetlerdir ve belirli bir zamanda çalışıyor ya da çalışmıyor oldukları bilinemez.

source: My router is using a large amount of CPU, what can I do about this?
de: Mein Router erzeugt sehr viel CPU-Last, was kann ich dagegen tun?
es_ar: Mi router está utilizando una gran cantidad de CPU, ¿qué puedo hacer al respecto?
fr: Mon routeur utilise une grosse partie de mon UCT, que puis-je y faire ?
id: Router saya menggunakan banyak kapasitas CPU, apa yang harus saya lakukan?
ja: ルーターがCPUを大量に使用しています。何か対策は？
pl: Mój węzeł intensywnie korzysta z procesora, co można z tym zrobić?
pt: O meu router está a utilizar uma grande quantidade de CPU, o que posso fazer?
tr: Yönelticimin işlemci kullanımı çok fazla. Bu konuda ne yapabilirim?

source: There are many possible causes of high CPU usage. Here is a checklist:
de: Es gibt viele Gründe für hohe CPU Last. Hier ist eine Kontrolliste:
es_ar: Hay muchas causas posibles para un elevado uso de la CPU. Aquí tiene una lista para su comprobación:
fr: Une utilisation élevée de l’UCT peut avoir plusieurs causes possibles. Voici une liste de contrôle :
id: Ada banyak kemungkinan penyebab dari penggunaan CPU yang tinggi. Berikut adalah daftarnya:
ja: 高い CPU 使用率のありうる原因は沢山あります。ここにチェックリストがあります。
pl: Istnieje wiele różnych powodów wysokiego użycia procesora. Kolejno:
pt: Existem muitas causas possíveis de uma utilização elevada da CPU. Aqui tem uma lista de verificação:
tr: Yüksek işlemci kullanımı çeşitli nedenlerden kaynaklanabilir. Şunlara bakabilirsiniz:

source: Java Runtime Environment
de: Java-Laufzeitumgebung
fr: Moteur d’exécution Java
pl: JRE
tr: Java Runtime Ortamı

source: Try to use either OpenJDK or Sun/Oracle Java if it's available for your system. You can check which version of java you have installed by typing <code>java -version</code> at a command/shell prompt. Performance tends to suffer with other implementations of java.
de: Versuchen Sie, entweder die OpenJDK oder Sun/Oracle Java zu nutzen, falls verfügbar für Ihr System. Durch Eingabe von <code>java -version</code> in eine Kommandozeile/Eingabezeile können Sie die Version des installierten Java Kits erfahren. Mit anderen Implementationen von Java kann die Performance von I2P leiden.
fr: Essayez d’utiliser soit OpenJDK soit Java par Sun/Oracle s’ils sont proposés pour votre système. Vous pouvez vérifier quelle version de Java est installée en tapant <code>java -version</code> dans une invite de commande. Les performances ont tendance à être moins bonnes avec d’autres versions de Java.
id: Cobalah untuk menggunakan OpenJDK atau Sun/Oracle Java jika tersedia untuk sistem operasi anda. Anda dapat memeriksa versi Java yang telah diinstal dengan mengetik <code>java -version</code> pada command prompt shell. Kinerja cenderung menurun dengan implementasi Java yang lain.
ja: 利用可能ならば、OpenJDK か Sun/Oracle Java のどちらかを使いましょう。 インストールしたJavaのバーション確認は <code>java -version</code> とコマンド/シェルプロンプトに入力すれば確認できます。 Javaの他の実装ではパフォーマンスが苦しくなりがちです。
pl: Spróbuj użyć albo OpenJDK albo Javy od Sun/Oracle jeżeli jest dostępna na Twój system. Możesz sprawdzić którą wersję Javy masz zainstalowaną wpisując <code>java -version</code> do konsoli/powłoki. Na innych implementacjach Javy wydajność jest słaba.
pt: Tente utilizar o OpenJDK ou o Sun/Oracle Java, se estiver disponível para o seu sistema. Pode verificar qual a versão de java que tem instalada escrevendo <code>java -version</code> numa linha de comandos/shell. O desempenho tende a sofrer com outras implementações do java.
tr: Sisteminiz için bulabiliyorsanız OpenJDK ya da Sun/Oracle Java sürümlerinden birini kullanmayı deneyin. Kurulu Java sürümü öğrenmek için komut satırına <code>java-version</code> yazın. Başarım diğer Java kurulumlarından olumsuz etkilenebilir.

source: File sharing applications, e.g. BitTorrent
de: Filesharing-Anwendungen, z.B. BitTorrent
es_ar: Aplicaciones de intercambio de archivos, como BitTorrent
fr: Applications de partage de fichiers, p.ex. BitTorrent
id: Aplikasi berbagi file, misalnya Bittorrent
ja: ファイル共有アプリケーション、例えばBitTorrent
pl: programy do wymiany plików, np. BitTorrent
pt: Aplicações de partilha de ficheiros, por exemplo, BitTorrent
tr: BitTorrent gibi dosya paylaşım uygulamaları

source: Are you running a BitTorrent client over I2P? Try reducing the number of torrents, the bandwidth limits, or try turning it off completely to see if that helps.
de: Nutzen Sie einen Bittorrent Klienten über I2P? Versuchen Sie die Anzahl an Torrents oder die Bandbreitenlimits zu verringern, oder schalten Sie diesen komplett aus, um zu sehen, ob dieses hilft.
es_ar: ¿Está ejecutando un cliente Bittorrent sobre I2P? Intente reducir el número de torrents, los límites de ancho de banda, o pruebe a apagarlo completamente a ver si eso ayuda.
fr: Faites-vous tourner un client BitTorrent sur ​​I2P ? Essayez de réduire le nombre de torrents, les limites de bande passante ou encore de le fermer complètement pour voir si cela remédie à la situation.
id: Apakah anda menjalankan klien BitTorrent di dalam I2P? Coba kurangi jumlah torrent, batasan bandwidth, atau coba matikan, lihat apakah hal ini bisa membantu.
ja: I2P を通じて BitTorrent クライアントを動作させていませんか？ Torrent の数や、帯域幅制限を減らしたり、完全にオフにしてみて、助けになるか確かめてください。
pl: Masz włączony klient BitTorrent przez I2P? Spróbuj zredukować liczbę torrentów, limity pobierania, lub wyłącz go całkowicie aby sprawdzić czy to coś pomoże.
pt: Você está usando um cliente BitTorrent sobre I2P? Experimente reduzir o número de torrents, os limites de banda, ou tente desativá-lo completamente para ver se ajuda.
tr: I2P üzerinden bir BitTorrent istemcisi kullanıyor musunuz? Torrent sayısını ve bant genişliği ayarlarını azaltarak ya da tamamen kapatarak etkisinin olup olmadığına bakın.

source: High bandwidth settings
de: Einstellungen für hohe Bandbreiten
es_ar: Ajustes de gran ancho de banda
fr: Paramètres de bande passante élevée
id: Pengaturan bandwidth tinggi
ja: 高い帯域幅設定
pl: wysokie ustawienia przepustowości
pt: Definições de largura de banda elevada
tr: Yüksek bant genişliği ayarları

source: Are your bandwidth limits set too high? It is possible that too much traffic is going through your I2P router and it is overloaded. Try reducing the setting for <em>share bandwidth percentage</em> on the <a href="http://localhost:7657/config">configuration</a> page.
de: Sind Ihre Bandbreitenlimits zu hoch? Es ist möglich, dass zuviel Datenverkehr durch Ihren I2P Router geleitet wird und dieser überlastet is. Versuchen Sie eine Reduzierung der Prozentanzahl an <em>geteilten Bandbreite</em> auf der <a href="http://localhost:7657/config">Konfigurationsseite</a>.
es_ar: ¿Están sus límites de ancho de banda configurados demasiado altos? Es posible que pase demasiado tráfico a través de su router I2P y esté saturado. Intente reducir el <em>porcentaje de ancho de banda compartido</em> en la página de <a href="http://localhost:7657/config">configuración</a>.
fr: Vos limites de bande passante sont-elles trop élevées ? Il est possible que trop de trafic passe par votre routeur I2P et qu’il soit surchargé. Essayez de réduire le paramètre de <em>pourcentage de bande passante partagée</em> sur la page de <a href="http://localhost:7657/config">configuration</a>.
id: Apakah batas bandwidth diatur terlalu tinggi? Apakah terlalu banyak lalu lintas akan melalui router I2P sehingga kelebihan beban. Cobalah mengurangi setting untuk <em>persentase berbagi bandwidth</em> pada halaman <a href="http://localhost:7657/config">konfigurasi</a>
ja: 帯域幅が大きすぎるのではないですか？I2Pルーターに多量のトラフィックが流れ込み過負荷となっている可能性があります。 <a href="http://localhost:7657/config">設定ページ</a>の<em>帯域幅の共有割合</em>の設定を下げてみましょう。
pl: Może Twoje limity przepustowości są zbyt wysokie? Być może zbyt dużo transferu jest przesyłane przez Twój węzeł I2P i jest on przeciążony. Spróbuj zmniejszyć <em>procent udostępnianego pasma</em> na stronie <a href="http://localhost:7657/config">konfiguracji</a>.
pt: Seus limites de largura de banda estão muito altos? É possível que seja tráfego demais para seu roteador I2P e ele esteja sobrecarregado. Experimente reduzir a configuração para <em>percentagem de compartilhamento de banda</em> na página de <a href="http://localhost:7657/config">configuração</a> .
tr: Bant genişliği ayarınız çok yüksek olabilir. Üzerinden çok fazla trafik geçtiğinden I2P yönelticiniz aşırı yükleniyor olabilir. <a href="http://localhost:7657/config">Ayarlar</a> sayfasındaki <em>Paylaşılacak bant genişliği yüzdesi</em> ayarının değerini küçültmeyi deneyin.

source: I2P Version
es_ar: Versión de I2P
fr: Version d’I2P
id: Versi I2P
ja: I2Pのバージョン
pl: wersja I2P
pt: Versão da I2P
tr: I2P Sürümü

source: Make sure that you're running the latest version of I2P to get the benefits of increased performance and bug fixes.
de: Stellen Sie sicher, das Sie die aktuellste Version von I2P nutzen um die Vorteile von besserer Performance und weniger Fehlern zu geniessen.
es_ar: Asegúrese de usar la última versión de I2P para beneficiarse de las mejoras de rendimiento y la solución de errores.
fr: Assurez-vous d’utiliser la dernière version d’I2P pour profiter de performances améliorées et des correctifs de bogues.
id: Pastikan bahwa anda sedang menjalankan versi terbaru dari I2P untuk mendapatkan manfaat dari peningkatan kinerja dan perbaikan bug.
ja: 増加したパフォーマンスとバグフィクスの恩恵を得るために、I2P の最新版を起動しているか確認してください。
pl: Upewnij się, że korzystasz z najnowszej wersji I2P aby czerpać korzyści z poprawek błędów i wydajnościowych.
pt: Certifique-se de que você está rodando a última versão do I2P para conseguir os melhores benefícios do aumento de performance e correções de defeitos.
tr: Başarım iyileştirmeleri ve ayıklanmış hatalar nedeniyle son I2P sürümünü kullandığınızdan emin olun.

source: Memory allocation
de: Speicherzuweisung
es_ar: Asignación de memoria
fr: Allocation de la mémoire
id: Alokasi memori
ja: メモリ割り当て
pl: przydział pamięci
pt: Alocação de memória
tr: Bellek kullanımı
