Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Has enough memory been set aside for use by I2P? Look at the memory graph on <a href="http://localhost:7657/graphs">the graphs page</a> to see if the memory usage is "pegged"&mdash;the JVM is spending most of its time in garbage collection. Increase the setting <code>wrapper.java.maxmemory</code> in the file <code>wrapper.config</code>.
de: Ist genug Speicher zur Nutzung von I2P reserviert? Schauen Sie auf den Speicherbedarfsgraphen auf der <a href="http://localhost:7657/graphs">Graphen Seite</a> um zu schauen, ob die Speichernutzung zu hoch ist "&mdash; die JVM verbraucht die meiste Zeit mit Aufräumen des nicht merh genutzten Speichers. Erhöhen Sie die Einstellung <code>wrapper.java.maxmemory</code> in der Datei <code>wrapper.config</code>.
fr: Suffisamment de mémoire a-t-elle été mise de côté pour l’utilisation d’I2P ? Consultez le graphique de la mémoire sur <a href="http://localhost:7657/graphs">la page des graphiques</a> pour voir si l’utilisation de la mémoire est « hypothéquée ». La MVJ passe la plupart de son temps à récupérer de l’espace mémoire. Augmentez le paramètre <code>wrapper.java.maxmemory</code> dans le fichier <code>wrapper.config</code>.
id: Apakah ada cukup memori yang telah disisihkan untuk digunakan oleh I2P? Lihat grafik memori pada <a href="http://localhost:7657/graphs">halaman grafik</a> untuk melihat jika penggunaan memori adalah "pegged" &mdash; JVM menghabiskan sebagian besar waktunya dalam garbage collection. Meningkatkan pengaturan <code>wrapper.java.maxmemory</code> di file <code>wrapper.config</code> .
ja: I2P使用のために十分なメモリが確保されていますか？<a href="http://localhost:7657/graphs">グラフページ</a>のメモリーグラフを見て、メモリ使用量が「頭打ち」- JVMがガーベジコレクションに大部分の時間を費やしている - になっていないか確認しましょう。 <code>wrapper.config</code>ファイルの<code>wrapper.java.maxmemory</code>設定を増やしてみましょう。
pl: Czy wystarczająca ilość pamięci została zarezerwowana dla I2P? Spójrz na wykres pamięci na <a href="http://localhost:7657/graphs">stronie wykresów</a> i sprawdź, czy wykres nie jest „przycięty” – JVM spędza większość czasu na odśmiecaniu pamięci (ang. garbage collection). Zwiększ wartość <code>wrapper.java.maxmemory</code> w pliku <code>wrapper.config</code>.
pt: Foi reservada memória suficiente para ser utilizada pelo I2P? Veja o gráfico de memória na <a href="http://localhost:7657/graphs">página de gráficos</a> para ver se o uso da memória está “preso”; a JVM está passando a maior parte do tempo na coleta de lixo. Aumente a definição <code>wrapper.java.maxmemory</code> no ficheiro <code>wrapper.config</code>.
tr: I2P için yeterli bellek var mı? <a href="http://localhost:7657/graphs">Çizelgeler sayfasından</a> bellek çizelgesine bakın ve JVM bellek kullanımı genellikle sabit ise ya da çöp toplama için kullanılıyorsa <code>wrapper.config</code> dosyasındaki <code>wrapper.java.maxmemory</code> ayarının değerini arttırın.

source: Bursts of high-usage vs. constant 100% usage
de: Spitzenwerte in der Nutzung oder konstante 100% Nutzung
fr: Courtes périodes de forte utilisation / utilisation constamment à 100 %
ja: 使用量の突発的増加 vs 常に100%
pl: piki wysokiego użycia, czy stałe użycie CPU w 100%?
pt: Explosões de utilização elevada vs. utilização constante a 100%
tr: Yüksek kullanım atakları ve sabit %100 kullanım

source: Is the CPU usage simply higher than you would like, or is it pegged at 100&#37; for a long time? If it is pegged, this could be a bug. Look in the logs for clues.
de: Ist die Nutzung der CPU höher als Sie es gerne hätten, oder ist die CPU über einen langen Zeitraum zu 100&#37; belastet? Falls sie überlastet ist, könnte dieses ein Fehler sein. Schauen Sie bitte in den Logdateien nach weiteren Hinweisen.
es_ar: ¿El uso de la CPU es simplemente mayor de lo que te gustaría, o está fijado en 100&#37; durante mucho tiempo? Si es así, podría tratarse de un error. Busca pistas en los registros.
fr: L’utilisation de l’UCT est-elle simplement plus élevée que ce que vous souhaiteriez ou est-elle bloquée à 100 % pendant longtemps ? Une utilisation bloquée à 100 % pourrait être causée par un bogue. Recherchez des indices dans les journaux.
id: Apakah penggunaan CPU lebih tinggi daripada yang anda inginkan, atau dipatok pada 100 &#37; untuk waktu yang lama? Jika itu dipatok ini bisa menjadi sebuah bug. Lihat di log untuk petunjuk.
ja: CPU使用量は単に予想より多いだけですか？それとも長時間100&#37;で頭打ちになっていますか？ 天井に張り付いている場合は、バグの可能性があります。ログを確認して手がかりを見つけてください。
pl: Czy użycie procesora jest po prostu wyższe nie byś chciał(a), czy cały czas wynosi 100&#37;? Jeżeli stale wynosi 100&#37; to może to być jakiś błąd. Zajrzyj do dziennika węzła po dalsze informacje.
pt: O uso da CPU é simplesmente maior do que você gostaria, ou está fixado em 100&#37; por um longo tempo? Se estiver preso, isso pode ser um erro. Procure nos registos por pistas.
tr: İşlemci kullanımı beklediğinizden daha yüksek mi yoksa uzun süre %100 olarak sabit mi? Uzun süre sabit kalıyorsa bu bir yazılım hatası olabilir. Fikir edinmek için günlük kayıtlarını inceleyin.

source: Java-related
de: Zu Java
fr: Connexe à Java
id: Terkait Java
ja: Java関連
pl: związane z Javą
pt: Relacionado a Java
tr: Java ile ilişkili

source: You may be using the Java-based BigInteger library instead of the native version, especially if you are running on a new or unusual OS or hardware (OpenSolaris, mipsel, etc.). See the <a href="%(jbigi)s">jbigi page</a> for instructions on diagnosing, building, and testing methods.
de: Möglicherweise nutzen Sie die Java-basierte BigInteger Bibliothek anstelle der nativen Implementation, insbesondere falls Sie ein neues oder eher weniger genutztes Betriebssystem (oder Hardware) nutzen (OpenSolaris, mipsel, etc.). Schauen Sie auf der <a href="%(jbigi)s">jbigi Seite</a> nach weiteren Inforationen zur Diagnose, zum Bauen der libJbigi und den Testmethoden.
es_ar: Puede que esté usando la librería BigInteger en vez de la versión nativa, especialmente si lo ejecuta en un sistema o hardware nuevo o inusual (OpenSolaris, mipsel, etc). Visite la <a href="%(jbigi)s">web de jbigi</a> que incluye instrucciones para el diagnóstico, compilado y métodos de testeo.
fr: Vous utilisez peut-être la bibliothèque BigInteger qui s’appuie sur Java au lieu de la version native, particulièrement si vous utilisez un SE ou du matériel nouveau ou exotique (OpenSolaris, mipsel, etc.). Des instructions sur les méthodes de diagnostic, de compilation et de test se trouvent sur la <a href="%(jbigi)s">page de jbigi</a>.
id: Anda mungkin menggunakan library BigInteger berbasis Java alih-alih versi asli, terutama jika Anda menjalankan OS atau perangkat keras yang baru atau tidak biasa (OpenSolaris, MIPSEL, dll.). Lihat <a href="%(jbigi)s">halaman jbigi</a> untuk petunjuk tentang metode mendiagnosis, membuat, dan menguji.
ja: あなたはJava版BigIntegerライブラリをネイティブ版の代わりに使っているかもしれません。特に、新しかったりマイナーなOSやハードウェア（OpenSolaris、mipselなど）を動かしている場合です。 <a href="%(jbigi)s">jbigiページ</a>を確認し、診断、ビルド、テストメソッドに関する説明を参照してください。
pl: Być może używasz opartej na Javie biblioteki BigInteger zamiast natywnej wersji, zwłaszcza jeżeli masz nowy lub nietypowy sprzęt lub system (OpenSolaris, mipsel, itp.). Zajrzyj na <a href="%(jbigi)s">stronę jbigi</a> po instrukcje na temat diagnozowania, kompilacji i metod testowania.
pt: Você pode usar a biblioteca BigInteger, baseada em Java, ao invés da versão nativa, especialmente se estiver rodando num SO ou hardware novo (OpenSolaris, mipsel, etc.). Veja <a href="%(jbigi)s">a página jbigi</a> para instruções de métodos de diagnóstico, construção e teste.
tr: Doğal sürüm yerine Java temelli BigInteger kitaplığını kullanıyor olabilirsiniz. Özellikle yeni ya da az kullanılan işletim sistemi ya da donanım kullanıyorsanız (OpenSolaris, mipsel gibi) Sorun bulma, derleme ve deneme yöntemleri hakkında bilgi almak için <a href="%(jbigi)s">jbigi sayfasına</a> bakabilirsiniz.

source: Participating tunnels
de: Fremde Tunnel, an denen Sie teilnehmen
es_ar: Túneles participantes
fr: Tunnels participants
ja: 参加しているトンネル
pl: tunele uczestniczące
pt: Túneis participantes
tr: Katılınan tüneller

source: If your native jbigi library is working fine, the biggest user of CPU may be routing traffic for participating tunnels. This uses CPU because at each hop a layer of encryption must be decoded. You can limit participating traffic in two ways - by reducing the share bandwidth on the <a href="http://localhost:7657/confignet.jsp">confignet</a> page, or by setting <tt>router.maxParticipatingTunnels=nnn</tt> on the <a href="http://localhost:7657/configadvanced.jsp">configadvanced</a> page.
de: Arbeitet ihre native jBigi Bibliotthek problemlos, ist das Weiterleiten der Tunnel anderer Router wahrscheinlich der größte Nutzer der CPU. Dieses nutzt die CPU, da bei jeder Zwischenstation eine Schicht der Verschlüsselung entschlüsselt werden muss. Sie können diesen weitergeleiteten Datenverkehr in 2 Arten begrenzen - indem Sie den Anteil an geteilter Bandbreite auf der <a href="http://localhost:7657/confignet.jsp">confignet</a> Seite reduzieren, oder durch Setzen des <tt>router.maxParticipatingTunnels=nnn</tt> Parameters auf der <a href="http://localhost:7657/configadvanced.jsp">configadvanced</a> Seite.
fr: Si votre bibliothèque native jbigi fonctionne correctement, le routage du trafic pour les tunnels participants pourrait être le plus grand consommateur de ressources de traitement. Il utilise l’UCT, car une couche de chiffrement doit être décodée lors de chaque saut. Vous pouvez limiter le trafic participant de deux façons : en réduisant la bande passante partagée sur la page <a href="http://localhost:7657/confignet.jsp">confignet</a> ou en paramétrant <tt>router.maxParticipatingTunnels=nnn</tt> sur la page <a href="http://localhost:7657/configadvanced.jsp">configadvanced</a>.
id: Jika library jbigi asli Anda bekerja dengan baik, pengguna terbesar CPU mungkin routing lalu lintas untuk participating tunnel. Ini menggunakan CPU karena di setiap hop, setiap lapisan enkripsi harus di-decoded. Anda dapat membatasi lalu lintas participating dengan dua cara - dengan mengurangi sharing bandwidth pada <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>, atau dengan menetapkan <tt>router.maxParticipatingTunnels=nnn</tt> pada <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.
ja: ネイティブ版jbigiが正常に動作している場合、一番CPUを使っているのはトンネル参加のためのトラフィック中継かもしれません。 これはCPUを食います。それぞれのホップで暗号層が複合されなくてはならないからです。トラフィックへの参加を制限するには2つの方法があります - <a href="http://localhost:7657/confignet.jsp">confignet</a>ページで共有帯域幅を減らすか、<a href="http://localhost:7657/configadvanced.jsp">configadvanced</a>ページで<tt>router.maxParticipatingTunnels=nnn</tt>を設定するかです。
pl: Jeżeli Twoja natywna biblioteka jbigi działa poprawnie, największym pożeraczem CPU prawdopodobnie jest przekazywany ruch uczestniczących tuneli. To wykorzystuje CPU, ponieważ przy każdym skoku każda kolejna warstwa szyfrowania musi zostać zdekodowana. Możesz zmniejszyć ruch uczestniczący na dwa sposoby – poprzez redukcję udostępnianej przepustowości na stronie <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a> lub poprzez ustawienie <tt>router.maxParticipatingTunnels=nnn</tt> na stronie <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.
pt: Se a sua biblioteca jbigi nativa estiver funcionando bem, o maior utilizador de CPU pode ser o tráfego de roteamento para os túneis participantes. Isso usa CPU porque em cada salto uma camada de criptografia tem de ser descodificada. É possível limitar o tráfego participante de duas maneiras - reduzindo a largura de banda partilhada na página <a href="http://localhost:7657/confignet.jsp">confignet</a>, ou definindo <tt>router.maxParticipatingTunnels=nnn</tt> na página <a href="http://localhost:7657/configadvanced.jsp">configadvanced</a>.
tr: Doğal jbigi kitaplığınız düzgün çalışıyorsa en yüksek işlemci kullanıcısı katkı tünellerine yöneltilen trafik olabilir. Bu işlem her durak katmanı için şifrelemenin çözülmesini gerektirdiğinden yüksek işlemci gücü kullanıyor olabilir. Trafiğe yapacağınız katkıyı iki şekilde sınırlayabilirsiniz <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a> içindeki paylaşım bant genişliğini azaltabilirsiniz <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a> içindeki <tt>router.maxParticipatingTunnels=nnn</tt> değerini ayarlayabilirsiniz.

source: If your router has 10 or more active peers, everything is fine. The router should maintain connections to a few peers at all times. The best way to stay "better-connected" to the network is to share more bandwidth. The amount of bandwidth that is shared by the router can be changed on the configuration page: <a href="http://localhost:7657/config">http://localhost:7657/config</a>
de: Mit mehr als 10 aktiven Teilnehmern ist alles Ok für Ihren Router. Ihr Router sollte jederzeit Verbindungen zu ein paar Teilnehmern aufrecht erhalten. Der beste Weg um "besser im Netzwerk verbunden" zu sein ist das teilen von mehr Bandbreite. Die vom Router geteilte Bandbreite kann auf der Konfigurationsseite <a href="http://localhost:7657/config"> http://localhost:7657/config</a> geändert werden.
fr: Si votre routeur a 10 pairs actifs ou plus, tout va bien. Le routeur devrait maintenir des connexions vers quelques pairs en tout temps. La meilleure façon de rester « mieux connecté » au réseau est de partager plus de bande passante. La quantité de bande passante qui est partagée par le routeur peut être changée sur la page de configuration : <a href="http://localhost:7657/config">http://localhost:7657/config</a>
id: Jika router anda memiliki 10 peer aktif atau lebih banyak lagi, semuanya baik-baik saja. Router harus menjaga hubungan dengan beberapa peer sepanjang waktu. Cara terbaik untuk tetap "lebih terhubung" ke jaringan adalah dengan berbagi lebih banyak bandwidth. Jumlah bandwidth yang dibagikan oleh router dapat diubah pada halaman konfigurasi: <a href="http://localhost:7657/config">http://localhost:7657/config</a>
ja: 10以上のアクティブピアがあれば問題ありません。ルーターは少数ピアとの接続をずっと維持するはずです。 ネットワークへの「よりよい接続」を維持するのに最も良い方法は、より大きな帯域幅を共有することです。 ルーターが共有する帯域幅は設定ページ <a href="http://localhost:7657/config">http://localhost:7657/config</a> で変更可能。
pl: Jeżeli Twój węzeł łączy się z 10 lub więcej aktywnymi uczestnikami, to wszystko jest w porządku. Węzeł I2P przez cały czas powinien utrzymywać łączność z kilkoma uczestnikami. Najlepszym sposobem na bycie „lepiej połączonym” z siecią jest udostępnianie większej ilości pasma. Ilość pasma udostępnianego przez węzeł można skonfigurować na stronie <a href="http://localhost:7657/config">http://localhost:7657/config</a>.
pt: Se o seu router tiver 10 ou mais pares ativos, está tudo bem. O router deve manter sempre conexões a alguns pares. A melhor forma de se manter “melhor conectaado” à rede é partilhar mais largura de banda. A quantidade de largura de banda que é partilhada pelo router pode ser alterada na página de configuração: <a href="http://localhost:7657/config">http://localhost:7657/config</a>
tr: Yönelticinizin 10 ya da daha fazla eşi varsa herşey yolundadır.. Yönelticinin her zaman bir kaç eş ile bağlantıda olması gerekir. Ağ ile "daha iyi bağlantı kurmanın" en iyi yolu daha çok bant genişliğini paylaşmaktır. Yöneltici tarafından paylaşılan bant genişliği miktarı yapılandırma sayfasından değiştirilebilir: <a href="http://localhost:7657/config">http://localhost:7657/config</a>

source: No, there isn't anything wrong. This is normal behavior. All routers adjust dynamically to changing network conditions and demands. Routers come online and go offline depending on whether the system it is installed on is operational or not, as well as whether there is an available network connection. Your router is constantly updating its local Network Database. Tunnels which your router is participating in expire every 10 minutes and may or may not be rebuilt through your router.
de: Nein, es ist nichts falsch. Dieses ist ein normales Verhalten. Alle Router passen sich dynamisch an die sich stetig ändernden Netzwerkumgebung und Anforderungen an. Router gehen On- und Offline, wenn Nutzer die System starten oder beenden, oder auch wenn das Netzwerk ausfällt oder wieder aktiv wird. Ihr Router aktualisiert ständig die lokale Netzwerkdatenbank. Tunnel, an denen Ihr Router teilnimmt, haben eine Lebenszeit von 10 Minuten und werden anschliessend möglicherweise durch ihren Router neu aufgebaut, oder auch nicht.
es_ar: No, no pasa nada. Es un comportamiento normal. Todos los routers se ajustan dinámicamente a las condiciones y demandas cambiantes de la red. Los routers se conectan y desconectan dependiendo de si el sistema en el que están instalados está operativo o no, así como de si hay una conexión de red disponible. El router actualiza constantemente su base de datos de red local. Los túneles en los que participa su router expiran cada 10 minutos y pueden o no ser reconstruidos a través de su router.
fr: Non, tout va bien Ce comportement est normal. Tous les routeurs s’ajustent de façon dynamique aux conditions changeantes du réseau et aux demandes. Les routeurs apparaissent et disparaissent selon que les systèmes sur lesquels ils sont installés sont fonctionnels ou non. La disponibilité d’une connexion réseau est aussi un facteur. Votre routeur met constamment à jour sa base de données réseau locale. Les tunnels auxquels votre routeur participe expirent toutes les 10 minutes et pourraient ou non être reconstruits en passant par votre routeur.
id: Tidak, tidak ada yang salah. Ini adalah perilaku normal. Semua router menyesuaikan secara dinamis untuk mengubah kondisi dan tuntutan jaringan. Router menjadi online dan offline tergantung pada apakah sistem yang diinstal dalam keadaan operasional atau tidak, serta apakah ada koneksi jaringan yang tersedia. Router Anda terus memperbarui Network Database lokalnya. Tunnel yang diikuti oleh router Anda akan kedaluwarsa setiap 10 menit dan mungkin dibangun kembali melalui router Anda atau tidak.
ja: いいえ、おかしいところはありません。 これは通常の振る舞いです。 全てのルーターは変動するネットワーク状況と需要に対して動的な調整を行います。 インストールされたシステムが動作可能かどうか、また利用可能なネットワーク接続があるかどうかに応じて、ルーターはオンラインになったりオフラインになったりします。 ルーターは常にローカルのネットワークデータベースを更新しています。 参加しているトンネルは10分ごとに有効でなくなり、再構成されるかどうかは分かりません。
pl: Nie, to jest normalne zachowanie. Każdy węzeł dynamicznie dostosowuje się do zmieniających się warunków sieci i potrzeb. Węzły przyłączają i odłączają się od sieci w zależności od tego czy maszyny na których są zainstalowane są włączone/wyłączone i czy są połączone bądź odłączone od internetu. Twój węzeł na bieżąco aktualizuje swoją bazę danych sieci (NetDB). Tunele w których uczestniczy Twój węzeł wygasają po 10 minutach i mogą być odnowione przez Twój węzeł.
pt: Não, não há nada de errado. Este é um comportamento normal. Todos os routers se ajustam dinamicamente às condições e exigências variáveis da rede. Os routers ficam online e offline dependendo do facto de o sistema em que estão instalados estar operacional ou não, bem como da existência de uma conexão de rede disponível. O router está constantemente a atualizar a sua base de dados de rede local. Os túneis em que o router participa expiram a cada 10 minutos e podem ou não ser reconstruídos através do router.
tr: Hayır yanlış bir şey yok. Bu davranış normaldir. Tüm yönelticiler değişen ağ koşullarına ve isteklere göre uyum sağlar. Yönelticiler, sistemin ve ağ bağlantısının çalışıp çalışmadığına bağlı olarak çevrimiçi ya da çevrimdışı olabilir. Yönelticiniz kendi yerel ağ veri tabanını sürekli günceller. Yönelticinizin katkıda bulunduğu tüneller 10 dakikada bir kullanımdan kaldırılır ve yönelticiniz tarafından yeniden açılabilir ya da açılmayabilir.

source: The encryption and routing within the I2P network adds a substantial amount of overhead and limits bandwidth. We can try to clarify this with the aid of a diagram:
de: Die Verschlüsselung und das Routing im I2P-Netzwerk fügen eine nicht unerhebliche Menge an Overhead hinzu und begrenzen die Bandbreite. Das kann mit Hilfe eines Diagramms verdeutlicht werden:
es_ar: El cifrado y el encaminamiento dentro de la red I2P añaden una cantidad considerable de sobrecarga y limitan el ancho de banda. Podemos intentar aclararlo con ayuda de un diagrama:
fr: Le chiffrement et le routage dans le réseau I2P ajoutent une surcharge substantielle et limitent la bande passante. Nous pouvons essayer de clarifier cela à l’aide d’un diagramme :
id: Enkripsi dan perutean dalam jaringan I2P menambah banyak overhead dan membatasi bandwidth. Kami dapat mencoba mengklarifikasi ini dengan bantuan diagram:
ja: I2Pネットワークにおける暗号化と中継が相当量の負荷をかけ帯域幅を制限します。 図を用いて解説してみましょう：
pl: Szyfrowanie i trasowanie pakietów w sieci I2P stanowi znaczący narzut i zmniejsza dostępną przepustowość. Można to wyjaśnić za pomocą rysunku:
pt: A encriptação e o encaminhamento dentro da rede I2P acrescentam uma quantidade substancial de sobrecarga e limitam a largura de banda. Podemos tentar clarificar esta questão com a ajuda de um diagrama:
tr: I2P ağındaki şifreleme ve yöneltme önemli düzeyde bir yük oluşturduğundan bant genişliğini sınırlar. Bu durumu bir çizim yardımı ile açmayı deneyelim.
