Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: I2P hides the server from the user and the user from the server. All I2P traffic is internal to the I2P network. Traffic inside I2P does not interact with the Internet directly. It is a layer on top of the Internet. It uses encrypted unidirectional tunnels between you and your peers. No one can see where traffic is coming from, where it is going, or what the contents are. Additionally I2P offers resistance to pattern recognition and blocking by censors. Because the network relies on peers to route traffic, location blocking is also reduced.
de: I2P versteckt die Server vor den Nutzern und die Nutzer vor den Servern. Der gesamte I2P-Datenverkehr läuft innerhalb des I2P-Netzwerks. Er tritt nicht mit dem Internet direkt in Verbindung. Es ist eine Schicht die auf dem Internet liegt. Sie verwendet verschlüsselte einseitige Tunnel zwischen Ihnen und den anderen Knoten. Niemand kann sehen woher der Datenverkehr kommt und wohin er geht oder welche Inhalte sich darin befinden. Zusätzlich bietet I2P Abwehrfunktionen gegen Mustererkennung und die Blockierung durch Zensur.
es_ar: I2P oculta el servidor al usuario y el usuario al servidor. Todo el tráfico I2P es interno a la red I2P. El tráfico dentro de I2P no interactúa directamente con Internet. Es una capa superior a Internet. Utiliza túneles unidireccionales encriptados entre usted y sus pares. Nadie puede ver de dónde viene el tráfico, a dónde va o cuál es su contenido. Además, I2P ofrece resistencia al reconocimiento de patrones y al bloqueo por parte de los censores. Como la red se basa en los pares para enrutar el tráfico, también se reduce el bloqueo por localización.
fr: I2P cache ses serveurs de ses utilisateurs et l'utilisateur des serveurs. Toute la circulation I2P est interne au réseau I2P. La circulation à l'intérieur d'I2P n'interagit pas directement avec l'internet. C'est une couche au dessus d'internet. Il utilise des tunnels chiffrés non directionnels entre vous et vos pairs. Personne ne peux voir d'où la circulation arrive, où elle va et où le contenu se trouve. De plus, I2P offre de la résistance sur la reconnaissance de modèle et en bloquant la censure. Parce que le réseau se repose sur des paires pour acheminer le trafic, le blocage de localisation est aussi réduit.
id: I2P menyembunyikan server dari pengguna dan pengguna dari server. Semua lalu lintas I2P bersifat internal di jaringan I2P. Lalu lintas di dalam I2P tidak berinteraksi dengan Internet secara langsung. Ini adalah lapisan di atas internet. Ini menggunakan terowongan dua arah terenkripsi antara Anda dan orang lain. Tidak ada yang bisa melihat dari mana lalu lintas berasal, ke mana ia pergi, atau apa isinya. Selain itu I2P menawarkan resistensi terhadap pengenalan pola dan pemblokiran oleh sensor. Karena jaringan bergantung pada rekan untuk mengarahkan lalu lintas, pemblokiran lokasi juga berkurang.
ja: I2Pは、サーバーからユーザー、及びユーザーからサーバーを隠します。全てのI2PトラフィックはI2Pネットワークの内部にあります。I2P内部のトラフィックは、インターネットと直接やりとりすることはありません。それはインターネットの上にある層です。あなたとあなたのピアの間で暗号化された一方向トンネルを使用します。トラフィックがどこから来ているのか、どこに向かっているのか、またはどんな内容かは誰も見ることができません。また、I2Pはパターン認識や検閲によるブロックに強いという特徴があります。なぜなら、ネットワークはトラフィックをルーティングするためにピアに頼るため、ロケーションブロッキングも減少します。
pl: Sieć I2P ukrywa serwer przed użytkownikiem i użytkownika przed serwerem. Cały ruch w sieci I2P to ruch wewnętrzny, niemający bezpośredniego kontaktu ze zwykłym internetem. Jest to warstwa sieci nad internetem. Sieć I2P wykorzystuje szyfrowane tunele jednokierunkowe pomiędzy Tobą i innymi użytkownikami. Nikt nie może zobaczyć skąd, dokąd i co jest przesyłane. Dodatkowo sieć oferuje ochronę przed rozpoznawaniem wzorców i przed blokadą cenzorów. Ponieważ sieć I2P wykorzystuje użytkowników do przesyłania ruchu, blokowanie lokalizacji jest również ograniczone.
pt: I2P esconde o servidor do usuário e o usuário do servidor. Todo o tráfego I2P é interno à rede I2P. O tráfego dentro do I2P não interage diretamente com a Internet. É uma camada no topo da Internet. Ele usa túneis unidirecionais criptografados entre você e seus pares. Ninguém pode ver de onde vem o tráfego, para onde ele vai, ou qual é o conteúdo. Além disso, I2P oferece resistência ao reconhecimento e bloqueio de padrões por censores. Como a rede depende dos pares para encaminhar o tráfego, o bloqueio de localização também é reduzido.
tr: I2P, sunucuyu kullanıcıdan, kullanıcıyı da sunucudan gizler. Tüm I2P trafiği, I2P ağının içindedir. I2P içindeki trafik, İnternet ile doğrudan etkileşime girmez. İnternet üzerinde ayrı bir katmandır. Siz ve eşleriniz arasında şifrelenmiş tek yönlü tüneller kullanılır. Hiç kimse trafiğin nereden geldiğini, nereye gittiğini ya da içeriğinin ne olduğunu göremez. Ek olarak I2P, örüntü tanıma ve sansür uygulamalarına karşı koyar. Ağ, trafiği yöneltmek için eşler kullandığından, konuma göre engelleme etkisi de azaltılır.

source: Read more&hellip;
de: Weiterlesen&hellip;
es_ar: Leer más&hellip;
fr: En savoir plus…
id: Baca lebih banyak&hellip;
ja: 詳細を読む&hellip;
pl: Czytaj więcej…
pt: Ler mais&hellip;
tr: Ayrıntılı bilgi alın&hellip;

source: Peer-to-Peer
fr: Pair-à-pair
ja: ピアツーピア
pl: P2P
pt: Par-a-Par
tr: Uçtan Uca

source: The network is people powered . Peers make a portion of their resources, particularly bandwidth, available to other network participants. This allows the network to function without relying on centralized servers.
es_ar: La red está impulsada por las personas. Los pares ponen una parte de sus recursos, en particular el ancho de banda, a disposición de los demás participantes en la red. Esto permite que la red funcione sin depender de servidores centralizados.
fr: Le réseau est entretenu par le peuple. Les pairs font partie d'une portion des ressources, spécialement la bande passante, disponibles aux autres participants du réseaux. Cela permet au réseau de fonctionner sans se reposer sur des serveurs centralisés.
id: Jaringan ini didukung oleh pesertanya. Peserta menyediakan sebagian sumber dayanya, terutama bandwidth, untuk peserta lain. Hal ini memungkinkan jaringan berfungsi tanpa bergantung pada server terpusat.
ja: このネットワークは人々の力で動いています。ピアは特にネットワークの他の参加者が使用可能な帯域幅ですが、そのリソースの一部をなしています。これにより、ネットワークは中央サーバーに依存することなく機能できています。
pl: Sieć jest zasilana przez ludzi. Użytkownicy udostępniają część swoich zasobów, w szczególności przepustowość pasma, innym uczestnikom sieci. To umożliwia funkcjonowanie sieci bez konieczności polegania na scentralizowanych serwerach.
pt: A rede é alimentada por pessoas. Os pares disponibilizam uma parte dos seus recursos, nomeadamente a largura de banda, a outros participantes na rede. Isto permite que a rede funcione sem depender de servidores centralizados.
tr: Ağ, gücünü insanların katkılarından alır. Eşler kaynaklarının bir kısmını, özellikle de bant genişliğini, diğer ağ katılımcılarının kullanımına sunar. Böylece ağ merkezi sunuculara dayanmadan çalışabilir.

source: Learn more about the Protocol Stack
es_ar: Más información sobre la Protocol Stack
fr: Apprenez-en plus sur le Protocole Stack
id: Pelajari lebih lanjut tentang Protocol Stack
ja: プロトコルスタックに関する詳細
pl: Więcej informacji odnośnie stosu protokołu
pt: Saiba mais sobre a pilha de protocolos
tr: İletişim kuralı yığını hakkında ayrıntılı bilgi alın

source: Privacy and Security By Design
es_ar: Privacidad y seguridad por diseño
fr: Conçu pour l'Intimité et la Sécurité
id: Didesain untuk Privasi dan Keamanan
ja: プライバシーとセキュリティ・バイ・デザイン
pl: Zaprojektowana z myślą o prywatności i bezpieczeństwie
pt: Privacidade e Segurança Do Esboço
tr: Tasarımdan Kaynaklı Gizlilik ve Güvenlik

source: I2P has created transport protocols that resist DPI censorship, and continuously improves its end to end encryption.
es_ar: I2P ha creado protocolos de transporte resistentes a la censura DPI y mejora continuamente su cifrado de extremo a extremo.
fr: I2P a créer des protocoles de transport qui résistent la censure IPP et améliore en continu son chiffrement de bout en bout.
id: I2P telah menciptakan protokol transportasi yang tahan terhadap sensor DPI, dan terus meningkatkan enkripsi end-to-end.
ja: I2PはDPI検閲に対抗するようにトランスポートプロトコルを作成し、エンドツーエンド暗号化を継続的に改善しています。
pl: Sieć I2P używa protokołów transportowych odpornych na głęboką inspekcję pakietów (DPI), a używane metody szyfrowania od-końca-do-końca są nieustannie ulepszane.
pt: O I2P criou protocolos de transporte que resistem à censura com inspeção profunda de pacotes (DPI) e melhora continuamente a sua encriptação de ponta a ponta.
tr: I2P, "Derin paket denetimi" (DPI) sansürüne karşı koyan taşıyıcı iletişim kuralları oluşturmuştur ve uçtan uca şifrelemeyi sürekli olarak geliştirmektedir.

source: Read the I2P Transport Overview
es_ar: Lea la descripción general del transporte I2P
fr: Lire l'aperçu du Transport I2P
id: Baca Rangkuman I2P Transport
ja: I2Pのトランスポートの概要を読む
pl: Więcej informacji odnośnie warstw transportowych
pt: Leia a visão geral do transporte I2P
tr: I2P Taşıyıcı Özetini Okuyun

source: Built For Communication
es_ar: Construido para la comunicación
fr: Construit pour la Communication
id: Dibangun Untuk Komunikasi
ja: 通信のために築かれた
pl: Z myślą o komunikacji
pt: Construído Para Comunicação
tr: İletişim için Yapıldı

source: I2P has an application layer with easy to use
es_ar: I2P tiene una capa de aplicación fácil de usar
fr: I2P a une couche d'application facile à utiliser
id: I2P memiliki lapisan aplikasi yang mudah digunakan
ja: プライバシーに配慮した独自アプリを作成するためのAPI
pl: I2P jest warstwą aplikacji z łatwym w użyciu
pt: I2P tem uma camada de aplicação com fácil de usar
tr: I2P uygulama katmanının kullanımı kolaydır

source: APIs for creating your own privacy - aware apps.
fr: Une API pour créer ses propre applications consciente de la confidentialité.
id: API untuk membuat aplikasi yang menggunakan privasi.
ja: を簡単に使用できるアプリケーションレイヤーがI2Pにはあります。
pl: API umożliwiającym tworzenie własnych aplikacji nakierowanych na prywatność.
pt: APIs para criar sua própria privacidade - consciente apps.
tr: Gizliliğe duyarlı uygulamalarınızı oluşturmak için API uygulamaları.

source: News &amp; Updates
de: Neuigkeiten &amp; Updates
es_ar: Noticias y actualizaciones
fr: Nouvelles et mises à jour
id: Berita &amp; Update
ja: ニュースと更新
pl: Nowości i aktualizacje
pt: Notícias e Atualizações
tr: Haberler ve Güncellemeler

source: Links
es_ar: Enlaces
fr: Liens
id: Link
ja: リンク
pl: Odnośniki
pt: Hiperligações
tr: Bağlantılar

source: Recommended Links & Resources
de: Empfohlene Links & Ressourcen
es_ar: Enlaces recomendados y más recursos
fr: Liens et ressources recommandés
id: Tautan & Sumber Daya yang Direkomendasikan
ja: おすすめの リンクとリソース
pl: Polecane odnośniki i zasoby
pt: Recursos e Hiperligações Recomendados
tr: Önerilen Bağlantı ve Kaynaklar

source: See also the page with <a href="%(media)s">links to presentations, videos, and tutorials about I2P</a>.
de: Scnauen Sie auch auf die Seite mit <a href="%(media)s">Links zu Präsentations, Videos und Anleitungen zu I2P</a>.
es_ar: Vea también la web con a href="%(media)s">enlaces a presentaciones, vídeos, y manuales sobre I2P</a>.
fr: Voir aussi la page avec des <a href="%(media)s">liens vers des présentations, des vidéos et des tutoriels au sujet d’I2P</a>.
id: Lihat juga halaman dengan <a href="%(media)s">link ke presentasi, video, dan tutorial tentang I2P</a> .
ja: <a href="%(media)s">I2P についてのプレゼンテーションやビデオ、チュートリアルへのリンク</a>にあるページも参照のこと。
pl: Zobacz także stronę z <a href="%(media)s">linkami do prezentacji, filmikami, i poradnikami o I2P</a>.
pt: Consulte também a página com as <a href="%(media)s">hiperligações para apresentações, vídeos, e tutoriais sobre o I2P</a>.
tr: <a href="%(media)s">I2P hakkında sunum, görüntü ve eğitimler</a> sayfasına da bakabilirsiniz.

source: I2P on the web
de: I2P im Netz
es_ar: I2P en la web
fr: I2P sur la Toile
id: I2P di internet
ja: ウェブ上の I2P
pl: I2P w sieci
pt: I2P na Web
tr: İnternet üzerinde I2P

source: Friends of I2P
de: Freunde von I2P
es_ar: Amigos de I2P
fr: Amis d’I2P
id: Teman-teman dari I2P
ja: I2P の友人たち
pl: Przyjaciele I2P
pt: Amigos do I2P
tr: I2P dostları

source: More Projects and Documentation
de: Mehr Projekte und Dokumentationen
es_ar: Más proyectos y documentación
fr: Plus de projets et de documentation
id: Proyek dan Dokumentasi Lainnya
ja: さらなるプロジェクトと文書
pl: Więcej projektów i dokumentacji
pt: Mais Projetos e Documentação
tr: Diğer Projeler ve Belgeler

source: Press
de: Presse
es_ar: Prensa
fr: Presse
id: Untuk Press
ja: プレス
pl: Prasa
pt: Imprensa
tr: Basın

source: Boards, newssite, others
de: Foren, Newsseiten, anderes
es_ar: Foros, sitio de noticias y otros
fr: Forums, sites de nouvelles, autres
id: Forum, situs berita, dan lainnya
ja: 掲示板、ニュースサイト他
pl: Fora, nowości, inne
pt: Fóruns, site de notícias, outros
tr: Forumlar, haber sitesi, diğerleri

source: Very Old Stuff
de: Sehr altes Material
es_ar: Cosas muy antiguas
fr: De très vieux trucs
id: Bahan-bahan yang sangat lama
ja: かなり昔のもの
pl: Starocie
pt: Coisas Muito Antigas
tr: Çok Eski Şeyler

source: Blog
fr: Blogue
ja: ブログ
pt: Blogue

source: Lab
de: Labor
fr: Labo
ja: ラボ
pl: Laboratorium
pt: Laboratório

source: https://geti2p.net
ja: https://geti2p.net/ja/
pl: https://geti2p.net/pl

source: docker pull geti2p/i2p
fr: extraction docker geti2p/i2p

source: Bittorrent
id: Bittorent

source: SAM
pl: Programista SAM
