Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Yes, by far the easiest and most common way is by blocking bootstrap, or "Reseed" servers. Completely blocking all obfuscated traffic would work as well (although it would break many, many other things that are not I2P and most are not willing to go this far). In the case of reseed blocking, there is a reseed bundle on Github, blocking it will also block Github. You can reseed over a proxy (many can be found on Internet if you do not want to use Tor) or share reseed bundles on a friend-to-friend basis offline.
es_ar: Sí, con mucho, la forma más fácil y más común es mediante el bloqueo de bootstrap, o "Reseed" de servidores. Bloquear completamente todo el tráfico ofuscado también funcionaría (aunque rompería muchas, muchas otras cosas que no son I2P y la mayoría no están dispuestos a ir tan lejos). En el caso del bloqueo de reseed, hay un paquete de reseed en Github, bloquearlo también bloqueará Github. Puedes hacer reseed a través de un proxy (se pueden encontrar muchos en Internet si no quieres usar Tor) o compartir paquetes de reseed de amigo a amigo sin conexión.
fr: Oui, la manière la plus simple et connue est de bloquer bootstrap ou réensemencer les serveurs. Bloquer entièrement toute la circulation obscurcie marcherait aussi (même si ça casserait beaucoup, beaucoup d'autres choses qui ne sont pas I2P et la plupart ne veulent pas aller aussi loin). Dans la situation de bloquer le réensemencement, il y a un paquet de réensemencer sur Github, le bloquer bloquera aussi Github. Vous pouvez réensemencer sur un mandataire (beaucoup sont trouvable sur Internet si vous ne voulez pas utiliser Tor) ou partager des paquets réensemencement en tant qu'amis hors-ligne.
id: Ya, sejauh ini cara termudah dan paling umum adalah dengan memblokir bootstrap, atau server "Reseed". Benar -benar memblokir semua lalu lintas yang disamarkan akan bekerja dengan baik (walaupun itu akan menghancurkan banyak, banyak hal lain yang bukan I2P dan sebagian besar tidak mau sejauh ini). Dalam kasus reseed blocking, ada bundel reseed di github, pemblokirannya juga akan memblokir GitHub. Anda dapat melakukan reseed melalui proxy (banyak yang dapat ditemukan di Internet jika Anda tidak ingin menggunakan Tor) atau membagikan bundel reseed secara offline antar teman.
ja: はい、ずば抜けて簡単で一般的な方法は、ブートストラップ、つまり「再シード」のサーバーをブロックすることです。完全に不明瞭なトラフィックをブロックすることでも可能です（が、I2P以外の他の多くのものに悪影響が出ますし、大半はそこまで求めていないでしょう）。 再シードをブロックする場合、Githubに再シードのバンドルがあるので、それをブロックするとGithubもブロックします。 プロキシ越しにも再シード可能ですし（Torを使いたくなければ多くがインターネットで見つかります）友人を通じてでオフラインで再シードバンドルを共有することもできます。
pl: Tak, najprostszą i najbardziej powszechną metodą jest zablokowanie serwerów pozwalających znaleźć nowe węzły – tzw. «reseed». Całkowite zablokowanie całego szyfrowanego ruchu również działałoby (jednakże spowodowałoby to zablokowane wielu usług niezwiązanych z I2P). W przypadku zablokowania serwerów reseed, wciąż można byłoby pobrać paczkę reseed z GitHuba, którą można byłoby zablokować blokując całkowicie dostęp do GitHuba. Wciąż możliwe byłoby przeprowadzić reseedowanie przez serwer proxy (oprócz sieci Tor jest wiele innych serwerów dostępnych na sieci), bądź pobranie (lub wymiana offline) paczki reseed od znajomego.
pt: Sim, de longe a forma mais fácil e mais comum é bloquear os servidores bootstrap ou “Reseed”. Bloquear completamente todo o tráfego ofuscado também funcionaria (embora isso quebrasse muitas, muitas outras coisas que não são I2P e a maioria não está disposta a ir tão longe). No caso do bloqueio de reseed, há um pacote de reseed no Github, bloqueá-lo também bloqueará o Github. É possível fazer o reseed através de um proxy (muitos podem ser encontrados na Internet se não quiser usar o Tor) ou partilhar pacotes de reseed offline de amigo para amigo.
tr: Evet, açık farkla en kolay ve en yaygın yol, bootstrap ya da "Yeniden tohumlama" sunucularını engellemektir. Tüm gizlenmiş trafiği tamamen engellemek (I2P olmayan ve çoğu bu kadar ileri gitmeye istekli olmayan pek çok şeyi bozsa da) işe yarar. Yeniden tohumlamanın engellenmesi durumunda, GitHub üzerinde bir yeniden tohumlama paketi vardır ve engellenmesi GitHub erişimini de engeller. Bir vekil sunucu üzerinden yeniden tohumlama yapabilirsiniz (Tor kullanmak istemiyorsanız çoğunu İnternette bulabilirsiniz) ya da yeniden tohumlanan paketleri çevrimdışı olarak arkadaştan arkadaşa paylaşabilirsiniz.

source: In <code>wrapper.log</code> I see an error that states "<code>Protocol family unavailable</code>" when loading the Router Console
de: In der Datei <code>wrapper.log</code> sehe ich einen Fehler, der sagt "<code>Protokollfamilie nicht verfügbar</code>" beim Laden der Router Konsole
es_ar: En el archivo <code>wrapper.log</code> veo un error que indica "<code>Protocol family unavailable</code>" cuando arranco la consola del ruter.
fr: Dans <code>wrapper.log</code>, je vois une erreur qui indique « <code>Famille de protocoles non disponible</code> » lors du chargement de la console de routeur
id: Di <code>wrapper.log</code> saya melihat error yang menyatakan " <code>Protocol family unavailable</code> " ketika loading console router
ja: <code>wrapper.log</code> 内に、ルーターコンソールがロード中の時の "<code>Protocol family unavailable</code>" というエラー状態がありました。
pl: W pliku<code>wrapper.log</code> pojawia się błąd: „<code>Protocol family unavailable</code>” podczas ładowania konsoli węzła.
pt: Em <code>wrapper.log</code> vejo um erro que diz "<code>Protocol family unavailable</code>" quando carrego o Painel do Roteador
tr: Yöneltici panosu yüklenirken <code>wrapper.log</code> içinde <code>İletişim kuralı ailesi kullanılamıyor</code> şeklinde bir hata görüyorum

source: Often this error will occur with any network enabled java software on some systems that are configured to use IPv6 by default. There are a few ways to solve this:
de: Dieser Fehler tritt öfters bei Systemen auf, die IPv6 als Default gesetzt haben und Java Software mit Netzwerkfunktionen nutzen. Es gibt ein paar Möglichkeiten, dieses zu lösen:
es_ar: A menudo este error ocurre con cualquier aplicación java que active la red en sistemas configurados para usar IPV6 por defecto. Hay varias formas de arreglarlo:
fr: Fréquemment, cette erreur se produira avec n’importe quel logiciel Java prenant en charge le réseau sur certains systèmes configurés pour utiliser IPv6 par défaut. Il y existe quelques façons de corriger cela :
id: Seringkali error ini akan terjadi dengan software Java yang jaringannya diaktifkan pada beberapa sistem operasi yang dikonfigurasi untuk menggunakan IPv6 secara default. Ada beberapa cara untuk memecahkan masalah ini:
ja: このエラーはしばしば、デフォルトで IPv6を使用するよう設定されている一部のシステム上でネットワークが有効になっている java ソフトウェアが原因で発生します。
pl: Ten błąd często występuje z programami Java wykorzystujących sieć na niektórych systemach skonfigurowanych do używania domyślnie IPv6. Jest na to kilka sposobów:
pt: Normalmente esse erro ocorrerá em qualquer software que acessa a rede em alguns sistemas configurados para usar IPv6 por padrão. Há alguns modos de resolver isso:
tr: Bu sorun genellikle bazı sistemler üzerindeki ağ erişimine açık Java yazılımlarının varsayılan olarak IPv6 kullanacak şekilde ayarlanmış olmasından kaynaklanır. Bu sorun bir kaç şekilde çözülebilir:

source: On Linux based systems, you can <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
de: Auf Linux-basierten Systemen verwenden Sie <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
es_ar: En sistemas basados en Linux puede ejecutar <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
fr: Sur les systèmes basés sur Linux, vous pouvez utiliser <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
id: Pada sistem berbasis Linux, anda dapat<code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
ja: Linux ベースのシステムでは、<code>echo 0 > /proc/sys/net/ipv6/bindv6only</code> でできます。
pl: Na systemach linuksowych, wpisz code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
pt: Em sistemas baseados em Linux, podeis usar o seguinte comando: <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
tr: Linux temelli sistemlerde <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code> yazabilirsiniz

source: Look for the following lines in <code>wrapper.config</code>.
de: Suchen Sie folgende Zeilen in der <code>wrapper.config</code> Datei.
es_ar: Busque por las siguientes líneas en <code>wrapper.config</code>.
fr: Chercher les lignes suivantes dans <code>wrapper.config</code>.
id: Cari baris berikut dalam <code>wrapper.config</code> .
ja: <code>wrapper.config</code> で次の行を探してください。
pl: Poszukaj następujących linii w <code>wrapper.config</code>:
pt: Procure pelas seguintes linhas no arquivo <code>wrapper.config</code>.
tr: <code>wrapper.config</code> içinde şu satırlara bakın.

source: If the lines are there, uncomment them by removing the "#"s. If the lines are not there, add them without the "#"s.
de: Wenn diese Zeilen bereits so vorhanden sind, kommentiere sie aus, indem du die "#"s entfernst. Andernfalls füge die Zeilen ohne die '#'s hinzu.
es_ar: Si las líneas ya están ahí, descomentelas eliminando los "#". Si las líneas no están ahí añádalas sin los "#".
fr: Si les lignes y sont, ôter le commentaire en supprimant les « # ». Si les lignes n’y sont pas, les ajouter sans « # ».
id: Jika baris tersebut ada, hilangkan tanda komentar dengan menghapus "#". Jika baris tersebut tidak tambahkan mereka tanpa "#".
ja: 行があれば、"#"を除去して、コメント解除してください。行がなければ、"#"をつけず、以下を追加してください。
pl: Jeżeli je napotkasz, od-komentuj je poprzez usunięcie znaków „#”. Jeżeli ich nie ma, to je dodaj bez znaków „#”.
pt: Se essas linhas estiverem lá, remove os "#". Se as linhas não estão lá, adicione-as sem os "#".
tr: Satırlar varsa "#" karakterlerini silerek etkinleştirin. Satırlar yoksa "#" karakteri olmadan ekleyin.

source: Another option would be to remove the <strong>::1</strong> from <code>~/.i2p/clients.config</code>
de: Eine andere Möglichkeit wäre, die <strong>::1</strong> aus <code>~/.i2p/clients.config</code> zu entfernen
es_ar: Otra opción sería borrar <strong>::1</strong> del archivo <code>~/.i2p/clients.config</code>
fr: Une autre option serait de supprimer <strong>::1</strong> dans <code>~/.i2p/clients.config</code>
id: Pilihan lain adalah menghapus <strong>::1</strong> di<code>~/.i2p/clients.config</code>
ja: 別のオプションは、 <code>~/.i2p/clients.config</code> から <strong>::1</strong> を削除することです。
pl: Inną opcją jest usunięcie <strong>::1</strong> z <code>~/.i2p/clients.config</code>.
pt: Outra opção seria a remoção de <strong>::1</strong> do arquivo <code>~/.i2p/clients.config</code>
tr: Bir diğer seçenek olarak <code>~/.i2p/clients.config</code> içinden <strong>::1</strong> bölümünü silebilirsiniz

source: <strong>WARNING</strong>: For any changes to <code>wrapper.config</code> to take effect, you must completely stop the router and the wrapper. Clicking <em>Restart</em> on your router console will NOT reread this file! You must click <em>Shutdown</em>, wait 11 minutes, then start I2P.
de: <strong>WARNUNG</strong>: Damit Änderungen an der <code>wrapper.config</code> wirksam werden, müssen der Router und der Wrapper vollständig gestoppt werden. Ein Klick auf <em>Neustart</em> in der Router-Konsole liest diese Datei NICHT erneut ein! Klicke <em>Herunterfahren</em>, warte 11 Minuten, dann starte I2P neu.
es_ar: <strong>CUIDADO</strong>: Para que los cambios en <code>wrapper.config</code> tengan efecto debe apagar completamente el ruter y el wrapper. ¡Pulsando <em>Reiniciar</em> en la consola del ruter NO leerá de nuevo este archivo! Tiene que pulsar <em>apagar</em>, esperar 11 minutos y entonces arrancar I2P.
fr: <strong>AVERTISSEMENT</strong> : Pour que des modifications de <code>wrapper.config</code> prennent effet, vous devez fermer le routeur et l’enveloppeur. Cliquer sur <em>Redémarrer</em> dans la console de votre routeur ne relira PAS ce fichier ! Vous devez cliquer sur <em>Fermeture</em>, attendre 11 minutes, puis démarrer I2P.
id: <strong>PERINGATAN</strong>: Agar perubahan apa pun pada <code>wrapper.config</code> dapat diterapkan, Anda harus sepenuhnya hentikan router dan wrapper-nya. Mengklik <em>Restart</em> di router console tidak akan mengaktifkan file ini! Anda harus klik <em>Shutdown</em>, tunggu 11 menit, kemudian mulai lagi I2P.
ja: <strong>警告</strong>: <code>wrapper.config</code> への変更を適用するには、ルータ及びラッパーを完全に停止させる必要があります。ルーターコンソールで <em>再起動</em>をクリックしても、このファイルは再読込されません！<em>シャットダウン</em>をクリックして、11分待ち、それから I2P を起動する必要があります。
pl: <strong>UWAGA</strong>: wszelkie zmiany w <code>wrapper.config</code> wymagają całkowitego restartu węzła i wrappera. Samo kliknięcie <em>Restart</em> w konsoli węzła NIE przeładuje tego pliku! Musisz kliknąć <em>Zamknij</em>, poczekać 11 minut, i ponownie włączyć I2P.
pt: <strong>AVISO</strong>: Para quaisquer mudanças no arquivo <code>wrapper.config</code> fazerem efeito, é necessário parar completamente o roteador e o embalador. Clicar <em>Reiniciar</em> em teu painel do roteador NÃO irá reler esse arquivo! É necessário clicar <em>Desligar</em>, esperar onze minutos, então iniciar o I2P.
tr: <strong>Uyarı</strong>: <code>wrapper.config</code> içinde yapılan değişikliklerin etkili olması için yöneltici ve sarıcının tamamen durdurulması gerekir. Bu dosya yöneltici panonuzda <em>Yeniden Başlat</em> üzerine tıkladığınızda yeniden okunmaz. <em>Kapat</em> üzerine tıklayıp 11 dakika bekledikten sonra I2P uygulamasını başlatın.

source: If you consider every I2P Site that has ever been created, yes, most of them are down. People and I2P Sites come and go. A good way to get started in I2P is check out a list of I2P Sites that are currently up. <a href="%(eepstatus)s">%(eepstatus)s</a> tracks active I2P Sites.
fr: Si vous considérez tout les sites I2P qui ont été crées, oui, la plupart sont arrêtés. Les gens et les sites I2P vont et viennent. Un bon moyen de commencer sur I2P est de regarder une liste des sites I2P qui sont actuellement actifs. <a href="%(eepstatus)s">%(eepstatus)s</a>traque les sites I2P actifs.
id: Jika anda mempertimbangkan setiap situs I2P yang pernah dibuat, ya, sebagian besar dari mereka sedang tidak aktif. Orang dan situs I2P datang dan pergi. Cara yang baik untuk memulai di I2P adalah melihat daftar situs I2P yang sedang aktif. <a href="%(eepstatus)s">%(eepstatus)s</a> tracks active I2P Sites.
ja: 過去に作成されたすべてのI2Pサイトということなら、そうです、そのほとんどがダウンしています。 人もI2Pサイトも現れては消えます。 I2Pを始める良い方法は、現在繋がるI2Pサイトのリストを確認することです。 <a href="%(eepstatus)s">%(eepstatus)s</a> はアクティブなI2Pサイトを追跡しています。
pl: Jeżeli weźmiemy pod uwagę wszystkie strony .i2p w historii, to tak, większość z nich jest martwych. Ludzie i strony I2P rodzą się i odchodzą. Dobrym sposobem na rozpoczęcie przygody z I2P jest spojrzenie na listę czynnych stron .i2p. Strona <a href="%(eepstatus)s">%(eepstatus)s</a> śledzi aktywne strony I2P.
pt: Se considerarmos todos os sítios I2P que já foram criados, sim, a maioria deles está em baixo. As pessoas e os sítios I2P vão e vêm. Uma boa maneira de começar a usar o I2P é verificar uma lista de sites I2P que estão atualmente em funcionamento. <a href="%(eepstatus)s">%(eepstatus)s</a> rastreia sítios I2P ativos.
tr: Şu ana kadar oluşturulmuş tüm I2P Sitelerini düşünürseniz, çoğu şu anda kapalıdır. Kişiler ve I2P siteleri gelir ve gider. Şu anda çalışmakta olan I2p sitelerinin listesini denetlemek I2P ile çalışmaya başlamak için iyi bir yoldur. <a href="%(eepstatus)s">%(eepstatus)s</a> etkin I2P sitelerini izler.

source: Why is I2P listening on port 32000?
de: Warum lauscht I2P auf dem Port 32000 ?
es_ar: ¿Porqué está escuchando I2P en el puerto 32000?
fr: Pourquoi I2P écoute-t-il sur le port 32000 ?
id: Mengapa I2P mendengarkan pada port 32000?
ja: 何故 I2P は 32000番ポートでリッスンしているのですか？
pl: Dlaczego I2P nasłuchuje na porcie 32000?
pt: Por que o I2P está escutando na porta 32000?
tr: I2P neden 32000 numaralı bağlantı noktasını dinliyor?

source: The Tanuki java service wrapper that we use opens this port &mdash;bound to localhost&mdash; in order to communicate with software running inside the JVM. When the JVM is launched it is given a key so it can connect to the wrapper. After the JVM establishes its connection to the wrapper, the wrapper refuses any additional connections.
de: Der genutzte Tanuki Java Service Wrapper öffnet diesen Port &mdash;gebunden an Localhost&mdash; um mit Softwre, die innerhalb der JVM rennt, zu kommunizieren. Beim Start der JVM wird ein Schlüssel übergeben, damit diese sich mit dem Wrapper verbinden kann. Nach Etablierung der Verbindung JVM - Wrapper verweigert der Wrapper weitere Verbindungen.
es_ar: El Tanuki java service wrapper que utilizamos abre este puerto &mdash;vinculado a localhost&mdash; con el fin de comunicarse con el software que se ejecuta dentro de la JVM. Cuando se lanza la JVM se le da una clave para que pueda conectarse a la envoltura. Después de que la JVM establece su conexión con la envoltura, ésta rechaza cualquier conexión adicional.
fr: L’enveloppeur de services Java Tanuki que nous utilisons ouvre ce port « lié à l’hôte local » afin de communiquer avec les programmes qui tournent dans la MVJ. Quand la MVJ est lancée, elle reçoit une clé afin de pouvoir se connecter à l’enveloppeur. Une fois que la MVJ établit sa connexion à l’enveloppeur, ce dernier refuse toute autre connexion.
id: Tanuki Java service wrapper yang kita gunakan untuk membuka port ini &mdash;terikat kepada localhost&mdash; untuk berkomunikasi dengan software yang berjalan di dalam JVM. Ketika JVM diluncurkan, JVM diberikan sebuah kunci sehingga dapat terhubung ke wrapper tersebut. Setelah JVM membuat koneksi ke wrapper, wrapper menolak koneksi tambahan.
ja: 我々が使用している Tanuki Java サービスラッパーがこのポート - localhostにバインド - を開けています。それはJVM内で動作しているソフトウェアと通信するためです。 JVM の起動時に鍵が渡されラッパーに接続できるようになります。 JVMがラッパーへの接続を確立すると、ラッパーはそれ以上の接続を拒否します。
pl: Usługa wrappera Javy „Tanuki” otwiera ten port – przypięty pod localhost – aby komunikować się z oprogramowaniem uruchomionym wewnątrz JVM. Kiedy maszyna wirtualna Javy jest uruchamiana, tworzony jest klucz, potrzebny do połączenia z wrapperem. Po tym jak JVM utworzy połączenie z wrapperem, wrapper odrzuca wszystkie następne połączenia.
pt: O wrapper do serviço java Tanuki que utilizamos abre esta porta &mdash;ligado ao localhost&mdash; para comunicar com o software que corre dentro da JVM. Quando a JVM é iniciada, é-lhe dada uma chave para que possa estabelecer conexões com o wrapper. Depois de a JVM estabelecer a sua ligação ao wrapper, este recusa quaisquer conexões adicionais.
tr: Java sanal makinesi içindeki yazılım ile localhost arasında bağlantı kuracak bu bağlantı noktasını açmak için Tanuki Java hizmeti kapsayıcısını kullanıyoruz. Java sanal makinesi başlatıldığında, verilen bir anahtarı kullanarak kapsayıcı ile bağlantı kurar. Java sanal makinesi kapsayıcı ile bağlantı kurduktan sonra, kapsayıcı başka bir bağlantı kurulmasına izin vermez.

source: More information can be found in the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>.
de: Mehr Informationen können in der <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">Dokumentation des Wrappers</a> gefunden werden.
es_ar: Encontrará más información en la <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentación sobre envoltorios</a>.
fr: Plus d’informations se trouvent dans la <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentation de l’enveloppeur</a>.
id: Informasi lebih lanjut dapat ditemukan dalam <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">dokumentasi wrapper</a>.
ja: 詳細な情報は、<a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">ラッパーの文書</a>を参照のこと。
pl: Więcej informacji jest dostępnych w <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">dokumentacji wrappera</a>.
pt: Para mais informações, consultar a documentação do </a>wrapper</a>.
tr: Ayrıntılı bilgi almak için <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">kapsayıcı belgeleri</a> bölümüne bakabilirsiniz.

source: The proxy config for different browsers is on a <a href="%(browserconfig)s"> separate page</a> with screenshots. More advanced configs with external tools, such as the browser plug-in FoxyProxy or the proxy server Privoxy, are possible but could introduce leaks in your setup.
de: Die Konfiguration des Proxy ist ausgelagert auf eine <a href="%(browserconfig)s"> separate Seite</a> mit ScreenShots. Weitere Konfigurationen mit externen Programmen, wie z.B. dem PlugIn FoxyProxy oder dem Proxyserver Privoxy, sind möglich, können jedoch Schwachstellen in Ihrem Setup öffnen.
fr: La configuration du mandataire pour différents navigateurs se trouve sur une <a href="%(browserconfig)s">page séparée</a> avec des captures d’écran. Des configurations plus évoluées sont possibles avec des outils externes, tels que l’extension FoxyProxy pour navigateur ou le serveur mandataire Privoxy, mais ils pourraient entraîner des fuites dans votre installation.
id: Konfigurasi proxy untuk browser yang berbeda ada di <a href="%(browserconfig)s">halaman terpisah</a> dengan screenshot. Konfigurasi yang lebih canggih dengan alat eksternal, seperti plug-in browser FoxyProxy atau proxy server Privoxy, memang dimungkinkan tetapi dapat memberikan kebocoran dalam pengaturan Anda.
ja: それぞれのブラウザに対するプロキシ設定は<a href="%(browserconfig)s">別ページ</a>にスクリーンショット付きで載せてあります。 外部ツール、例えばブラウザプラグインFoxyProxyやプロキシサーバーPrivoxyなどによる高度な設定は可能ですが、漏洩を招く可能性があります。
pl: Instrukcje konfiguracji serwerów proxy dla różnych przeglądarek internetowych wraz z zrzutami ekranu znajdują się na <a href="%(browserconfig)s">osobnej stronie</a>. Bardziej zaawansowane konfiguracje z użyciem narzędzi zewnętrznych takich jak rozszerzenie do przeglądarek FoxyProxy bądź serwer Privoxy są możliwe, ale ich niepoprawna konfiguracja grozi wyciekiem Twoich danych.
pt: A configuração do proxy para diferentes navegadores está numa <a href="%(browserconfig)s">página separada</a> com capturas de ecrã. Configurações mais avançadas com ferramentas externas, como o plug-in de navegador FoxyProxy ou o servidor proxy Privoxy, são possíveis, mas podem introduzir vazamentos na sua configuração.
tr: Farklı tarayıcılar için vekil sunucu ayarları ekran görüntüleri ile <a href="%(browserconfig)s">ayrı bir bölümde verilmiştir</a>. FoxyProxy ya da Privoxy gibi eklentiler kullanılarak daha gelişmiş ayarlar da yapılabilir ancak bunlar kurulumunuzda sızıntılara neden olabilir.
