Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: A tunnel to the main IRC server within I2P, Irc2P, is created when I2P is installed (see the <a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel configuration page</a>), and is automatically started when the I2P router starts. To connect to it, tell your IRC client to connect to <code>localhost 6668</code>. HexChat-like client users can create a new network with the server <code>localhost/6668</code> (remember to tick "Bypass proxy server" if you have a proxy server configured). Weechat users can use the following command to add a new network:
de: Ein Tunnel zum wichtigsten IRC Netzwerk innerhalb von I2P, IRC2p, wird bei der Installation von I2P erstellt (schauen Sie auf die <a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel Konfigurations Seite</a>) und wird beim Start des I2P Routers automatisch gestartet. Um sich damit zu verbinden, weisen Sie ihrem IRC Klienten an, sich mit <code>localhost 6668</code>zu verbinden. Nutzer eines HexChat ähnlichen Programmes können ein neues Netzwerk mit dem Server<code>localhost/6668</code> erstellen (Falls Sie einen Proxy Server im IRC Programm eingerichtet habenm vergessen Sie nicht die Option "Bypass proxy server" zu aktivieren. Weechat Nutzer können folgende Befehle zum Hinzufügen eines neuen Netzwerkes benutzen:
fr: Un tunnel vers le serveur IRC principal dans I2P, Irc2P, est créé lors de l’installation d’I2P (voir la <a href="http://localhost:7657/i2ptunnel/index.jsp">page Configuration d’I2PTunnel</a>) et est démarré automatiquement lors du démarrage du routeur I2P. Pour s’y connecter, configurez votre client IRC pour qu’il se connecte à l’<code>hôte local 6668.</code> Les utilisateurs de clients comme HeXChat peuvent créer un nouveau réseau avec le serveur <code>localhost/6668</code> (ne pas oublier de cocher « Contourner le serveur mandataire » si un mandataire est configuré). Les utilisateurs de Weechat peuvent utiliser la commande suivante pour ajouter un nouveau réseau :
id: Tunnel ke server IRC utama dalam I2P, Irc2P, dibuat saat I2P diinstal (lihat <a href="http://localhost:7657/i2ptunnel/index.jsp">halaman konfigurasi I2PTunnel</a> ), dan otomatis dimulai saat router I2P dimulai. Untuk menghubungkannya, beritahu klien IRC anda untuk terhubung ke <code>localhost 6668</code> . Pengguna klien seperti hexchat dapat membuat jaringan baru dengan server <code> localhost/6668 </code> (ingat untuk mencentang "Bypass Proxy Server" jika Anda memiliki server proxy yang dikonfigurasi). Pengguna Weechat dapat menggunakan perintah berikut untuk menambahkan jaringan baru:
ja: I2PのメインIRCサーバー Irc2P へのトンネルは、I2Pのインストール時に作成され（<a href="http://localhost:7657/i2ptunnel/index.jsp">I2Pトンネル設定ページ</a>を参照）、I2Pルーター起動時に自動的に開始されます。 接続するには、IRCクライアントに<code>localhost 6668</code>へ繋ぐよう指定します。 HexChat系クライアント使用者は<code>localhost/6668</code>サーバーで新しいネットワークを作成できます（プロキシサーバーを設定している場合「プロキシサーバーのバイパス」をONにするのを忘れずに）。 Weechatユーザは新しいネットワーク作成に次のコマンドを使用できます。
pl: Tunel do głównego serwera IRC w sieci I2P – Irc2P – został utworzony podczas instalacji I2P (zajrzyj na <a href="http://localhost:7657/i2ptunnel/index.jsp">stronę zarządzania ukrytymi usługami</a>) i jest automatycznie uruchamiany podczas startu węzła. Aby się z nim połączyć, skonfiguruj swojego klienta IRC do łączenia się z serwerem <code>localhost 6668</code>. Użytkownicy programu HexChat mogą utworzyć nową sieć z serwerem <code>localhost/6668</code> (zaznacz „pomiń serwer proxy”, jeżeli masz skonfigurowany serwer proxy). Użytkownicy programu Weechat mogą wpisać następujące polecenie:
pt: Um túnel para o servidor principal de IRC dentro do I2P, Irc2P, é criado quando o I2P é instalado (veja a <a href="http://localhost:7657/i2ptunnel/index.jsp">página de configuração do I2PTunnel</a>), e é automaticamente iniciado quando o roteador I2P inicia. Para se ligar a ele, diga ao seu cliente IRC para se ligar a <code>localhost 66682</code>. Os utilizadores de clientes do tipo HexChat podem criar uma nova rede com o servidor <code>localhost/66683</code> (não se esqueça de assinalar “Contornar o servidor proxy” se tiver um servidor proxy configurado). Os utilizadores do Weechat podem utilizar o seguinte comando para adicionar uma nova rede:
tr: I2P kurulurken, I2P, Irc2P içinden ana IRC sunucusuna bir tünel oluşturulur (<a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel Yapılandırması bölümüne</a> bakabilirsiniz) ve I2P yönelticisi başlatıldığında otomatik olarak başlatılır. Bağlanmak için IRC istemcinizi <code>localhost 6668</code> adresine bağlanacak şekilde ayarlayın. HexChat benzeri istemci kullanıcıları <code>localhost/6668</code> sunucusu ile yeni bir ağ oluşturabilir (vekil sunucu varsa "Vekil sunucu atlansın" seçeneğini işaretlemeyi unutmayın). Weechat kullanıcıları şu komutu kullanarak yeni bir ağ ekleyebilir:

source: Click on the <a href="http://localhost:7658/">Website</a> link at the top of your router console for instructions.
de: Klicken Sie auf den <a href="http://localhost:7658/">Webseiten</a> Link ganz oben in der Routerkonsole um Anweisungen zu erhalten.
es_ar: Pulse en el enlace a la <a href="http://localhost:7658/">página web</a> en la parte de arriba de las instrucciones de la consola del ruter.
fr: Cliquez sur le lien du <a href="http://localhost:7658/">site Web</a> en haut de la console de votre routeur pour obtenir des instructions.
id: Klik pada tautan <a href="http://localhost:7658/">Situs Web</a> di bagian atas router consel anda untuk mendapatkan petunjuk.
ja: ルーターコンソール上部の<a href="http://localhost:7658/">Webサイト</a>リンクをクリックして説明を確認してください。
pl: Kliknij w odnośnik „<a href="http://localhost:7658/">serwer www</a>” w konsoli Twojego węzła, aby dowiedzieć się więcej.
pt: Para instruções, clique no link do <a href="http://localhost:7658/">Website</a> no topo do painel do seu roteador.
tr: Yönergeler için yöneltici panonuzun üzerindeki <a href="http://localhost:7658/">site</a> bağlantısına tıklayın.

source: If you're hosting a personal blog or doing something otherwise non-sensitive, then you are obviously in little danger. If you have privacy needs that are basically non-specific, you are in little danger. If you are hosting something sensitive, then your services will go down at the same time that your router goes down. Someone who observes your downtime and correlates it to real-world events could probably de-anonymize you with enough effort. I2P has defenses available against this like multihoming or Tahoe-LAFS, but they require additional set up and are only appropriate for some threat models. There is no magic solution, protecting yourself from a real threat will take real consideration in any case.
es_ar: Si alojas un blog personal o haces algo que no sea sensible, obviamente corres poco peligro. Si tienes necesidades de privacidad que básicamente no son específicas, corres poco peligro. Si estás alojando algo sensible, entonces tus servicios se caerán al mismo tiempo que tu router. Alguien que observe su tiempo de inactividad y lo correlacione con eventos del mundo real probablemente podría desanonimizarte con suficiente esfuerzo. I2P tiene defensas disponibles contra esto como multihoming o Tahoe-LAFS, pero requieren una configuración adicional y sólo son apropiadas para algunos modelos de amenaza. No existe una solución mágica. protegerse de una amenaza real requerirá una consideración real en cualquier caso.
fr: Si vous hébergez un blogue personnel et faites quelque chose de déplacé, vous êtes évidemment peu en danger. Si vous avez des besoin d'intimité qui ne sont pas spécifiques, vous n'êtes pas vraiment en danger. Si vous hébergez quelque chose de sensible, alors vos services s'arrêteront en même temps que votre routeur. Quelqu'un qui observe vos temps d'arrêts et les lie à des évènements dans la vraie vie peut probablement vous désanonymiser avec suffisamment d'effort. I2P à des défenses disponibles contre des situations pareilles comme des multiconnexions ou Tahoe-LAFS, mais ils demandent des préparations supplémentaires et ne sont appropriées que pour certaines menaces. Il n'y a pas de solution magique, vous protéger d'une vrai menace demandera dans tout les cas une considération réelle.
id: Jika Anda hosting blog pribadi atau melakukan sesuatu yang tidak sensitif, maka Anda jelas dalam bahaya kecil. Jika Anda memiliki kebutuhan privasi yang pada dasarnya tidak spesifik, Anda berada dalam bahaya kecil. Jika Anda me-hosting sesuatu yang sensitif, service yang Anda jalankan akan mati pada saat yang sama router Anda mati. Seseorang yang mengamati downtime Anda dan menghubungkannya dengan peristiwa di dunia nyata mungkin bisa menganonimkan Anda dengan usaha yang cukup. I2P memiliki pertahanan yang terhadap ini seperti multihoming atau Tahoe-LAFS, tetapi membutuhkan pengaturan tambahan dan hanya sesuai untuk beberapa model ancaman. Tidak ada solusi ajaib, melindungi diri Anda dari ancaman nyata akan memerlukan usaha nyata.
ja: 個人ブログをホストしたり、その他のセンシティブでないことをやる場合は明らかに危険度は小さいです。 基本的に具体的ではないプライバシーのニーズがある場合、危険度は小さいです。センシティブなコンテンツをホストしている場合は、 サービスはルーターがダウンした際に同時にダウンします。ダウンタイムを観測して、それを実世界の出来事に結び付けた 人物は、おそらく相当の努力をもってすればあなたを脱匿名化可能でしょう。I2PにはマルチホーミングやTahoe-LAFSのような この種の攻撃に対する防御がありますが、追加設定が必要であり、有効なのはいくつかの脅威モデルに対してのみです。魔法の解決策はなく、 自分を現実の今日から守るには、どんな場合でもじっくりと考えることが必要となります。
pl: Jeżeli prowadzisz własny blog lub udostępniasz jakieś mało wrażliwe treści, to raczej nie jesteś w większym niebezpieczeństwie. Jeżeli potrzebujesz podstawowej prywatności, również nie jesteś w większym niebezpieczeństwie. Jeżeli hostujesz jakieś wrażliwe treści, Twoja usługa przestanie działać w tym samym momencie co Twój węzeł. Ktoś monitorujący czas niedostępności Twojej usługi może skorelować to z wydarzeniami w świecie rzeczywistym i zdeanonimizować Cię przy pewnych nakładach pracy. Można się przed tym bronić hostując usługę na wielu serwerach (multihoming) bądź korzystając z Tahoe-LAFS, ale wymaga do dodatkowej konfiguracji i jest odpowiednie tylko dla pewnego rodzaju zagrożeń. Nie istnieje jedno idealne rozwiązanie, ochrona przed inwigilacją wymaga rozważnych decyzji w każdym przypadku.
pt: Se estiver a alojar um blogue pessoal ou a fazer algo que não seja sensível, então, obviamente, corre pouco perigo. Se tiver necessidades de privacidade basicamente não específicas, corre pouco perigo. Se estiver a alojar algo sensível, então os seus serviços ficarão em baixo ao mesmo tempo que o seu roteador fica em baixo. Alguém que observe o seu tempo de inatividade e o correlacione com eventos do mundo real poderia provavelmente retirar-lhe o anonimato com esforço suficiente. O I2P tem defesas disponíveis contra isso, como multihoming ou Tahoe-LAFS, mas elas exigem configurações adicionais e são apropriadas apenas para alguns modelos de ameaças. Não existe uma solução mágica, proteger-se de uma ameaça real requer uma consideração real em qualquer caso.
tr: Kişisel bir blog barındırıyorsanız ya da hassas olmayan başka bir şey yapıyorsanız, kesinlikle küçük bir tehlike altındasınız demektir. Kişisel gizlilik gereksinimleriniz temel olarak belirli değilse çok az tehlike altındasınız. Hassas bir içerik barındırıyorsanız, yönelticiniz devre dışı kalırsa hizmetleriniz de devre dışı kalır. Devre dışı kalma süresini gözlemleyen ve bunu gerçek dünyadaki olaylar ile ilişkilendiren biri, yeterince çaba harcarsa anonimliğinizi kaldırabilir. Bu durumlara karşı çoklu barındırma ya da Tahoe-LAFS gibi I2P korumaları vardır. Ancak bunlar ek kurulum gerektirir ve yalnızca bazı tehdit modelleri için uygundur. Kendinizi gerçek bir tehditten korumak için sihirli bir çözüm yoktur ve gerçekleşebilecek her durumun değerlendirilmesi gerekir.

source: How Does I2P find ".i2p" websites?
es_ar: ¿Cómo encuentra I2P los sitios web ".i2p"?
fr: Comment est-ce que I2P trouve les sites web ".i2p" ?
id: Bagaimana cara I2P menemukan situs web ".i2p"?
ja: I2Pはどのようにして".i2p"のウェブサイトを見つけるのですか？
pl: W jaki sposób węzeł odnajduje strony .i2p?
pt: Como é que o I2P encontra sites ".i2p"?
tr: I2P, ".i2p" sitelerini nasıl bulur?

source: How do I add addresses to the Address Book?
es_ar: ¿Cómo añado direcciones a la Agenda?
fr: Comment rajouter des adresses au carnet d'adresse ?
id: Bagaimana cara menambahkan alamat ke Buku Alamat?
ja: アドレス帳にアドレスを追加するには？
pl: Jak można dodać adresy do książki adresowej?
pt: Como faço para adicionar endereços ao Catálogo de Endereços?
tr: Adresleri Adres Defterine nasıl eklerim?

source: You cannot add an address without knowing at least the base32 or base64 of the site you want to visit. The "hostname" which is human-readable is only an alias for the cryptographic address, which corresponds to the base32 or base64. Without the cryptographic address, there is no way to access an I2P Site, this is by design. Distributing the address to people who do not know it yet is usually the responsibility of the Jump service provider. Visiting an I2P Site which is unknown will trigger the use of a Jump service. stats.i2p is the most reliable Jump service.
es_ar: No puede añadir una dirección sin conocer al menos el base32 o el base64 del sitio que desea visitar. El "nombre de host" que es legible por humanos es sólo un alias para la dirección criptográfica, que corresponde a base32 o base64. Sin la dirección criptográfica, no hay manera de acceder a un sitio I2P, esto es por diseño. Distribuir la dirección a las personas que aún no la conocen suele ser responsabilidad del proveedor del servicio Jump. Visitar un Sitio I2P que es desconocido activará el uso de un servicio Jump. stats.i2p es el servicio Jump más fiable.
fr: Vous ne pouvez pas ajouter une adresse sans connaître au moins base32 ou base64 du site que vous voulez visiter. Le "hostname" qui est lisible par un humain est seulement un alias pour l'adresse cryptographique qui corresponds à la base 32 ou base64. Sans l'adresse cryptographique, il est impossible d'accéder à un site I2P, c'est intentionnel. Distribuer l'adresse à des gens qui ne la connaisse pas encore est normalement la responsabilité du fournisseur du service Jump. Visiter un site I2P inconnu activera le service Jump. stats.i2p est le service Jump le plus fiable.
id: Anda tidak dapat menambahkan alamat tanpa mengetahui setidaknya alamat base32 atau base64 dari situs yang ingin Anda kunjungi. "hostname" yang dapat dibaca manusia hanyalah alias untuk alamat kriptografi, yang sesuai dengan alamat base32 atau base64. Tanpa alamat kriptografi, tidak ada cara untuk mengakses Situs I2P, hal ini memang disengaja. Menyebarkan alamat biasanya merupakan tanggung jawab penyedia Jump service. Mengunjungi situs I2P yang tidak diketahui akan memicu penggunaan Jump service. stats.i2p adalah Jump service yang paling dapat diandalkan.
ja: 開きたいサイトのbase32または base64を少なくとも知っていなければアドレスを追加できません。人間が可読な「ホスト名」は暗号化されたアドレスのエイリアスにすぎず、base32または base64に対応します。暗号アドレスがなければ、I2P サイトにアクセスする手段はありません。これは仕様です。アドレスを知らない人に配布するのは、通常ジャンプサービスプロバイダーの責任です。知らない I2P サイトを開くことがジャンプサービスの利用の引き金となります。stats.i2pは最も信頼できるジャンプサービスです。
pl: Nie można dodać adresu bez znajomości przynajmniej adresu Base32 lub Base64 strony. Łatwo zapamiętywalna nazwa hosta jest tylko aliasem adresu kryptograficznego, który odpowiada adresowi Base32/Base64. Bez tego adresu kryptograficznego nie ma możliwości odwiedzenia danej strony w sieci I2P. Rozpowszechnianiem adresów osobom, które jaszcze ich nie znają zajmują się „usługi skoków”. Przy wejściu na nieznany adres węzeł I2P zaproponuje użycia usługi skoków, z których stats.i2p jest najbardziej godną zaufania.
pt: Não é possível adicionar um endereço sem conhecer pelo menos a base32 ou a base64 do sítio que se pretende visitar. O “nome do host”, que é legível por humanos, é apenas um alias para o endereço criptográfico, que corresponde à base32 ou base64. Sem o endereço criptográfico, não há forma de aceder a um sítio I2P, o que está previsto. A distribuição do endereço a pessoas que ainda não o conhecem é normalmente da responsabilidade do fornecedor do serviço Jump. A visita a um I2P Site desconhecido desencadeará a utilização de um serviço Jump. stats.i2p é o serviço Jump mais fiável.
tr: Adres eklemek için ziyaret etmek istediğiniz sitenin en azından base32 ya da base64 adresini bilmeniz gerekir. İnsan tarafından okunabilen "sunucu adı", base32 veya base64 değerine karşılık gelen şifrelenmiş adres için bir takma addır. Tasarım gereği, şifrelenmiş adres olmadan bir I2P sitesine erişilemez. Adresi henüz bilmeyen kişilere dağıtmak genellikle Jump hizmeti sağlayıcısının sorumluluğundadır. Bilinmeyen bir I2P Sitesini ziyaret etmek, bir Jump hizmetinin kullanılmasına yol açar. stats.i2p, en güvenilir Jump hizmetidir.

source: If you're hosting a site via i2ptunnel, then it won't have a registration with a jump service yet. To give it a URL locally, then visit the configuration page and click the button that says "Add to Local Address Book." Then go to http://127.0.0.1:7657/dns to look up the addresshelper URL and share it.
es_ar: Si estás alojando un sitio a través de i2ptunnel, entonces todavía no tendrá un registro con un servicio de salto. Para darle una URL localmente, entonces visita la página de configuración y haz clic en el botón que dice "Añadir a la libreta de direcciones local". A continuación, vaya a http://127.0.0.1:7657/dns para buscar la URL de addresshelper y compártala.
fr: Si vous hébergez un site sur i2ptunnel, alors il n'aura pas encore d'inscription à un service jump. Pour lui donner une URL locale, visitez la page de configuration et cliquez le bouton indiquant "Ajouter au carnet d'adresse local" puis allez à http://127.0.0.1:7657/dns pour trouver l'URL adresshelper et la partager.
id: Jika Anda me-hosting situs melalui I2ptunnel, maka situsnya belum akan terdaftar di Jump service. Untuk memberikan URL secara lokal, kunjungi halaman konfigurasi dan klik tombol yang bertuliskan "Tambahkan ke Buku Alamat Lokal." Kemudian buka http://127.0.0.1:7657/dns untuk mencari URL Alamat lalu bagikan alamat tersebut.
ja: i2ptunnelを通じてサイトをホストしている場合、まだジャンプサービスに登録されていません。ローカルに URL を与えるためには、設定ページを開いて、「ローカルのアドレス帳に追加」と書かれたボタンをクリックしてください。その後、 http://127.0.0.1:7657/dns を開き、アドレスヘルパーのURLを検索し、共有してください。
pl: Hostowanie strony korzystając z wbudowanej aplikacji „i2ptunnel” nie spowoduje automatycznej rejestracji strony w usłudze skoków. Aby przydzielić nazwę lokalnie, wejdź na stronę konfiguracji i kliknij „dodaj do lokalnej książki adresowej”. Następnie przejdź do <a href="http://127.0.0.1:7657/dns">http://127.0.0.1:7657/dns</a> i udostępnij innym odnośnik pomocniczy.
pt: Se estiver a alojar um site através do i2ptunnel, então este ainda não terá um registo num serviço de salto. Para lhe dar um URL localmente, visite a página de configuração e clique no botão que diz “Adicionar ao livro de endereços local”. Depois, vá a http://127.0.0.1:7657/dns para procurar o URL do addresshelper e partilhe-o.
tr: Bir siteyi i2ptunnel ile barındırıyorsanız, henüz bir Jump hizmetinde kaydı yoktur. Yerel olarak bir adres vermek için, yapılandırma sayfasını ziyaret edin ve "Yerel Adres Defterine Ekle" düğmesine tıklayın. Ardından, adres yardımcısı adresini aramak ve paylaşmak için http://127.0.0.1:7657/dns adresine gidin.

source: The ports that are used by I2P can be divided into 2 sections:
de: Die Ports, die I2P benutzt, können in zwei Gruppen eingeteilt werden:
es_ar: Los puertos que utiliza I2P pueden dividirse en 2 secciones:
fr: Les ports utilisés par I2P peuvent être divisés en deux catégories :
id: Port yang digunakan oleh I2P dapat dibagi menjadi 2 bagian:
ja: I2Pに使用されているポートは2つの部分から成ります：
pl: Porty wykorzystywane przez I2P można umieścić w 2 kategoriach:
pt: As portas que são utilizadas pela I2P podem ser divididas em 2 grupos:
tr: I2P tarafından kullanılan bağlantı noktaları ikiye ayrılabilir:

source: Internet-facing ports, which are used for communication with other I2P routers
de: Dem Internet zugewandte Ports für die Verbindung zu anderen I2P-Routern
es_ar: Puertos orientados a Internet, que se utilizan para la comunicación con otros routers I2P
fr: Les ports dirigés vers Internet qui sont utilisés pour la communication avec d’autres routeurs I2P
id: Port yang menghadap internet, yang digunakan untuk komunikasi dengan router I2P lainnya
ja: インターネット用ポート。他のI2Pルーターとのやり取りに使用される。
pl: Porty wystawione do internetu, używane do komunikacji z innymi węzłami I2P
pt: Portas voltadas para a Internet, que são usadas para comunicação com outros roteadores I2P
tr: İnternet üzerine dönük olan ve diğer I2P yönelticileri ile iletişim kurmak için kullanılan bağlantı noktaları

source: Local ports, for local connections
de: Lokale Ports für lokale Verbindungen
es_ar: Puertos locales, para conexiones locales
fr: Les ports locaux pour les connexions locales
id: Port lokal, untuk koneksi lokal
ja: ローカル接続用のローカルポート。
pl: Porty lokalne, do połączeń lokalnych na Twoim systemie
pt: Portas locais, para conexões locais
tr: Yerel ağa dönük olan ve yerel bağlantılar için kullanılan bağlantı noktaları

source: These are described in detail below.
de: Diese sind unten im Detail beschrieben.
es_ar: A continuación se describen detalladamente.
fr: Ils sont décrits en détail ci-dessous.
id: Hal ini dijelaskan secara rinci di bawah ini.
ja: 詳しい説明は以下。
pl: Poniżej szczegółowy opis.
pt: Estes são descritos em detalhes abaixo.
tr: Bunlar aşağıda ayrıntılı olarak açıklanmıştır.

source: Internet-facing ports<br> Note: Since release 0.7.8, new installs do not use port 8887; a random port between 9000 and 31000 is selected when the program is run for the first time. The selected port is shown on the router <a href="http://127.0.0.1:7657/confignet">configuration page</a>.
de: Service Ports auf der Internetseite<br> Hinweis: seit Version 0.7.8 nutzen neue Installationen nicht mehr den Port 8887; ein zufälliger Port zwischen 9000 und 31000 wird beim ersten Start des Programms ausgewählt. Der ausgewählte Port wird auf der Router <a href="http://127.0.0.1:7657/confignet">Konfigurationsseite</a>angezeigt.
fr: Ports dirigés vers Internet<br> Note : Depuis la version 0.7.8, les nouvelles installations n’utilisent pas le port 8887 ; un port aléatoire entre 9000 et 31000 est sélectionné lors du premier lancement du programme. Le port sélectionné apparaît sur la <a href="http://127.0.0.1:7657/confignet">page de configuration</a> du routeur.
id: Port yang terhubung ke Internet<br> Catatan: Sejak rilis 0.7.8, instalasi baru tidak menggunakan port 8887; Port acak antara 9000 dan 31000 dipilih ketika program dijalankan untuk pertama kalinya. Port yang dipilih ditampilkan pada <a href="http://127.0.0.1:7657/confignet">halaman konfigurasi</a> router.
ja: インターネット用ポート<br> 注意：バージョン0.7.8以降の新規インストールでは8887番ポートを使用しません。 9000～31000番ポートが初回起動時にランダムに選ばれます。 選ばれたポートは<a href="http://127.0.0.1:7657/confignet">ルーター設定ページ</a>に表示されています。
pl: Porty wystawione do internetu<br> Uwaga: od wersji 0.7.8 nowe instalacje nie wykorzystują portu 8887, tylko losowy port z przedziału &#91;9000, 31000&#93; wybrany podczas pierwszego uruchomienia węzła. Wybrany port jest wyświetlany na <a href="http://127.0.0.1:7657/confignet">stronie konfiguracji</a> węzła.
pt: Portas viradas para a Internet <br> Nota: desde a versão 0.7.8, as novas instalações não utilizam a porta 8887; uma porta aleatória entre 9000 e 31000 é selecionada quando o programa é executado pela primeira vez. A porta selecionada é apresentada na <a href="http://127.0.0.1:7657/confignet">página de configuração do router</a>.
tr: Internet üzerine dönük bağlantı noktaları<br> Not: 0.7.8 sürümünden sonra yeni kurulumlarda 8887 numaralı bağlantı noktası kullanılmıyor; uygulama ilk kez çalıştırıldığında 9000 ile 31000 arasında bir bağlantı noktası rastgele olarak seçiliyor. Seçilmiş bağlantı noktası yönelticinin <a href="http://127.0.0.1:7657/confignet">yapılandırma bölümünden</a> görülebilir.

source: OUTBOUND
de: AUSGEHEND
fr: SORTANT
ja: 発信側
pl: WYCHODZĄCE
pt: SAÍDA
tr: GİDİŞ
