Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Downloading...
de: Download...
es_ar: Descargando...
fr: Téléchargement…
id: Mengunduh...
ja: ダウンロードしています...
pl: Pobieranie…
pt: A transferir...
tr: İndiriliyor...

source: Your download will begin shortly. If it doesn't start within 5 seconds, click <a href="%(url)s">here</a>.
de: Dein Download beginnt gleich. Falls er nicht innerhalb von 5 Sekunden startet, klicke <a href="%(url)s">hier</a>.
es_ar: Su descarga comenzará en breve. Si no comienza en 5 segundos, haga clic <a href="%(url)s">aquí</a>.
fr: Votre téléchargement débutera sous peu. S’il ne commence pas dans les 5 secondes, cliquer <a href="%(url)s">ici</a>.
id: Unduhan anda akan dimulai segera. Jika unduhan tidak dimulai dalam 5 detik, klik <a href="%(url)s">di sini</a>.
ja: ダウンロードはすぐに始まります。5秒以内に始まらない場合は、 <a href="%(url)s">こちら</a>をクリックしてください。
pl: Pobieranie powinno się wkrótce rozpocząć. Jeśli nie rozpocznie się w ciągu 5 sekund, kliknij <a href="%(url)s">tu</a>.
pt: O seu download começará em instantes. Se não iniciar dentro de 5 segundos, clique <a href="%(url)s">aqui</a>.
tr: İndirme işleminiz kısa bir süre sonra başlayacak. 5 saniye içinde başlamaz ise <a href="%(url)s">buraya tıklayın</a>.

source: Mirror selection
de: Mirror Auswahl
es_ar: Selección de servidor espejo ('mirror')
fr: Sélection du miroir
id: Pilihan Mirror
ja: ミラー選択
pl: Wybór serwera pobierania
pt: Seleção do espelho
tr: Yansı seçimi

source: File:
de: Datei:
es_ar: Archivo:
fr: Fichier :
ja: ファイル:
pl: Plik:
pt: Ficheiro:
tr: Dosya:

source: Any mirror
de: Irgendein Downloadmirror
es_ar: Cualquier servidor espejo ('mirror')
fr: N’importe quel miroir
id: Miror mana saja
ja: すべてのミラー
pl: Dowolny serwer
pt: Qualquer espelho
tr: Herhangi bir yansı

source: Separately Installing I2P, its dependencies, and recommended external software on Windows 10(The Long Way)
fr: Installation Séparée I2P, ces dépendances et le réseau externe recommandé sur Windows 10 (La Version Longue)
id: Menginstal I2P, dependensinya, dan perangkat lunak eksternal yang direkomendasikan di Windows 10 secara terpisah (Cara Panjang)
ja: Windows 10 上で I2P と依存関係と推奨の外部ソフトウェアを個別にインストールする（長い道のり）
pt: Instalar separadamente o I2P, as suas dependências e o software externo recomendado no Windows 10 (o caminho longo)
tr: I2P, I2P bağımlılıkları ve Windows 10 için önerilen diğer uygulamaların ayrı ayrı kurulması (uzun yöntem)

source: This is the long way of installing I2P for Windows, using the IzPack based installer and a separate Java Virtual Machine installed on the host. If you're new to I2P, you may want to try the Beta installer, which requires fewer total steps and automatically configures a JVM, I2P, and sets up a Firefox Profile in a single step.
fr: C'est la version longue pour installer I2P sur Windows, en utilisant le programme d'installation basé sur IzPack et une Machine Virtuelle Java installée sur l'hôte. Si vous êtes nouveau sur I2P, vous pouvez avoir envie d'essayer le programme d'installation bêta qui requiert moins d'étapes et se configure automatiquement à JVM, I2P et met en place un profil Firefox en une seule étape.
id: Ini adalah jalan panjang untuk menginstal I2P untuk Windows, menggunakan installer berbasis IzPack dan mesin virtual Java terpisah yang diinstal pada host. Jika Anda baru mengenal I2P, Anda mungkin Ingin mencoba installer beta, yang membutuhkan lebih sedikit langkah dan secara otomatis mengonfigurasi JVM, I2p, dan mengatur profil Firefox dalam satu langkah.
ja: これはlzPack ベースのインストーラーと、ホスト上にインストールされた別のJava仮想マシン を使って Windows 用 I2P をインストールするまでの長い道のりです。I2P に詳しくなければ、 ベータ版のインストーラーを使ってみてはどうでしょう。必要なステップがほとんどなく、 自動的に JVM と I2P 、Firefox プロファイルを一つのステップで設定します。
pt: Este é o caminho mais longo para instalar o I2P para Windows, usando o instalador baseado no IzPack e uma Máquina Virtual Java separada instalada no hospedeiro. Se é novo no I2P, pode querer tentar o instalador Beta, que requer menos passos no total e configura automaticamente uma JVM, I2P, e configura um Perfil Firefox num único passo.
tr: Bu yöntem, IzPack tabanlı kurucuyu ve bilgisayarda kurulu ayrı bir Java sanal makinesini kullanarak Windows için I2P kurmanın uzun yoludur. I2P kullanmaya yeni başlıyorsanız, daha az işlem gerektiren ve tek adımda otomatik olarak bir JVM, I2P yapılandırması ve Firefox profili oluşturan Beta aşamasındaki kurucuyu denemek isteyebilirsiniz.

source: Follow this link to the beta installer
fr: Suivez ce lien vers le programme d'installation bêta
id: Ikuti tautan ini untuk mendapatkan installer beta
ja: このリンクからベータ版インストーラーを入手
pt: Siga esta hiperligação para o instalador beta
tr: Beta kurucusuna giden bu bağlantıyı izleyin

source: This is a detailed, step-by-step guide to installing and configuring I2P, including all dependencies and setting up a browser, on a new Windows 10 system. Many users will be able to skip steps if they already have Java 8 or Firefox installed.
fr: C'est un guide détaillé, étape par étape pour installer et configurer I2P, y compris toute les dépendances et mettre en place un navigateur sur un nouveau système Windows 10. Beaucoup d'utilisateurs seront capable de sauter des étapes si ils ont déjà Java 8 ou Firefox installé.
id: Ini adalah panduan langkah demi langkah yang terperinci untuk menginstal dan mengkonfigurasi I2P, termasuk semua dependensi dan pengaturan browser, pada sistem Windows 10. Banyak pengguna akan dapat melewati langkah-langkah jika mereka sudah memasang Java 8 atau Firefox.
ja: これは、新しい Windows 10 システムに I2P をインストールし、すべての依存関係を含めて設定し、 ブラウザを設定するための詳細なステップ・バイ・ステップのガイドです。 すでにJava 8やFirefoxがインストールされている場合は、多くのユーザーは ステップをスキップすることができます。
pl: Znajdziesz tutaj szczegółową instrukcję instalacji i konfiguracji I2P, wliczając w to instalację zależności i konfigurację przeglądarki na świeżym systemie Windows 10. Możesz pominąć niektóre etapy, jeżeli masz już zainstalowaną Javę 8 bądź Firefoksa.
pt: Este é um guia detalhado, passo a passo, para instalar e configurar o I2P, incluindo todas as dependências e configuração de um navegador, num novo sistema Windows 10. Muitos utilizadores poderão saltar etapas se já tiverem o Java 8 ou o Firefox instalados.
tr: Bu rehberde, yeni bir Windows 10 sisteminde tüm bağımlılıklar ve tarayıcı kurulumu ile birlikte I2P uygulamasını kurmak ve yapılandırmak için adım adım ayrıntılar bulunur. Java 8 ya da Firefox kurulu kullanıcılar bu adımları atlayabilir.

source: So what are we going to do here?
fr: Donc que faisons nous ici ?
id: Jadi apa yang akan kita lakukan di sini?
ja: すべきこと
pl: Więc co będziemy tutaj robić?
pt: Então, o que vamos fazer aqui?
tr: Yani burada ne yapacağız?

source: We're going to finish four tasks. We are going to:
fr: Nous allons finir quatre tâches. Nous allons :
id: Kami akan melakukan empat langkah. Kita akan:
ja: 4つのタスクを完了させます。その4つとは:
pl: Do zrobienia są cztery rzeczy, kolejno:
pt: Vamos terminar quatro tarefas. Nós vamos terminar:
tr: Dört görevi tamamlayacağız. Yapacaklarımız:

source: Install Java
de: Java installieren
es_ar: Instalar Java
fr: Installer Java
id: Pasang Java
ja: Javaのインストール
pl: Instalacja Javy
pt: Instalar Java
tr: Java kurulumu

source: Install I2P
fr: Installer I2P
id: Instal I2P
ja: I2Pのインストール
pl: Instalacja I2P
pt: Instalar I2P
tr: I2P kurulumu

source: Install a Better Browser(Firefox)
fr: Installer un Meilleur Navigateur (Firefox)
id: Instal browser yang lebih bagus (Firefox)
ja: ベターなブラウザをインストール(Firefox)
pl: Instalacja przeglądarki Firefox
pt: Instale um Navegador Melhor(Firefox)
tr: Daha iyi bir tarayıcı (Firefox) kurulumu

source: Configure I2P Bandwidth
fr: Configurer la bande passante I2P
id: Konfigurasi bandwidth I2P
ja: I2Pの帯域幅を設定
pl: Konfiguracja przepustowości I2P
pt: Configurar a banda; banda-larga; largura de banda do I2P
tr: I2P bant genişliğini ayarlama

source: Part One: Install Java
fr: Partie 1 : Installer Java
id: Bagian Satu: Instal Java
ja: パート1: Javaをインストール
pl: Krok pierwszy: instalacja Javy
pt: Parte Um: Instalar Java
tr: Birinci Bölüm: Java kurulumu

source: In order to use I2P, you will need a suitable Java environment. On Windows, users should probably choose Oracle's Java 8 implementation. Please install it by following the instructions below:
fr: Pour utiliser I2P, vous aurez besoin d'un environnement Java propice. Sur Windows, les utilisateurs devront probablement choisir une implémentation Java 8 de Oracle. Veuillez l'installer en suivant les instructions ci-dessous :
id: Untuk menggunakan I2P, Anda akan membutuhkan Java environment yang cocok. Di Windows, pengguna mungkin sebaiknya memilih Oracle Java 8 implementation. Harap instal dengan mengikuti instruksi di bawah ini:
ja: I2Pを使用するには、適切なJava環境が必要です。Windowsでは、ユーザーは おそらくOracleのJava 8実装を選択する必要があります。 以下の手順でインストールしてください。
pl: Aby korzystać z oprogramowania I2P niezbędne jest środowisko uruchomieniowe Java. Pod systemem Windows zaleca się instalację Javy 8 od Oracle. Podążaj za poniższymi wskazówkami:
pt: Para utilizar o I2P, é necessário um ambiente Java adequado. No Windows, os utilizadores devem provavelmente escolher a implementação Java 8 da Oracle. Instale-a seguindo as instruções abaixo:
tr: I2P uygulamasını kullanmak için uygun bir Java ortamına gerek duyacaksınız. Windows üzerindeki kullanıcılar büyük olasılıkla Oracle Java 8 uygulamasını seçmelidir. Aşağıdaki yönergeleri izleyerek kurabilirsiniz:

source: If you already have Java installed, you may
fr: Si vous avez déjà Java installé, vous pourrez
id: Jika Anda sudah menginstal Java, Anda dapat melakukannya
ja: すでにJavaをインストールしている場合、
pl: Jeżeli masz już zainstalowaną Javę, możesz
pt: Se você já tem Java instalado, você pode
tr: Java zaten kurulmuş ise şunu yapabilirsiniz

source: I2P requires Java to run, if you don't have Java installed, you will get an error that looks like this:
fr: I2P requiert Java pour s'exécuter, si vous n'avez pas Java installé, vous aurez un code d'erreur qui ressemble à ça :
id: I2P memerlukan Java. Jika Anda belum menginstal Java, Anda akan mendapatkan error seperti ini:
ja: I2Pの起動にはJavaが必要ですので、Javaをインストールしていない場合 は、このようなエラーが表示されます。
pl: I2P wymaga do działania Javy, jeżeli nie masz jej zainstalowanej, otrzymasz taki błąd:
pt: I2P requer Java para rodar, se você não tiver Java instalado, você receberá um erro que se parece com isto:
tr: I2P uygulamasının çalışabilmesi için Java gereklidir. Java kurulu değilse şuna benzer bir hata iletisi görürsünüz:

source: We appreciate that you have a wide range of choices in Java software, but the Oracle Java software is the easiest to install and use with I2P on Windows.
fr: Nous apprécions que vous avez beaucoup de choix de réseaux Java, mais le réseau Java d'Oracle est le plus simple à installer et utiliser avec I2P sur Windows.
id: Kami mengerti bahwa Anda memiliki banyak pilihan dalam perangkat lunak Java, tapi Oracle Java Software adalah yang paling mudah untuk diinstal dan digunakan dengan I2P di Windows.
ja: Javaソフトウェアの選択肢が幅広いことは承知していますが、Oracle JavaソフトウェアがWindows上でi2Pをインストールして使用する際には一番簡単な方法です。
pl: Doceniamy fakt, że jest dostępny szeroki wachlarz środowisk Java, ale Java od Oracle jest najłatwiejsza do instalacji i użytku z I2P pod systemem Windows.
pt: Sabemos que existe uma grande variedade de opções de software Java, mas o software Java da Oracle é o mais fácil de instalar e utilizar com o I2P no Windows.
tr: Java yazılımı için geniş bir seçenek yelpazesi bulunduğunu anlıyoruz. Ancak Oracle Java yazılımı Windows üzerinde kurulumu ve I2P ile kullanımı en kolay olanıdır.

source: Download it from
fr: Téléchargez le sur
id: Unduh dari
ja: ダウンロード:
pl: Pobierz plik z
pt: Baixar do
tr: Şuradan indirebilirsiniz

source: Double-click the Java Installer you just downloaded. Don't set a custom path, just use the default one.
fr: Cliquez deux fois sur le Programme d'installation Java que vous venez de télécharger. Ne créez pas un chemin customisé, utilisez celui par défaut.
id: Klik dua kali Java installer yang baru saja Anda unduh. Jangan instal di folder lain, instal hanya di folder default.
ja: ダウンロードしたJavaインストーラーをダブルクリックしてください。 カスタムパスは設定せず、デフォルトのものを使用してください。
pl: Dwukrotnie kliknij pobrany plik. Nie wybieraj własnego katalogu, pozostaw domyślne ustawienia.
pt: Faça duplo clique no Instalador de Java que acabou de descarregar. Não defina um caminho personalizado, apenas utilize o caminho predefinido.
tr: Yeni indirdiğiniz Java kurucuya çift tıklayın. Özel bir yol belirlemeyin, varsayılan yolu kullanın.

source: Java will show you some information about what it is and where it runs while you wait for it to finish installing.
fr: Java vous montrera quelques information sur sa fonction et où il s'exécute pendant que vous attendez qu'il finisse de s'installer.
id: Java akan menunjukkan kepada Anda beberapa informasi tentang apa itu Java dan di mana Java berjalan saat Anda menunggu sampai selesai menginstal.
ja: Javaは、インストール完了まで待っている間に、それがどういうものなのか、どこで動くのかについて情報を提示します。
pl: Instalator wyświetli trochę informacji czym jest Java, gdzie jest używana, itp., poczekaj aż instalacja się zakończy.
pt: O Java irá mostrar-lhe algumas informações sobre o que é e onde é executado enquanto espera que ele termine a instalação.
tr: Kurulumun bitmesini beklerken Java işlem ilerlemesi ve nerede çalıştığı hakkında bazı bilgiler görüntüler.

source: When you see this, Java is almost installed.
fr: Quand vous verrez ça, Java sera bientôt installé.
id: Ketika Anda melihat ini, Java hampir selesai terinstal.
ja: これが表示されたら、Javaのインストールはほとんどできています。
pl: Już prawie gotowe.
pt: Quando você vê isto, Java está quase instalado.
tr: Bunu gördüğünüzde Java kurulmuş sayılır.

source: Java is now installed!
fr: Java est désormais installé !
id: Java sudah selesai diinstal!
ja: Javaがインストールされました！
pl: Java została zainstalowana!
pt: Java está agora instalado!
tr: Java kuruldu!

source: Part Two: Install I2P
fr: Partie 2 : Installer I2P
id: Bagian Dua: Instal I2P
ja: パート２: I2Pをインストール
pl: Krok drugi: instalacja I2P
pt: Parte Dois: Instalar I2P
tr: İkinci Bölüm: I2P kurulumu

source: Download I2P from
fr: Téléchargez I2P sur
id: Unduh i2p dari
ja: I2Pをダウンロード:
pl: Pobierz I2P z
pt: Baixar o I2P de
tr: I2P uygulamasını şuradan indirin

source: 'I2P is available in many languages. Pick one that is familiar to you.'
fr: 'I2P est disponible en beaucoup de langues, choisissez en une qui vous est familière.'
id: 'I2P tersedia dalam banyak bahasa. Pilih salah satu yang Anda inginkan.'
ja: 「I2Pは様々な言語で利用可能です。親しみのあるものを選びましょう。」
pl: Wybierz język.
pt: 'I2P está disponível em vários idiomas. Escolha um que é familiar para você.'
tr: 'I2P birçok dilde kullanılabilir. Size uyan birini seçin.'

source: On the first screen, we introduce our software.
fr: Sur le premier écran, nous présentons notre réseau.
id: Di layar pertama, kami memperkenalkan perangkat lunak kami.
ja: 最初の画面では、我々のソフトウェアの紹介をします。
pl: Na pierwszym ekranie jest wprowadzenie.
pt: Na primeira tela, Nós introduzimos nosso software.
tr: İlk ekranda uygulamamızı tanıtacağız.

source: I2P is mostly public domain software, with permissive licenses and a small amount of GPL2'ed Free Software.
fr: I2P est principalement un réseau du domaine public avec des licences permissives et un petit taux de logiciel libre GPL2'ed.
id: I2P sebagian besar merupakan perangkat lunak domain publik, dengan lisensi permisif dan sejumlah kecil GPL2 Perangkat lunak bebas dan gratis.
ja: I2Pはほとんどパブリックドメインのソフトウェアですが、任意ライセンスもあり、わずかに GPL第二版のフリーソフトウェアが含まれます。
pl: Oprogramowanie I2P w większości należy do domeny publicznej, częściowo na wolnych licencjach i z niewielką porcją kodu na licencji GPLv2.
pt: I2P é principalmente software de domínio público, com licenças permissivas e uma pequena quantidade de software livre sob a licença GPL2.
tr: I2P çoğunlukla herkese açık bir yazılımdır, bazı izin alınmış lisanslar ve az miktarda GPL2 lisanslı bir özgür yazılımdır.

source: You should probably leave I2P installed at the default path, as it is easiest to work with this way.
fr: Vous devrez probablement garder I2P installé sur le chemin par défaut, vu qu'il est plus facile de fonctionner de cette manière.
id: Anda mungkin harus menginstal I2P di folder default, karena I2P paling mudah untuk bekerja dengan cara.
ja: たぶんデフォルトのパスでI2Pをインストールさせると、一番簡単にこのように動作させられます。
pl: Zaleca się instalację I2P w domyślnym katalogu, jest to najłatwiejszy sposób pracy.
pt: Provavelmente, deverá deixar o I2P instalado no caminho predefinido, uma vez que é mais fácil trabalhar com ele desta maneira.
tr: Bu şekilde çalışmak en kolay yol olduğu için muhtemelen I2P uygulamasını varsayılan yolda kurulu bırakmalısınız.

source: Don't bother running it as a Windows service for now, an easy-to-use shortcut will be added to the start menu for you to control I2P with.
fr: Ne perdez pas votre temps à l'exécuter en tant que service Windows pour l'instant, un raccourci facile d'utilisation sera ajouté au menu d'accueil pour que vous puissiez contrôler I2P avec.
id: Jangan repot-repot menjalankannya sebagai Windows service saat ini, shortcut yang mudah digunakan akan ditambahkan di Start Menu untuk mengontrol I2P.
ja: いまのところ、わざわざWindowsサービスとして起動しないでください。簡単に使えるショートカットがスタートメニューに追加され、I2Pをコントロールできます。
pl: Nie musisz uruchamiać I2P jako usługi systemowej, łatwy w użyciu skrót zostanie dodany do menu start, aby kontrolować I2P.
pt: Não se preocupe em executá-lo como um serviço do Windows por enquanto, um atalho fácil de usar será adicionado ao menu Iniciar para que possa controlar o I2P.
tr: Şimdilik bir Windows hizmeti olarak çalıştırmakla uğraşmayın. I2P uygulamasını denetlemeniz için başlangıç ​​menüsüne kullanımı kolay bir kısayol eklenecek.

source: I2P will copy it's files into the install location.
fr: I2P copiera ces fichiers dans l'emplacement d'installation.
id: I2P akan menyalin file-file ke lokasi instal.
ja: I2Pはファイルをインストール場所にコピーします。
pl: Pliki I2P zostaną skopiowane do docelowego katalogu.
pt: O I2P copiará seus ficheiros para o local de instalação.
tr: I2P dosyaları kurulum konumuna kopyalanacak.

source: I2P is now installed! You can start it using the "Start I2P" entries in your Start Menu and on your Desktop.
fr: I2P est maintenant installé ! Vous pouvez le démarrer en utilisant l'entrée "Start I2P" dans votre menu d'accueil sur votre bureau.
id: I2P sekarang terinstal! Anda dapat memulainya dengan menggunakan "Start I2P" di Start Menu Anda dan di desktop Anda.
ja: I2Pがインストールされました！スタートメニューの中とデスクトップ上にある「I2Pを始める」エントリを使って起動することができます。
pl: I2P zostało zainstalowane! Włącz je używając skrótu „Start I2P” w menu start lub na pulpicie.
pt: O I2P já está instalado! Pode iniciá-lo usando as entradas "Iniciar o I2P" no menu Iniciar e na área de trabalho.
tr: I2P kuruldu! Başlat Menünüzdeki ve Masaüstünüzdeki "I2P Başlat" simgelerini kullanarak başlatabilirsiniz.

source: Part Three: Install a Better Browser(Firefox or Tor Browser)
fr: Partie 3 : Installer un meilleur navigateur (Firefox ou Navigateur Tor)
id: Bagian Ketiga: Instal browser yang lebih bagus (Firefox atau Tor Browser)
ja: パート３：ベターなブラウザをインストール(FirefoxかTorブラウザ)
pl: Krok trzeci: instalacja przeglądarki Firefox (bądź Tor Browser)
pt: Parte Três: Instale um Navegador Melhor (Firefox ou o Navegador Tor)
tr: Üçüncü Bölüm: Daha iyi bir Tarayıcı (Firefox veya Tor Browser) kurulumu

source: If you already have either Firefox or Tor Browser installed, skip the first 2 steps.
fr: Si vous avez déjà Firefox ou Tor installé, sautez les 2 premières étapes.
id: Jika Anda sudah memasang Firefox atau Tor Browser, lewati 2 langkah pertama.
ja: すでにFirefoxかTorブラウザをインストール済みであれば、最初の2つのステップは飛ばしてください。
pl: Jeżeli masz już zainstalowaną przeglądarkę Firefox lub Tor Browser, pomiń dwa pierwsze kroki.
pt: Se você já tem Firefox ou o navegador Tor instalado, pule os 2 primeiros passos.
tr: Firefox veya Tor Browser zaten kurulu ise ilk iki adımı atlayabilirsiniz.

source: Unfortunately for Windows users, Microsoft Edge does not have proxy settings that are safe to use with I2P. The browser that is easiest to configure with I2P in a reasonably good way is Firefox(Although Chrome is possible, this procedure is only recommended for experts). I2P participants who want to browse I2P Sites can follow these steps to install and configure Firefox for I2P.
fr: Malheureusement pour les utilisateurs Windows, Microsoft Edge n'a pas de paramètres mandataires sécurisés pour être utiliser avec I2P. Le navigateur qui est le plus facile à configurer avec I2P de la bonne manière est Firefox (Chrome est aussi une option, cependant cette procédure n'est recommandée qu'aux experts). Les participants d'I2P qui veulent naviguer les sites I2P peuvent suivre ces étapes pour installer et configurer Firefox pour I2P.
id: Sayangnya untuk pengguna Windows, Microsoft Edge tidak memiliki pengaturan proxy yang aman digunakan dengan I2P. Browser yang paling mudah dikonfigurasi dengan I2P dengan cara yang cukup baik adalah Firefox (meskipun Chrome mungkin digunakan, prosedur ini hanya direkomendasikan untuk para ahli). Peserta I2P yang ingin menelusuri Situs I2P dapat mengikuti langkah-langkah berikut untuk menginstal dan konfigurasikan Firefox untuk I2P.
ja: 残念ながら、Windowsユーザーに対して、Microsoft EdgeにはI2Pで安全に使えるプロキシ設定がありません。中々良いやり方でI2Pで一番簡単に設定できるブラウザーはFirefoxです（Chromeが使えるのであれば、このやり方は玄人向けになります）。I2PをブラウズしたいI2Pの参加者はこれらのステップを追っていき、Firefox for I2Pをインストール・設定しましょう。
pl: Domyślna przeglądarka w systemach Windows – Microsoft Edge – niestety nie posiada ustawień proxy umożliwiających bezpieczne korzystanie z I2P. Najłatwiejszą przeglądarką do korzystania z I2P jest Firefox (możliwa jest również konfiguracja Google Chrome, ale jest to zalecane tylko dla zaawansowanych użytkowników). Poniżej znajduje się opis, co należy zrobić, aby móc przeglądać strony I2P za pomocą Firefoksa.
pt: Infelizmente para os utilizadores do Windows, o Microsoft Edge não tem definições de proxy que sejam seguras para utilizar com o I2P. O navegador que é mais fácil de configurar com o I2P de uma forma razoavelmente boa é o Firefox (embora o Chrome seja possível, este procedimento só é recomendado para especialistas). seja possível, este procedimento só é recomendado para especialistas). Os participantes da I2P que queiram navegar nos sítios da I2P podem seguir estes passos para instalar e configurar o Firefox para I2P.
tr: Ne yazık ki Windows kullanıcıları için, Microsoft Edge için I2P uygulamasınıb güvenli bir şekilde kullanılabileceği vekil sunucu ayarları yok. I2P ile en kolay şekilde Firefox tarayıcısı kullanılabilir (Chrome kullanılabilir ancak bu işlem yalnızca uzman kullanıcılar için önerilir). I2P sitelerine erişmek isteyen I2P katılımcıları, I2P için Firefox kurmak ve yapılandırmak için bu adımları izleyebilir.

source: If you already have Firefox installed, you may
fr: Si vous avez Firefox installé, vous pouvez
id: Jika Anda sudah menginstal Firefox, Anda dapat
ja: すでにFirefoxをインストールしている場合、
pl: Jeżeli masz już zainstalowanego Firefoksa, możesz
pt: Se já tem o Firefox instalado, pode
tr: Firefox zaten kuruluysa şunu yapabilirsiniz

source: Get Firefox from
fr: Obtenez Firefox de
id: mengambil Firefox dari
ja: Firefoxを入手:
pl: Pobierz przeglądarkę Firefox ze strony
pt: Obtenha o Firefox de
tr: Firefoz uygulamasını şuradan alın

source: Run the installer.
fr: Exécutez le programme d'installation
id: Jalankan installer.
ja: インストーラーを起動
pl: Uruchom instalator.
pt: Execute o instalador.
tr: Kurulum dosyasını çalıştırın.

source: Install the I2P Firefox Profile
fr: Installer le profil Firefox I2P
id: Instal profil Firefox I2P
ja: I2PのFirefoxプロファイルをインストール
pl: Instalacja profilu I2P Firefoxa
pt: Instale o Perfil I2P para Firefox
tr: I2P Firefox Profilini kurun
