Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/priority.po
Languages: de, es_ar, fr, id, ja, pl, pt, tr

source: Router console HTML/CSS design
de: Routerkonsole (HTML/CSS-Design)
es_ar: Diseño del HTML/CSS de la consola del ruter
fr: Design HTML/CSS de la console routeur
id: Desain HTML / CSS di router console
ja: ルーターコンソールの HTML/CSS の設計
pl: dizajn HTML/CSS konsoli węzła
pt: Design HTML/CSS do painel do roteador
tr: Yöneltici panosu HTML/CSS tasarımı

source: SAM maintainer
de: SAM-Betreuer
es_ar: Encargado de SAM
fr: Mainteneur SAM
id: Pengelola SAM
ja: SAM維持者
pl: programista mostka SAM
pt: Mantenedor do SAM
tr: SAM geliştirici

source: Translators
de: Übersetzer
es_ar: Traductores
fr: Traducteurs
id: Penerjemah
ja: 翻訳者
pl: tłumacze
pt: Tradutores
tr: Çevirmenler

source: many many people!
de: Sehr viele!
es_ar: ¡mucha mucha gente!
fr: beaucoup beaucoup de personnes !
id: Banyak banyak orang
ja: たくさんの、たくさんの、人たち！
pl: wiele osób!
pt: e muitas mais pessoas!
tr: pek çok kişi!

source: Contributors
de: Beitragende
es_ar: Contribuidores
fr: Contributeurs
id: Kontributor
ja: 貢献
pl: współtwórcy
pt: Colaboradores
tr: Katkıda bulunanlar

source: fire2pe dev, console enhancements
de: fire2pe Entwickler, Konsolen Verbesserungen
es_ar: Desarrollador de fire2pe, mejoras de la consola
fr: Fire2pe dev, améliorations console
id: Pengembangan fire2pe dev, penambahan fungsi console
ja: fire2pe開発、コンソール強化
pl: fire2pe, poprawki konsoli węzła
pt: desenvolvedor do fire2pe, melhorias no painel
tr: fire2pe geliştirme, pano geliştirmeleri

source: desktopgui, dijjer port
de: Dekstopgui, dijjer Port
es_ar: entorno de escritorio, puerto dijjer
fr: Interface graphique utilisateur, portage dijjer
pl: desktopgui, port dijjer
pt: GUI do computador, porta dijjer
tr: desktopgui, dijjer taşıma

source: Debian/Ubuntu Packager and PPA maintainer
de: Debian/Ubuntu Paketersteller und PPA Verwalter
es_ar: Encargado de los paquetes para Debian/Ubuntu y del PPA
fr: Intégrateur Debian/Ubuntu et mainteneur du PPA
ja: Debian/Ubuntu パッケージャーとPPA維持者
pl: tworzenie paczek Debiana/Ubuntu i zarządzanie PPA
pt: empacotador para Debian/Ubuntu e mantenedor de repositório PPA
tr: Debian/Ubuntu Paketleyici ve PPA sorumlusu

source: Routerconsole backend and UI work, website revamp, unit tests work
de: Arbeiten am Routerkonsolen-Backend und der Benutzerschnittstelle, Umgestaltung der Website, Erstellung von Unit-Tests
es_ar: Trabajos en la consola del ruter y el interfaz gráfico, mejora de la web, y trabajos en los unit tests
fr: Arrière-plan et travail sur l’UI de la console routeur, réorganisation du site Web, travail sur les tests d’unité
id: Router console backend dan pekerjaan UI, perombakan situs web, pekerjaan tes unit
ja: ルーターコンソールのバックエンドと UI の動作、ウェブサイトの改良、単体テストの実施
pl: back-end i interfejs konsoli węzła, reorganizacja strony, testy jednostkowe
pt: Backend do painel do roteador e trabalhos na interface com o usuário, retoques no website, trabalhos de testes de unidade
tr: Routerconsoleyönetim bölümü ve kullanıcı arayüzü işlemleri, sitenin yenilenmesi, birim denemeleri

source: Help needed on many fronts!
de: Hilfe wird überall gebraucht!
es_ar: Se necesita diversas formas de ayuda
fr: Aide nécessaire sur beaucoup de fronts !
id: Bantuan dibutuhkan di banyak bidang!
ja: 様々な方面からの支援が必要です！
pl: Potrzebujemy pomocy na wielu frontach!
pt: Precisa-se de ajuda em muitas frentes!
tr: Pek çok konuda yardım gerekiyor!

source: Past contributors
de: ehemalige Beitragende
es_ar: Participantes pasados
fr: Anciens contributeurs
id: Kontributor sebelumnya
ja: 過去の貢献者
pl: Poprzedni współtwórcy
pt: Colaboradores antigos
tr: Geçmişte katkıda bulunanlar

source: I2PTunnel development, ministreaming library
de: Entwicklung I2P Tunnel, Ministreaming Bibliothek
es_ar: Desarrollo de I2PTunnel, librería de ministreaming
fr: développement I2PTunnel, mini bibliothèque de flux
id: Pengembangan I2PTunnel, ministreaming library
ja: I2PTunnel の開発とミニストリーミングライブラリ
pl: rozwój „menadżera ukrytych usług”, biblioteka „ministreaming”
pt: Desenvolvimento do I2PTunnel, biblioteca de ministreaming
tr: I2PTunnel geliştirme, ministreaming kitaplığı

source: Project lead, Syndie lead
de: Projektleitung, Syndie-Leitentwickler
es_ar: Encargado del proyecto, encargado de Syndie
fr: Responsable du projet, responsable de Syndie
ja: プロジェクト指揮、Syndie指揮
pl: główny programista, rozwój Syndie
pt: principal responsável pelo Projeto e pelo Syndie
tr: Proje lideri, Syndie lideri

source: Project lead, Syndie lead, I2Phex, support guru
de: Projektleitung, Syndie-Leitentwickler, I2Phex, Support-Guru
es_ar: Encargado del proyecto, encargado de Syndie, I2Phex, soporte
fr: Responsable du projet, responsable de Syndie, I2Phex, gourou du support
ja: プロジェクトリード、Syndieリード、I2Phex、サポートグル
pl: główny programista, rozwój Syndie, I2Phex, pomoc użytkownikom
pt: principal responsável pelo Projeto e pelo Syndie, I2Phex, guru de suporte
tr: Proje lideri, Syndie lideri, I2Phex, destek gururu

source: iMule lead
de: iMule-Leitentwickler
es_ar: Encargado de IMule
fr: Responsable de iMule
ja: iMule lead指揮
pl: programista iMule
pt: principal responsável pelo iMule
tr: iMule lideri

source: I2Phex work
de: I2Phex-Arbeit
es_ar: Trabajo en I2Phex
fr: Travail I2Phex
ja: I2Phex
pl: rozwój I2Phex
pt: trabalho no I2Phex
tr: I2Phex çalışmaları

source: Python SAM library, attack simulations
de: Python SAM-Bibliothek, Angriffssimulationen
es_ar: librería SAM en Python, simulaciones de ataques
fr: Bibliothèque Python SAM, simulations d’attaques
ja: Python SAM ライブラリ、模擬攻撃実験
pl: biblioteka Pythona SAM, symulacje ataku
pt: Biblioteca SAM em Python, simulação de ataque
tr: Python SAM kitaplığı, saldırı benzetimleri

source: i2pmail development
de: i2pmail-Entwicklung
es_ar: Desarrollo de i2pmail
fr: Développement d’i2pmail
id: Pengembangan i2pmail
ja: i2pmail開発
pl: rozwój poczty I2P
pt: desenvolvimento de i2pmail
tr: i2pmail geliştirme

source: Syndie help
de: Syndie Hilfe
es_ar: Ayuda de Syndie
fr: Aide pour Syndie
ja: Syndie ヘルプ
pl: pomoc przy Syndie
pt: Ajuda de Syndie
tr: Syndie yardımı

source: i2p mail,susimail and susidns apps
de: I2P Mail, Susimail und SusiDNS apps
es_ar: Mail de i2p, susimail y aplicaciones susidns
fr: applis courriel i2p, susimail et susidns
ja: i2p mail、susimail及びsusidnsアプリ
pl: poczta I2P, aplikacje SusiMail i susidns
pt: email i2p, susimail e susidns
tr: i2p mail,susimail ve susidns uygulamaları

source: I2Phex (port of Phex to I2P)
de: I2Phex (Portierung von Phex nach I2P)
es_ar: I2Phex (versión de Phex para I2P)
fr: I2Phex (portage de Phex vers I2P)
id: I2Phex (port Phex ke I2P)
ja: I2Phex (PhexのI2Pへのポート)
pl: I2Phex (port Phex w I2P)
pt: I2Phex (transporte do Phex para a I2P)
tr: I2Phex (I2P üzerine Phex taşıma)

source: addressbook,i2p-bt,syndie client
de: Addressbuch, I2P-bt, syndie Client
es_ar: libreta de direcciones, i2p-bt,cliente syndie
fr: carnet d’adresses, i2p-bt, client Syndie
ja: アドレス帳、i2p-bt、syndieクライアント
pl: książka adresowa, i2p-bt, Syndie
pt: catálogo de endereços, i2p-bt, cliente Syndie
tr: addressbook,i2p-bt,syndie istemcisi

source: organize and develop the i2p-bt BitTorrent port
de: Organisation und Entwicklung des I2P-bt BitTorrent Ports
es_ar: organización y desarrollo de la versión de Bittorrent i2p-bt
fr: Organise et développe le portage BitTorrent i2p-bt
id: Mengatur dan mengembangkan port BitTorrent i2p-bt
ja: i2p-bt BitTorrent 移植の編成と開発
pl: organizacja i rozwój portu BitTorrent i2p-bt
pt: organiza e desenvolve o i2p-bt: transporte do BitTorrent para a I2P
tr: i2p-bt BitTorrent taşıması derleme ve geliştirme

source: addressbook, i2p-bt, syndie client development
de: Adressbuch, I2P-bt, Syndie Client Entwicklung
es_ar: libreta de direcciones, i2p-bt, y desarrollo del cliente de syndie
fr: Carnet d’adresses, i2p-bt, développement du client Syndie
id: Addressbook, i2p-bt, pengembangan syndie client
ja: アドレスブック, i2p-bt, syndie クライアント開発
pl: książka adresowa, i2p-bt, Syndie
pt: catálogo de endereços, i2p-bt, desenvolvimento do cliente para o Syndie
tr: addressbook, i2p-bt, syndie istemci geliştirme

source: encryption and signature routines, I2PIM
de: Verschlüsselungs- und Signierroutinen, I2PIM
es_ar: rutinas de cifrado y firma, I2P IM
fr: Routines de chiffrement et de signature, I2PIM
ja: 暗号化と署名のルーチン、I2PIM
pl: procedury szyfrowania i sygnatur, I2PIM
pt: criptografia e rotinas de assinatura, I2PIM
tr: şifreleme ve imzalama alt yazılımları, I2PIM

source: SAM jython code, work on stasher (DHT) and v2v (VoI2P)
de: SAM jython Code, Arbeit am Verteiler (DHT) und v2v (VoI2P)
es_ar: código jython de SAM, trabajo en stasher (DHT) y v2v (VoI2P)
fr: Code jython de SAM, travail sur stasher (DHT) et v2v (VoI2P)
id: SAM jython kode, bekerja pada stasher (DHT) dan v2v (VoI2P)
ja: SAM jython コード, stasher (DHT) および v2v (VoI2P)に関する働き
pl: kod SAM jython, rozwój stasher (DHT) i v2v (VoI2P)
pt: código jython do SAM, trabalho em stasher (DHT) e v2v (VoI2P)
tr: SAM jython kodu, stasher ("Dağıtılmış karma tablosu", DHT) v2v (VoI2P) çalışmaları

source: installer, systray, bogobot
es_ar: instalador, bandeja de sistema, bogobot
fr: installateur, zone de notification, bogobot
pl: instalator, zasobnik systemowy, bogobot
pt: instalador, ícone na bandeja do sistema, bogobot
tr: Kurucu, systray, bogobot

source: jbigi development, wiki migration, doc cleanup
de: jbigi-Entwicklung, Wiki-Migration, Doku aufräumen
es_ar: desarrollo de jbigi, migración de la wiki, limpieza de la documentación
fr: Développement jbigi, migration du wiki, nettoyage de la doc
id: pengembangan jbigi, migrasi wiki, pembersihan doc
ja: jbigi 開発, wiki 移転, ドキュメントの整理
pl: rozwój jbigi, migracja wiki, uporządkowanie dokumentacji
pt: desenvolvimento da jbigi, migração do wiki, apuração da documentação
tr: jbigi geliştirme, wiki aktarımı, belge temizliği

source: java debugging and client development on I2PTunnel and the router console
de: Java-Debugging und Client-Entwicklung bei I2PTunnel und der Routerkonsole
es_ar: depuración de java y desarrollo del cliente en I2PTunnel y en la consola del ruter
fr: Débogage java debugging et développement de client sur I2PTunnel et la console du routeur
id: Debugging java dan pengembangan client di I2PTunnel dan router console
ja: I2PTunnelとルーターコンソールに関する java デバッグとクライアント開発
pl: java-odpluskwianie i rozwój klienta I2PTunnel i konsoli węzła
pt: resolução de problomas do java e desenvolvimento do cliente no I2PTunnel e no painel do roteador
tr: I2PTunnel ve yöneltici panosu java hata ayıklama ve istemci geliştirme

source: SAM perl module
de: SAM Perl Modul
es_ar: Módulo perl de SAM
fr: Module perl de SAM
ja: SAM perl モジュール
pl: moduł perl SAM
pt: módulo perl do SAM
tr: SAM perl modülü

source: i2psnark work
de: I2PSnark Arbeiten
es_ar: trabajo en i2psnark
fr: travail sur i2psnark
ja: i2psnark
pl: rozwój i2psnark
pt: trabalho no i2psnark
tr: i2psnark çalışması

source: java cleanup
de: Javacode aufräumen
es_ar: limpieza de java
fr: Nettoyage Java
ja: java クリーンナップ
pl: java-oczyszczanie
pt: apuração java
tr: java temizliği

source: docs. wiki migration
de: Dokumentation. Wiki Migration
es_ar: documentos, migración de la wiki
fr: migration du wiki docs.
id: dokumen. migrasi wiki
ja: docs. wiki 移転
pl: dokumentacja i migracja wiki
pt: documentos. migração de wiki
tr: belgeler. wiki aktarımları

source: translations into French
de: Übersetzungen ins Französische
es_ar: traducción al francés
fr: traductions en français
id: penerjemahan ke bahasa Perancis
ja: フランス語翻訳
pl: tłumaczenie na francuski
pt: traduções para francês
tr: Fransızca çevirisi

source: C port of jcpuid
de: C-Portierung von jcpuid
es_ar: port en C de jcpuid
fr: Portage en C de jcpuid
id: C port untuk jcpuid
ja: jcpuidのC移植
pl: port C biblioteki jcpuid
pt: Porta C de jcpuid
tr: jcpuid C taşıma

source: C# SAM library, pants, fortuna integration
de: C# SAM Bibliotheken, Pants, Fortuna Integration
es_ar: librería C# de SAM, integración de fortuna
fr: Bibliothèque SAM C#, pants, fortuna integration
ja: C# SAM ライブラリ、パンツ、フォルトゥナの統合
pl: biblioteka C# SAM, pants, integracja algorytmu Fortuna
pt: Biblioteca C# do SAM, integração do fortuna
tr: C# SAM kitaplığı, pants, fortuna bütünleştirmesi

source: i2p-bt tracker development
de: I2P-BT Tracker Entwicklung
es_ar: desarrollo del tracker i2p-bt
fr: Développement du traqueur bt-i2p
id: pengembangan tracker i2p-bt
ja: i2p-bt トラッカーの開発
pl: rozwój trackera i2p-bt
pt: desenvolvimento do rastreador i2p-bt
tr: i2p-bt izleyici geliştirme

source: Console and website themes
de: Konsolen- und Webseiten-Themes
es_ar: Temas de la consola y la web
fr: Thèmes console et site Web
ja: コンソールとウェブサイトのテーマ
pl: skórki strony internetowej i konsoli
pt: Consola e temas do site da Web
tr: Pano ve site temaları

source: &hellip; and many others
de: &hellip; und viele andere
es_ar: &hellip; y muchas otros
fr: &hellip; et de nombreux autres
id: &hellip; dan banyak lagi
ja: その他大勢の人々
pl: …i wielu innych
pt: e muitos outros
tr: &hellip; ve pek çok diğer şey

source: Inclusion
es_ar: Inclusión
id: Inklusi
ja: インクルージョン
pt: Inclusão
tr: Kapsayıcılık

source: I2P welcomes all kinds of people, as long as they are friendly and helpful to each other.<br> We disgrace hate, anger, racism, and bad speaking towards anyone.<br> We do support LBGT, suppressed minorites and other people, wether they need help in kind of our I2P software or not.<br> We work together to build a free world without hate, racism and violence.<br> The I2P router software was created in this spirit and should be used to help repressed people to regain their freedom of speech, while not suppressing others.
es_ar: I2P da la bienvenida a todo tipo de personas, siempre y cuando sean amables y se ayuden mutuamente.<br> Rechazamos el odio, la ira, el racismo y las malas palabras hacia cualquier persona.<br> Apoyamos a los LBGT, a las minorías oprimidas y a otras personas, tanto si necesitan ayuda como si no.<br> Trabajamos juntos para construir un mundo libre sin odio, racismo ni violencia.<br> El software del router I2P se creó con este espíritu y debe utilizarse para ayudar a las personas reprimidas a recuperar su libertad de expresión, sin reprimir a los demás.
fr: I2P accueille tout le monde, tant qu'ils sont amicaux et s'aide les uns les autres.<br> Nous n'acceptons aucune haine, racisme et mauvaises paroles contre qui que ce soit.<br> Nous soutenons les LGBT, les minorités et d'autres, qu'ils ait besoin de notre aide pour le logiciel I2P ou non.<br> Nous travaillons ensemble pour construire un monde libre sans haine, racisme ou violence.<br> Le logiciel routeur d'I2P a été crée dans ce but et doit être utilisé pour aider les gens réprimés à regagner leur liberté d'expression, tout en n'en étouffant pas d'autres.
id: I2P menerima semua orang, selama mereka ramah dan membantu satu sama lain.<br> Kami tidak menyukai kebencian, kemarahan, rasisme, dan perkataan buruk terhadap siapa pun.<br> Kami mendukung LBGT, kaum minoritas yang tertindas, dan orang lain, baik mereka memerlukan bantuan dalam bentuk perangkat lunak I2P kami atau tidak.<br> Kami bekerja sama untuk membangun dunia bebas tanpa kebencian, rasisme, dan kekerasan.<br> Perangkat lunak router I2P dibuat dengan semangat ini dan harus digunakan untuk membantu orang-orang yang tertindas mendapatkan kembali kebebasan berbicara mereka, tanpa menindas orang lain.
ja: I2Pは他者と友好的に助け合う限り、あらゆる人々を歓迎しております。<br> 憎悪や怒り、人種差別、他者の罵倒に反対します。<br> I2Pソフトウェアの助けを必要としているにせよ、そうでないにせよ、LGBTや抑圧されたマイノリティなどの人々を支持します。<br> 憎しみや人種差別、暴力のない自由な世界を築こうとともに取り組みます。<br> I2Pルーターソフトウェアはこの精神の下作られ、他者を抑圧するのではなく、抑圧された人々が言論の自由を取り戻す助けになるべきです。
pl: I2P wita wszystkich ludzi, tak długo jak są oni przyjaźni i pomocni dla siebie nawzajem.<br> Potępiamy nienawiść, gniew, rasizm i złą mowę wobec kogokolwiek.<br> Wspieramy LGBT, prześladowane mniejszości i innych ludzi, niezależnie od tego, czy potrzebują pomocy w postaci naszego oprogramowania I2P czy też nie.<br> Pracujemy razem, aby zbudować wolny świat bez nienawiści, rasizmu i przemocy.<br> Oprogramowanie routera I2P powstało w tym duchu i powinno być używane, żeby pomóc represjonowanym ludziom odzyskać wolność słowa, jednocześnie nie tłamsząc innych.
pt: O I2P acolhe todo o tipo de pessoas, desde que sejam simpáticas e prestáveis umas com as outras.<br> Desprezamos o ódio, a raiva, o racismo e o falar mal de quem quer que seja.<br> Apoiamos os LBGT, as minorias reprimidas e outras pessoas, quer necessitem ou não de ajuda através do nosso software I2P.<br> Trabalhamos em conjunto para construir um mundo livre, sem ódio, racismo e violência.<br> O software de encaminhamento I2P foi criado com este espírito e deve ser utilizado para ajudar as pessoas reprimidas a recuperar a sua liberdade de expressão, sem reprimir os outros.
tr: I2P, birbirlerine dost ve yardımcı oldukları sürece her türden insanı kabul eder.<br> Nefret, öfke, ırkçılık ve herhangi birine yönelik kötü konuşmayı ortaya dökeriz.<br> LBGT, bastırılmış azınlık ve diğer insanları, I2P uygulamamızın yardımına gerek duysunlar ya da duymasınlar destekliyoruz.<br> Nefret, ırkçılık ve şiddetin olmadığı özgür bir dünya kurmak için birlikte çalışıyoruz.<br> I2P yöneltici yazılımı bu ruhla oluşturuldu ve kimseye baskı uygulamadan, baskı altındaki insanların konuşma özgürlüklerini yeniden kazanmalarına yardımcı olmak için kullanılmalıdır.

source: Frequently Asked Questions
de: Häufig gestellte Fragen (FAQ)
es_ar: Preguntas Frecuentes
fr: Foire aux questions
ja: よくある質問 (FAQ)
pl: Częste pytania
pt: Perguntas Mais Frequentes
tr: Sık Sorulan Sorular

source: I2P Router Help
de: Hilfe zum I2P-Router
es_ar: Ayuda del router I2P
fr: Aide du routeur I2P
id: Bantuan untuk Router i2p
ja: I2P ルーターヘルプ
pl: Pomoc węzła I2P
pt: Ajuda do Roteador do I2P
tr: I2P Yöneltici Yardımı

source: What systems will I2P run on?
de: Auf welchen Systemen wird I2P laufen?
es_ar: ¿Sobre qué sistemas funcionará I2P?
fr: Sur quels systèmes I2P peut-il fonctionner ?
id: Sistem apa I2P akan dijalankan?
ja: I2P はどんなシステムで動作しますか？
pl: Na jakich systemach I2P będzie działać?
pt: Em que sistemas é que o I2P funciona?
tr: I2P hangi sistemler üzerinde çalışır?

source: Is installing Java required to use I2P?
de: Ist die Installation von Java erforderlich, um I2P verwenden zu können?
es_ar: ¿Se requiere instalar Java para usar I2P?
fr: Est-il exigé d’installer Java pour utiliser I2P ?
id: Apakah menginstal Java yang diperlukan untuk menggunakan I2P?
ja: I2Pを使用するためにJavaをインストールする必要はありますか？
pl: Czy instalacja Javy jest wymagana aby korzystać z I2P?
pt: A instalação do Java é necessária para usar a I2P?
tr: I2P kullanabilmek için Java kurmak gerekli midir?

source: What is an "I2P Site" and how do I configure my browser so I can use them?
es_ar: ¿Qué es un "Sitio I2P" y cómo configuro mi navegador para poder utilizarlos?
fr: Qu'est ce qu'un "Site I2P" et comment configurer mon navigateur pour que je puisse les utiliser ?
id: Apa itu "Situs I2P" dan bagaimana cara mengkonfigurasi browser saya sehingga saya dapat menggunakannya?
ja: "I2Pサイト"とは何か、またそれを利用するためのブラウザの設定方法は？
pl: Czym są strony .i2p i jak mam skonfigurować swoją przeglądarkę, aby móc je przeglądać?
pt: O que é um "Site I2P" e como configuro meu navegador para poder usá-los?
tr: "I2P sitesi" nedir ve erişmek için tarayıcımı nasıl yapılandırabilirim?

source: What do the Active x/y numbers mean in the router console?
de: Was bedeuten die Active x/y Nummern in der Router Konsole?
es_ar: ¿Qué significan los números activos x/y en la consola del router?
fr: Qu’est-ce que les nombres « Actifs x/y » signifient dans la console du routeur ?
id: Apakah arti dari Active x/y numbers di router console?
ja: ルーターコンソールにおいて、アクティブ x/y の数値は何を意味しているのですか？
pl: Co oznacza pole „aktywni: X/Y” w konsoli węzła?
pt: O que quer dizer os números "x/y Ativos" no painel do roteador?
tr: Yöneltici panosundaki etkin x/y sayılarının anlamı nedir?

source: My router has very few active peers, is this OK?
de: Mein Router hat sehr wenige aktive Peers, ist das OK?
es_ar: Mi router tiene muy pocos pares ('peers') activos, ¿está bien esto?
fr: Mon routeur a très peu de pairs actifs, est-ce normal ?
id: Router memiliki peer aktif yang sangat sedikit, apakah ini OK?
ja: 自分のルーターにはほとんどアクティブなピアがありませんが、これは大丈夫ですか？
pl: Mój węzeł ma bardzo mało aktywnych uczestników, czy to jest OK?
pt: Meu roteador tem poucos peers ativos, isso está certo?
tr: Yönelticimde çok az etkin eş var. Bu bir sorun mu?

source: I am opposed to certain types of content. How do I keep from distributing, storing, or accessing them?
de: Ihnen sind manche Inhalte äusserst zuwider. Wie können Sie verhindern, das Sie diese verteilen, speichern oder abfrufen?
es_ar: Estoy en contra de ciertos tipos de contenido. ¿Cómo evito almacenarlos, distribuirlos o acceder a ellos?
fr: Je m’oppose à certains types de contenus. Comment puis-je éviter d’en distribuer, d’en stocker ou d’y accéder ?
id: Saya menentang konten jenis tertentu. Bagaimana cara untuk tidak mendistribusikan, menyimpan atau mengakses mereka?
ja: 特定の種類のコンテンツに反対しています。これらを配布したり、保存したり、アクセスしないようにするには？
pl: Mam uprzedzenia do pewnych treści. Jak mogę się ustrzec przed rozsyłaniem, przechowywaniem i oglądaniem ich?
pt: Eu me oponho a certos tipos de conteúdo. Como posso evitar de distribuir, armazenar ou acessar esses conteúdos?
tr: Belirli türde içeriklere karşıyım. Bu türde içeriklerin dağıtılmasına, depolanmasına ya da erişilmesine nasıl engel olabilirim?

source: Is it possible to block I2P?
es_ar: ¿Es posible bloquear I2P?
fr: Peut on bloquer I2P ?
id: Apakah mungkin untuk memblokir I2P?
ja: I2Pをブロックすることは可能ですか？
pl: Czy można zablokować I2P?
pt: É possível bloquear I2P?
tr: I2P engellenebilir mi?

source: In <code>wrapper.log</code> I see an error stating <code>Protocol family unavailable</code> when I2P is loading
de: Im <code>wrapper.log</code> sehen Sie einen Fehler <code>Protokoll Familie nicht verfügbar</code> beim Start von I2P
es_ar: En <code>wrapper.log</code> (registro del encasulador como servicio para Java) veo un error indicando <code>Protocol family unavailable</code> (familia de protocolos no disponible) ocurrido cuando I2P estaba cargandose.
fr: Dans <code>wrapper.log</code>, je vois une erreur qui indique « <code>Famille de protocoles non disponible</code> » lors du chargement d’I2P
id: <code>wrapper.log</code> saya melihat pesan error: <code>Protocol family unavailable</code> ketika I2P sedang loading
ja: <code>wrapper.log</code> に、I2Pがロード中の時の <code>Protocol family unavailable</code> というエラーがありました。
pl: W <code>wrapper.log</code> zauważyłem błąd <code>Protocol family unavailable</code> podczas uruchamiania I2P
pt: Em <code>wrapper.log</code> eu vejo um erro onde diz <code>Protocol family unavailable</code> quando o I2P está carregando
tr: I2P yüklenirken <code>wrapper.log</code> içinde <code>İletişim kuralı ailesi kullanılamıyor</code> şeklinde bir hata görüyorum

source: Most of the I2P Sites within I2P are down?
es_ar: ¿La mayoría de los sitios de I2P no funcionan?
fr: La plupart des sites I2P dans I2P sont arrêtés ?
id: Sebagian besar situs I2P di dalam I2P tidak aktif?
ja: I2P 内の I2P サイトのほとんどはダウンしていますか？
pl: Czy większość stron .i2p w sieci I2P jest martwa?
pt: A maioria dos sites I2P dentro do I2P estão fora do ar?
tr: I2P içindeki I2P Sitelerinin çoğu çalışmıyor?

source: Why is I2P listening for connections on port 32000?
de: Warum lauscht I2P auf Port 32000 für Verbindungen?
es_ar: ¿Por qué I2P tiene abierto el puerto 32000 escuchando conexiones?
fr: Pourquoi I2P écoute-t-il les connexions sur le port 32000 ?
id: Mengapa I2P listening untuk koneksi pada port 32000?
ja: I2P がポート32000番で接続をリッスンしているのは何故ですか？
pl: Dlaczego I2P nasłuchuje połączeń na porcie 32000?
pt: Por que o I2P está aguardando conexões na porta 32000?
tr: I2P neden 32000 numaralı bağlantı noktasını dinliyor?
