Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/research.po
Languages: id, pt, ru, tr

source: As stated above in the researcher notes, please <a href="%(contact)s">contact us</a> before you commence your testing. While we do not discourage researchers from responsibly testing their ideas on the live network, if an attack becomes apparent and we don't have any line of communication then we will end up taking countermeasures which could interfere with the test.
id: Sebagaimana dinyatakan di atas dalam catatan peneliti, silakan <a href="%(contact)s">menghubungi kami</a> sebelum Anda memulai pengujian. Walau kami tidak mencegah peneliti secara bertanggung jawab menguji idenya langsung pada jaringan, jika sebuah serangan terjadi dan kami kita tidak memiliki jalur komunikasi maka kami akan mengambil langkah penanggulangan yang dapat mengganggu pengujian.
ru: Как указано выше, в замечаниях исследователям, пожалуйста, <a href="%(contact)s">свяжитесь с нами</a> до начала тестирования. Хотя мы не препятствуем исследователям ответственно тестировать свои идеи в живой сети, но если атака становится очевидной, и у нас нет никакой линии связи, то мы в конечном итоге будем принимать контрмеры, которые могут помешать тесту.
tr: Yukarıdaki araştırmacı notlarında belirtildiği gibi, lütfen testinizi başlatmadan önce <a href="%(contact)s">bizimle görüşün</a>. Araştırmacıları, fikirlerini canlı ağda sorumlu bir şekilde test etmekten caydırmıyoruz. Ancak bir saldırı ortaya çıkarsa ve bu konuda herhangi bir bilgimiz yoksa, saldırıya karşı alacağımız karşı önlemler testinizi engelleyebilir.

source: Router Family Configuration
pt: Configuração da Família do Roteador
ru: Конфигурация семейства роутеров
tr: Yöneltici Ailesi Yapılandırması

source: As of release 0.9.25, I2P supports a router family configuration. This provides researchers who run multiple routers with the means to publicly identify those routers. In turn, this helps the I2P project understand that these routers are not running an attack on the network. It also will prevent other routers from including multiple routers of the family in a single tunnel, which could lead to deanonymization. Routers that appear to be colluding but do not have a declared family may be assumed to be an attack on the network, and may be blocked. The best way to ensure the success of your research project is to work with us directly.
id: Pada rilis 0.9.25, I2P mendukung konfigurasi router family. Ini menyediakan peneliti yang menjalankan beberapa router dengan sarana untuk mengenali router tersebut secara publik. Pada akhirnya, ini membantu proyek I2P memahami bahwa router ini tidak menyerang jaringan. Ini juga akan mencegah router lain menyertakan beberapa router familyi di satu tunnel, yang dapat menyebabkan deanonymization. Router yang tampaknya berkolusi tapi tidak memiliki familiy yang dinyatakan dapat dianggap sebagai serangan terhadap jaringan dan mungkin diblokir. Cara terbaik untuk memastikan keberhasilan proyek penelitian Anda adalah bekerja sama langsung dengan kami.
ru: Начиная с выпуска 0.9.25, I2P поддерживает конфигурацию семейства маршрутизаторов. Это предоставляет исследователям, которые запускают multiple роутеры, средства публично идентифицировать эти роутеры. В свою очередь, это помогает проекту I2P понять, что эти маршрутизаторы не атакуют сеть. Это также поможет другим роутерам избежать включения multiple роутеров семьи в единый туннель, что может привести к деанонимизации. Маршрутизаторы, которые объединяются, но не имеют объявленного семейства, могут считаться атакующими и могут быть заблокированы. Лучший способ обеспечить успех вашего исследовательского проекта - работать с нами напрямую.
tr: 0.9.25 sürümünden başlayarak, I2P bir yöneltici ailesi yapılandırmasını destekliyor. Bu özellik, birden fazla yöneltici çalıştıran araştırmacıların, bu yönelticileri herkese açık bir şekilde tanımlayabilmesini sağlar. Bu da I2P projesinin, bu yönelticilerin ağda bir saldırı yapmadığını anlamasına yardımcı olur. Ayrıca, diğer yönelticilerin tek bir tünele ailenin birden çok yönelticisini katması nedeniyle anonimliğin bozulması olasılığını engeller. Bir arada gibi görünen, ancak bildirilmiş bir ailesi olmayan yönelticiler ağa yönelik bir saldırı olarak kabul edilebilir ve engellenebilir. Araştırma projenizin başarılı olmasını sağlamanın en iyi yolu doğrudan bizimle çalışmanızdır.

source: A router family shares a private key so that participation in the family cannot be spoofed. To configure a router family, click on the 'I2P Internals' link in the router console, and then on the 'Family' tab. Follow the instructions there to generate the private key for the first router in the family. Then, export the key from that router, and import it to other members of the family.
id: Sebuah router familiy berbagi private key sehingga partisipasi dalam sebuah familiy tidak bisa dipalsukan. Untuk mengkonfigurasi router familiy, klik tautan 'I2P Internals' di router console, lalu pada tab 'Family'. Ikuti instruksi di sana untuk menghasilkan private key untuk router pertama dalam familiy. Kemudian, ekspor private key dari router itu, lalu impor ke anggota familiy lainnya.
ru: Семейство маршрутизаторов совместно использует закрытый ключ, так что участие в семействе не может быть подделано. Чтобы настроить семейство маршрутизаторов, щелкните ссылку "Настройки I2P" в консоли маршрутизатора, а затем на вкладке "Семейство роутеров". Следуйте инструкциям, чтобы сгенерировать закрытый ключ для первого маршрутизатора в семействе. Затем экспортируйте ключ из этого маршрутизатора и импортируйте его другим членам семейства.
tr: Bir yöneltici ailesi özel bir anahtarı paylaşır. Böylece aileye sahte katılımlar engellenir. Bir yöneltici ailesi yapılandırmak için, yöneltici panosundaki 'I2P Bilgileri' bağlantısına ve 'Aile' sekmesine tıklayın. Ailedeki ilk yönelticinin özel anahtarını oluşturmak için yönergeleri izleyin. Ardından bu yönelticinin anahtarını dışa aktardıktan sonra ailenin diğer üyelerinde içe aktarın.

source: Open research questions
id: Pertanyaan penelitian terbuka
pt: Abrir perguntas de investigação
ru: Вопросы, открытые для исследования
tr: Açık araştırma konuları

source: Network database
id: Database jaringan
pt: Base de dados da Rede
ru: Сетевая база данных
tr: Ağ veri tabanı

source: Floodfills
pt: Inundações
ru: Floodfill-роутеры
tr: Otomatik doldurmalar

source: Transports
id: Transport
pt: Transportes
ru: Транспорты
tr: Taşıyıcılar

source: Tunnels and Destinations
id: Saluran dan Tujuan
pt: Túneis e Destinos
ru: Туннели и Назначения
tr: Tüneller ve Hedefler

source: Peer selection
id: Pemilihan Peer
pt: Seleção de par
ru: Выбор узлов
tr: Eş seçimi

source: Unidirectional tunnels
id: Saluran searah
pt: Túneis unidireccionais
ru: Однонаправленные туннели
tr: Yönsüz tüneller

source: Multihoming
ru: Множественная адресация
tr: Çoklu ev

source: Message routing
id: Routing pesan
pt: Encaminhamento de mensagem
ru: Маршрутизация сообщений
tr: İleti yöneltme

source: Anonymity
id: Anonimitas
pt: Anonimato
ru: Анонимность
tr: Anonimlik

source: Network Related
id: Terkait Jaringan
pt: Relacionado com Rede
ru: Связанное с сетью
tr: Ağ ile ilgili

source: Vulnerability Response Process
pt: Processo de Resposta de Vulnerabilidade
ru: Процесс сообщения об уязвимости
tr: Güvenlik Açığı Müdahale Süreci

source: This process is subject to change. Please refer to this page for the current VRP.
id: Proses ini bisa berubah. Silakan lihat halaman ini untuk VRP terkini.
pt: Este processo está sujeito a alterações. Consulte esta página para obter o VRP atual.
ru: Этот процесс может быть изменен. Пожалуйста, обратитесь к этой странице для текущего VRP.
tr: Bu süreç değişebilir. Geçerli süreç için lütfen bu sayfaya bakın.

source: This page was last updated in June 2020.
id: Halaman ini terakhir diperbarui pada Juni 2020.
pt: Esta página foi atualizada pela última vez em junho de 2020.
tr: Bu sayfa Haziran 2020 tarihinde güncellenmiştir.

source: Researchers: while you research/hack, we ask that you refrain from the following: - Performing active exploits or Denial of Service attacks on the i2p network - Performing social engineering on i2p development team members - Performing any physical or electronic attempts against i2p property and/or data centers
id: Peneliti: saat Anda meneliti/meretas, kami meminta Anda untuk menahan diri dari hal-hal berikut: - Melakukan eksploitasi aktif atau serangan Denial of Service pada jaringan i2p - Melakukan rekayasa sosial pada anggota tim pengembangan i2p - Melakukan segala upaya fisik atau elektronik terhadap properti dan/atau pusat data i2p
pt: Pesquisadores: enquanto você pesquisa/hackeia, pedimos que você se abstenha do seguinte: - Realizar explorações ativas ou ataques de negação de serviço na redei2p - Realizar engenharia social em membros da equipe de desenvolvimento i2p - Realizar quaisquer tentativas físicas ou eletrônicas contra propriedades e/ou datacenters da i2p
tr: Araştırmacılar: Araştırma ya da hack çalışmalarınızda şunlardan kaçınmanızı rica ediyoruz: - I2P ağında Etkin açıkları kullanmak veya Hizmet Reddi saldırıları gerçekleştirmek - I2P geliştirme ekibinin üyeleri üzerinde sosyal mühendislik yapmak - I2P mülklerine ve/veya veri merkezlerine karşı herhangi bir fiziksel veya elektronik girişimde bulunmak

source: As i2p is an open-source community, many volunteers and development team members run their own I2P Sites as well as public (“non-private internet”) domains. These sites/servers are NOT in the scope of the vulnerability assessment / response process, only the underlying code of i2p is.
id: Karena i2p adalah komunitas open source, banyak sukarelawan dan anggota tim pengembangan yang menjalankan Situs I2P mereka sendiri serta domain publik (“internet non-pribadi”). Situs /server ini tidak berada dalam ruang lingkup proses penilaian / respons kerentanan, hanya source code I2P yang masuk ke dalam lingkupnya.
pt: Como o i2p é uma comunidade de código aberto, muitos voluntários e membros da equipe de desenvolvimento administram seus próprios sites I2P, bem como domínios públicos ("internet não privada"). Essessites/servidores NÃO estão no escopo do processo de avaliação/resposta de vulnerabilidade, apenas o código subjacente do i2p está.
tr: I2P bir açık kaynak topluluğu olduğundan, birçok gönüllü ve geliştirme ekibi üyeleri kendilerine ait herkese açık ("özel olmayan İnternet") etki alanlarının yanında I2P Siteleri de işletmektedir. Bu siteler ya da sunucular, güvenlik açığı değerlendirme ve yanıtlama süreci kapsamında DEĞİLDİR, yalnızca temel I2P kodu bu kapsamdadır.

source: Point of Contact for Security Issues
pt: Ponto de contato para questões de segurança
ru: Контакты по вопросам безопасности
tr: Güvenlik Konuları için İletişim Noktası

source: Security Response Team
pt: Equipe de resposta de segurança
ru: Группа, ответственная за безопасность
tr: Güvenlik Müdahale Ekibi

source: Echelon is the trusted security point-of-contact. He forwards e-mails to team members as appropriate.
id: Echelon adalah titik kontak keamanan tepercaya. Beliau meneruskan email ke anggota tim sebagaimana mestinya.
pt: O Echelon é o ponto de contato de segurança confiável. Ele encaminha e-mails para os membros da equipe conforme apropriado.
tr: Echelon, güvenilir bir güvenlik iletişim noktasıdır. E-postaları uygun şekilde ekip üyelerine yönlendirir.

source: Incident Response
pt: Resposta a incidentes
ru: Ответственные по чрезвычайным ситуациям
tr: Olay Müdahalesi

source: Researcher submits report via:
id: Peneliti mengirimkan laporan melalui:
pt: O pesquisador envia o relatório por meio de:
tr: Araştırmacı bildirimini şuradan gönderir:

source: Response Team designates a Response Manager who is in charge of the particular report based on availability and/or knowledge-set.
id: Response Team menunjuk Response Manager yang bertanggung jawab atas laporan tertentu berdasarkan ketersediaan dan/atau knowledge-set.
pt: A Equipe de Resposta designa um Gerente de Resposta que é responsável pelo relatório específicocom base na disponibilidade e/ou no conjunto de conhecimentos.
ru: Ответственная группа назначает менеджера по ответам, отвечающего за конкретный ответ, на основе доступности и/или набора знаний.
tr: Müdahale Ekibi, uygunluğa ve/veya bilgi kümesine göre bildirimden sorumlu bir Müdahale Sorumlusu belirler.

source: In no more than %(limit)s working days, Response Team should respond to researcher using only encrypted methods.
id: Tidak lebih dari %(limit)s hari kerja, Response Team harus dengan penuh rasa terima kasih menanggapi peneliti dengan hanya menggunakan metode terenkripsi.
tr: Müdahale Ekibi en fazla %(limit)s iş günü içinde, araştırmacıya yalnızca şifrelenmiş yöntemler üzerinden yanıt verir.

source: Response Manager makes inquiries to satisfy any needed information and to confirm if submission is indeed a vulnerability.
id: Response Manager membuat pertanyaan untuk memuaskan informasi yang dibutuhkan dan untuk memastikan bahwa laporan tersebut memang merupakan kerentanan.
pt: O Response Manager faz perguntas para satisfazer todas as informações necessárias e confirmar se oenvio é realmente uma vulnerabilidade.
ru: Ответственный менеджер делает запросы, чтобы удовлетворить любую необходимую информацию и подтвердить, что предмет действительно является уязвимостью.
tr: Müdahale Sorumlusu, gerekli bilgileri sağlamak ve bildirimin gerçekten bir güvenlik açığı olup olmadığını doğrulamak için sorgulamalar yapar.

source: If submission proves to be vulnerable, proceed.
id: Jika laporan terbukti adalah kerentanan, lanjutkan.
pt: Se o envio se mostrar vulnerável, prossiga.
ru: Если предмет окажется уязвимым, выполнить.
tr: Bildirimin bir güvenlik açığı olduğu ortaya çıkarsa, ilerlenir.

source: If not vulnerable:
id: Jika bukan kerentanan:
pt: Se não vulnerável:
ru: Если не уязвим:
tr: Bir güvenlik açığı değilse:

source: Response Manager responds with reasons why submission is not a vulnerability.
id: Response Manager merespons dengan alasan mengapa laporan bukan merupakan kerentanan.
pt: O Response Manager responde com motivos pelos quais o envio não é uma vulnerabilidade.
ru: Ответственный менеджер объясняет, почему предмет не является уязвимостью.
tr: Müdahale Sorumlusu, bildirimin neden bir güvenlik açığı olmadığını açıklayan bir yanıt verir.

source: Response Manager moves discussion to a new or existing ticket on public Trac if necessary.
id: Response Manager memindahkan diskusi ke tiket baru atau tiket yang sudah ada di Trac publik, jika perlu.
pt: O Response Manager move a discussão para um ticket novo ou existente no Trac público, se necessário.
ru: Ответственный менеджер перемещает обсуждение в новый или существующий тикет на публичном трекере, если это необходимо.
tr: Müdahale Sorumlusu, gerekirse konuyu herkese açık Trac üzerindeki yeni ya da var olan bir destek kaydına taşır.

source: Establish severity of vulnerability:
id: Menetapkan tingkat keparahan kerentanan:
pt: Estabeleça a gravidade da vulnerabilidade:
ru: Установить степень опасности уязвимости:
tr: Güvenlik açığının önem derecesini belirleyin:

source: Affects network as a whole, has potential to break entire network or is on a scale of great catastrophe.
id: Memberikan efek kepada jaringan secara keseluruhan, berpotensi menghancurkan keseluruhan jaringan atau berskala bencana besar.
pt: Afeta a rede como um todo, tem potencial para quebrar toda a rede ou está em uma escala de grande catástrofe.
ru: Касается сети в целом, имеют потенциал, чтобы сломать всю сеть или имеют масштаб большой катастрофы.
tr: Ağı bir bütün olarak etkiler, tüm ağı kırma potansiyeline sahiptir yada büyük bir felaket ölçeğindedir.

source: Affects individual routers, or must be carefully exploited.
id: Memberikan efek kepada router individual, atau harus dieksploitasi secara hati-hati.
pt: Afeta roteadores individuais ou deve ser explorado com cuidado.
tr: Bazı yönelticileri etkiler veya dikkatlice yararlanılmalıdır.

source: Is not easily exploitable.
id: Tidak mudah dieksploitasi.
pt: Não é facilmente explorável.
ru: Нелегко воспроизвести.
tr: Kolayca yararlanılmaz.

source: Respond according to the severity of the vulnerability:
id: Merespon sesuai dengan tingkat keparahan kerentanan:
pt: Responda de acordo com a gravidade da vulnerabilidade:
ru: Ответить согласно степени опасности уязвимости:
tr: Güvenlik açığının önem derecesine göre yanıtlayın:

source: HIGH severities must be notified on website and news feed within %(limit)s working days of classification.
id: Tingkat keparahan yang tinggi harus diberitahukan di situs web dan news feed dalam %(limit)s hari kerja.
ru: О ВЫСОКОЙ степени опасности должны быть уведомления на веб-сайте и в ленте новостей в течение %(limit)s рабочих дней с момента классификации.
tr: YÜKSEK önem dereceleri sınıflandırıldıktan en fazla %(limit)s iş günü sonra sitede ve haber akışında bildirilmelidir.

source: The notification should list appropriate steps for users to take, if any.
id: Pemberitahuan harus mencantumkan langkah-langkah yang tepat untuk diambil pengguna, jika ada.
pt: A notificação deve listar as etapas apropriadas a serem executadas pelos usuários, se houver.
ru: В уведомлении должны быть перечислены соответствующие действия, которые должны предпринять пользователи, если таковые имеются.
tr: Bildirimde, varsa kullanıcıların uygulaması gereken adımlar listelenmelidir.

source: The notification must not include any details that could suggest an exploitation path.
id: Pemberitahuan tersebut tidak boleh menyertakan rincian yang dapat menyarankan jalur eksploitasi.
pt: A notificação não deve incluir quaisquer detalhes que possam sugerir uma via de exploração.
ru: В уведомлении не должно содержаться никаких сведений, которые могли бы указывать на путь эксплуатации.
tr: Bildirimde güvenlik açığından yararlanılmasını sağlayabilecek bir ayrıntı bulunmamalıdır.

source: The latter takes precedence over the former.
id: Yang terakhir lebih diutamakan daripada yang pertama.
pt: Este último tem precedência sobre o primeiro.
ru: Последнее имеет приоритет над первым.
tr: İkinci konu, birinciye göre önceliklidir.

source: MEDIUM and HIGH severities will require a Point Release.
id: Tingkat keparahan yang SEDANG dan TINGGI akan memerlukan Point Release.
pt: As gravidades MÉDIA e ALTA exigirão uma liberação pontual.
ru: СРЕДНИЕ и ВЫСОКИЕ степени опасности потребуют Point Release.
tr: ORTA ve YÜKSEK önem dereceleri için Anlık Sürüm yayınlanır.

source: LOW severities will be addressed in the next Regular Release.
id: Tingkat keparahan yang RENDAH akan diatasi di dalam Regular Release berikutnya.
pt: As gravidades BAIXAS serão abordadas na próxima versão regular.
ru: НИЗКИЕ степени опасности будут рассмотрены в следующем регулярном выпуске.
tr: DÜŞÜK önem dereceleri bir sonraki Normal Sürümde ele alınır.

source: Response Team applies appropriate patch(es).
id: Response Team menerapkan patch yang sesuai.
pt: A equipe de resposta aplica os patches apropriados.
ru: Ответственная группа применяет соответствующие исправления.
tr: Müdahale Ekibi gerekli yamaları uygular.

source: Response Manager works on a patch LOCALLY, patches are shared by the response team via PGP-encrypted e-mail until such a time as it is safe to expose to the public.
id: Manajer Respons membuat patch secara lokal, patch dibagikan oleh tim respons melalui email yang dienkripsi PGP sampai waktu yang aman untuk diekspos kepada publik.
pt: O Response Manager trabalha em um patch LOCALMENTE, os patches são compartilhados pela equipe de resposta por meio de e-mail criptografado por PGP até o momento em que seja seguro expor ao público.
tr: Müdahale Sorumlusu, YEREL OLARAK bir yama üzerinde çalışır. Yamalar, müdahale ekibi tarafından, herkese açık olarak duyurulması güvenli olana kadar PGP ile şifrelenmiş e-posta yoluyla paylaşılır.

source: Patches are reviewed with the researcher.
id: Patch diperiksa oleh peneliti.
pt: Os patches são revisados com o pesquisador.
ru: Патчи рассматриваются совместно с исследователем.
tr: Yamalar araştırmacı ile birlikte gözden geçirilir.

source: Any messages associated with PUBLIC commits during the time of review should not make reference to the security nature of the PRIVATE branch or its commits.
id: Setiap pesan yang terkait dengan komitmen PUBLIK selama peninjauan sebaiknya tidak mengacu pada sifat keamanan cabang PRIVATE atau commit-nya.
pt: Quaisquer mensagens associadas a commits PUBLIC durante o tempo de revisão nãodevem fazer referência à natureza de segurança do branch PRIVATE ou de seus commits.
ru: Любые сообщения, связанные с ПУБЛИЧНЫМИ коммитами во время проверки, не должны ссылаться на характер безопасности ПРИВАТНОЙ ветви или ее коммита.
tr: Gözden geçirme sırasında HERKESE AÇIK yazılım güncellemelerindeki iletilerde, KİŞİSEL dal ya da yazılım güncellemelerindeki güvenlik kapsamına atıfta bulunulmamalıdır.

source: Vulnerability announcement is drafted.
id: Pengumuman kerentanan disusun.
pt: O anúncio de vulnerabilidade é elaborado.
ru: Составляется объявление об уязвимости.
tr: Güvenlik açığı duyurusunun taslağı hazırlanır.

source: Include severity of vulnerability.
id: menyertakan tingkat keparahan dari kerentanan.
pt: Inclua a gravidade da vulnerabilidade.
ru: Добавьте серьезность уязвимости.
tr: Güvenlik açığının önem derecesini belirtin.

source: Include systems/apps effected.
id: Menyertakan sistem/aplikasi yang terpengaruh.
pt: Inclua sistemas/aplicativos afetados.
ru: Добавьте системы/приложения, к которым это применимо.
tr: Etkilenen sistemleri ve uygulamaları ekleyin.

source: Include solutions (if any) if patch cannot be applied.
id: Menyertakan solusi (jika ada) jika patch tidak bisa diterapkan.
pt: Inclua soluções (se houver) se o patch não puder ser aplicado.
ru: Добавьте решения (если имеются), если патч не может быть применен.
tr: Yama uygulanamıyorsa (varsa) çözümleri ekleyin.

source: Release date is discussed.
id: Tanggal rilis dibahas.
pt: A data de lançamento é discutida.
ru: Дата релиза обсуждается.
tr: Yayınlanma tarihi tartışılır.

source: At release date, Response Team coordinates with developers to finalize update:
id: Pada tanggal rilis, Response Team berkoordinasi dengan pengembang untuk menyelesaikan pembaruan:
pt: Na data de lançamento, a Equipe de Resposta coordena com os desenvolvedores para finalizar a atualização:
ru: На дату релиза ответственная группа координирует работу с разработчиками для завершения обновления:
tr: Yayınlanma tarihinde, Müdahale Ekibi güncellenmeyi tamamlamak üzere geliştiriciler ile iş birliği yapar:

source: Response Manager propagates the "hotfix branch" to trunk.
id: Response Manager menyebarkan "hotfix bramch" ke dalam trunk.
pt: O Gerenciador de Resposta propaga a "ramificação do hotfix" para o tronco.
ru: Ответственный менеджер сливает "hotfix branch" с основной версией.
tr: Müdahale Sorumlusu, yazılımın "düzeltme dalını" ana koda ekler.

source: Response Manager includes vulnerability announcement draft in release notes.
id: Response Manager menyertakan draft pengumuman kerentanan dalam catatan rilis.
pt: O Gerenciador de Resposta inclui rascunho de anúncio de vulnerabilidade nas notas de versão.
ru: Ответственный менеджер включает черновик объявления об уязвимости в заметки о выпуске.
tr: Müdahale Sorumlusu, güvenlik açığı duyuru taslağını sürüm notlarına ekler.
