Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/research.po
Languages: id, pt, ru, tr

source: Proceed with the Point or Regular Release. At this time, it is not possible to release an in-network update for only one operating system or architecture. In order that all affected products can be released as quickly as possible, the person responsible for that software should be able to perform necessary release processes in a timely manner. Importantly this should include consideration for package maintainers in Debian, Ubuntu and F-Droid.
id: Lanjutkan dengan Point atau Regular Release. Saat ini, tidak mungkin merilis pembaruan dalam jaringan hanya untuk satu sistem operasi atau arsitektur. Agar semua produk yang terpengaruh dapat dirilis secepat mungkin, orang yang bertanggung jawab untuk perangkat lunak itu harus dapat melakukan proses rilis yang diperlukan dalam tepat waktu. Yang penting, ini harus termasuk pertimbangan untuk package maintainer di Debian, Ubuntu dan F-Droid.
tr: Anlık ya da Normal Sürüm yayını ile ilerlenir. Şu anda, yalnızca bir işletim sistemi veya mimari için bir ağ içi güncelleme yayınlanamaz Etkilenen tüm ürünlerin olabildiğince hızlı yayınlanabilmesi için, bu yazılımdan sorumlu kişinin gerekli işlemleri en kısa zamanda yapması gerekir. Daha da önemlisi, Debian, Ubuntu ve F-Droid üzerindeki paket yöneticileri de düşünülmelidir.

source: Post-release Disclosure Process
pt: Processo de Divulgação Pós-lançamento
ru: Процесс раскрытия информации после выпуска
tr: Yayın Sonrası Açığa Çıkarma Süreci

source: Response Team has %(limit)s days to fulfill all points within section III.
id: Response Team memiliki waktu %(limit)s hari untuk memenuhi semua poin di dalam bagian III.
ru: У ответственной группы есть %(limit)s дней, чтобы выполнить все пункты в разделе III.
tr: Müdahale Ekibi, III. bölümdeki tüm işlemleri %(limit)s gün içinde yapmalıdır.

source: If the Incident Response process in section III is successfully completed:
id: Jika proses Incident Response pada bagian III berhasil diselesaikan:
pt: Se o processo de Resposta a Incidentes na seção III for concluído com êxito:
ru: Если процесс реагирования на инциденты в разделе III успешно завершен:
tr: III. bölümdeki Olay Müdahalesi süreci başarıyla tamamlanırsa:

source: Response Manager contacts researcher and asks if researcher wishes for credit.
id: Response Manager menghubungi peneliti dan menanyakan apakah peneliti menginginkan namanya disebut.
pt: O Response Manager entra em contato com o pesquisador e pergunta se o pesquisador deseja crédito.
ru: Ответственный менеджер связывается с исследователем и спрашивает, желает ли исследователь получить благодарность.
tr: Müdahale Sorumlusu araştırmacı ile görüşerek, araştırmacının katkıda bulunduğunun duyurulmasını isteyip istemediğini sorar.

source: Finalize vulnerability announcement draft and include the following:
id: Selesaikan draft pengumuman kerentanan dan masukkan hal-hal berikut:
pt: Finalize o rascunho do anúncio de vulnerabilidade e inclua o seguinte:
ru: Доработать проект объявления об уязвимости и включить в него следующее:
tr: Güvenlik açığı duyuru taslağı tamamlanır ve aşağıdakiler eklenir:

source: Project name and URL.
id: Nama proyek dan URL
pt: Nome do projeto e URL.
ru: Название проекта и URL.
tr: Proje adı ve adresi.

source: Versions known to be affected.
id: Beberapa versi diketahui terkena pengaruh.
pt: Versões conhecidas por serem afetadas.
ru: Затронутые версии.
tr: Etkilendiği bilinen sürümler.

source: Versions known to be not affected (for example, the vulnerable code was introduced in a recent version, and older versions are therefore unaffected).
id: Versi yang diketahui tidak terpengaruh (misalnya, kode yang rentan dimasukkan dalam versi terbaru sehingga versi yang lebih lama tidak terpengaruh).
pt: Versões conhecidas por não serem afetadas (por exemplo, o código vulnerável foi introduzido em uma versão recente e, portanto, as versões mais antigas não são afetadas).
ru: Версии, которые не затронуты (например, уязвимый код был введен в последней версии, и поэтому старые версии не затронуты).
tr: Etkilenmediği bilinen sürümler (Örnek: Güvenlik açığından etkilenen kod yeni bir sürümde eklendiğinden bundan önceki sürümler etkilenmemiş olabilir).

source: Versions not checked.
id: Versi tidak diperiksa.
pt: Versões não verificadas.
ru: Непроверенные версии.
tr: Denetlenmeyen sürümler.

source: Type of vulnerability and its impact.
id: Jenis kerentanan dan dampaknya.
pt: Tipo de vulnerabilidade e seu impacto.
ru: Тип уязвимости и ее воздействие.
tr: Güvenlik açığının türü ve etkisi.

source: If already obtained or applicable, a CVE-ID.
id: Jika sudah didapat atau bisa diterapkan, CVE-ID.
pt: Se já obtido ou aplicável, um CVE-ID.
ru: Если уже получено или применимо, CVE-ID.
tr: Zaten alınmışsa veya varsa, bir CVE kodu.

source: The planned, coordinated release date.
id: Tanggal rilis yang direncanakan dan terkoordinasi.
pt: A data de lançamento planejada e coordenada.
ru: Планируемая, согласованная дата релиза.
tr: Planlanmış ve organize edilmiş yayın tarihi.

source: Mitigating factors (for example, the vulnerability is only exposed in uncommon, non-default configurations).
id: Faktor yang mengurangi (misalnya, kerentanan hanya terjadi dalam konfigurasi non-default yang tidak biasa).
pt: Fatores atenuantes (por exemplo, a vulnerabilidade só é exposta em configurações incomuns e não padrão).
ru: Смягчающие факторы (например, уязвимость только в необычных, нестандартных конфигурациях).
tr: Azaltıcı etkenler (Örnek: Güvenlik açığı yalnızca yaygın kullanılmayan durumlarda, varsayılan yapılandırmadan farklı ayarlarda ortaya çıkıyorsa).

source: Workarounds (configuration changes users can make to reduce their exposure to the vulnerability).
id: Workarounds (perubahan konfigurasi yang dapat dilakukan pengguna untuk mengurangi paparan terhadap kerentanan).
pt: Soluções alternativas (alterações de configuração que os usuários podem fazer para reduzir sua exposição à vulnerabilidade).
ru: Обходные пути (пользователи могут вносить изменения в конфигурацию, чтобы уменьшить подверженность уязвимости).
tr: Geçici çözümler (kullanıcıların bu güvenlik açığından etkilenmesini azaltmak için yapabilecekleri yapılandırma değişiklikleri).

source: If applicable, credits to the original reporter.
id: Jika berlaku, ucapkan terima kasih kepada orang yang melaporkan.
pt: Se for o caso, créditos ao repórter original.
ru: Если возможно, благодарности сообщившему о проблеме.
tr: İstiyorsa, bildirimi yapan araştırmacının emeklerini anma.

source: Release finalized vulnerability announcement on website and in news feed.
id: Pengumuman kerentanan rilis terakhir di situs web dan news feed.
pt: Lançamento de anúncio de vulnerabilidade finalizado no site e no feed de notícias.
ru: Выпуск завершенного объявления об уязвимости на веб-сайте и в ленте новостей.
tr: Tamamlanmış güvenlik açığı duyurusu sitede ve haber akışında yayınlanır.

source: For HIGH severities, release finalized vulnerability announcement on well-known mailing lists:
id: Untuk tingkat keparahan yang TINGGI, rilis pengumuman kerentanan akhir pada milis terkenal:
pt: Para severidades ALTAS, libere o anúncio de vulnerabilidade finalizado em listas de discussão conhecidas:
ru: Для ВЫСОКИХ уровней опасности, релиз завершенного объявления об уязвимости в известных списках рассылки:
tr: YÜKSEK önem dereceleri için, iyi bilinen e-posta listelerinde tamamlanmış güvenlik açığı duyurusu yayınlanır:

source: If applicable, developers request a CVE-ID.
id: Jika dapat diterapkan, pengembang dapat meminta CVE-ID.
pt: Se aplicável, os desenvolvedores solicitam um CVE-ID.
ru: Если возможно, разработчики запрашивают CVE-ID.
tr: Uygulanabiliyorsa, geliştiriciler bir CVE kodu başvurusunda bulunur.

source: The commit that applied the fix is made reference too in a future commit and includes a CVE-ID.
id: Komitment menerapkan perbaikan juga dijadikan rujukan di masa mendatang dan menyertakan CVE-ID.
pt: A confirmação que aplicou a correção também é feita referência em uma confirmação futura e inclui uma CVE-ID.
ru: Коммит, который применил исправление, также ссылается в будущие коммиты и включает CVE-ID.
tr: Düzeltmenin yapıldığı kayıt, gelecekteki işlemler için referans yapılır ve bir CVE kodu eklenir.

source: If the Incident Response process in section III is *not* successfully completed:
id: Jika proses Incident Response pada bagian III *tidak* berhasil diselesaikan:
pt: Se o processo de Resposta a Incidentes na seção III *não* for concluído com êxito:
tr: III. bölümdeki Olay Müdahale süreci başarıyla *tamamlanmadıysa*:

source: Response Team and developers organize an IRC meeting to discuss why/what points in section III were not resolved and how the team can resolve them in the future.
id: Response Team dan pengembang mengatur pertemuan IRC untuk membahas mengapa poin di bagian III tidak terselesaikan dan bagaimana tim dapat menyelesaikannya di masa mendatang.
pt: A equipe de resposta e os desenvolvedores organizam uma reunião de IRC para discutir por que/quais pontosna seção III não foram resolvidos e como a equipe pode resolvê-los nofuturo.
tr: Müdahale Ekibi ve geliştiriciler, III. bölümdeki konuların hangilerinin neden çözümlenemediğini ve bunların gelecekte nasıl çözümleneceğini tartışmak için bir IRC toplantısı düzenler.

source: Any developer meetings immediately following the incident should include points made in section V.
id: Setiap pertemuan pengembang yang diadakan segera setelah kejadian tersebut harus mencakup poin yang dibuat di bagian V.
pt: Quaisquer reuniões de desenvolvedores imediatamente após o incidente devem incluir pontosfeitos na seção V.
tr: Olayı izleyen bir geliştirici toplantısında V. bölümde ele alınan noktalar görüşülmelidir.

source: If disputes arise about whether or when to disclose information about a vulnerability, the Response Team will publicly discuss the issue via IRC and attempt to reach consensus.
id: Jika perselisihan timbul tentang apakah harus mengungkapkan informasi tentang kerentanan atau kapan mengungkapkan kerentanan, Response Team akan mendiskusikan masalah ini melalui IRC dan berusaha mencapai konsensus.
pt: Se surgirem disputas sobre se ou quando divulgar informações sobre umavulnerabilidade, a Equipe de Resposta discutirá publicamente o problema via IRC etentará chegar a um consenso.
tr: Bir güvenlik açığı hakkında bilgi verilip verilmeyeceği veya ne zaman duyurulacağı konusunda anlaşmazlık ortaya çıkarsa, Müdahale Ekibi IRC aracılığıyla konuyu herkese açık olarak tartışır ve bir fikir birliğine varmaya çalışır.

source: If consensus on a timely disclosure is not met (no later than %(limit)s days), the researcher (after %(limit)s days) has every right to expose the vulnerability to the public.
id: Jika konsensus mengenai waktu pengungkapan tidak terpenuhi (selambat-lambatnya %(limit)s hari), peneliti (setelah %(limit)s hari) memiliki hak untuk mengekspos kerentanan kepada publik.
tr: Duyuru zamanlaması ile ilgili fikir birliği sağlanamazsa (en geç %(limit)sgün içinde), araştırmacı (%(limit)sgün sonra) güvenlik açığını herkese açık olarak duyurma hakkına sahiptir.

source: Incident Analysis
pt: Análise de Incidentes
ru: Анализ инцидента
tr: Olay İncelemesi

source: Isolate codebase
pt: Isolar a base de código
tr: Kod temelini yalıtma

source: Response Team and developers should coordinate to work on the following:
id: Response team dan pengembang harus berkoordinasi untuk mengerjakan hal-hal berikut:
pt: A equipe de resposta e os desenvolvedores devem se coordenar para trabalhar no seguinte:
tr: Müdahale Ekibi ve geliştiriciler şu konular üzerinde çalışmak için organize olmalıdır:

source: Problematic implementation of classes/libraries/functions, etc.
id: Implementasi bermasalah pada classes/libraries/functions, dll.
pt: Implementação problemática de classes/bibliotecas/funções, etc.
tr: Sınıfların/kitaplıkların/işlevlerin vb. soruna göre uyarlanması

source: Focus on apps/distro packaging, etc.
id: Fokus pada aplikasi/distro packaging, dll.
pt: Concentre-se em empacotamento de aplicativos/distro, etc.
tr: Uygulamalara/dağıtım paketlerine vb. odaklanılması.

source: Operator/config error, etc.
id: Operator/config error, dll.
pt: Erro de operador/configuração, etc.
tr: Kullanıcı/yapılandırma hatası vb.

source: Auditing
pt: Auditoria
tr: Denetim

source: Auditing of problem area(s) as discussed in point 1.
id: Mengaudit area masalah(-masalah) sebagaimana dibahas pada butir 1.
pt: Auditoria da(s) área(s) problemática(s), tal como referido no ponto 1.
tr: 1. maddede anıldığı gibi sorunlu alan(lar)ın denetlenmesi.

source: Generate internal reports and store for future reference.
id: Buat laporan internal dan simpan referensi untuk masa mendatang.
pt: Gere relatórios internos e armazene para referência futura.
tr: İç raporların oluşturulması ve ileride başvurulmak üzere arşivlenmesi.

source: If results are not sensitive, share with the public via IRC or public Trac.
id: Jika hasil tidak sensitif, bagikan dengan publik melalui IRC atau public Trac.
pt: Se os resultados não forem sensíveis, partilhe com o público através de IRC ou Trac público.
tr: Sonuçlar kritik değilse, IRC ya da herkese açık Trac üzerinde herkese açık olarak paylaşılması.

source: Response Team has %(limit)s days following completion of section III to ensure completion of section V.
id: Response Team memiliki %(limit)s hari setelah selesainya bagian III untuk memastikan penyelesaian seksi V.
tr: Müdahale Ekibi, III. bölümü tamamladıktan sonra %(limit)s gün içinde V. bölümü tamamlamalıdır.

source: Resolutions
pt: Resoluções
ru: Решения
tr: Sonuçlar

source: Any further questions or resolutions regarding the incident(s) between the researcher and response + development team after public disclosure can be addressed via the following:
id: Pertanyaan atau resolusi lebih lanjut mengenai insiden antara tim peneliti dan tim pengembang + respon setelah pengungkapan publik dapat ditangani melalui:
pt: Quaisquer outras perguntas ou resoluções sobre o(s) incidente(s) entre o pesquisador e a equipe de resposta + desenvolvimento após adivulgação pública podem serabordadas através do seguinte:
tr: Herkese açık duyuru yapıldıktan sonra, olay(lar) ile ilgili ilgili herhangi bir başka soru veya çözüm, araştırmacı ile müdahale + geliştirme ekibi arasında şu başlıklarla ele alınabilir:

source: Continuous Improvement
id: Perbaikan terus-menerus
pt: Aperfeiçoamento Contínuo
ru: Непрерывное улучшение
tr: Sürekli iyileştirme

source: Response Team and developers should hold annual meetings to review the previous year's incidents.
id: Response Team dan pengembang harus mengadakan pertemuan tahunan untuk meninjau insiden tahun sebelumnya.
pt: A equipe de resposta e os desenvolvedores devem realizar reuniões anuais para revisar os incidentes do ano anterior.
tr: Müdahale Ekibi ve geliştiriciler, önceki yılın olaylarını gözden geçirmek için yıllık toplantılar düzenlemelidir.

source: Response Team or designated person(s) should give a brief presentation, including:
id: Response Team atau orang(-orang) yang ditunjuk harus memberikan presentasi singkat, termasuk:
pt: A Equipe de Resposta ou a(s) pessoa(s) designada(s) deve(m) fazer uma breve apresentação, incluindo:
tr: Müdahale Ekibi veya belirlenen kişi(ler) şu konularda kısa bir sunum yapmalıdır:

source: Areas of I2P affected by the incidents.
id: Area I2P yang terkena dampak insiden.
pt: Áreas da I2P afetadas pelos incidentes.
tr: Olaylardan etkilenen I2P alanları.

source: Any network downtime or monetary cost (if any) of the incidents.
id: Setiap downtime jaringan atau biaya moneter (jika ada) dari kejadian tersebut.
pt: Qualquer tempo de inatividade da rede ou custo monetário (se houver) dos incidentes.
tr: Olaylardan kaynaklanan herhangi bir ağ kesintisi ya da (varsa) parasal maliyet.

source: Ways in which the incidents could have been avoided (if any).
id: Cara-cara di mana insiden bisa dihindari (jika ada).
pt: Maneiras pelas quais os incidentes poderiam ter sido evitados (se houver).
tr: Olaylardan kaçınma yolları (varsa).

source: How effective this process was in dealing with the incidents.
id: Seberapa efektif proses ini dalam menghadapi insiden tersebut.
pt: Como esse processo foi eficaz para lidar com os incidentes.
tr: Bu sürecin olaylarla başa çıkmada ne kadar etkili olduğu.

source: After the presentation, Response Team and developers should discuss:
id: Setelah presentasi, Response Team dan pengembang harus mendiskusikan:
pt: Após a apresentação, a Equipe de Resposta e os desenvolvedores devem discutir:
tr: Sunumdan sonra, Müdahale Ekibi ve geliştiriciler şu konuları tartışmalıdır:

source: Potential changes to development processes to reduce future incidents.
id: Potensi perubahan pada proses pengembangan untuk mengurangi insiden di masa depan.
pt: Possíveis mudanças nos processos de desenvolvimento para reduzir incidentes futuros.
tr: Gelecekteki olayları azaltmak için geliştirme süreçlerinde yapılabilecek değişiklikler.

source: Potential changes to this process to improve future responses.
id: Potensi perubahan pada proses ini untuk memperbaiki respons di masa depan.
pt: Possíveis mudanças nesse processo para melhorar as respostas futuras.
tr: Gelecekteki müdahaleleri iyileştirmek için bu süreçte yapılabilecek değişiklikler.
