Repository: go-i2p/generator
Catalog: translations/*/LC_MESSAGES/research.po
Languages: id, pt, ru, tr

source: Academic Research
id: Penelitian Akademik
pt: Investigação Académica
ru: Научные исследования
tr: Akademik Araştırma

source: May 2018
id: Mei 2018
pt: Maio de 2018
ru: Май 2018
tr: Mayıs 2018

source: Introduction
id: Pendahuluan
pt: Introdução
ru: Вступление
tr: Giriş

source: Research on the I2P Network
id: Penelitian tentang Jaringan I2P
pt: Investigação na Rede do I2P
ru: Исследование сети I2P
tr: I2P Ağı Üzerine Araştırma

source: I2P is a very unique project that unfortunately has not received the wider academic attention it deserves. To date, most research focus on anonymous and onion-routing technology has been around Tor, and while those papers benefit us as well, there is a great need for I2P-focused research. This plays a key role in both maintaining the security and integrity of the network, as well as opening doors for more impactful future development.
id: I2P adalah proyek yang sangat unik yang sayangnya belum mendapat perhatian akademis lebih luas yang layak diterimanya. Sampai saat ini, sebagian besar penelitian berfokus pada anonimitas dan teknologi Onion Routing yang telah ada di Tor, dan meskipun makalah-makalah tersebut bermanfaat bagi kita terdapat kebutuhan besar akan penelitian yang berfokus pada I2P. Ini memainkan peran penting baik dalam menjaga keamanan dan integritas jaringan, serta membuka pintu bagi pembangunan masa depan yang lebih berdampak.
pt: A I2P é um projeto muito singular que infelizmente não recebeu a atenção acadêmica mais extensa que merece. Até o momento, a maior parte do foco de pesquisa sobre tecnologia anônima e de roteamento cebola foi ao redor do Tor, e ainda que essa pesquisa nos beneficie também, há uma grande necessidade de pesquisa focada na I2P. Isso tem um papel chave tanto em manter a segurança e integridade da rede, quanto em abrir portas para desenvolvimento futuro de maior impacto.
ru: I2P - это уникальный проект, который, к сожалению, не удостоен должного академического внимания. На сегодняшний день большая часть исследований анонимности и технологии луковой маршрутизации сфокусирована вокруг Tor, и это приносит нам пользу, но также есть большая потребность в исследованиях, сфокусированных на I2P. Это играет ключевую роль, как в поддержании безопасности и целостности сети, так и в открытии возможностей для эффективного развития в будущем.
tr: Ne yazık ki, I2P hakettiği geniş kapsamlı akademik ilgiyi görmeyen çok benzersiz bir projedir. Bugüne kadar anonimlik ve onion-routing teknolojileri üzerine yapılan çoğu araştırma Tor ile ilgiliydi. Bu makaleler bize de yararlı oluyor ancak I2P odaklı araştırmalara da büyük bir ihtiyaç var. Bu araştırmalar, ağın güvenliğini ve bütünlüğünü korumakta önemli bir rol oynayarak gelecekte daha etkili gelişmeler için yeni kapılar açacaktır.

source: There is a large research community investigating a wide range of aspects of anonymity. For a current and comprehensive list of relevant papers, see the <a href="%(anonbib)s">Free Haven Anonymity Bibliography</a>. I2P benefits from much of the research into Tor and onion routing, but there is little dedicated research interest into the theory behind I2P, and the choices and tradeoffs that the network makes. This presents a unique opportunity for original research.
id: Ada sebuah komunitas penelitian besar yang menginvestigasi berbagai aspek anonimitas. Dan untuk daftar lengkap makalah yang relevan saat ini, lihat <a href="%(anonbib)s">Suaka Bibliografi Anonimitas Gratis</a>. I2P mendapatkan manfaat dari banyak penelitian kedalam routing Tor dan onion, tetapi ada sedikit kepentingan penelitian berdedikasi kedalam teori dibalik I2P, dan pilihan serta pengorbanan yang membuat jaringan. Ini merupakan sebuah kesempatan unik untuk penelitian asli.
pt: Há uma enorme comunidade de pesquisa investigando uma ampla variedade de aspectos do anonimato. Para uma lista abrangente e atual de artigos relevantes, dê uma olhada na <a href="%(anonbib)s">Bibliografia sobre anonimato do Free Haven</a>. A I2P se beneficia da maioria da pesquisa feita no Tor e sobre o roteamento cebola, mas há pouco esforço de pesquisa dedicado aos tópicos teóricos por trás da I2P, e às escolhas e compromissos que a rede faz. Isso apresenta uma oportunidade única para pesquisa nova e original.
ru: Существует большое сообщество, занимающееся исследованием широкого спектра аспектов анонимности. Для ознакомления с текущим и исчерпывающим списком соответствующих материалов, загляните в <a href="%(anonbib)s">Free Haven Anonymity Bibliography</a>. I2P использует многие положительные результаты исследований Tor и луковой маршрутизации, однако сейчас интерес к исследованию непосредственно теории работы I2P, применяемым в I2P решениям и соглашениям довольно низкий. Это, в свою очередь, предоставляет уникальную возможность для проведения оригинальных исследовательских работ.
tr: Anonimlik konusunu çok çeşitli yönleriyle araştıran büyük bir araştırma topluluğu var. İlgili makalelerin güncel ve kapsamlı listesini <a href="%(anonbib)s">Free Haven Anonymity Bibliography</a> üzerinde bulabilirsiniz. I2P, Tor ve onion yöneltme araştırmalarının çoğundan yararlanır, ancak I2P yapısının arkasındaki teori ve ağın sağladığı olanak ve seçeneklere çok az ilgi gösterilmiştir. Bu durum, özgün bir araştırma benzersiz bir fırsat sunar.

source: A list of known published papers about I2P is available <a href="%(papers)s">here</a>.
id: Daftar makalah diterbitkan yang dikenal mengenai I2P sudah tersedia <a href="%(papers)s">disini</a>
pt: Está disponível <a href="%(papers)s">aqui</a>, uma lista de papéis conhecidos publicados sobre o I2P.
ru: Список известных публикаций про I2P доступен <a href="%(papers)s">здесь</a>.
tr: I2P ile ilgili bilinen yayınlanmış makaleleri <a href="%(papers)s">burada </a>bulabilirsiniz.

source: This page aims to outline the most needed fields of research, notes to potential researchers, our general safety guidelines as well as an expanding list of open questions that you can begin on at any time.
id: Halaman ini bertujuan untuk menguraikan bidang penelitian yang paling dibutuhkan, catatan untuk peneliti potensial, pedoman keselamatan umum serta perluasan daftar pertanyaan terbuka yang dapat Anda mulai kapan saja.
pt: Essa página visa a destacar os campos de pesquisa mais necessitados, notas para potenciais pesquisadores, nossas diretrizes gerais de segurança, bem como uma lista em expansão de questões abertas nas quais você pode começar a qualquer momento.
ru: Цель этой страницы: выделить наиболее востребованные области исследования, замечания для потенциальных исследователей, наши основные методические рекомендации по безопасности, а также расширить список открытых вопросов, с которых вы можете начать в любое время.
tr: Bu bölüm, en çok gerek duyulan araştırma alanlarını özetlemeyi amaçlıyor. Olası araştırmacılara notlar, genel güvenlik yönergelerimiz ve istediğiniz zaman üzerinde çalışmaya başlayabileceğiniz açık soruların listesi.

source: Notes to Researchers:
id: Catatan untuk Peneliti:
pt: Notas para os investigadores:
ru: Замечания для исследователей:
tr: Araştırmacılara Notlar:

source: Defensive Research
id: Penelitian Defensif
pt: Investigação Defensiva
ru: Оборонные исследования
tr: Savunma Araştırması

source: While all research on the I2P network is beneficial and appreciated, there are certain areas which are more in need than others - most so in defensive research. Most people enjoy coming up with fun ways to launch offensives against anonymous software, and this is further reinforced by the incentives in academic institutions. While we know it is often not the first choice for researchers, We would certainly appreciate any and all work towards ways to fortify the network!
id: Sementara semua penelitian tentang jaringan I2P bermanfaat dan dihargai, ada area tertentu yang lebih membutuhkan daripada yang lain - paling banyak dalam penelitian defensif defensif. Kebanyakan orang senang menemukan cara-cara menyenangkan untuk melancarkan serangan terhadap perangkat lunak anonim, dan hal ini semakin diperkuat dengan adanya insentif di dalam institusi akademis. Meskipun kita tahu ini seringkali bukan pilihan pertama peneliti, kami pasti akan menghargai setiap dan semua usaha menuju cara untuk membentengi jaringan!
pt: Apesar de toda a pesquisa sobre a rede I2P ser benéfica e bem-vinda, existem certas área que estão mais carentes do que outras - sobretudo em pesquisa defensiva. A maioria das pessoas gosta de elaborar formas divertidas de lançar ofensivas contra software anônimo, e isso é reforçado ainda mais pelos incentivos em instituições acadêmicas. Embora nós saibamos que frequentemente não é a primeira escolha para pesquisadores, nós certamente gostaríamos de todo e qualquer trabalho em direção a formas de fortificar a rede!
ru: В то время как все исследования в сети I2P полезны и ценятся, есть некоторые области, которые более востребованы, чем другие - по большей части это оборонные исследования. Многие люди выступают против анонимного программного обеспечения, и это в дальнейшем подкрепляется стимулами в учебных заведениях. Хотя мы знаем, что это не в приоритете у исследователей, мы, конечно, ценим любую работу по укреплению сети!
tr: I2P ağı üzerine tüm araştırmalar faydalı ve takdir ediyoruz. Ancak diğerlerinden daha fazla gerek duyulan - çoğu savunma araştırma amaçlı - belirli alanlar var. Çoğu kişi anonimlik uygulamalarına karşı bir saldırı başlatmanın eğlenceli yollarını bulmayı sever ve bu durum, akademik kuruluşlar tarafından da desteklenir. Bunun genellikle araştırmacılar için ilk seçenek olmadığını bilsek de ağı güçlendirmeye yönelik her türlü çabayı kesinlikle takdir ediyoruz!

source: Offensive and Analytic Tests
id: Tes Ofensif dan Analitik
pt: Testes Ofensivos e Analíticos
ru: Наступательное и аналитическое тестирование
tr: Saldırgan ve Analitik Testler

source: If you've decided on a research topic that aims to hands-on investigate the I2P network or solve a problem of large proportions we ask you to <b>please</b> <a href="%(contact)s">communicate your ideas</a> to the development team, the sooner the better. I2P is under constant development and a significant amount of roadmapping occurs, therefore your problem may have already been identified and flagged for update or patch. In the unlikely event you are conducting testing that overlaps with / would be of interest to another research project already in motion, we are also able to make you aware of this (with their permission, of course), and possibly open the door for collaboration. There is also a chance that the test itself may significantly harm the network or regular users, and the team may have ideas or suggestions to mitigate that risk and increase the safety of your testing.
id: Jika Anda telah memutuskan topik penelitian yang bertujuan untuk menyelidiki jaringan I2P secara langsung atau menyelesaikan sebagian besar masalah yang kami minta Anda <b>tolong</b> <a href="%(contact)s">komunikasikan ide anda</a> kepada tim development, makin cepat makin baik. I2P sedang dalam pengembangan konstan dan jumlah roadmapping yang signifikan sedang terjadi, oleh karena itu masalah Anda mungkin sudah diidentifikasi dan ditandai untuk pembaruan atau tambalan. Seandainya Anda sedang melakukan hal yang sama dengan/akan menjadi topik untuk proyek penelitian lain yang sudah berjalan, kami juga dapat membuat Anda mengetahui hal ini (dengan izin mereka, tentu saja), dan mungkin membuka pintu untuk kolaborasi. Ada juga kemungkinan bahwa pengujian itu sendiri dapat membahayakan jaringan atau pengguna biasa secara signifikan, dan tim mungkin memiliki ide atau saran untuk mengurangi risiko tersebut dan meningkatkan keamanan pengujian Anda.
pt: Se você escolheu um tópico de pesquisa que visa a investigar com mãos na massa a rede I2P ou resolver um problema de grandes proporções, nós pedimos que você, <b>por favor</b>, <a href="%(contact)s">comunique suas ideias</a> ao time de desenvolvimento, o quanto antes melhor. A I2P está sob constante desenvolvimento e uma quantidade significativa de elaboração de roteiros ocorre, portanto seu problema pode já ter sido identificado e marcado para atualização ou patch. No evento pouco provável de você estar conduzindo testes que coincidam com / seriam de interesse para outro projeto de pesquisa já em andamento, nós também seremos capazes de deixar você a par disso (com a permissão deles, claro), e possivelmente abrir a porta para colaboração. Há ainda a chance de que o teste em si pode prejudicar significativamente a rede ou usuários regulares, e o time pode ter ideias ou sugestões para mitigar esse risco e aumentar a segurança dos seus testes.
ru: Если вы определились с темой исследования, целью которого является практическое исследование сети I2P или решение проблемы больших пропорций, мы просим вас: <b>пожалуйста</b>, <a href="%(contact)s">передайте</a> свои идеи команде разработчиков, чем скорее, тем лучше. I2P находится в постоянном развитии, поэтому ваша проблема, возможно, уже была выявлена и помечена для обновления или исправления. В менее вероятном случае вы будете проводить тестирование, которое пересекается / будет пересекаться с другим уже запущенным исследовательским проектом, и мы можем уведомить вас об этом (с их разрешения, конечно), и, возможно, открыть дверь для сотрудничества. Также, есть вероятность того, что сам тест может существенно повредить сети, и у обычных пользователей или команды разработчиков могут быть идеи или предложения по снижению этого риска и увеличению безопасности вашего испытания.
tr: Belirli bir konuda I2P ağını uygulamalı olarak araştırmaya veya büyük bir sorunu çözmeye karar verdiyseniz <b>lütfen</b> <a href="%(contact)s">fikirlerinizi geliştirme ekibine iletin</a>. Ne kadar erken olursa o kadar iyidir. I2P sürekli geliştirme aşamasında ve önemli miktarda yol haritası çıkıyor. Bu nedenle sorununuz önceden belirlenmiş ve güncellenme ya da yama geliştirmek için sıraya alınmış olabilir. Düşük olasılıklı olsa da, yürürlükteki başka bir araştırma projesi ile örtüşen ya da onu ilgilendiren durumlarda bunun farkına varmanızı sağlayarak (tabi ki onların izniyle) ve olası bir işbirliğine kapı aralıyoruz. Ayrıca testin ağa ya da normal kullanıcılara önemli ölçüde zarar verme olasılığı olabilir ve ekibin bu riski azaltmak ve testinizin güvenliğini arttırmak için fikir ve önerileri olabilir.

source: Research Ethics &amp; Testing the Network
id: Etika Penelitian & Pengujian Jaringan
pt: Ética de Investigação e Testar a Rede
ru: Исследовательская этика &amp; Тестирование сети
tr: Araştırma Etiği ve Ağda Test Yaprmak

source: General Guidelines
id: Petunjuk umum
pt: Diretrizes Gerais
ru: Общие методические рекомендации
tr: Genel Kurallar

source: <ol> <li> Consider the benefits and risks - is there any doubt that the research provides more value than danger? </li> <li> If the research can be done on a test network then that is the preferred method </li> <li> If you must operate on the live network, the safest route is only collecting data about yourself </li> <li> If you need 'bigger data', It is recommended to first see if you can use data sets from previous experiments or other third party resources is recommended </li> <li> If you must collect data on the live network, ensure it is safe for publication and collect as little as possible </li> <li> After testing and before publish, review that all data which is to be published publicly is <b><i>not</i></b> intended to be private by the originator </li> </ol>
id: <ol> <li> Pertimbangkan manfaat dan risiko – apakah penelitian tersebut ada keraguan memberikan manfaat lebih banyak daripada bahaya? </li> <li> Jika penelitian dapat dilakukan pada jaringan tes maka itu adalah metode yang sebaiknya dipilih </li> <li> Jika Anda harus melakukannya di jaringan I2P, cara teraman hanyalah mengumpulkan data tentang diri Anda </li> <li> Jika Anda membutuhkan 'data yang lebih banyak', sebaiknya terlebih dahulu melihat apakah Anda dapat menggunakan data dari eksperimen sebelumnya atau sumber daya pihak ketiga lainnya yang direkomendasikan </li> <li> Jika Anda harus mengumpulkan data langsung di jaringan I2P, pastikan aman untuk publikasi dan kumpulkan data sesedikit mungkin </li> <li> Setelah pengujian selesai dan sebelum publikasi, tinjau semua data yang akan dipublikasikan secara publik <b><i>tidak</i></b> dimaksudkan untuk dijadikan pribadi oleh pemilik data </li> </ol>
pt: <ol> <li> Considere os benefícios e riscos - há alguma dúvida de que a pesquisa oferece mais valor do que perigo? </li> <li> Se a pesquisa pode ser feita em uma rede de testes, então esse é o método preferível </li> <li> Se você precisa operar na rede real, a rota mais segura é somente coletar dados sobre você próprio </li> <li> Se você precisa de 'maiores dados', é recomendado ver primeiro se você consegue usar conjuntos de dados de experimentos prévios ou de outros recursos de terceiros </li> <li> Se você precisa coletar dados da rede real, certifique-se de que são seguros para publicação e colete o mínimo possível </li> <li> Após testar e antes de publicar, reveja se todos os dados a serem publicados publicamente <b><i>não</i></b> são destinados a serem privados pelo originador </li> </ol>
ru: <ol><li>Рассмотрим преимущества и риски - есть ли сомнения, что исследования принесут больше пользы, чем вреда?</li><li>Если исследование может быть сделано в тестовой сети, то это более предпочтительно</li><li>Если необходимо работать в live-сети, самым безопасным методом является только сбор данных о себе</li><li>Если вам нужны "bigger data", то рекомендуется решить, подойдут ли вам наборы данных из предыдущих экспериментов или из других сторонних источников </li><li>Если необходимо собрать данные в live-сети, убедитесь, что они безопасны для публикации и собирайте как можно меньше</li><li>После тестирования и перед публикацией просмотрите все данные, которые должны быть опубликованы, там <b><i>не должно быть</i></b> данных, обозначенных владельцем, как приватные</li></ol>
tr: <ol> <li> Yararları ve riskleri değerlendirin - Araştırma sağlayacağı yarardan çok zarara yol açabilir mi? </li> <li> Araştırma bir test ağında yapılabiliyorsa, bu yöntem yeğlenmelidir </li> <li> Canlı ağ üzerinde çalışmanız gerekiyorsa, en güvenli yol yalnızca kendiniz hakkında veri toplamaktır. </li> <li> 'Daha çok veriye' gerek duyuyorsanız, önce daha önce yapılmış deneylerden ya da üçüncü taraflardan elde edilen verileri kullanıp kullanamayacağınızı görmeniz önerilir. </li> <li> Canlı ağda veri toplamanız gerekiyorsa, bu verilerin yayınlanmak için güvenli olduğundan emin olun ve olabildiğince az veri toplayın. </li> <li> Testi tamamladıktan sonra ve sonuçları yayınlamadan önce, herkese açık olarak yayınlanacak tüm verileri gözden geçirerek, kaynağı tarafından kişisel veri olarak değerlendirilebilecek bir bilgi <b><i>içermediğinden </i></b> emin olun. </li> </ol>

source: Using a Test Network to Attack I2P
id: Menggunakan Jaringan Tes untuk Menyerang I2P
pt: Utilizar 'Testar Rede' para Atacar o I2P
ru: Использование тестовой сети для атаки на I2P
tr: I2P Ağına Saldırmak İçin Bir Test Ağı Kullanmak

source: I2P can be run as a separate test network by controlling the locations that a new router reseeds from so that it only finds other test routers. The standard mode of operation is to have one JVM per router instance; hence running multiple copies of I2P on a single machine is inadvisable, both due to the potential resource drain and the certain port conflicts. To better facilitate setting up small test networks, I2P has a multirouter mode which enables multiple distinct routers to be run in the same JVM. MultiRouter can be started from the i2p base directory by running the below command.
id: I2P dapat dijalankan sebagai sebuah jaringan tes terpisah dengan mengendalikan lokasi yang router baru reseed sehingga hanya menemukan router penguji lain. Modus standar pengoperasian adalah untuk menggunakan satu JVM per router instance; karena itu tidak disarankan untuk menjalankan beberapa salinan I2P pada sebuah komputer, karena akan menguras sumber daya potensial dan membuat konflik port tertentu. Untuk lebih baik dalam memfasilitasi pengaturan jaringan tes yang kecil, I2P memiliki mode multirouter yang memungkinkan beberapa router berbeda dijalankan dalam JVM yang sama. Multirouter dapat dimulai dari direktori dasar I2P dengan menjalankan perintah di bawah ini.
ru: I2P может быть запущен как отдельная тестовая сеть, контролируя местоположения, которые новый роутер загружает так, что он будет находить только другие тестовые роутеры. Стандартный режим работы подразумевает одну JVM на экземпляр маршрутизатора; следовательно, запуск нескольких копий I2P на одной машине нецелесообразен, как из-за потенциальной утечки ресурсов, так и из-за определенных конфликтов портов. Чтобы облегчить настройку небольших тестовых сетей, I2P имеет режим multirouter, который позволяет запускать несколько различных маршрутизаторов в одной JVM. Multirouter можно запустить из базового каталога I2P, выполнив следующую команду.
tr: I2P, ayrı bir test ağı olarak çalıştırılabilir. Yeni yöneltici, yalnızca diğer test yönelticilerini bulacak şekilde yeniden tohumlanır. Standart çalışma kipinde, her bir yöneltici kopyası için bir JVM bulunur. Her kopyanın ayrı kaynak tüketimi olduğundan ve belirli bağlantı noktaları çakışacağından, tek bir bilgisayarda birden fazla I2P kopyasının çalıştırılması önerilmez. Küçük test ağlarının kurulmasını kolaylaştırmak için, I2P üzerinde çoklu yöneltici kipi bulunur. Böylece aynı JVM üzerinde birden fazla yöneltici çalıştırılabilir. MultiRouter, i2p klasöründe aşağıdaki komut yürütülerek başlatılabilir.

source: Additionally, I2P can be started in a virtual network mode. This mode disables all transports, allowing the router to be tested in isolation without network traffic. To enable this mode, add <code>i2p.vmCommSystem=true</code> to the router.config before starting.
id: Sebagai tambahan, I2P dapat dimulai dalam modus jaringan virtual. Modus ini menonaktifkan semua transport, memungkinkan router untuk diuji dalam isolasi tanpa trafik jaringan. Untuk mengaktifkan mode ini, tambahkan <code> i2p.vmCommsystem = true </code> ke router.config sebelum memulai.
ru: Кроме того, I2P можно запустить в режиме виртуальной сети. Этот режим отключает все транспортные протоколы, позволяя маршрутизатору тестироваться изолированно без сетевого трафика. Чтобы включить этот режим, добавьте <code>i2p.vmCommSystem=true</code> в router.config перед запуском.
tr: Ek olarak, I2P sanal ağ kipinde başlatılabilir. Bu kip tüm taşıyıcıları devre dışı bırakarak, yönelticinin ağ trafiği olmadan yalıtılmış şekilde test edilmesini sağlar. Bu kipi etkinleştirmek için, başlatmadan önce router.config dosyasına <code>i2p.vmCommSystem=true </code> seçeneğini ekleyin.

source: Testing on the Live I2P Network
id: Pengujian langsung di Jaringan I2P
pt: Testando na Rede I2P em Produção
ru: Тестирование в live-cети I2P
tr: Canlı I2P Ağında Test Yapmak
